#Область ПрограммныйИнтерфейс    

// Выполняет коррекцию заполнения тэгов
// 
// Параметры:
//  Параметры - Структура - Структура анализируемых параметров.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство, фискализирующее чек
//  ОписаниеОшибки - Строка -  описание ошибки для возврата в случае нахождения ошибки
//
Процедура ВыполненитьКоррекциюЗаполненияТэгов(Параметры, ИдентификаторУстройства, ОписаниеОшибки) Экспорт
	
	Электронно = Ложь;
	Параметры.Свойство("Электронно", Электронно);
	
	Отправляет1СEmail = Ложь;
	Параметры.Свойство("Отправляет1СEmail", Отправляет1СEmail);
	
	Отправляет1СSMS = Ложь;
	Параметры.Свойство("Отправляет1СSMS", Отправляет1СSMS);
	
	Если Отправляет1СEmail Или Отправляет1СSMS Тогда 
		Параметры.Электронно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняется проверка корректности занесения сведений о покупателе, 
// если поле "Покупатель" заполнено, тогда должно быть заполнено либо поле "ИНН", 
// либо персональные сведения о покупателе.
// Реквизиты "дата рождения покупателя (клиента)" (тег 1243), "код вида документа, удостоверяющего личность" (тег 
// 1245), "данные документа, удостоверяющего личность" (тег 1246) включаются в состав ФД в случае не включения в 
// состав ФД реквизита "ИНН покупателя (клиента)" (тег 1228).
// 
// Параметры:
//   Параметры - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//   ФорматФД - Строка - версия формата фискальных документов
//   ОписаниеОшибки - Строка
//
// Возвращаемое значение:
//   Булево
Функция СведенияОПокупателеКорректны(Параметры, ОписаниеОшибки)
	
	ФорматФД = Параметры.ФорматФД;
	 // при формате 1.05 реквизит необязателен
	Если ФорматФД = "1.05" Тогда 
		Возврат Истина;
	КонецЕсли;
	
	СведенияОПокупателе = Параметры.СведенияОПокупателе;
	Если ПустаяСтрока(Параметры.Получатель) И ПустаяСтрока(СведенияОПокупателе.Покупатель) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПолучательИНН) Или ЗначениеЗаполнено(СведенияОПокупателе.ПокупательИНН) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОписаниеОшибки = НСтр("ru = 'Не указан ИНН или дата рождения и реквизиты документа удостоверяющего личность покупателя.'");
	Возврат Ложь;
	
КонецФункции

#КонецОбласти