#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура РезультатПроверкиДокументаНаСоответствиеТребованиямГИСМТИзФоновогоЗадания(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ОбработкаОбъект().РезультатПроверкиДокументаНаСоответствиеТребованиямГИСМТИзФоновогоЗадания(ПараметрыФоновогоЗадания, АдресРезультата)
	
КонецПроцедуры

Функция ПроверкаДокументаНаСоответствиеТребованиямГИСМТ(ПараметрыПроверки) Экспорт
	
	Возврат ОбработкаОбъект().ПроверкаДокументаНаСоответствиеТребованиямГИСМТ(ПараметрыПроверки);
	
КонецФункции

Функция СтатусОбработкиДокументаВГИСМТПоИдентификаторуЭД(Организация, ИдентификаторЭД) Экспорт
	
	Возврат ОбработкаОбъект().СтатусОбработкиДокументаВГИСМТПоИдентификаторуЭД(Организация, ИдентификаторЭД);
	
КонецФункции

Функция СтатусОбработкиУниверсальногоДокументаПоИдентификатору(Организация, ИдентификаторЭД) Экспорт
	
	Возврат ОбработкаОбъект().СтатусОбработкиУниверсальногоДокументаПоИдентификатору(Организация, ИдентификаторЭД);
	
КонецФункции

Функция СформироватьИтоговыйРезультатПоИтогамПроверокДокументаВСервисеГИСМТ(ПараметрыОбработки) Экспорт
	
	Возврат ОбработкаОбъект().СформироватьИтоговыйРезультатПоИтогамПроверокДокументаВСервисеГИСМТ(ПараметрыОбработки);
	
КонецФункции

Функция ОшибкиОперацийВыполненныхВСервисеПоДокументу(ПараметрыОбработки, Ошибки, ОписаниеПолей) Экспорт
	
	Возврат ОбработкаОбъект().ОшибкиОперацийВыполненныхВСервисеПоДокументу(ПараметрыОбработки, Ошибки, ОписаниеПолей);
	
КонецФункции

Функция ОшибкиКвитанции(ПараметрыОбработки) Экспорт
	
	Возврат ОбработкаОбъект().ОшибкиКвитанции(ПараметрыОбработки);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаОбъект()
	
	ОбработкаОбъект = Создать();
	
	Возврат ОбработкаОбъект;
	
КонецФункции

#КонецОбласти

#КонецЕсли