#Область ПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка КАК Ссылка,
	|	ИнвентаризацияТоваровНаСкладе.Дата КАК Период,
	|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
	|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Ссылка КАК Основание,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Склад КАК Склад
	|ИЗ
	|	Реквизиты КАК Реквизиты";
	
	Результат = Запрос.Выполнить();
	
	Реквизиты = ОбщегоНазначенияВызовСервера.ПолучитьСтруктуруИзРезультатаЗапроса(Результат);
	
	Если ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Реквизиты.Период, Отказ, Реквизиты.Организация, "Нал", Истина) = Неопределено Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;

	Запрос.Текст = ТекстЗапросаТаблицыДокумента(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;

КонецФункции

Функция ТекстЗапросаТаблицаПрослеживаемыхТоваровПоОснованию() Экспорт
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИнвентаризацияТоваровНаСкладеТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ИнвентаризацияТоваровНаСкладеТовары.Количество) КАК Количество,
		|	СУММА(ИнвентаризацияТоваровНаСкладеТовары.Сумма) КАК Сумма,
		|	ИнвентаризацияТоваровНаСкладе.Организация КАК Организация,
		|	ИнвентаризацияТоваровНаСкладе.Дата КАК ПериодСобытия,
		|	ИнвентаризацияТоваровНаСкладе.Склад КАК Склад,
		|	СУММА(ИнвентаризацияТоваровНаСкладеТовары.КоличествоУчет) КАК КоличествоУчет,
		|	СУММА(ИнвентаризацияТоваровНаСкладеТовары.СуммаУчет) КАК СуммаУчет
		|ПОМЕСТИТЬ ВТ_ТаблицаТоваровВременная
		|ИЗ
		|	Документ.ИнвентаризацияТоваровНаСкладе.Товары КАК ИнвентаризацияТоваровНаСкладеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
		|		ПО ИнвентаризацияТоваровНаСкладеТовары.Ссылка = ИнвентаризацияТоваровНаСкладе.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|		ПО ИнвентаризацияТоваровНаСкладеТовары.Номенклатура.КодТНВЭД = КлассификаторТНВЭД.Ссылка
		|ГДЕ
		|	ИнвентаризацияТоваровНаСкладеТовары.Ссылка = &Основание
		|	И ИнвентаризацияТоваровНаСкладе.Проведен
		|	И КлассификаторТНВЭД.ПрослеживаемыйТовар
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнвентаризацияТоваровНаСкладеТовары.Номенклатура,
		|	ИнвентаризацияТоваровНаСкладе.Организация,
		|	ИнвентаризацияТоваровНаСкладе.Дата,
		|	ИнвентаризацияТоваровНаСкладе.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПериодСобытия,
		|	Организация,
		|	Склад,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрацияПрослеживаемыхТоваров.Организация КАК Организация,
		|	РегистрацияПрослеживаемыхТоваров.Номенклатура КАК Номенклатура,
		|	РегистрацияПрослеживаемыхТоваров.Основание КАК Основание,
		|	РегистрацияПрослеживаемыхТоваров.ПериодСобытия КАК ПериодСобытия,
		|	РегистрацияПрослеживаемыхТоваров.Основание.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее
		|ИЗ
		|	РегистрСведений.РегистрацияПрослеживаемыхТоваров КАК РегистрацияПрослеживаемыхТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТоваровВременная КАК ВТ_ТаблицаТоваров
		|		ПО РегистрацияПрослеживаемыхТоваров.Организация = ВТ_ТаблицаТоваров.Организация
		|			И РегистрацияПрослеживаемыхТоваров.ПериодСобытия <= ВТ_ТаблицаТоваров.ПериодСобытия
		|			И РегистрацияПрослеживаемыхТоваров.Номенклатура <= ВТ_ТаблицаТоваров.Номенклатура
		|			И РегистрацияПрослеживаемыхТоваров.Основание.Склад <= ВТ_ТаблицаТоваров.Склад
		|ГДЕ
		|	РегистрацияПрослеживаемыхТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацииПрослеживаемыхТоваров.ИнвентаризацияТоваров)
		|	И РегистрацияПрослеживаемыхТоваров.Основание <> &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрацияПрослеживаемыхТоваров.Номенклатура,
		|	РегистрацияПрослеживаемыхТоваров.Организация,
		|	РегистрацияПрослеживаемыхТоваров.Основание,
		|	РегистрацияПрослеживаемыхТоваров.ПериодСобытия,
		|	РегистрацияПрослеживаемыхТоваров.Основание.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПериодСобытия,
		|	Организация,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаТоваров.Количество КАК Количество,
		|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
		|	ВТ_ТаблицаТоваров.Организация КАК Организация,
		|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
		|	ВТ_ТаблицаТоваров.Склад КАК Склад,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацииПрослеживаемыхТоваров.ИнвентаризацияТоваров) КАК ВидОперации,
		|	ВТ_ТаблицаТоваров.КоличествоУчет КАК КоличествоУчет,
		|	НоменклатураСправочник.КодТНВЭД КАК ТНВЭД,
		|	НЕ ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее.Номенклатура ЕСТЬ NULL КАК РанееРегистрировалсяВПрослеживаемости,
		|	ВТ_ТаблицаТоваров.СуммаУчет КАК СуммаУчет,
		|	НоменклатураСправочник.СтранаПроисхождения КАК СтранаПроисхождения,
		|	НоменклатураСправочник.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_ТаблицаТоваровРазмеченный
		|ИЗ
		|	ВТ_ТаблицаТоваровВременная КАК ВТ_ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее КАК ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее
		|		ПО ВТ_ТаблицаТоваров.Номенклатура = ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее.Номенклатура
		|			И ВТ_ТаблицаТоваров.Организация = ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее.Организация
		|			И ВТ_ТаблицаТоваров.Склад = ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|			ПО НоменклатураСправочник.КодТНВЭД = КлассификаторТНВЭД.Ссылка
		|		ПО ВТ_ТаблицаТоваров.Номенклатура = НоменклатураСправочник.Ссылка
		|ГДЕ
		|	КлассификаторТНВЭД.ПрослеживаемыйТовар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаТоваров.Количество КАК Количество,
		|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
		|	ВТ_ТаблицаТоваров.ТНВЭД КАК ТНВЭД,
		|	ВТ_ТаблицаТоваров.ВидОперации КАК ВидОперации,
		|	ВТ_ТаблицаТоваров.Организация КАК Организация,
		|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
		|	ВТ_ТаблицаТоваров.Склад КАК Склад,
		|	ВТ_ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ВТ_ТаблицаТоваров.ЕдиницаИзмерения,
		|	0 КАК КоличествоПрослеживаемости
		|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
		|ИЗ
		|	ВТ_ТаблицаТоваровРазмеченный КАК ВТ_ТаблицаТоваров
		|ГДЕ
		|	НЕ ВТ_ТаблицаТоваров.РанееРегистрировалсяВПрослеживаемости
		|	И ВТ_ТаблицаТоваров.Количество > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Склад,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрослеживаемыеТоварыОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ПрослеживаемыеТоварыОбороты.КоличествоПриход - ПрослеживаемыеТоварыОбороты.КоличествоРасход) КАК ОстатокТовараСРНПТ,
		|	ПрослеживаемыеТоварыОбороты.Регистратор.СкладОрдер КАК РегистраторСклад,
		|	ПрослеживаемыеТоварыОбороты.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ПрослеживаемыеТоварыСРНПТ
		|ИЗ
		|	РегистрНакопления.ПрослеживаемыеТовары.Обороты(&НачалоПериода, &КонецПериода, Запись, Организация = &Организация) КАК ПрослеживаемыеТоварыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрослеживаемыеТоварыОбороты.Номенклатура,
		|	ПрослеживаемыеТоварыОбороты.Регистратор.СкладОрдер,
		|	ПрослеживаемыеТоварыОбороты.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РегистраторСклад,
		|	Организация,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(УведомлениеОВвозеПрослеживаемыхТоваровТовары.Количество) КАК Количество,
		|	УведомлениеОВвозеПрослеживаемыхТоваровТовары.Номенклатура КАК Номенклатура,
		|	УведомлениеОВвозеПрослеживаемыхТоваров.Организация КАК Организация,
		|	УведомлениеОВвозеПрослеживаемыхТоваров.ПервичныйДокумент.СкладОрдер КАК Склад,
		|	СУММА(УведомлениеОВвозеПрослеживаемыхТоваровТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_УведомленияОВвозе
		|ИЗ
		|	Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Товары КАК УведомлениеОВвозеПрослеживаемыхТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОВвозеПрослеживаемыхТоваров КАК УведомлениеОВвозеПрослеживаемыхТоваров
		|		ПО УведомлениеОВвозеПрослеживаемыхТоваровТовары.Ссылка = УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка
		|ГДЕ
		|	УведомлениеОВвозеПрослеживаемыхТоваров.Проведен
		|	И УведомлениеОВвозеПрослеживаемыхТоваров.РНПТ = &ПустаяСсылкаРнпт
		|	И УведомлениеОВвозеПрослеживаемыхТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	УведомлениеОВвозеПрослеживаемыхТоваров.Организация,
		|	УведомлениеОВвозеПрослеживаемыхТоваров.ПервичныйДокумент.СкладОрдер,
		|	УведомлениеОВвозеПрослеживаемыхТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Склад,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.ТНВЭД КАК ТНВЭД,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество - ЕСТЬNULL(ВТ_ПрослеживаемыеТоварыСРНПТ.ОстатокТовараСРНПТ, 0) - ЕСТЬNULL(ВТ_УведомленияОВвозе.Количество, 0) КАК Количество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ПрослеживаемыеТоварыСРНПТ.ОстатокТовараСРНПТ, 0) = 0
		|				ИЛИ ТаблицаТоваров.Количество = 0
		|			ТОГДА ТаблицаТоваров.Сумма - ЕСТЬNULL(ВТ_УведомленияОВвозе.Сумма, 0)
		|		ИНАЧЕ ТаблицаТоваров.Сумма - ТаблицаТоваров.Сумма / ТаблицаТоваров.Количество * ВТ_ПрослеживаемыеТоварыСРНПТ.ОстатокТовараСРНПТ - ЕСТЬNULL(ВТ_УведомленияОВвозе.Сумма, 0)
		|	КОНЕЦ КАК Сумма,
		|	ТаблицаТоваров.Организация КАК Организация,
		|	ТаблицаТоваров.ВидОперации КАК ВидОперации,
		|	ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
		|	ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаТоваров.ЕдиницаИзмерения,
		|	ТаблицаТоваров.КоличествоПрослеживаемости
		|ПОМЕСТИТЬ ВТ_ТоварыПоОснованию
		|ИЗ
		|	ВТ_ТаблицаТоваров КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрослеживаемыеТоварыСРНПТ КАК ВТ_ПрослеживаемыеТоварыСРНПТ
		|		ПО ТаблицаТоваров.Организация = ВТ_ПрослеживаемыеТоварыСРНПТ.Организация
		|			И ТаблицаТоваров.Склад = ВТ_ПрослеживаемыеТоварыСРНПТ.РегистраторСклад
		|			И ТаблицаТоваров.Номенклатура = ВТ_ПрослеживаемыеТоварыСРНПТ.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УведомленияОВвозе КАК ВТ_УведомленияОВвозе
		|		ПО ТаблицаТоваров.Организация = ВТ_УведомленияОВвозе.Организация
		|			И ТаблицаТоваров.Склад = ВТ_УведомленияОВвозе.Склад
		|			И ТаблицаТоваров.Номенклатура = ВТ_УведомленияОВвозе.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТаблицаТоваровВременная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТоварыРегистрируемыеВПрослеживаемостиРанее";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Ссылка КАК Основание,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Склад КАК Склад
	|ИЗ
	|	Реквизиты КАК Реквизиты";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти
