
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст        - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоПриобретение - Булево - исходящий признак соответствия документа типу «Приобретение товаров и услуг».
Процедура ЭтоДокументПриобретения(Контекст, ЭтоПриобретение) Экспорт
	
	ЭтоПриобретение = ИнтеграцияИСМПУТКлиентСервер.ЭтоДокументПриобретения(Контекст);
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст        - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоРеализация - Булево - исходящий признак соответствия документа типу «Реализация товаров и услуг».
Процедура ЭтоДокументРеализации(Контекст, ЭтоРеализация) Экспорт
	
	ТипКонтекста    = ТипЗнч(Контекст);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст,"ЭтотОбъект") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ДокументОбъект") Тогда
			Если ТипЗнч(Контекст.ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
				ЭтоРеализация = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ФормаКлиентскогоПриложения") Тогда
		Если СтрНачинаетсяС(Контекст.ИмяФормы, "Документ.РеализацияТоваровУслуг") Тогда
			ЭтоРеализация = Истина;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ЭтоРеализация = Истина;
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧек   - Булево - исходящий признак соответствия документа типу «Чек ККМ».
Процедура ЭтоЧекККМ(Контекст, ЭтоЧек) Экспорт
	
	ЭтоЧек = ИнтеграцияИСМПУТКлиентСервер.ЭтоЧекККМ(Контекст);
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст      - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧекВозврат - Булево - исходящий признак соответствия документа типу «Чек ККМ возврат».
Процедура ЭтоЧекККМВозврат(Контекст, ЭтоЧекВозврат) Экспорт
	
	ЭтоЧекВозврат = ИнтеграцияИСМПУТКлиентСервер.ЭтоЧекККМВозврат(Контекст);
	
КонецПроцедуры

#Область СерииНоменклатуры

// Возвращает через параметр коды статусов указания серий, соответствующих не заполненным сериям.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих не заполненным сериям.
Процедура СтатусыСерийСерияНеУказана(СтатусыСерияНеУказана) Экспорт
	
	
КонецПроцедуры

// Возвращает через параметр коды статусов указания серий, соответствующих не заполненным сериям.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих не заполненным сериям.
Процедура СтатусыСерийСериюМожноУказать(СтатусыСериюМожноУказать) Экспорт
	
	
КонецПроцедуры

// Возвращает через параметр коды статусов указания серий, соответствующих заполненным сериям.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих не заполненным сериям.
Процедура СтатусыСерийСерияУказана(СтатусыСерияУказана) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
