#Область СлужебныЙПрограммныйИнтерфейс

// См. МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД
Функция ПолучитьСведенияДоверенностиНаСервереМЧД(НомерДоверенности, ИННДоверителя, ТокенДоступа = "") Экспорт
	
	Возврат МашиночитаемыеДоверенности.ПолучитьСведенияДоверенностиНаСервереМЧД(
		НомерДоверенности, ИННДоверителя, ТокенДоступа);
	
КонецФункции

// Свойства сервера МЧД.
// 
// Возвращаемое значение:
//  Структура:
//  * АдресСервера - Строка
//  * АдресСервераБезАутентификации - Строка
//  * РесурсКорняAPI - Строка
//  * ЛогинОператора - Строка
//  * ПарольОператора - Строка
//  * ИспользоватьРасширенияAPI - Булево
// 
Функция СвойстваСервераМЧД() Экспорт
	
	СтруктураАдреса = МашиночитаемыеДоверенности.ПрочитатьАдресРеестраМЧД();
	СтруктураАдреса.Вставить("АдресСервераБезАутентификации",	СтруктураАдреса.АдресСервера);
	СтруктураАдреса.Вставить("ЛогинОператора", 					"");
	СтруктураАдреса.Вставить("ПарольОператора", 				"");
	
	Возврат СтруктураАдреса;
	
КонецФункции

#КонецОбласти
