
&НаКлиенте
Процедура ПродолжитьВыполнение(Команда)
	ПараметрЗакрытия = Истина;
	Закрыть(ПараметрЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	ПараметрЗакрытия = Ложь;
	Закрыть(ПараметрЗакрытия);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Предупреждения = Элементы.СтраницыПредупреждений.ПодчиненныеЭлементы;
	НужнаяСтраница = Предупреждения.Найти("Страница"+Строка(Параметры.Режим));
	Если НужнаяСтраница <> Неопределено Тогда
		Элементы.СтраницыПредупреждений.ТекущаяСтраница = НужнаяСтраница;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(ПараметрЗакрытия) <> Тип("Булево") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	ЗапуститьПриложение("http://1c.ru/news/info.jsp?id=21537");
КонецПроцедуры
