Функция ПолучитьТипКонтрагент() Экспорт
	
	Возврат Тип("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Контрагенты"));
	
КонецФункции


Функция ПолучитьТипОрганизация() Экспорт
	
	Возврат Тип("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Организации"));
	
КонецФункции


Функция НазваниеИВерсияПрограммы() Экспорт
	
	МетаданныеИмя = Метаданные.Имя;
	МетаданныеВерсия = СокрЛП(Метаданные.Версия);
	
	Возврат ВРЕГ(Лев(МетаданныеИмя + " " + МетаданныеВерсия, 40));
	
КонецФункции
