// @strict-types

#Область ПрограммныйИнтерфейс

// Доступна работа с кодами маркировки пива.
// 
// Параметры:
//  Отказ - Булево - Отказ от открытия форм связанных с производством/импортом пива
// 
// Возвращаемое значение:
//  Булево - Доступна работа с кодами маркировки пива
Функция ДоступнаРаботаСКодамиМаркировкиПива(Отказ = Неопределено) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Если Не(Отказ = Неопределено) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для работы с документами производства/импорта пива
					 |требуется встроить подсистему ИС МП библиотеки'"),,,,
				Отказ);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМП"); //ОбщийМодуль - 
	Результат = Модуль.ИспользуемыеВидыМаркируемойПродукцииИСМП().Найти(Перечисления.ВидыПродукцииИС.Пиво)<>Неопределено;
	Если Не Результат Тогда
		Если Не(Отказ = Неопределено) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для работы с документами производства/импорта пива
					 |требуется включить использование вида продукции ""Пиво""
					 |в панели администрирования ИС МП'"),,,,
				Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

