
&НаКлиенте
Перем СписокПредставленийДанных;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.ПредставлениеДанных;
	
	Для каждого Представление Из Параметры.СписокПредставленийДанных Цикл
		Список.Добавить().Представление = Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокПредставлений(СписокПредставлений, Контекст) Экспорт
	
	СписокПредставленийДанных = СписокПредставлений;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОткрыть()
	
	ОткрытьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанные()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Индекс = Список.Индекс(Строка);
	
	Значение = СписокПредставленийДанных[Индекс].Значение;
	
	ОткрытьЗначение(Значение);
	
КонецПроцедуры
