#Область ПрограммныйИнтерфейс

// Емкость упаковки по GTIN.
// Результат выполнения операции будет передан в ОписаниеОповещения в переданном параметре.
// 
// Параметры:
//  ПараметрыЗапроса - (см. ИнтерфейсИСМПКлиент.ПараметрыЗапросаДанных).
Процедура ЕмкостьУпаковкиПоGTIN(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                = ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса         = ИнтерфейсИСМПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ЕмкостьУпаковкиПоGTIN;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Получает места осуществления деятельности из ГИС МТ.
// Результат выполнения операции будет передан в ОписаниеОповещения в переданном параметре.
// 
// Параметры:
//  ПараметрыЗапроса - (см. ИнтерфейсИСМПКлиент.ПараметрыЗапросаДанных).
Процедура МестаОсуществленияДеятельности(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                = ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса         = ИнтерфейсИСМПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.МестаОсуществленияДеятельности;
	ПараметрыОбработки.ВидПродукции   = ПараметрыЗапроса.Параметры.ВидПродукции;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Обновляет список CDN-площадок и время их отклика
// Результат выполнения операции будет передан в ОписаниеОповещения в переданном параметре.
// 
// Параметры:
//  ПараметрыЗапроса - (см. ИнтерфейсИСМПКлиент.ПараметрыЗапросаДанных).
Процедура АктуализацияСпискаCDNПлощадок(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                  = ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                           = ИнтерфейсИСМПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                   = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок;
	ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи = Истина;
	ПараметрыОбработки.УникальныйИдентификатор          = ПараметрыЗапроса.УникальныйИдентификатор;
	ПараметрыОбработки.ВыполнениеВФоне                  = Истина;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Выполняет операцию авторизации ГИС МТ.
// 
// Параметры:
//  ПараметрыЗапроса - см. ИнтерфейсИСМПКлиент.ПараметрыЗапросаДанных.
Процедура ВыполнитьАвторизациюГИСМТ(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                = ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса         = ИнтерфейсИСМПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ВыполнитьАвторизацию;
	ПараметрыОбработки.ВидПродукции   = ПараметрыЗапроса.Параметры;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

// Выполняет операцию получения розничного токена в ГИС МТ.
// 
// Параметры:
//  ПараметрыЗапроса - см. ИнтерфейсИСМПКлиент.ПараметрыЗапросаДанных.
Процедура АвторизацияГИСМТРозничныйТокен(ПараметрыЗапроса) Экспорт
	
	ПараметрыОбработки                                  = ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса);
	ДоступныеМетодыИнтерфейса                           = ИнтерфейсИСМПКлиентСервер.ДоступныеМетодыИнтерфейса();
	ПараметрыОбработки.ИмяОбработчика                   = ДоступныеМетодыИнтерфейса.ПолучениеРозничногоТокена;
	ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи = Истина;
	ПараметрыОбработки.ОрганизацияПоСертификатам        = Истина;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет результат авторизации на наличие ошибки.
// 
// Параметры:
//  РезультатАвторизации - см. ИнтерфейсИСМПКлиент.ПараметрыЗавершенияОбработки.
// 
// Возвращаемое значение:
//  Булево - Авторизация ГИС МТ выполнена с ошибкой.
Функция АвторизацияГИСМТВыполненаСОшибкой(РезультатАвторизации) Экспорт
	
	ЕстьОшибка = Ложь;
	
	Если РезультатАвторизации <> Неопределено
		И РезультатАвторизации.ЕстьОшибки Тогда
		
		Если ЗначениеЗаполнено(РезультатАвторизации.ТекстОшибки) Тогда
			ПоказатьПредупреждение(, РезультатАвторизации.ТекстОшибки);
		КонецЕсли;
		
		ЕстьОшибка = Истина
		
	КонецЕсли;
	
	Возврат ЕстьОшибка;
	
КонецФункции

#Область ИнтерфейсИСМП

Процедура ОбработкаМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки)
	
	ДоступныеМетодыИнтерфейса = ИнтерфейсИСМПКлиентСервер.ДоступныеМетодыИнтерфейса();
	
	Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ВыполнитьАвторизацию Тогда
		Если Не ПараметрыОбработки.ВызовПослеАвторизации Тогда
			ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессии = Истина;
		КонецЕсли;
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеРозничногоТокена Тогда
		Если Не ПараметрыОбработки.ВызовПослеАвторизации Тогда
			ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
		КонецЕсли;
	Иначе
		ИнтерфейсИСМПВызовСервера.ЗапросМетодаИнтефрейсаСОбработкой(ПараметрыОбработки);
	КонецЕсли;
	
	Если ПараметрыОбработки.ВыполнениеВФоне Тогда
		ОжидатьВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	Иначе
		ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки)
	
	Результат = ПараметрыЗавершенияОбработки();
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",   ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("ПараметрыОбработки", ПараметрыОбработки);
	
	Если ПараметрыОбработки.ОрганизацияПоСертификатам <> Неопределено
		И ПараметрыОбработки.ОрганизацияПоСертификатам Тогда
		
		ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
			"ПоискОрганизацияПоСертификатамЗавершение",
			интерфейсисмпклиент,
			ДополнительныеПараметры);
		ЭлектроннаяПодписьКлиент.НайтиДействительныеЛичныеСертификаты(ОповещениеПриЗапросеКлючаСессии);
		Возврат;
		
	ИначеЕсли ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессии Тогда
		
		Если ПараметрыОбработки.ВызовПослеАвторизации Тогда
			Результат.ЕстьОшибки  = Истина;
			Если ЗначениеЗаполнено(ПараметрыОбработки.ТекстОшибки) Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось выполнить авторизацию ГИС МТ по причине:
						       |%1'"),
					ПараметрыОбработки.ТекстОшибки);
			КонецЕсли;
			Результат.ТекстОшибки = ТекстОшибки;
		Иначе
			
			ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
				"ЗапроситьКлючСессииЗавершение",
				интерфейсисмпклиент,
				ДополнительныеПараметры);
			
			Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ПараметрыОбработки.ВидПродукции) Тогда
				ПараметрыЗапросаКлючаСесии = ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(ПараметрыОбработки.Организация);
			Иначе
				ПараметрыЗапросаКлючаСесии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(
					ПараметрыОбработки.Организация);
			КонецЕсли;
			
			ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(
				ПараметрыЗапросаКлючаСесии, 
				ОповещениеПриЗапросеКлючаСессии);
				
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		
		Если ПараметрыОбработки.ВызовПослеАвторизации Тогда
			Результат.ЕстьОшибки  = Истина;
			Если ЗначениеЗаполнено(ПараметрыОбработки.ТекстОшибки) Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось выполнить авторизацию ГИС МТ по причине:
						       |%1'"),
					ПараметрыОбработки.ТекстОшибки);
			КонецЕсли;
			Результат.ТекстОшибки = ТекстОшибки;
		Иначе
			
			ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
				"ЗапроситьРозничныйКлючСессииЗавершение",
				интерфейсисмпклиент,
				ДополнительныеПараметры);
			
			ПараметрыЗапросаКлючаСесии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессииИСМПРозница(ПараметрыОбработки.Организация);
			
			ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(
				ПараметрыЗапросаКлючаСесии, 
				ОповещениеПриЗапросеКлючаСессии);
				
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОбработки.ЕстьОшибки Тогда
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось запросить данные ГИС МТ по причине: %1'"),
			ПараметрыОбработки.ТекстОшибки);
		Результат.ЕстьОшибки  = Истина;
		Результат.ТекстОшибки = ТекстОшибки;
	Иначе
		Результат.Результат = ПараметрыОбработки.Результат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыЗапроса.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

Процедура ОжидатьВыполненияМетодаИнтерфейсаСАвторизацией(ПараметрыЗапроса, ПараметрыОбработки)
	
	Если ПараметрыОбработки.ДлительнаяОперация <> Неопределено Тогда
		
		ВыводитьОкноОжидания = Истина;
		Если ТипЗнч(ПараметрыЗапроса.Параметры) = Тип("Структура") И ПараметрыЗапроса.Параметры.Свойство("НеВыводитьОкноОжидания") Тогда
			ВыводитьОкноОжидания = Не ПараметрыЗапроса.Параметры.НеВыводитьОкноОжидания;
		КонецЕсли;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Выполняется обновление CDN-площадок'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания       = ВыводитьОкноОжидания;
		ПараметрыОжидания.ВыводитьСообщения          = Истина;
		
		ПараметрыЗавершенияДлительнойОперации = ПараметрыЗавершенияДлительнойОперации();
		ПараметрыЗавершенияДлительнойОперации.ПараметрыЗапроса        = ПараметрыЗапроса;
		ПараметрыЗавершенияДлительнойОперации.ПараметрыОбработки      = ПараметрыОбработки;
		ПараметрыЗавершенияДлительнойОперации.ОповещениеПриЗавершении = ПараметрыЗапроса.ОповещениеОЗавершении;
		ПараметрыЗавершенияДлительнойОперации.Организация             = ПараметрыЗапроса.Организация;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ПараметрыОбработки.ДлительнаяОперация,
			Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ИнтерфейсИСМПКлиент, ПараметрыЗавершенияДлительнойОперации),
			ПараметрыОжидания);
		
	Иначе
		
		Если ПараметрыОбработки.ОрганизацияПоСертификатам <> Неопределено
			И ПараметрыОбработки.ОрганизацияПоСертификатам Тогда
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ПараметрыЗапроса",   ПараметрыЗапроса);
			ДополнительныеПараметры.Вставить("ПараметрыОбработки", ПараметрыОбработки);
			
			ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения(
				"ПоискОрганизацияПоСертификатамЗавершение",
				интерфейсисмпклиент,
				ДополнительныеПараметры);
			ЭлектроннаяПодписьКлиент.НайтиДействительныеЛичныеСертификаты(ОповещениеПриЗапросеКлючаСессии);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗавершенияДлительнойОперации(Результат, ДополнительныеПараметрыДлительнойОперации) Экспорт
	
	Если Результат = Неопределено Тогда // отменено пользователем
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОбмена = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		ОбработатьРезультатОбменаСлужебный(РезультатОбмена, ДополнительныеПараметрыДлительнойОперации);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		Если ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении, Новый Массив);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатОбменаСлужебный(РезультатОбмена, ДополнительныеПараметрыДлительнойОперации)
	
	ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки.Результат                             = РезультатОбмена;
	ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки.ЕстьОшибки                            = РезультатОбмена.ЕстьОшибки;
	ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбмена.ТребуетсяОбновлениеКлючаСессииРозница;
	ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки.ТекстОшибки                           = РезультатОбмена.ТекстОшибки;
	
	ОбработкаРезультатаВыполненияМетодаИнтерфейсаСАвторизацией(ДополнительныеПараметрыДлительнойОперации.ПараметрыЗапроса,
		ДополнительныеПараметрыДлительнойОперации.ПараметрыОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область Авторизация

Процедура ПоискОрганизацияПоСертификатамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.ПараметрыОбработки.ОрганизацияПоСертификатам = Ложь;
	
	Если Результат = Неопределено
		Или Результат.Количество() = 0 Тогда
		ДополнительныеПараметры.ПараметрыОбработки.ЕстьОшибки  = Истина;
		ДополнительныеПараметры.ПараметрыОбработки.ТекстОшибки = НСтр("ru = 'Не найдено доступных сертификатов для подписи.'");
	Иначе
		ДополнительныеПараметры.ПараметрыОбработки.Организация = Результат[0].Организация;
	КонецЕсли;
	
	ОбработкаМетодаИнтерфейсаСАвторизацией(ДополнительныеПараметры.ПараметрыЗапроса, ДополнительныеПараметры.ПараметрыОбработки);
	
КонецПроцедуры

Процедура ЗапроситьКлючСессииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОтказОтАвторизации = Ложь;
	ОшибкаАвторизации  = Ложь;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие")
		Или (ДополнительныеПараметры.ПараметрыОбработки.Организация <> Неопределено
		И Результат[ДополнительныеПараметры.ПараметрыОбработки.Организация] = Неопределено) Тогда
		ОтказОтАвторизации = Истина;
	Иначе
		
		Если ДополнительныеПараметры.ПараметрыОбработки.Организация = Неопределено Тогда
			Для Каждого КлючИЗначение Из Результат Цикл
				РезультатАвторизации = КлючИЗначение.Значение;
			КонецЦикла;
		Иначе
			РезультатАвторизации = Результат[ДополнительныеПараметры.ПараметрыОбработки.Организация];
		КонецЕсли;
		
		Если РезультатАвторизации = Неопределено Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = НСтр("ru = 'Произошла ошибка при авторизации.'");
		ИначеЕсли РезультатАвторизации <> Истина Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = РезультатАвторизации;
		Иначе
			ДополнительныеПараметры.ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессии = Ложь;
			ДополнительныеПараметры.ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтказОтАвторизации Тогда
		Возврат;
	ИначеЕсли ОшибкаАвторизации Тогда
		ДополнительныеПараметры.ПараметрыОбработки.ЕстьОшибки  = Истина;
		ДополнительныеПараметры.ПараметрыОбработки.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

	ДополнительныеПараметры.ПараметрыОбработки.ВызовПослеАвторизации = Истина;
	ОбработкаМетодаИнтерфейсаСАвторизацией(ДополнительныеПараметры.ПараметрыЗапроса, ДополнительныеПараметры.ПараметрыОбработки);
	
КонецПроцедуры

Процедура ЗапроситьРозничныйКлючСессииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОтказОтАвторизации = Ложь;
	ОшибкаАвторизации  = Ложь;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие")
		Или (ДополнительныеПараметры.ПараметрыОбработки.Организация <> Неопределено
		И Результат[ДополнительныеПараметры.ПараметрыОбработки.Организация] = Неопределено) Тогда
		ОтказОтАвторизации = Истина;
	Иначе
		
		Если ДополнительныеПараметры.ПараметрыОбработки.Организация = Неопределено Тогда
			Для Каждого КлючИЗначение Из Результат Цикл
				РезультатАвторизации = КлючИЗначение.Значение;
			КонецЦикла;
		Иначе
			РезультатАвторизации = Результат[ДополнительныеПараметры.ПараметрыОбработки.Организация];
		КонецЕсли;
		
		Если РезультатАвторизации = Неопределено Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = НСтр("ru = 'Произошла ошибка при авторизации.'");
		ИначеЕсли РезультатАвторизации <> Истина Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = РезультатАвторизации;
		Иначе
			ДополнительныеПараметры.ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессии = Ложь;
			ДополнительныеПараметры.ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтказОтАвторизации Тогда
		
		РезультатВыполнения = ПараметрыЗавершенияОбработки();
		РезультатВыполнения.Результат  = Новый Структура("ОтказОтАвторизации", Истина);
		РезультатВыполнения.ТекстОшибки = ДополнительныеПараметры.ПараметрыОбработки.ТекстОшибки;  
		РезультатВыполнения.ЕстьОшибки  = Истина;
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПараметрыЗапроса.ОповещениеОЗавершении, РезультатВыполнения);
		Возврат;
		
	ИначеЕсли ОшибкаАвторизации Тогда
		ДополнительныеПараметры.ПараметрыОбработки.ЕстьОшибки  = Истина;
	КонецЕсли;

	ДополнительныеПараметры.ПараметрыОбработки.ВызовПослеАвторизации = Истина;
	ОбработкаМетодаИнтерфейсаСАвторизацией(ДополнительныеПараметры.ПараметрыЗапроса, ДополнительныеПараметры.ПараметрыОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыОбработки

// Параметры запроса данных.
// 
// Возвращаемое значение:
//  Структура - Параметры запроса данных:
// * Параметры - Неопределено, Структура - Параметры запроса.
// * Организация - Неопределено, ОпределяемыйТип.Организация - Организация.
// * ОповещениеОЗавершении - Неопределено, ОписаниеОповещения - Точка возврата после выполенения метода.
// * УникальныйИдентификатор - Неопределено, УникальныйИдентификатор - уникальный идентификатор формы
Функция ПараметрыЗапросаДанных() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Параметры",               Неопределено);
	ВозвращаемоеЗначение.Вставить("Организация",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ОповещениеОЗавершении",   Неопределено);
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор", Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПараметрыОбработкиЗапросаДанных(ПараметрыЗапроса)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ИмяОбработчика",                        Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",        Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ВызовПослеАвторизации",                 Ложь);
	ВозвращаемоеЗначение.Вставить("Результат",                             Неопределено);
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           Неопределено);
	ВозвращаемоеЗначение.Вставить("Параметры",                             ПараметрыЗапроса.Параметры);
	ВозвращаемоеЗначение.Вставить("Организация",                           ПараметрыЗапроса.Организация);
	ВозвращаемоеЗначение.Вставить("ОрганизацияПоСертификатам",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ВидПродукции",                          Неопределено);
	ВозвращаемоеЗначение.Вставить("ПроверкаПоТокенуРозничнойПродажи",      Ложь);
	ВозвращаемоеЗначение.Вставить("УникальныйИдентификатор",               Неопределено);
	ВозвращаемоеЗначение.Вставить("ВыполнениеВФоне",                       Ложь);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",                    Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Параметры завершения обработки.
// 
// Возвращаемое значение:
//  Структура - Параметры завершения обработки:
// * ЕстьОшибки - Булево - Наличие ошибок.
// * ТекстОшибки - Неопределено - Текст Ошибки.
// * Результат - Неопределено - Результат.
Функция ПараметрыЗавершенияОбработки() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                  Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 Неопределено);
	ВозвращаемоеЗначение.Вставить("Результат",                   Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПараметрыЗавершенияДлительнойОперации()
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("ПараметрыОбработки");
	ПараметрыЗавершения.Вставить("ПараметрыЗапроса");
	ПараметрыЗавершения.Вставить("ОповещениеПриЗавершении");
	ПараметрыЗавершения.Вставить("Организация");
	
	Возврат ПараметрыЗавершения;
	
КонецФункции

#КонецОбласти

#КонецОбласти


