// Возвращает текст запроса для дополнения переданной таблицы настройками внутреннего документооборота.
// 
// Параметры:
// 	ИмяИсходнойТаблицы - Строка
// 	ПоляТаблицы - Строка
// 	ПоляКлючаНастройки - см. НовоеОписаниеПолейКлючаНастройкиОтправки
// Возвращаемое значение:
// 	Строка
Функция ТекстЗапросаДополнениеНастройкамиВнутреннегоЭДО(ИмяИсходнойТаблицы, ПоляТаблицы, ПоляКлючаНастройки) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	&ПоляТаблицы,
		|	НастройкиВнутреннегоЭДО.Организация КАК Организация,
		|	НастройкиВнутреннегоЭДО.ВидВнутреннегоДокумента КАК ВидДокумента,
		|	НастройкиВнутреннегоЭДО.Формировать КАК Формировать,
		|	НастройкиВнутреннегоЭДО.ВидПодписи КАК ВидПодписи,
		|	НастройкиВнутреннегоЭДО.МаршрутПодписания КАК МаршрутПодписания,
		|	НастройкиВнутреннегоЭДО.ЭтоОсновнойВидДокумента КАК ЭтоОсновнойВидДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.Внутренний) КАК СпособОбмена
		|ИЗ
		|	ИмяИсходнойТаблицы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВнутреннегоЭДО КАК НастройкиВнутреннегоЭДО
		|		ПО &УсловияСвязи";
	
	УсловияСвязи = Новый Массив;
	Для Каждого Элемент Из ПоляКлючаНастройки Цикл
		УсловияСвязи.Добавить(СтрШаблон("%1 = НастройкиВнутреннегоЭДО.%2", Элемент.Значение, Элемент.Ключ));
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляТаблицы", ПоляТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяИсходнойТаблицы", ИмяИсходнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияСвязи", СтрСоединить(УсловияСвязи, "
		|		И "));
	
	Возврат ТекстЗапроса;
	
КонецФункции
