// Программный интерфейс

// Служебные процедуры и функции

// Печать чека

Функция ПараметрыОперацииФискализацииЧека(ДокументСсылка, СуммаПредоплатыКорректировка = Неопределено, ВерсияФФД = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|	КОНЕЦ КАК ТипРасчета,
	|	ЕСТЬNULL(ДанныеДокумента.Ответственный.ФизЛицо.Наименование, """") КАК Кассир,
	|	"""" КАК КассирИНН,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ККМ КАК ТорговыйОбъект,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ПринятоОт КАК ПринятоОт,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные) КАК ТипОплаты,
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПоставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.РасходДенежныхСредствПрочее)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств)
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДанныеДокумента.Ответственный.ФизЛицо.Наименование, """"),
	|	"""",
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ККМ,
	|	ДанныеДокумента.СуммаДокумента,
	|	ДанныеДокумента.ВалютаДокумента,
	|	ДанныеДокумента.Выдать,
	|	ДанныеДокумента.Основание,
	|	ДанныеДокумента.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные),
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДанныеДокумента.Ответственный.ФизЛицо.Наименование, """"),
	|	"""",
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ККМ,
	|	ДанныеДокумента.СуммаДокумента,
	|	ДанныеДокумента.ВалютаДокумента,
	|	ЕСТЬNULL(ДанныеДокумента.Контрагент.НаименованиеПолное, """"),
	|	"""",
	|	ДанныеДокумента.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно),
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств)
	|	КОНЕЦ,
	|	ЕСТЬNULL(NULL, """"),
	|	ЕСТЬNULL(NULL, """"),
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ККМ,
	|	ДанныеДокумента.СуммаДокумента,
	|	ДанныеДокумента.ВалютаДокумента,
	|	ЕСТЬNULL(ДанныеДокумента.Контрагент.НаименованиеПолное, """"),
	|	"""",
	|	ДанныеДокумента.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно),
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПоставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств)
	|	КОНЕЦ,
	|	ЕСТЬNULL(NULL, """"),
	|	ЕСТЬNULL(NULL, """"),
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ККМ,
	|	ДанныеДокумента.СуммаДокумента,
	|	ДанныеДокумента.ВалютаДокумента,
	|	ЕСТЬNULL(ДанныеДокумента.Контрагент.НаименованиеПолное, """"),
	|	"""",
	|	ДанныеДокумента.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Электронно),
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыФискализацииЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	Если Не Выборка.Следующий() Тогда
		Возврат ПараметрыФискализацииЧека;
	КонецЕсли;
	
	СведенияОЮрФизЛице = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация, ТекущаяДатаСеанса());
	
	ПараметрыФискализацииЧека.ДокументОснование      = ДокументСсылка;
	ПараметрыФискализацииЧека.ТипРасчета             = Выборка.ТипРасчета;
	ПараметрыФискализацииЧека.АдресРасчетов          = СведенияОЮрФизЛице.ФактическийАдрес;
	ПараметрыФискализацииЧека.МестоРасчетов          = "";
	
	ПараметрыФискализацииЧека.Кассир    = Выборка.Кассир;
	ПараметрыФискализацииЧека.КассирИНН = Выборка.КассирИНН;
	
	// Для принтера чеков (ЕНВД)
	ПараметрыФискализацииЧека.ОрганизацияНазвание  = СведенияОЮрФизЛице.ПолноеНаименование;
	ПараметрыФискализацииЧека.ОрганизацияИНН       = СведенияОЮрФизЛице.ИНН;
	ПараметрыФискализацииЧека.ОрганизацияКПП       = СведенияОЮрФизЛице.КПП;
	ПараметрыФискализацииЧека.АдресМагазина        = СведенияОЮрФизЛице.ФактическийАдрес;
	ПараметрыФискализацииЧека.НаименованиеМагазина = СведенияОЮрФизЛице.Представление;
	
	Если ВерсияФФД = "1.0" Тогда
		ЗаполнитьПозицииИТаблицуОплатЧека10(ПараметрыФискализацииЧека, Выборка, СуммаПредоплатыКорректировка);
	Иначе
		ЗаполнитьПозицииИТаблицуОплатЧека(ПараметрыФискализацииЧека, Выборка, СуммаПредоплатыКорректировка, ВерсияФФД);
	КонецЕсли;
	
	Возврат ПараметрыФискализацииЧека;
	
КонецФункции

Процедура ЗаполнитьПозицииИТаблицуОплатЧека(ПараметрыФискализацииЧека, ДанныеДокумента, СуммаПредоплатыКорректировка, ВерсияФФД)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	МАКСИМУМ(ДанныеДокумента.СтавкаНДС) КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.Сделка.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаДокумента,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|ПОМЕСТИТЬ Расшифровка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Сделка ЕСТЬ NULL 
	|		И ТИПЗНАЧЕНИЯ(ДанныеДокумента.ДокументРасчетовСКонтрагентом) В (&ТипыНакладная)
	|		ИЛИ
	|		ТИПЗНАЧЕНИЯ(ДанныеДокумента.ДокументРасчетовСКонтрагентом) НЕ В (&ТипыНакладная)
	|		И НЕ ДанныеДокумента.Сделка.ВалютаДокумента ЕСТЬ NULL
	|		И НЕ ДанныеДокумента.Сделка ЕСТЬ NULL)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.Сделка.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	МАКСИМУМ(ДанныеДокумента.СтавкаНДС) КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.Сделка.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаДокумента,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|	
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Сделка ЕСТЬ NULL 
	|		И ТИПЗНАЧЕНИЯ(ДанныеДокумента.ДокументРасчетовСКонтрагентом) В (&ТипыНакладная)
	|		ИЛИ
	|		ТИПЗНАЧЕНИЯ(ДанныеДокумента.ДокументРасчетовСКонтрагентом) НЕ В (&ТипыНакладная)
	|		И НЕ ДанныеДокумента.Сделка.ВалютаДокумента ЕСТЬ NULL
	|		И НЕ ДанныеДокумента.Сделка ЕСТЬ NULL)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.Сделка.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	МАКСИМУМ(ДанныеДокумента.СтавкаНДС) КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.Сделка.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаДокумента,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя)
	|	И (ДанныеДокумента.Сделка ЕСТЬ NULL 
	|		И ТИПЗНАЧЕНИЯ(ДанныеДокумента.ДокументРасчетовСКонтрагентом) В (&ТипыНакладная)
	|		ИЛИ
	|		ТИПЗНАЧЕНИЯ(ДанныеДокумента.ДокументРасчетовСКонтрагентом) НЕ В (&ТипыНакладная)
	|		И НЕ ДанныеДокумента.Сделка.ВалютаДокумента ЕСТЬ NULL
	|		И НЕ ДанныеДокумента.Сделка ЕСТЬ NULL)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|					ДанныеДокумента.Сделка.СуммаДокумента
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Сделка КАК Основание,
	|	ДанныеДокумента.Сделка.ВалютаДокумента КАК ВалютаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	МАКСИМУМ(ДанныеДокумента.СтавкаНДС) КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДокумента,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю)
	|	И НЕ ДанныеДокумента.Сделка ЕСТЬ NULL 
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Сделка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Сделка КАК Основание,
	|	ДанныеДокумента.Сделка.ВалютаДокумента КАК ВалютаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	МАКСИМУМ(ДанныеДокумента.СтавкаНДС) КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДокумента,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ ДанныеДокумента.Сделка ЕСТЬ NULL 
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Сделка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Сделка КАК Основание,
	|	ДанныеДокумента.Сделка.ВалютаДокумента КАК ВалютаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	МАКСИМУМ(ДанныеДокумента.СтавкаНДС) КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаДокумента,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ ДанныеДокумента.Сделка ЕСТЬ NULL 
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Сделка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка.ВалютаДокумента = &Валюта ТОГДА
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Основание
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Сделка КАК ЗаказКлиента,
	|	ЕСТЬNULL(СУММА(Расчеты.СуммаВзаиморасчетовРасход), 0) КАК КОплатеРасход
	|ПОМЕСТИТЬ Расчеты
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Обороты(,, Регистратор,
	|		Сделка В (
	|			ВЫБРАТЬ
	|				Расшифровка.Основание
	|			ИЗ
	|				Расшифровка
	|			ГДЕ
	|				Расшифровка.Основание <> НЕОПРЕДЕЛЕНО
	|			)
	|		И Сделка.ВалютаДокумента = &Валюта
	|	) КАК Расчеты
	|ГДЕ
	|	Регистратор <> &Ссылка
	|	И НЕ &ТипРасчетаВозврат
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Сделка
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(СУММА(Расчеты.СуммаВзаиморасчетовРасход), 0) >= 0
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расшифровка.Основание,
	|	Расшифровка.СтавкаНДС,
	|	Расшифровка.СуммаДокумента,
	|	Расшифровка.СуммаОплаты,
	|	ВЫБОР
	|		КОГДА НЕ &ЗаданаСуммаПредоплаты ТОГДА
	|			ЕСТЬNULL(СУММА(ФискальныеОперации.ОплатаПредоплата), ЕСТЬNULL(СУММА(Расчеты.КОплатеРасход), 0))
	|		ИНАЧЕ
	|			&СуммаПредоплатыКорректировка
	|	КОНЕЦ КАК СуммаПредоплаты,
	|	ВЫБОР
	|		КОГДА Расшифровка.ВалютаОснования = &Валюта ТОГДА
	|			ВЫБОР
	|				КОГДА Расшифровка.СуммаОплаты - Расшифровка.СуммаДокумента
	|					+ ВЫБОР
	|						КОГДА НЕ &ЗаданаСуммаПредоплаты ТОГДА
	|							ЕСТЬNULL(СУММА(ФискальныеОперации.ОплатаПредоплата), ЕСТЬNULL(СУММА(Расчеты.КОплатеРасход), 0))
	|						ИНАЧЕ
	|							&СуммаПредоплатыКорректировка
	|					КОНЕЦ > 0 ТОГДА
	|					
	|					Расшифровка.СуммаОплаты - Расшифровка.СуммаДокумента
	|						+ ВЫБОР
	|							КОГДА НЕ &ЗаданаСуммаПредоплаты ТОГДА
	|								ЕСТЬNULL(СУММА(ФискальныеОперации.ОплатаПредоплата), ЕСТЬNULL(СУММА(Расчеты.КОплатеРасход), 0))
	|							ИНАЧЕ
	|								&СуммаПредоплатыКорректировка
	|						КОНЕЦ
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаПереплаты,
	|	ВЫБОР
	|		КОГДА Расшифровка.ВалютаОснования = &Валюта ТОГДА
	|			ВЫБОР
	|				КОГДА Расшифровка.СуммаДокумента - Расшифровка.СуммаОплаты
	|					- ВЫБОР
	|						КОГДА НЕ &ЗаданаСуммаПредоплаты ТОГДА
	|							ЕСТЬNULL(СУММА(ФискальныеОперации.ОплатаПредоплата), ЕСТЬNULL(СУММА(Расчеты.КОплатеРасход), 0))
	|						ИНАЧЕ
	|							&СуммаПредоплатыКорректировка
	|					КОНЕЦ > 0 ТОГДА
	|					
	|					Расшифровка.СуммаДокумента - Расшифровка.СуммаОплаты
	|						- ВЫБОР
	|							КОГДА НЕ &ЗаданаСуммаПредоплаты ТОГДА
	|								ЕСТЬNULL(СУММА(ФискальныеОперации.ОплатаПредоплата), ЕСТЬNULL(СУММА(Расчеты.КОплатеРасход), 0))
	|							ИНАЧЕ
	|								&СуммаПредоплатыКорректировка
	|						КОНЕЦ
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаКредита
	|	
	|ПОМЕСТИТЬ РасшифровкаОснования
	|ИЗ
	|	Расшифровка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|	ПО
	|		ФискальныеОперации.ДокументОснование = Расшифровка.Основание
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Расчеты КАК Расчеты
	|	ПО
	|		Расчеты.ЗаказКлиента = Расшифровка.Основание
	|
	|СГРУППИРОВАТЬ ПО
	|	Расшифровка.Основание,
	|	Расшифровка.ВалютаОснования,
	|	Расшифровка.СтавкаНДС,
	|	Расшифровка.СуммаДокумента,
	|	Расшифровка.СуммаОплаты
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаОснования.Основание,
	|	РасшифровкаОснования.СтавкаНДС КАК СтавкаНДС,
	|	РасшифровкаОснования.СуммаПереплаты КАК СуммаПереплаты
	|ИЗ
	|	РасшифровкаОснования
	|ГДЕ
	|	РасшифровкаОснования.СуммаПереплаты > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ВЫБОР 
	|		КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДоговорКонтрагента
	|		ИНАЧЕ 
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ КАК ОснованиеПлатежа,
	|	ДанныеДокумента.СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)
	|
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Ссылка НЕ В (ВЫБРАТЬ Расшифровка.Ссылка ИЗ Расшифровка)
	|		ИЛИ ДанныеДокумента.Сделка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|   ВЫБОР 
	|		КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДоговорКонтрагента
	|		ИНАЧЕ 
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ,
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ВЫБОР 
	|		КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДоговорКонтрагента
	|		ИНАЧЕ 
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ КАК ОснованиеПлатежа,
	|	ДанныеДокумента.СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)
	|
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Ссылка НЕ В (ВЫБРАТЬ Расшифровка.Ссылка ИЗ Расшифровка)
	|		ИЛИ ДанныеДокумента.Сделка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|   ВЫБОР 
	|		КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДоговорКонтрагента
	|		ИНАЧЕ 
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ,
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ВЫБОР 
	|		КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДоговорКонтрагента
	|		ИНАЧЕ 
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ КАК ОснованиеПлатежа,
	|	ДанныеДокумента.СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)
	|
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя)
	|	И (ДанныеДокумента.Ссылка НЕ В (ВЫБРАТЬ Расшифровка.Ссылка ИЗ Расшифровка)
	|		ИЛИ ДанныеДокумента.Сделка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|   ВЫБОР 
	|		КОГДА ДанныеДокумента.ДокументРасчетовСКонтрагентом ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДоговорКонтрагента
	|		ИНАЧЕ 
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ,
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)
	|
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю)
	|	И (ДанныеДокумента.Ссылка НЕ В (ВЫБРАТЬ Расшифровка.Ссылка ИЗ Расшифровка)
	|		ИЛИ ДанныеДокумента.Сделка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)
	|
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Ссылка НЕ В (ВЫБРАТЬ Расшифровка.Ссылка ИЗ Расшифровка)
	|		ИЛИ ДанныеДокумента.Сделка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)
	|
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Ссылка НЕ В (ВЫБРАТЬ Расшифровка.Ссылка ИЗ Расшифровка)
	|		ИЛИ ДанныеДокумента.Сделка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.СтавкаНДС
	|
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РасшифровкаОснования.СуммаПредоплаты), 0) КАК СуммаПредоплаты,
	|	ЕСТЬNULL(СУММА(РасшифровкаОснования.СуммаКредита), 0) КАК СуммаКредита
	|ИЗ
	|	РасшифровкаОснования
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расшифровка.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫБОР
	|				КОГДА Расшифровка.ВалютаОснования = Расшифровка.ВалютаОплаты ТОГДА
	|					ЕСТЬNULL(Расшифровка.СуммаДокумента, 0) = Расшифровка.СуммаОплаты
	|				ИНАЧЕ
	|					ЕСТЬNULL(Расшифровка.СуммаВзаиморасчетовОснования, Расшифровка.СуммаДокумента) = Расшифровка.СуммаВзаиморасчетовОплаты
	|			КОНЕЦ, ЛОЖЬ) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
	|	КОНЕЦ КАК ПризнакСпособаРасчетаПредоплата,
	|	ВЫБОР
	|		КОГДА ФискальныеОперации.ДокументОснование ЕСТЬ NULL ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ВЫБОР
	|						КОГДА Расшифровка.ВалютаОснования = Расшифровка.ВалютаОплаты ТОГДА
	|							ЕСТЬNULL(Расшифровка.СуммаДокумента, 0) = Расшифровка.СуммаОплаты
	|						ИНАЧЕ
	|							ЕСТЬNULL(Расшифровка.СуммаВзаиморасчетовОснования, Расшифровка.СуммаДокумента) = Расшифровка.СуммаВзаиморасчетовОплаты
	|					КОНЕЦ, ЛОЖЬ) ТОГДА
	|					ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой)
	|				ИНАЧЕ
	|					ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой)
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
	|	КОНЕЦ КАК ПризнакСпособаРасчета
	|	
	|ПОМЕСТИТЬ ОснованияПлатежа
	|ИЗ
	|	Расшифровка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|	ПО
	|		ФискальныеОперации.ДокументОснование = Расшифровка.Основание
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Ссылка);
	Запрос.УстановитьПараметр("Валюта", ДанныеДокумента.Валюта);
	Запрос.УстановитьПараметр("СуммаПредоплатыКорректировка",
		?(ЗначениеЗаполнено(СуммаПредоплатыКорректировка), СуммаПредоплатыКорректировка, 0));
	Запрос.УстановитьПараметр("ЗаданаСуммаПредоплаты", ЗначениеЗаполнено(СуммаПредоплатыКорректировка));
	
	ТипыНакладная = Новый Массив;
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ТипыНакладная.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	Запрос.УстановитьПараметр("ТипыНакладная", ТипыНакладная);
	
	Запрос.УстановитьПараметр("ТипРасчетаВозврат", ПараметрыФискализацииЧека.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств);
	
	Запрос.УстановитьПараметр("СтавкаНДСПоУмолчанию", УчетНДС.ОбщаяСтавкаНДС(ДанныеДокумента.Дата));
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыФискализацииЧека.СистемаНалогообложения = МенеджерОборудованияКлиентСервер.СистемаНалогообложения
		(ДанныеДокумента.Организация, ДанныеДокумента.Дата);

	СтрокаОплаты = Новый Структура;
	СтрокаОплаты.Вставить("ТипОплаты", ДанныеДокумента.ТипОплаты);
	СтрокаОплаты.Вставить("Сумма",     ДанныеДокумента.СуммаДокумента);
	ПараметрыФискализацииЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
	
	Если Не РезультатЗапроса[4].Пустой() Тогда
		
		ВыборкаОплат = РезультатЗапроса[4].Выбрать();
		ВыборкаОплат.Следующий();
		
		Если ВыборкаОплат.СуммаПредоплаты > 0 Тогда
			СтрокаОплаты = Новый Структура;
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
			СтрокаОплаты.Вставить("Сумма",     ВыборкаОплат.СуммаПредоплаты);
			ПараметрыФискализацииЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		Если ВыборкаОплат.СуммаКредита > 0 Тогда
			СтрокаОплаты = Новый Структура;
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Постоплата);
			СтрокаОплаты.Вставить("Сумма",     ВыборкаОплат.СуммаКредита);
			ПараметрыФискализацииЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
	КонецЕсли;
	
	ПозицииЧека = Новый Массив;
	ИтогоСуммаЧека = 0;
	
	ВыборкаАвансов = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаАвансов.Следующий() Цикл
		
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		СтрокаПозицииЧека.ПризнакСпособаРасчета  = Перечисления.ПризнакиСпособаРасчета.Аванс;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
		
		Если ДанныеДокумента.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
			СтрокаПозицииЧека.Наименование = НСтр("ru = 'Оплата от:'")
				+ " " + ДанныеДокумента.ПринятоОт;
		Иначе
			СтрокаПозицииЧека.Наименование = НСтр("ru = 'Выдано:'")
				+ " " + ДанныеДокумента.ПринятоОт;
		КонецЕсли;
		
		СтрокаПозицииЧека.Количество   = 1;
		СтрокаПозицииЧека.Цена         = ВыборкаАвансов.СуммаПереплаты;
		СтрокаПозицииЧека.Сумма        = ВыборкаАвансов.СуммаПереплаты;
		СтрокаПозицииЧека.СтавкаНДС    = РозничныеПродажиКлиентСервер.СтавкаНДСФискальнойОперации(ВыборкаАвансов.СтавкаНДС);
		СтрокаПозицииЧека.НомерСекции  = 2;
		
		Если СтрокаПозицииЧека.Количество <> 0 Тогда
			СтрокаПозицииЧека.ЦенаСоСкидками = Окр(СтрокаПозицииЧека.Сумма / СтрокаПозицииЧека.Количество, 2);
		КонецЕсли;
		
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
		ИтогоСуммаЧека = ИтогоСуммаЧека + СтрокаПозицииЧека.Сумма;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаОплаченныеПозицииНоменклатуры();
	
	Запрос.УстановитьПараметр("ДатаДокумента",    ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента",  ДанныеДокумента.Валюта);
	Запрос.УстановитьПараметр("ОплатаОтКлиента",  ДанныеДокумента.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
		
		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, Выборка);
		
		СтрокаПозицииЧека.Сумма = Окр(СтрокаПозицииЧека.Сумма, 2);
		
		СтрокаПозицииЧека.Наименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			Выборка.НоменклатураНаименование,
			Выборка.ХарактеристикаНаименование);
			
		Упаковка = Неопределено;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "Упаковка")
			И ЗначениеЗаполнено(Выборка.Упаковка) Тогда
			
			Упаковка = Выборка.Упаковка;
		КонецЕсли;
		
		Если ВерсияФФД = "1.2" Тогда
			СтрокаПозицииЧека.КодЕдиницыИзмерения = РозничныеПродажи.КодЕдиницыИзмеренияПараметраЧека(Упаковка);
		Иначе
			СтрокаПозицииЧека.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(Упаковка), СокрЛП(Упаковка), "шт.");
		КонецЕсли;
		
		СтрокаПозицииЧека.СтавкаНДС = РозничныеПродажиКлиентСервер.СтавкаНДСФискальнойОперации(Выборка.СтавкаНДС);
		СтрокаПозицииЧека.НомерСекции = 1;
		
		Если СтрокаПозицииЧека.Количество <> 0 Тогда
			СтрокаПозицииЧека.ЦенаСоСкидками = Окр(СтрокаПозицииЧека.Сумма / СтрокаПозицииЧека.Количество, 2);
		КонецЕсли;
		
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
		ИтогоСуммаЧека = ИтогоСуммаЧека + СтрокаПозицииЧека.Сумма;
		
	КонецЦикла;
	
	ПараметрыФискализацииЧека.ПозицииЧека = ПозицииЧека;
	
	// Замена ставок НДС по признакам способа расчета: аванс, предоплата, оплата кредита
	Отказ = Ложь;
	ПараметрыФискализацииЧека.Вставить("СпособФорматноЛогическогоКонтроля", Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки);
	МенеджерОборудованияВызовСервера.ПривестиДанныеКТребуемомуФормату(ПараметрыФискализацииЧека, Отказ, "", Ложь);
КонецПроцедуры

Процедура ЗаполнитьПозицииИТаблицуОплатЧека10(ПараметрыФискализацииЧека, ДанныеДокумента, СуммаПредоплатыКорректировка)
	
	СтрокаОплаты = Новый Структура();
	СтрокаОплаты.Вставить("ТипОплаты", ДанныеДокумента.ТипОплаты);
	СтрокаОплаты.Вставить("Сумма", ДанныеДокумента.СуммаДокумента);
	
	ПараметрыФискализацииЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
	
	ПозицииЧека = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|ПОМЕСТИТЬ Расшифровка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ,
	|	ДанныеДокумента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|	
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ,
	|	ДанныеДокумента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сделка КАК Основание,
	|	ДанныеДокумента.Сделка.ВалютаДокумента КАК ВалютаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сделка КАК Основание,
	|	ДанныеДокумента.Сделка.ВалютаДокумента КАК ВалютаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ КАК Основание,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.ВалютаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаОснования,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом.СуммаДокумента
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка.СуммаДокумента
	|	КОНЕЦ КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сделка ЕСТЬ NULL ТОГДА
	|			ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИНАЧЕ
	|			ДанныеДокумента.Сделка
	|	КОНЕЦ,
	|	ДанныеДокумента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сделка КАК Основание,
	|	ДанныеДокумента.Сделка.ВалютаДокумента КАК ВалютаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаОснования,
	|	ДанныеДокумента.Сделка.СуммаДокумента КАК СуммаВзаиморасчетовОснования,
	|	ДанныеДокумента.Ссылка.ВалютаДокумента КАК ВалютаОплаты,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК СуммаОплаты,
	|	СУММА(ДанныеДокумента.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетовОплаты
	|
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.Ссылка
	|
	|;
	|
	|ВЫБРАТЬ
	|	Расшифровка.Основание,
	|	ЕСТЬNULL(ВЫБОР
	|		КОГДА Расшифровка.ВалютаОснования = Расшифровка.ВалютаОплаты ТОГДА
	|			ЕСТЬNULL(Расшифровка.СуммаОснования, 0) = Расшифровка.СуммаОплаты
	|		ИНАЧЕ
	|			ЕСТЬNULL(Расшифровка.СуммаВзаиморасчетовОснования, Расшифровка.СуммаОснования) = Расшифровка.СуммаВзаиморасчетовОплаты
	|	КОНЕЦ, ЛОЖЬ) И (Расшифровка.Основание <> &Ссылка) КАК ПолнаяОплатаОснования
	|ПОМЕСТИТЬ РасшифровкаОснования
	|ИЗ
	|	Расшифровка
	|;
	|
	|ВЫБРАТЬ
	|	Расшифровка.Основание
	|ИЗ
	|	РасшифровкаОснования КАК Расшифровка
	|ГДЕ
	|	Расшифровка.ПолнаяОплатаОснования
	|;
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК Сумма
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасшифровкаОснования КАК Расшифровка
	|	ПО Расшифровка.Основание = ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ Расшифровка.ПолнаяОплатаОснования
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК Сумма
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасшифровкаОснования КАК Расшифровка
	|	ПО Расшифровка.Основание = ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ Расшифровка.ПолнаяОплатаОснования
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК Сумма
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасшифровкаОснования КАК Расшифровка
	|	ПО Расшифровка.Основание = ДанныеДокумента.Сделка
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ Расшифровка.ПолнаяОплатаОснования
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ДанныеДокумента.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасшифровкаОснования КАК Расшифровка
	|	ПО Расшифровка.Основание = ДанныеДокумента.Сделка
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ Расшифровка.ПолнаяОплатаОснования
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ДанныеДокумента.СуммаПлатежа) КАК Сумма
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РасшифровкаОснования КАК Расшифровка
	|	ПО (Расшифровка.Основание = ДанныеДокумента.ДокументРасчетовСКонтрагентом
	|		ИЛИ Расшифровка.Основание = ДанныеДокумента.Сделка)
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И НЕ Расшифровка.ПолнаяОплатаОснования
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтавкаНДС
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Ссылка);
	Запрос.УстановитьПараметр("СтавкаНДСПоУмолчанию", УчетНДС.ОбщаяСтавкаНДС(ДанныеДокумента.Дата));
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыФискализацииЧека.СистемаНалогообложения = МенеджерОборудованияКлиентСервер.СистемаНалогообложения
		(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
		
	ИтогоСуммаЧека = 0;
	
	ВыборкаСтрокБезТоваров = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаСтрокБезТоваров.Следующий() Цикл
		
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		Если ДанныеДокумента.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
			СтрокаПозицииЧека.Наименование = НСтр("ru = 'Оплата от:'")
				+ " " + ДанныеДокумента.ПринятоОт;
		Иначе
			СтрокаПозицииЧека.Наименование = НСтр("ru = 'Выдано:'")
				+ " " + ДанныеДокумента.ПринятоОт;
		КонецЕсли;
		СтрокаПозицииЧека.Количество   = 1;
		СтрокаПозицииЧека.Цена         = ВыборкаСтрокБезТоваров.Сумма;
		СтрокаПозицииЧека.Сумма        = ВыборкаСтрокБезТоваров.Сумма;
		СтрокаПозицииЧека.СтавкаНДС    = РозничныеПродажиКлиентСервер.СтавкаНДСФискальнойОперации(ВыборкаСтрокБезТоваров.СтавкаНДС);
		СтрокаПозицииЧека.НомерСекции  = 2;
		
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
		ИтогоСуммаЧека = ИтогоСуммаЧека + СтрокаПозицииЧека.Сумма;
	КонецЦикла;
	
	ДокументыОснования = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Основание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОплаченныеПозицииНоменклатуры10();
	Запрос.УстановитьПараметр("МассивДокументов", ДокументыОснования);
	Запрос.УстановитьПараметр("ДатаДокумента", ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", ДанныеДокумента.Валюта);
	Запрос.УстановитьПараметр("ОплатаОтКлиента", ДанныеДокумента.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, Выборка);
		
		СтрокаПозицииЧека.Сумма = Окр(СтрокаПозицииЧека.Сумма, 2);
		
		СтрокаПозицииЧека.Наименование = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			Выборка.НоменклатураНаименование,
			Выборка.ХарактеристикаНаименование,
			Выборка.УпаковкаНаименование);
		
		СтрокаПозицииЧека.СтавкаНДС = РозничныеПродажиКлиентСервер.СтавкаНДСФискальнойОперации(Выборка.СтавкаНДС);
		СтрокаПозицииЧека.НомерСекции = 1;
		
		// Данные по алкогольной продукции
		ПараметрыАлкогольнойПродукции = Новый Массив;
		Если ЗначениеЗаполнено(Выборка.АлкогольнаяПродукция) И Выборка.АлкогольнаяПродукция Тогда
			ПараметрыАлкогольнойПродукции.Добавить(Выборка.МаркируемаяАлкогольнаяПродукция); // Признак наличия штрихкода PDF417
			ПараметрыАлкогольнойПродукции.Добавить("");                                      // Штрихкод марки в формате PDF417
			ПараметрыАлкогольнойПродукции.Добавить(Выборка.Объем);                           // Объем номенклатуры в литрах
			ПараметрыАлкогольнойПродукции.Добавить(Выборка.Крепость);                        // Процент содержания алкоголя
			ПараметрыАлкогольнойПродукции.Добавить(Выборка.КодВидаАлкогольнойПродукции);     // Код вида алкогольной продукции
		КонецЕсли;
		
		// Дополнительные параметры
		СтрокаПозицииЧека.Вставить("ПараметрыАлкогольнойПродукции", ПараметрыАлкогольнойПродукции);
		
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
		ИтогоСуммаЧека = ИтогоСуммаЧека + СтрокаПозицииЧека.Сумма;
	КонецЦикла;
	
	Если ИтогоСуммаЧека <> ДанныеДокумента.СуммаДокумента И ПозицииЧека.Количество() Тогда
		ПозицииЧека[ПозицииЧека.ВГраница()].Сумма =
			ПозицииЧека[ПозицииЧека.ВГраница()].Сумма + ДанныеДокумента.СуммаДокумента - ИтогоСуммаЧека;
	КонецЕсли;
	
	ПараметрыФискализацииЧека.ПозицииЧека = ПозицииЧека;
	
КонецПроцедуры

Функция ТекстЗапросаОплаченныеПозицииНоменклатуры()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	ТаблицаДокумента.ЕдиницаИзмерения КАК Упаковка,
	               |	ТаблицаДокумента.Количество КАК Количество,
	               |	ТаблицаДокумента.Цена КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ КАК Сумма,
	               |	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета КАК ПризнакСпособаРасчета
	               |ПОМЕСТИТЬ ТаблицаНоменклатуры
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ОтчетКомиссионераОПродажах.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |ГДЕ
	               |	&ОплатаОтКлиента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	НЕОПРЕДЕЛЕНО,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	НЕОПРЕДЕЛЕНО,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслугВНТТ.Услуги КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	НЕОПРЕДЕЛЕНО,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчета
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчетаПредоплата
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.ХарактеристикаНоменклатуры,
	               |	ТаблицаДокумента.ЕдиницаИзмерения,
	               |	ТаблицаДокумента.Количество,
	               |	ТаблицаДокумента.Цена,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТаблицаДокумента.Сумма
	               |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	               |	КОНЕЦ,
	               |	ТаблицаДокумента.СтавкаНДС,
	               |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	               |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
	               |	ОснованияПлатежа.ПризнакСпособаРасчетаПредоплата
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ТаблицаДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОснованияПлатежа КАК ОснованияПлатежа
	               |		ПО (ОснованияПлатежа.Основание = ТаблицаДокумента.Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсВалюты.Валюта КАК Валюта,
	               |	КурсВалюты.Курс * КурсВалютыДокумента.Кратность / (КурсВалюты.Кратность * КурсВалютыДокумента.Курс) КАК КоэффициентПересчета
	               |ПОМЕСТИТЬ КурсыВалют
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсВалюты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	КурсВалюты.Кратность <> 0
	               |	И КурсВалютыДокумента.Курс <> 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНоменклатуры.Количество КАК Количество,
	               |	ТаблицаНоменклатуры.Сумма * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК Сумма,
	               |	ТаблицаНоменклатуры.СтавкаНДС КАК СтавкаНДС,
	               |	ТаблицаНоменклатуры.Валюта КАК Валюта,
	               |	ТаблицаНоменклатуры.ПризнакСпособаРасчета КАК ПризнакСпособаРасчета,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ТаблицаНоменклатуры.ЦенаВключаетНДС
	               |				ТОГДА ТаблицаНоменклатуры.Цена
	               |			КОГДА ТаблицаНоменклатуры.Количество = 0
	               |				ТОГДА ТаблицаНоменклатуры.Сумма
	               |			ИНАЧЕ ТаблицаНоменклатуры.Сумма / ТаблицаНоменклатуры.Количество
	               |		КОНЕЦ * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК ЧИСЛО(31, 2)) КАК Цена,
	               |	ЕСТЬNULL(ТаблицаНоменклатуры.Номенклатура.НаименованиеПолное, """") КАК НоменклатураНаименование,
	               |	ЕСТЬNULL(ТаблицаНоменклатуры.Характеристика.Наименование, """") КАК ХарактеристикаНаименование,
	               |	ТаблицаНоменклатуры.Упаковка               КАК Упаковка,
	               |	ТаблицаНоменклатуры.Упаковка КАК УпаковкаНаименование
	               |ИЗ
	               |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	               |		ПО ТаблицаНоменклатуры.Валюта = КурсыВалют.Валюта";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОплаченныеПозицииНоменклатуры10()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактуры.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ СчетаФактуры
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.Ссылка В (&МассивДокументов)
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура          		КАК Номенклатура,                               
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,                              
	|	ТаблицаДокумента.ЕдиницаИзмерения 			КАК Упаковка,                                     
	|	ТаблицаДокумента.Количество 				КАК Количество,                                    
	|	ТаблицаДокумента.Цена                   	КАК Цена,                                           
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,                                           
	|	ТаблицаДокумента.СтавкаНДС              	КАК СтавкаНДС,                                        
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента 	КАК Валюта,                                            
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС 	КАК ЦенаВключаетНДС
	|
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаФактуры КАК СчетаФактуры
	|		ПО ТаблицаДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|
	|ГДЕ
	|	(ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|		ИЛИ СчетаФактуры.ДокументОснование ЕСТЬ НЕ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура           	КАК Номенклатура,                                        
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,                                       
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,                                              
	|	ТаблицаДокумента.Количество					КАК Количество,                                             
	|	ТаблицаДокумента.Цена                   	КАК Цена,                                                    
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС                                              
	|	КОНЕЦ 										КАК Сумма,                                                    
	|	ТаблицаДокумента.СтавкаНДС              	КАК СтавкаНДС,                                                 
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента     КАК Валюта,                                                     
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС                                              
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ТаблицаДокумента
	|		
	|ГДЕ
	|	(ТаблицаДокумента.Ссылка В (&МассивДокументов))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ                                                                                                          
	|	ТаблицаДокумента.Номенклатура           	КАК Номенклатура,                                                  
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,                                                 
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,                                                        
	|	ТаблицаДокумента.Количество					КАК Количество,                                                       
	|	ТаблицаДокумента.Цена                   	КАК Цена,                                                              
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,                                                              
	|	ТаблицаДокумента.СтавкаНДС              	КАК СтавкаНДС,                                                           
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента     КАК Валюта,                                                               
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС                                                        
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура           КАК Номенклатура,                                                               
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,                                                          
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,                                                                 
	|	ТаблицаДокумента.Количество					КАК Количество,                                                                
	|	ТаблицаДокумента.Цена                   КАК Цена,                                                                           
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,                                                                       
	|	ТаблицаДокумента.СтавкаНДС              КАК СтавкаНДС,                                                                        
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента     КАК Валюта,                                                                        
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС                                                                 
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК ТаблицаДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ СчетаФактуры КАК СчетаФактуры
	|	ПО ТаблицаДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|
	|ГДЕ
	|	(ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|	ИЛИ СчетаФактуры.ДокументОснование ЕСТЬ НЕ NULL)
	|	И &ОплатаОтКлиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура          		КАК Номенклатура,                                                                    
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,                                                                   
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,                                                                          
	|	ТаблицаДокумента.Количество					КАК Количество,                                                                         
	|	ТаблицаДокумента.Цена                   	КАК Цена,                                                                                
	|	ВЫБОР                                                                                                                    
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,      
	|	ТаблицаДокумента.СтавкаНДС             		КАК СтавкаНДС,   
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента     КАК Валюта,       
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС	
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура          		КАК Номенклатура,    
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,   
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,          
	|	ТаблицаДокумента.Количество					КАК Количество,         
	|	ТаблицаДокумента.Цена                   	КАК Цена,                
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,                
	|	ТаблицаДокумента.СтавкаНДС             		КАК СтавкаНДС,             
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента     КАК Валюта,                 
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС          
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура            КАК Номенклатура,                
	|	НЕОПРЕДЕЛЕНО                             КАК Характеристика,               
	|	НЕОПРЕДЕЛЕНО                             КАК Упаковка,                      
	|	ТаблицаДокумента.Количество              КАК Количество,                     
	|	ТаблицаДокумента.Цена                    КАК Цена,                            
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 									 КАК Сумма,                            
	|	ТаблицаДокумента.СтавкаНДС               КАК СтавкаНДС,                         
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента  КАК Валюта,                             
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС                      
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура              КАК Номенклатура,                         
	|	НЕОПРЕДЕЛЕНО                             КАК Характеристика,                        
	|	НЕОПРЕДЕЛЕНО                             КАК Упаковка,                               
	|	ТаблицаДокумента.Количество              КАК Количество,                              
	|	ТаблицаДокумента.Цена                    КАК Цена,                                     
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 									 КАК Сумма,                                     
	|	ТаблицаДокумента.СтавкаНДС               КАК СтавкаНДС,                                  
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента  КАК Валюта,                                      
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС                               
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ.Услуги КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура				КАК Номенклатура,                               
	|	НЕОПРЕДЕЛЕНО                            КАК Характеристика,                                  
	|	НЕОПРЕДЕЛЕНО                            КАК Упаковка,                                         
	|	ТаблицаДокумента.Количество             КАК Количество,                                        
	|	ТаблицаДокумента.Цена                   КАК Цена,                                               
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,                                           
	|	ТаблицаДокумента.СтавкаНДС              КАК СтавкаНДС,                                            
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента 	КАК Валюта,                                            
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС 	КАК ЦенаВключаетНДС                                     
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТаблицаДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СчетаФактуры КАК СчетаФактуры
	|	ПО
	|		ТаблицаДокумента.Ссылка = СчетаФактуры.ДокументОснование
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|	ИЛИ СчетаФактуры.ДокументОснование ЕСТЬ НЕ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ                                                                                                 
	|	ТаблицаДокумента.Номенклатура           	КАК Номенклатура,                                        
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,                                       
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,                                              
	|	ТаблицаДокумента.Количество					КАК Количество,                                             
	|	ТаблицаДокумента.Цена                   	КАК Цена,                                                    
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС                                              
	|	КОНЕЦ 										КАК Сумма,                                                    
	|	ТаблицаДокумента.СтавкаНДС              	КАК СтавкаНДС,                                                 
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента     КАК Валюта,                                                     
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС                                              
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура           	КАК Номенклатура,	
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,  
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,         
	|	ТаблицаДокумента.Количество					КАК Количество,        
	|	ТаблицаДокумента.Цена                   	КАК Цена,               
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,               
	|	ТаблицаДокумента.СтавкаНДС              	КАК СтавкаНДС,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента 	КАК Валюта,               
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС        
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура           	КАК Номенклатура,
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ТаблицаДокумента.ЕдиницаИзмерения           КАК Упаковка,
	|	ТаблицаДокумента.Количество					КАК Количество,
	|	ТаблицаДокумента.Цена                   	КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.СуммаВключаетНДС
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ 										КАК Сумма,
	|	ТаблицаДокумента.СтавкаНДС              КАК СтавкаНДС,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента 	КАК Валюта,
	|	ТаблицаДокумента.Ссылка.СуммаВключаетНДС	КАК ЦенаВключаетНДС
	|ИЗ
	|	Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ТаблицаДокумента
	|
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Упаковка = Штрихкоды.ЕдиницаИзмерения
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетШтрихКода
	|ПОМЕСТИТЬ Штрихкоды
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ТаблицаТовары.Номенклатура = Штрихкоды.Владелец
	|			И ТаблицаТовары.Характеристика = Штрихкоды.ХарактеристикаНоменклатуры
	|			И (ТаблицаТовары.Упаковка = Штрихкоды.ЕдиницаИзмерения
	|				ИЛИ ТаблицаТовары.Номенклатура.БазоваяЕдиницаИзмерения = ТаблицаТовары.Упаковка
	|					И Штрихкоды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика,
	|	Штрихкоды.Упаковка,
	|	МАКСИМУМ(Штрихкоды.ПриоритетШтрихКода) КАК ПриоритетШтрихКода
	|ПОМЕСТИТЬ ПриоритетыШтрихКода
	|ИЗ
	|	Штрихкоды КАК Штрихкоды
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика,
	|	Штрихкоды.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Характеристика КАК Характеристика,
	|	Штрихкоды.Упаковка КАК Упаковка,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
	|ПОМЕСТИТЬ ШтрихкодыНоменклатуры
	|ИЗ
	|	Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыШтрихКода КАК ПриоритетыШтрихКода
	|		ПО Штрихкоды.Номенклатура = ПриоритетыШтрихКода.Номенклатура
	|			И Штрихкоды.Характеристика = ПриоритетыШтрихКода.Характеристика
	|			И Штрихкоды.Упаковка = ПриоритетыШтрихКода.Упаковка
	|			И Штрихкоды.ПриоритетШтрихКода = ПриоритетыШтрихКода.ПриоритетШтрихКода
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика,
	|	Штрихкоды.Упаковка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Упаковка
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.Курс * КурсВалютыДокумента.Кратность / (КурсВалюты.Кратность * КурсВалютыДокумента.Курс) КАК КоэффициентПересчета
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КурсВалюты.Кратность <> 0
	|	И КурсВалютыДокумента.Курс <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Количество             КАК Количество,
	|	ТаблицаНоменклатуры.Сумма * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК Сумма,
	|	ТаблицаНоменклатуры.СтавкаНДС              КАК СтавкаНДС,
	|	ТаблицаНоменклатуры.Валюта                 КАК Валюта,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ТаблицаНоменклатуры.ЦенаВключаетНДС ТОГДА
	|			ТаблицаНоменклатуры.Цена
	|		КОГДА ТаблицаНоменклатуры.Количество = 0 ТОГДА
	|			ТаблицаНоменклатуры.Сумма
	|		ИНАЧЕ
	|			ТаблицаНоменклатуры.Сумма / ТаблицаНоменклатуры.Количество
	|	КОНЕЦ * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК ЧИСЛО(31,2)) КАК Цена,
	|	ТаблицаНоменклатуры.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.Характеристика.Наименование, """") КАК ХарактеристикаНаименование,
	|	ТаблицаНоменклатуры.Упаковка               КАК УпаковкаНаименование,
	|	
	|	ТаблицаНоменклатуры.Номенклатура.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаНоменклатуры.Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый КАК МаркируемаяАлкогольнаяПродукция,
	|	ТаблицаНоменклатуры.Номенклатура.ОбъемДАЛ * 10 КАК Объем,
	|	ТаблицаНоменклатуры.Номенклатура.Крепость КАК Крепость,
	|	ТаблицаНоменклатуры.Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Код КАК КодВидаАлкогольнойПродукции,
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК Штрихкод
	|
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют
	|		ПО ТаблицаНоменклатуры.Валюта = КурсыВалют.Валюта
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ШтрихкодыНоменклатуры.Номенклатура = ТаблицаНоменклатуры.Номенклатура
	|			И ШтрихкодыНоменклатуры.Характеристика = ТаблицаНоменклатуры.Характеристика
	|			И ШтрихкодыНоменклатуры.Упаковка = ТаблицаНоменклатуры.Упаковка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Печать чека (конец)

// Служебные процедуры и функции (конец)

// Программный интерфейс (конец)

