
#Область СлужебныйПрограммныйИнтерфейс

#Область Выгрузка

Процедура ВыгрузитьВФайлУведомлениеПоПрослеживаемости(Ссылка) Экспорт

	РезультатВыгрузки = ПрослеживаемостьВызовСервера.ПолучитьВыгружаемыеДанныеУведомленияПоПрослеживаемости(Ссылка);

	Если РезультатВыгрузки <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатВыгрузки.Ошибки) Тогда
		
			Сообщение = Новый СообщениеПользователю;
		
			Для каждого ТекущаяОшибка Из РезультатВыгрузки.Ошибки Цикл
			
				Сообщение.Текст = ТекущаяОшибка;
				Сообщение.Сообщить();
			
			КонецЦикла;
		Иначе
			
			ВыгрузитьУведомлениеВXML(РезультатВыгрузки);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузитьУведомлениеВXML(РезультатВыгрузки)
	
	Попытка
			
		ПолучитьФайл(РезультатВыгрузки.АдресФайлаВыгрузки, РезультатВыгрузки.ИмяФайлаВыгрузки, Истина);
			
	Исключение
			
		Сообщение = Новый СообщениеПользователю;
			
		ТекстСообщения = "Не удалось записать файл """ + РезультатВыгрузки.ИмяФайлаВыгрузки 
		+ """! Возможно, недостаточно места на диске или диск защищен от записи.";
		
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), ТекстСообщения);
		
		Сообщение.Сообщить();
			
	КонецПопытки;

КонецПроцедуры

Процедура ОткрытьФормуПредварительногоПросмотра(ТекущаяПечатнаяФорма, ТекстЗаголовкаФормы)
	
	СписокПечатныхФорм = Новый СписокЗначений;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПоместитьВоВременноеХранилище(ТекущаяПечатнаяФорма));
	МассивПараметров.Добавить(Новый УникальныйИдентификатор());
	МассивПараметров.Добавить("");
	
	СписокПечатныхФорм.Добавить(МассивПараметров, ТекстЗаголовкаФормы);
	
	ДополнительныеПараметры = Новый Структура("ЗаголовокФормы,Заголовок,УникальныйИдентификатор", 
	ТекстЗаголовкаФормы);
	
	//РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(
	//ДополнительныеПараметры, "ПоказатьБланк", , СписокПечатныхФорм, ДополнительныеПараметры);
	
КонецПроцедуры

Функция ПолучитьСписокПечатаемыхЛистовНаСервере(Ссылка) Экспорт
	
	Возврат 
		Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров.ПолучитьСписокПечатныхФормУведомлениеОПеремещенииПрослеживаемыхТоваров(Ссылка);
	
КонецФункции

Функция ПолучитьСписокПечатаемыхЛистовУведомлениеОбОстатках(Ссылка) Экспорт
	
	Возврат 
		Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров.ПолучитьПечатнуюФормуУведомлениеОбОстаткахПрослеживаемыхТоваров(Ссылка);
	
КонецФункции

Функция ПолучитьСписокПечатаемыхЛистовУведомлениеОВвозе(Ссылка) Экспорт
	
	Возврат 
		Документы.УведомлениеОВвозеПрослеживаемыхТоваров.ПолучитьПечатнуюФормуУведомления(Ссылка);
	
КонецФункции

#КонецОбласти
