#Область ПрограммныйИнтерфейс

// Определяет соответствие переданного документа типу "ПоступлениеТоваровУслуг".
// 
// Параметры:
// * Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа.
//
Функция ЭтоДокументПриобретения(Контекст) Экспорт
	
	ЭтоПриобретение = Ложь;
	ТипКонтекста    = ТипЗнч(Контекст);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст,"ЭтотОбъект") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ДокументОбъект") Тогда
			Если ТипЗнч(Контекст.ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда 
				ЭтоПриобретение = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ФормаКлиентскогоПриложения") Тогда
		Если СтрНачинаетсяС(Контекст.ИмяФормы, "Документ.ПоступлениеТоваровУслуг") Тогда
			ЭтоПриобретение = Истина;
		ИначеЕсли СтрНачинаетсяС(Контекст.ИмяФормы, "ОбщаяФорма.ПроверкаЗаполненияДокументов") Тогда
			Если ТипЗнч(Контекст.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				ЭтоПриобретение = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		ЭтоПриобретение = Истина;
	ИначеЕсли ТипКонтекста = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
		ЭтоПриобретение = Истина;
	КонецЕсли;
	
	Возврат ЭтоПриобретение;
	
КонецФункции

// Определяет соответствие переданного документа типу "ЧекККМ".
// 
// Параметры:
// * Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа.
//
Функция ЭтоЧекККМ(Контекст) Экспорт
	
	ЭтоЧек       = Ложь;
	ТипКонтекста = ТипЗнч(Контекст);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст,"ЭтотОбъект") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ДокументОбъект") Тогда
			Если ТипЗнч(Контекст.ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ") Тогда 
				ЭтоЧек = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ФормаКлиентскогоПриложения") Тогда
		Если СтрНачинаетсяС(Контекст.ИмяФормы, "Документ.ЧекККМ") Тогда
			ЭтоЧек = Истина;
		ИначеЕсли СтрНачинаетсяС(Контекст.ИмяФормы, "ОбщаяФорма.ПроверкаЗаполненияДокументов") Тогда
			Если ТипЗнч(Контекст.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
				ЭтоЧек = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ДокументСсылка.ЧекККМ") Тогда 
		ЭтоЧек = Истина;
	КонецЕсли;
	
	Возврат ЭтоЧек;
	
КонецФункции

// Определяет соответствие переданного документа типу "ЧекККМКоррекции".
// 
// Параметры:
// * Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа.
//
Функция ЭтоЧекККМВозврат(Контекст) Экспорт
	
	ЭтоЧекВозврат = Ложь;
	ТипКонтекста  = ТипЗнч(Контекст);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст,"ЭтотОбъект") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ДокументОбъект") Тогда
			Если ТипЗнч(Контекст.ДокументОбъект) = Тип("ДокументОбъект.ЧекККМКоррекции") Тогда 
				ЭтоЧекВозврат = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ФормаКлиентскогоПриложения") Тогда
		Если СтрНачинаетсяС(Контекст.ИмяФормы, "Документ.ЧекККМКоррекции") Тогда
			ЭтоЧекВозврат = Истина;
		ИначеЕсли СтрНачинаетсяС(Контекст.ИмяФормы, "ОбщаяФорма.ПроверкаЗаполненияДокументов") Тогда
			Если ТипЗнч(Контекст.Ссылка) = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда
				ЭтоЧекВозврат = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда 
		ЭтоЧекВозврат = Истина;
	КонецЕсли;
	
	Возврат ЭтоЧекВозврат;
	
КонецФункции

// Определяет соответствие переданного документа проверяемому типу.
// 
// Параметры:
// * Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа.
// * Имя      - Строка - имя объекта метаданного документа.
//
Функция ЭтоДокументПоНаименованию(Контекст, Имя) Экспорт
	
	Результат = Ложь;
	
	ТипКонтекста = ТипЗнч(Контекст);
	ТипДокСсылка = Тип(СтрШаблон("ДокументСсылка.%1",Имя));
	ТипДокОбъект = Тип(СтрШаблон("ДокументОбъект.%1",Имя));
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст,"ЭтотОбъект") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "ДокументОбъект") Тогда
			Если ТипЗнч(Контекст.ДокументОбъект) = ТипДокОбъект Тогда 
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = Тип("ФормаКлиентскогоПриложения") Тогда
		Если СтрНачинаетсяС(Контекст.ИмяФормы, СтрШаблон("Документ.%1",Имя)) Тогда
			Результат = Истина;
		ИначеЕсли СтрНачинаетсяС(Контекст.ИмяФормы, "ОбщаяФорма.ПроверкаЗаполненияДокументов") Тогда
			Если ТипЗнч(Контекст.Ссылка) = ТипДокСсылка Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипКонтекста = ТипДокСсылка Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область Серии

// Подготовливает структуру, массив которых в дальнейшем будет передан в процедуру генерации серий.
// 
// Параметры:
// Возвращаемое значение:
// * Структура - Описание:
//		** Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура, для которой будет генерироваться серия.
//		** Серия        - ОпределяемыйТип.СерииНоменклатуры   - В данное значение будет записана сгенерированная серия.
//		** МРЦ          - Число - Максимальная розничная цена табачной продукции.
//		** ЕстьОшибка   - Булево - Будет установлено в Истина, если по каким то причинам серия сгенерирована не будет.
//		** ТекстОшибки  - Строка - причина, по которой серия не генерировалась.
//
Функция СтруктураДанныхДляГенерацииСерии() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Номенклатура", Неопределено);
	СтруктураДанных.Вставить("Серия",        Неопределено);
	СтруктураДанных.Вставить("МРЦ",          0);
	СтруктураДанных.Вставить("ЕстьОшибка",   Ложь);
	СтруктураДанных.Вставить("ТекстОшибки",  "");
	
	Возврат СтруктураДанных;

КонецФункции

#КонецОбласти

#КонецОбласти

