&НаКлиенте
Перем ЧекиДляФискализации;

&НаКлиенте
Процедура ПробитьЧекиНаККТ(Команда)
	
	//Элементы.ФормаПробитьЧекиНаККТ.Доступность = Ложь;
	
	ВыбратьФискальноеУстройство();
	
КонецПроцедуры

// Служебные процедуры и функции

&НаКлиенте
Процедура ВыбратьФискальноеУстройство()
	
	Перем ФУ;
	
	НомерСтроки = 0;
	ЧекиДляФискализации = ДанныеФискализации();
	
	Если ЧекиДляФискализации.Количество() = 0 Тогда
		Сообщить("Нет чеков для фискализации!");
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСТорговымОборудованием.ПолучитьПроверитьПараметрыДляПробитияЧека(ФУ, Истина, ЧекиДляФискализации[0].Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьФискальноеУстройство_Завершение(ФУ);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФискальноеУстройство_Завершение(ИдентификаторУстройства) Экспорт
	
	Если ИдентификаторУстройства <> Неопределено Тогда
		ИдентификаторУстройстваККТ = ИдентификаторУстройства;
		НачатьФискализациюЧеков();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Фискальное устройство не выбрано.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеФискализации()
	
	Результат = Новый Массив();
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого КлючЗаписи Из ВыделенныеСтроки Цикл
		Данные = МенеджерОборудованияВызовСервера.ДанныеЧекаВОчереди(КлючЗаписи.ИдентификаторЗаписи);
		Результат.Добавить(Данные);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьФискализациюЧеков()
	
	Перем ФУ;
	
	Если НомерСтроки < ЧекиДляФискализации.Количество() Тогда
		
		Данные = ЧекиДляФискализации[НомерСтроки];
		НомерСтроки = НомерСтроки + 1;
		
		Если Данные.СтатусЧека <> ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Фискализирован") Тогда
			ОбщиеПараметры = МенеджерОборудованияВызовСервера.ДанныеЧекаВОчереди(Данные.ИдентификаторЗаписи).ДанныеЧека;
			Текст = МенеджерОборудованияКлиентСервер.СформироватьТекстНефискальногоДокумента(0, ОбщиеПараметры, 42);
			
			Если Не РаботаСТорговымОборудованием.ПолучитьПроверитьПараметрыДляПробитияЧека(ФУ, Истина, Данные.Организация) Тогда
				Возврат;
			КонецЕсли;

			ВидФУ = ПолучитьСерверТО().ПолучитьВид(ФУ);
			
			Если ВидФУ = Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор Тогда
				Возврат;
			Иначе
				ОписаниеПКС = КассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ФУ);
				
				Если ОписаниеПКС = Неопределено ИЛИ ОписаниеПКС.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Кассовая смена не открыта");
					Возврат;
				КонецЕсли;

				ОбъектДрайвера = Неопределено;
				ОбработкаОбслуживания = Неопределено;
				ПолучитьСерверТО().ПолучитьОбъектДрайвера(ФУ, ОбработкаОбслуживания, ОбъектДрайвера);
			//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьФискализациюЧеков_Завершение", ЭтотОбъект, ОбщиеПараметры);
			//МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОписаниеОповещения, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройстваККТ);
				Результат = ОбработкаОбслуживания.ФискализироватьЧек(ОбъектДрайвера, ОбщиеПараметры);
				НачатьФискализациюЧеков_Завершение(Результат, ОбщиеПараметры, ОбъектДрайвера.ОписаниеОшибки);
			КонецЕсли;
			
		Иначе
			НачатьФискализациюЧеков();
		КонецЕсли;
		
	Иначе
		Элементы.ФормаПробитьЧекиНаККТ.Доступность = Истина;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьФискализациюЧеков_Завершение(РезультатВыполнения, Параметры, ОписаниеОшибки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыполнения) Тогда
	    СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Фискализирован");
		ТекстСообщения = "";
	Иначе
	    СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Ошибка");
		ТекстСообщения = ОписаниеОшибки;
	КонецЕсли;
	
	МенеджерОборудованияВызовСервера.ЗаписатьСтатусЧекаВОчереди(Параметры, СтатусЧека, ТекстСообщения);
	НачатьФискализациюЧеков()
	
КонецПроцедуры

// Функция возвращает признак того, что клиент поддерживает работу с видом ТО,
// переданным в качестве параметра.
//
// Параметры:
//  Вид      - <ПеречислениеСсылка.ВидыТорговогоОборудования>
//           - Вид торгового оборудования, информация о поддержке
//             которого запрашивается.
//
// Возвращаемое значение:
//  <Булево> - Признак поддержки указанного класса торгового оборудования.
//
Функция ПоддерживаетсяВидТО(Вид) Экспорт

	Результат = Ложь;

	Если Вид = Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор 
		ИЛИ Вид = Перечисления.ВидыТорговогоОборудования.ККТ Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПоддерживаетсяВидТО()

&НаКлиенте
Процедура ПриОткрытии1(Отказ)
	
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьФискализированныеПриИзменении(Элемент)
	
	Список.Отбор.Элементы[0].Использование = НЕ ПоказыватьФискализированные;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусЧека");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусЧекаККТВОчереди.Фискализирован;
	ЭлементОтбора.Использование = Истина;
	
	
КонецПроцедуры

// Служебные процедуры и функции (конец)
