Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	Возврат "";
КонецФункции


Функция ТекстЗапросаПрослеживаемыеТовары(НомераТаблиц, ПараметрыПроведения, Реквизиты) Экспорт
	
	НомераТаблиц.Вставить("ВТ_Прослеживаемость",    НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрослеживаемыеТовары",   НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ВозвратТоваровПоставщикуСведенияПрослеживаемости.Количество) КАК Количество,
	|	ВозвратТоваровПоставщикуТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	СУММА(ВозвратТоваровПоставщикуСведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	ВозвратТоваровПоставщикуТовары.Ссылка КАК ДокументОперации,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаРеализации,
	|	ВЫБОР
	|		КОГДА НЕ &ЭтоДоговорСКомитентом
	|			ТОГДА
	|				ВозвратТоваровПоставщикуТовары.ДокументПоступления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ОснованиеДляВозврата,
	|	ЕСТЬNULL(ВозвратТоваровПоставщику.Номер, """") КАК НомерДокумента,
	|	ЕСТЬNULL(ВозвратТоваровПоставщику.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокумента,
	|	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	|	НАЧАЛОПЕРИОДА(ВозвратТоваровПоставщику.Дата, КВАРТАЛ) КАК ПериодОперации,
	|	ВЫБОР
	|		КОГДА &ЭтоДоговорСКомитентом
	|			ТОГДА ВозвратТоваровПоставщику.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Комитент,
	|	ВозвратТоваровПоставщикуСведенияПрослеживаемости.Сумма КАК СуммаБезНДС
	|ПОМЕСТИТЬ ВТ_Прослеживаемость
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.СведенияПрослеживаемости КАК ВозвратТоваровПоставщикуСведенияПрослеживаемости
	|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщикуСведенияПрослеживаемости.Ссылка
	|			И ВозвратТоваровПоставщикуТовары.ИдентификаторСтроки = ВозвратТоваровПоставщикуСведенияПрослеживаемости.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщику.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.ПрослеживаемыйТовар
	|	И ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровПоставщикуТовары.СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуСведенияПрослеживаемости.РНПТ,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	ВозвратТоваровПоставщикуТовары.Ссылка,
	|	ВозвратТоваровПоставщику.Контрагент,
	|	ЕСТЬNULL(ВозвратТоваровПоставщику.Номер, """"),
	|	ЕСТЬNULL(ВозвратТоваровПоставщику.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	НАЧАЛОПЕРИОДА(ВозвратТоваровПоставщику.Дата, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА НЕ &ЭтоДоговорСКомитентом
	|			ТОГДА
	|				ВозвратТоваровПоставщикуТовары.ДокументПоступления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоДоговорСКомитентом
	|			ТОГДА ВозвратТоваровПоставщику.Контрагент
	|	КОНЕЦ,
	|	ВозвратТоваровПоставщикуСведенияПрослеживаемости.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Прослеживаемость.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_Прослеживаемость.Количество) КАК Количество,
	|	ВТ_Прослеживаемость.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СУММА(ВТ_Прослеживаемость.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	ВТ_Прослеживаемость.РНПТ КАК РНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоДоговорСКомитентом
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗапасовПрослеживаемыхТоваров.ТоварыОтКомитентаНаРеализацию)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Прослеживаемость.Комитент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗапасовПрослеживаемыхТоваров.ПустаяСсылка)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗапасовПрослеживаемыхТоваров.ТоварыЗакупленныеДляКомитента)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ВТ_Прослеживаемость.ДатаРеализации КАК ДатаРеализации,
	|	ВТ_Прослеживаемость.ОснованиеДляВозврата КАК ОснованиеДляВозврата,
	|	ВТ_Прослеживаемость.Комитент КАК Комитент
	|ИЗ
	|	ВТ_Прослеживаемость КАК ВТ_Прослеживаемость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Прослеживаемость.Номенклатура,
	|	ВТ_Прослеживаемость.СтранаПроисхождения,
	|	ВТ_Прослеживаемость.РНПТ,
	|	ВТ_Прослеживаемость.ДатаРеализации,
	|	ВТ_Прослеживаемость.ОснованиеДляВозврата,
	|	ВТ_Прослеживаемость.Комитент";
	
	Возврат ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
		
КонецФункции

