/////////////////////////////////////////////////////////////////////
//
// Адаптационный модуль. Поддержка вызовов новой фуункциональности
//
/////////////////////////////////////////////////////////////////////

Функция КомментарийКонтактнойИнформации(КонтактнаяИнформация) Экспорт
	
	Если ПустаяСтрока(КонтактнаяИнформация) Тогда
		Возврат "";
	КонецЕсли;
	
	// Реализовать здесь.
	
	Возврат "";
	
КонецФункции

Процедура УстановитьКомментарийКонтактнойИнформации(XMLСтрока, Знач Комментарий) Экспорт
	
	Возврат;
	
КонецПроцедуры

Функция КонтактнаяИнформацияXMLПоПредставлению(Представление, ОжидаемыйВид) Экспорт
	
	// Реализовать здесь.
	Возврат "";
	
КонецФункции

Функция КонтактнаяИнформацияВXML(Знач ЗначенияПолей, Знач Представление = "", Знач ОжидаемыйВид = Неопределено) Экспорт
	
	// Реализовать здесь.
	Возврат "";
	
КонецФункции