
// ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.СписокПометитьНУдалениеСнятьПометку.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеСнятьПометку(Команда)
	
	МассивСсылок = Элементы.Список.ВыделенныеСтроки;
	ЕстьПометкаУдаления = ВернутьЗначениеПометкиУдаления(МассивСсылок);
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли МассивСсылок.Количество() = 1 Тогда
		Если ЕстьПометкаУдаления Тогда
			ТекстВопроса = НСтр("ru = 'Снять с ""%1"" пометку на удаление?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Пометить ""%1"" на удаление?'");
		КонецЕсли;
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, МассивСсылок[0]);
	Иначе
		Если ЕстьПометкаУдаления Тогда
			ТекстВопроса = НСтр("ru = 'Снять с выделенных элементов пометку на удаление?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Пометить выделенные элементы на удаление?'");
		КонецЕсли;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Результат = Вопрос(ТекстВопроса, Режим, 0);
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСнятьПометкуУдаленияНаСервере(МассивСсылок, Не ЕстьПометкаУдаления);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭлектронныеДокументыСлужебныйКлиент.ОткрытьЭДДляПросмотра(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ЭлектронныеДокументыСлужебныйКлиент.ОткрытьЭДДляПросмотра(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьЗначениеПометкиУдаления(МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭДПрисоединенныеФайлы.ПометкаУдаления
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|ГДЕ
	|	ЭДПрисоединенныеФайлы.ПометкаУдаления
	|	И ЭДПрисоединенныеФайлы.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьСнятьПометкуУдаленияНаСервере(МассивСсылок, ЗначениеПометкиУдаления)
	
	Для каждого ЭлементМассива Из МассивСсылок Цикл
		Объект = ЭлементМассива.ПолучитьОбъект();
		Объект.ДополнительныеСвойства.Вставить("ПомечатьНаУдалениеПодписанныеОбъекты", Истина);
		Объект.УстановитьПометкуУдаления(ЗначениеПометкиУдаления);
	КонецЦикла;
	
КонецПроцедуры
