#Область СлужебныйПрограммныйИнтерфейс

#Область ОбщиеНастройки

// Определяет, нужно ли подписывать служебные сообщения обезличенным сертификатом.
// 
// Возвращаемое значение:
// 	Булево - Значение константы "ИспользоватьОбезличенныеСертификаты"
Функция ИспользоватьОбезличенныеСертификаты() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Константы.ИспользоватьОбезличенныеСертификаты.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастройкиВнутреннегоЭДО

// См. НастройкиВнутреннегоЭДОКлиентСервер.НовоеОписаниеПолейКлючаНастройкиВнутреннегоЭДО
Функция НовоеОписаниеПолейКлючаНастройкиВнутреннегоЭДО() Экспорт
	
	Возврат НастройкиВнутреннегоЭДОКлиентСервер.НовоеОписаниеПолейКлючаНастройкиВнутреннегоЭДО();
	
КонецФункции

// См. НастройкиВнутреннегоЭДО.ТекстЗапросаДополнениеНастройкамиВнутреннегоЭДО
Функция ТекстЗапросаДополнениеНастройкамиВнутреннегоЭДО(ИмяИсходнойТаблицы, ПоляТаблицы, ПоляКлючаНастройки) Экспорт
	
	Возврат НастройкиВнутреннегоЭДО.ТекстЗапросаДополнениеНастройкамиВнутреннегоЭДО(ИмяИсходнойТаблицы,
		ПоляТаблицы, ПоляКлючаНастройки);
	
КонецФункции

#КонецОбласти

#КонецОбласти
