#Область СлужебныйПрограммныйИнтерфейс

// В процедуре нужно реализовать очистку кэшированных штрихкодов для исключения повторной обработки.
//
// Параметры:
//  ДанныеШтрихкодов - Массив - полученные штрихкоды,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
Процедура ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Вызывается после обработки штрихкодов. В процедуре нужно проанализировать полученные штрихкоды на предмет сканирования акцизной марки, а также
// обработать штрихкоды, не привязанные к номенклатуре.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В функции нужно реализовать подготовку данных для дальнейшей обработки штрихкодов, полученных из ТСД.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//  ТаблицаТоваров - Массив - полученные данные из ТСД,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ,
//  ПараметрыЗаполнения - Структура - параметры заполнения (см. ИнтеграцияЕГАИСКлиентСервер.ПараметрыЗаполненияТабличнойЧасти()).
//  СтруктураДействий - Структура - подготовленные данные.
Процедура ПодготовитьДанныеДляОбработкиТаблицыТоваровПолученнойИзТСД(
	Форма, ТаблицаТоваров, КэшированныеЗначения, ПараметрыЗаполнения, СтруктураДействий) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Вызывается после загрузки данных из ТСД. В процедуре нужно проанализировать полученные штрихкоды на предмет сканирования акцизной марки, а также
// обработать штрихкоды, не привязанные к номенклатуре.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
Процедура ПослеОбработкиТаблицыТоваровПолученнойИзТСД(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре реализуется открытие формы считывания акцизной марки в случае необходимости.
//
//Параметры:
//  Форма -  ФормаКлиентскогоПриложения - форма документа, в которой были обработаны штрихкоды,
//  СтруктураДействий - Структура - подготовленные ранее данные штрихкодов.
//
Процедура ОткрытьФормуСчитыванияАкцизнойМаркиПриНеобходимости(Форма, СтруктураДействий) Экспорт
	
	//++ НЕ ГОСИС
	ПараметрыСканирования  = ШтрихкодированиеИСКлиент.ПараметрыСканирования(Форма);
	ПараметрыОткрытияФормы =  ШтрихкодированиеИСКлиентСервер.ПараметрыОткрытияФормыВводаКодаМаркировки();
	ПараметрыОткрытияФормы.Номенклатура          = Неопределено;
	ПараметрыОткрытияФормы.Характеристика        = Неопределено;
	ПараметрыОткрытияФормы.ВидПродукции          = Перечисления.ВидыПродукцииИС.Алкогольная;
	ПараметрыОткрытияФормы.МаркируемаяПродукция  = Истина;
	ПараметрыОткрытияФормы.ПараметрыСканирования = ПараметрыСканирования;
	
	ШтрихкодированиеИСКлиент.ОткрытьФормуСчитыванияКодаМаркировки(Форма, ПараметрыОткрытияФормы);
	
	//-- НЕ ГОСИС
	
	Возврат;
	
КонецПроцедуры

// В функции нужно реализовать подготовку данных для дальнейшей обработки штрихкодов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//  ДанныеШтрихкодов - Массив - полученные штрихкоды,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ,
//  ПараметрыЗаполнения - Структура - параметры заполнения (см. СобытияФормЕГАИСКлиент.СтруктураПараметрыЗаполнения()).
//
// Возвращаемое значение:
//  Структура - подготовленные данные.
//
Функция ПодготовитьДанныеДляОбработкиШтрихкодов(Форма, ДанныеШтрихкодов, КэшированныеЗначения, ПараметрыЗаполнения) Экспорт
	
	
	Возврат Неопределено;
	
КонецФункции

// В процедуре нужно показать диалоговое окно для ввода штрихкода и передать полученные данные в описание оповещения.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - процедура, которую нужно вызвать после ввода штрихкода.
//
Процедура ПоказатьВводШтрихкода(Оповещение = Неопределено) Экспорт
	
	Результат = "";
	Если ШтрихкодыНоменклатурыКлиент.ВвестиШтрихкод(Результат) И
		НЕ (Оповещение = Неопределено) Тогда
		
		ВыполнитьОбработкуОповещенияИС(Оповещение, Новый Структура("Штрихкод,Количество",Результат,1));
		
	КонецЕсли;
	
КонецПроцедуры

// В процедуре нужно открыть форму регистрации новых штрихкодов номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, откуда производится вызов процедуры,
//  ДанныеШтрихкодов - Массив - элемент массива - структура с ключами:
//   * Штрихкод - Строка - штрихкод номенклатуры,
//   * Количество - Число - количество алкогольной продукции.
Процедура ОткрытьФормуРегистрацииШтрихкодовНоменклатуры(Форма, ДанныеШтрихкодов) Экспорт
	
	//++ НЕ ГОСИС	
	Если ДанныеШтрихкодов.Количество() > 0 Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("ШтрихКод", ДанныеШтрихкодов[0].ШтрихКод);
		ПараметрыОткрытияФормы.Вставить("ТипШтрихкода", ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
		
		ОткрытьФормуИС(
			"РегистрСведений.Штрихкоды.Форма.ФормаЗаписиУправляемая",
			ПараметрыОткрытияФормы,
			Форма,
			Новый УникальныйИдентификатор,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти
