/////////////////////////////////////////////////////////////////////////////////////////
//
//  Функции обратной совместимости для эмуляции новых возможностей платформы
//  Удалить лишние при необходимости
//
/////////////////////////////////////////////////////////////////////////////////////////

Функция ОпределяемыеТипыГИСЭПД() Экспорт
	#Если НЕ ВебКлиент И НЕ ТонкийКлиент Тогда
		Возврат  ОбменСГИСЭПДКлиентСерверПовтИсп.ОпределяемыеТипыГИСЭПДУПП();
	#Иначе
		Возврат Неопределено;
	#КонецЕсли
КонецФункции
