
Процедура ПриЗаписи(Отказ)
	
	// Актуализируем признак "Использование" у регламентных заданий,
	// зависмых от функциональной опции.
	МассивЗаданий = Новый Массив;
	МассивЗаданий.Добавить(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОтправкаОформленныхЭД));
	МассивЗаданий.Добавить(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПолучениеНовыхЭД));
	МассивЗаданий.Добавить(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ПроверкаКонтрагентовБЭД));
	МассивЗаданий.Добавить(РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.НаличиеНовыхЭД));
	
	Для Каждого Задание Из МассивЗаданий Цикл
		Если Задание.Использование <> Значение Тогда
			Задание.Использование = Значение;
			Задание.Записать();
		КонецЕсли;
	КонецЦикла;
 
КонецПроцедуры
