#Область СлужебныйПрограммныйИнтерфейс

#Область Обмен

Процедура ПостроитьОчередьСообщений(ПараметрыОбмена, СообщениеИлиДокумент = Неопределено) Экспорт
	
	ПараметрыОбмена.ОчередьСообщений.Очистить();
	ПараметрыОбмена.ЗависимостиСообщений.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Очередь.ДатаСоздания       КАК ДатаСоздания,
	|	Очередь.Сообщение          КАК Сообщение,
	|	Очередь.СообщениеОснование КАК СообщениеОснование,
	|	
	|	Очередь.ВидПродукции              КАК ВидПродукции,
	|	Очередь.Операция                  КАК Операция,
	|	Очередь.Назначение                КАК Назначение,
	|	Очередь.СтанцияУправленияЗаказами КАК СтанцияУправленияЗаказами,
	|	Очередь.ПроизводственныйОбъект    КАК ПроизводственныйОбъект,
	|	
	|	Очередь.Организация       КАК Организация,
	|	Очередь.Документ          КАК Документ,
	|	Очередь.ДокументОснование КАК ДокументОснование,
	|	
	|	Очередь.РеквизитыИсходящегоСообщения      КАК РеквизитыИсходящегоСообщения,
	|	Очередь.ПротоколОбмена                    КАК ПротоколОбмена,
	|	Очередь.ДатаМодификацииУниверсальная      КАК ДатаМодификацииУниверсальная,
	|	Очередь.ЗагружатьПосле                    КАК ЗагружатьПосле,
	|	Очередь.ЗагружатьДо                       КАК ЗагружатьДо,
	|	Очередь.ИдентификаторЗаявки               КАК ИдентификаторЗаявки,
	|	Очередь.ИдентификаторПоследнегоБлокаКодов КАК ИдентификаторПоследнегоБлокаКодов
	|ИЗ
	|	РегистрСведений.ОчередьСообщенийИСМП КАК Очередь
	|ГДЕ
	|	&УсловиеПоОрганизациям
	|");
	
	Если ПараметрыОбмена.Организации <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизациям", "Очередь.Организация В(&Организации)");
		Запрос.УстановитьПараметр("Организации", ПараметрыОбмена.Организации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизациям", "ИСТИНА");
	КонецЕсли;
	
	Если СообщениеИлиДокумент <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + Символы.ПС +
			"И (Очередь.Сообщение В(&СообщениеИлиДокумент) Или Очередь.Документ В(&СообщениеИлиДокумент))";
		
		Запрос.УстановитьПараметр("СообщениеИлиДокумент", СообщениеИлиДокумент);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РеквизитыИсходящегоСообщения = Выборка.РеквизитыИсходящегоСообщения.Получить();
		ПротоколОбмена               = Выборка.ПротоколОбмена.Получить();
		
		Если РеквизитыИсходящегоСообщения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементОчереди = ПараметрыОбмена.ОчередьСообщений.Добавить();
		ЭлементОчереди.ДатаСоздания       = Выборка.ДатаСоздания;
		ЭлементОчереди.Сообщение          = Выборка.Сообщение;
		ЭлементОчереди.СообщениеОснование = Выборка.СообщениеОснование;
		
		ЭлементОчереди.ВидПродукции              = Выборка.ВидПродукции;
		ЭлементОчереди.Операция                  = Выборка.Операция;
		ЭлементОчереди.Назначение                = Выборка.Назначение;
		ЭлементОчереди.СтанцияУправленияЗаказами = Выборка.СтанцияУправленияЗаказами;
		ЭлементОчереди.ПроизводственныйОбъект    = Выборка.ПроизводственныйОбъект;
		
		ЭлементОчереди.Организация       = Выборка.Организация;
		ЭлементОчереди.Документ          = Выборка.Документ;
		ЭлементОчереди.ДокументОснование = Выборка.ДокументОснование;
		
		ЭлементОчереди.РеквизитыИсходящегоСообщения      = РеквизитыИсходящегоСообщения;
		ЭлементОчереди.ПротоколОбмена                    = ПротоколОбмена;
		ЭлементОчереди.ДатаМодификацииУниверсальная      = Выборка.ДатаМодификацииУниверсальная;
		ЭлементОчереди.ИдентификаторЗаявки               = Выборка.ИдентификаторЗаявки;
		ЭлементОчереди.ИдентификаторПоследнегоБлокаКодов = Выборка.ИдентификаторПоследнегоБлокаКодов;
		
		Если ЗначениеЗаполнено(Выборка.ЗагружатьПосле) Тогда
			НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
			НоваяЗависимость.Сообщение1 = Выборка.Сообщение;
			НоваяЗависимость.Сообщение2 = Выборка.ЗагружатьПосле;
			НоваяЗависимость.Загрузка   = Ложь;
			НоваяЗависимость.Передача   = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ЗагружатьДо) Тогда
			НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
			НоваяЗависимость.Сообщение1 = Выборка.ЗагружатьДо;
			НоваяЗависимость.Сообщение2 = Выборка.Сообщение;
			НоваяЗависимость.Загрузка   = Ложь;
			НоваяЗависимость.Передача   = Ложь;
		КонецЕсли;
		
		Если ПротоколОбмена <> Неопределено
			И ПротоколОбмена.Количество() > 0 Тогда
			
			ПоследняяЗаписьПротоколаОбмена = ПротоколОбмена[ПротоколОбмена.Количество() - 1];
			ЭлементОчереди.ТекущийСтатусОбработки = ПоследняяЗаписьПротоколаОбмена.СтатусОбработки;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
					ПоследняяЗаписьПротоколаОбмена, "Статус") Тогда
				ЭлементОчереди.ТекущийСтатус = ПоследняяЗаписьПротоколаОбмена.Статус;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗависимостиКУдалению = Новый Соответствие();
	Для Каждого СтрокаТЧ Из ПараметрыОбмена.ЗависимостиСообщений Цикл
		Если ПараметрыОбмена.ОчередьСообщений.Найти(СтрокаТЧ.Сообщение1, "Сообщение") = Неопределено
			Или ПараметрыОбмена.ОчередьСообщений.Найти(СтрокаТЧ.Сообщение2, "Сообщение") = Неопределено Тогда
			ЗависимостиКУдалению.Вставить(СтрокаТЧ, Истина);
		КонецЕсли;
	КонецЦикла;
	Для Каждого КлючИЗначение Из ЗависимостиКУдалению Цикл
		ПараметрыОбмена.ЗависимостиСообщений.Удалить(КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьКПередачеУниверсально(ВходящиеДанные, ПараметрыОбмена) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
	ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресДанныхЛогаЗапроса",         Неопределено);
	ВозвращаемоеЗначение.Вставить(
		"ИзвлекатьДанныеЛогаЗапросов",
		ИнтеграцияИСКлиентСерверПовтИсп.ЭтоФоновоеЗаданиеНаСервере());
	
	// Собрать JSON для передаваемых документов
	// Требуется подписание документа на клиенте? Если да, то документы требуется вернуть на клиент.
	// Нужен ли запрос авторизации? Если да, то документы нужно положить в очередь и вернуться на клиент для авторизации
	// После всего - выполнить передачу и дождаться результата - изменений.
	СообщенияJSON = Новый Массив;
	Для Каждого ПараметрыОбработкиДокумента Из ВходящиеДанные Цикл
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыОбмена", ПараметрыОбмена);
		ДополнительныеПараметры.Вставить("ПараметрыОбработкиДокумента", ПараметрыОбработкиДокумента);
		
		Если ПараметрыОбработкиДокумента.ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.СогласиеОПредоставлениеИнформации Тогда
			
			СообщенияДокументаJSON = СообщениеКПередачеJSONСогласиеОПредоставлениеИнформации(
				ПараметрыОбработкиДокумента,
				ДополнительныеПараметры);
			
		Иначе
			
			СообщенияДокументаJSON = СообщениеКПередачеJSON(
				ПараметрыОбработкиДокумента.Ссылка,
				ПараметрыОбработкиДокумента.ДальнейшееДействие,
				ДополнительныеПараметры);
			
		КонецЕсли;
		
		Для Каждого СообщениеJSON Из СообщенияДокументаJSON Цикл
			СообщенияJSON.Добавить(СообщениеJSON);
		КонецЦикла;
		
	КонецЦикла;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ДатаСледующейИтерации = ОбработатьОчередьСообщений(ПараметрыОбмена);
	
	ЕстьОшибки = Ложь;
	Если ПараметрыОбмена.УникальныйИдентификатор <> Неопределено Тогда
		Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
			Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТребуетсяОжидание = ДатаСледующейИтерации <> Неопределено
	               Или (Не ЕстьОшибки И ПараметрыОбмена.ОчередьСообщений.Количество() > 0);
	
	ТребуетсяПодписание = (ПараметрыОбмена.СообщенияКПодписанию <> Неопределено
	                       И ПараметрыОбмена.СообщенияКПодписанию.Количество())
	                       Или (ПараметрыОбмена.КОбновлениюКлючейСессии <> Неопределено
	                       И ПараметрыОбмена.КОбновлениюКлючейСессии.Количество());
	
	ТребуетсяОпределениеВидаУпаковки = ПараметрыОбмена.КОпределениюВидаУпаковки <> Неопределено;

	ДоступныеСертификаты          = Неопределено;
	АдресКОпределениюВидаУпаковки = "";

	Если ТребуетсяОпределениеВидаУпаковки Тогда

		СообщенияКОпределениюВидаУпаковок = СообщенияКОпределениюВидаУпаковок(ПараметрыОбмена);

		ПроверитьКлючиСессии(
			СообщенияКОпределениюВидаУпаковок,
			СертификатыДляПодписанияНаСервере, ПараметрыОбмена);

		ДоступныеСертификаты(СообщенияКОпределениюВидаУпаковок, ДоступныеСертификаты);

		АдресКОпределениюВидаУпаковки = ШтрихкодированиеИСМПСлужебный.ДанныеКОпределениюВидаУпаковки(ПараметрыОбмена);

		Если Не ЗначениеЗаполнено(АдресКОпределениюВидаУпаковки) Тогда
			ТребуетсяОпределениеВидаУпаковки = Ложь;
			ПараметрыОбмена.КОпределениюВидаУпаковки = Неопределено;
		КонецЕсли;

	КонецЕсли;

	Если ТребуетсяОжидание И Не ТребуетсяПодписание И Не ТребуетсяОпределениеВидаУпаковки Тогда
		
		Если ДатаСледующейИтерации <> Неопределено Тогда
			ВремяОжидания = Окр(ДатаСледующейИтерации - ТекущаяДатаСеанса(), 0, РежимОкругления.Окр15как20);
		Иначе
			ВремяОжидания = 0;
		КонецЕсли;
		
		Если ПараметрыОбмена.ОжидатьНаСервере Тогда
			ИнтеграцияИС.Ожидать(ВремяОжидания, ПараметрыОбмена);
			Возврат ПродолжитьВыполнениеОбменаУниверсально(
				Неопределено,
				ПараметрыОбмена);
		ИначеЕсли Не ПараметрыОбмена.ОжидатьНаКлиенте Тогда
			Возврат ПродолжитьВыполнениеОбменаУниверсально(
				Неопределено,
				ПараметрыОбмена);
		КонецЕсли;
		
	КонецЕсли;
	
	Если (ТребуетсяОжидание Или ТребуетсяПодписание Или ТребуетсяОпределениеВидаУпаковки)
		И ПараметрыОбмена.АдресВоВременномХранилище <> Неопределено Тогда

		Если ТребуетсяПодписание Тогда
			
			ПроверитьКлючиСессии(
				ПараметрыОбмена.СообщенияКПодписанию,
				СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
			
			ДоступныеСертификаты(ПараметрыОбмена.СообщенияКПодписанию,    ДоступныеСертификаты);
			ДоступныеСертификаты(ПараметрыОбмена.КОбновлениюКлючейСессии, ДоступныеСертификаты);
			
		КонецЕсли;
		
		ВозвращаемоеЗначение.ДоступныеСертификаты           = ДоступныеСертификаты;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = ПараметрыОбмена.КОбновлениюКлючейСессии;
		ВозвращаемоеЗначение.ТребуетсяПодписание            = ПараметрыОбмена.СообщенияКПодписанию;
		ВозвращаемоеЗначение.КОпределениюВидаУпаковки       = АдресКОпределениюВидаУпаковки;

		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
		ПараметрыОбмена.ФоновоеЗадание          = Неопределено;
		ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено;
		ПараметрыОбмена.СообщенияКПодписанию    = Неопределено;
		
		Для Каждого НастройкаОбменаСУЗ Из ПараметрыОбмена.НастройкиОбменаСУЗ.ОбменНаСервере Цикл
			Для Каждого НастройкаПоОрганизации Из НастройкаОбменаСУЗ.Значение Цикл
				НастройкаПоОрганизации.ФоновоеЗадание = Неопределено;
			КонецЦикла;
		КонецЦикла;
		
		ВозвращаемоеЗначение.Ожидать                   = ИнтеграцияИС.ВремяОжидания(ВремяОжидания);
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		
		Если ЗначениеЗаполнено(ПараметрыОбмена.АдресВоВременномХранилище) Тогда
			УдалитьИзВременногоХранилища(ПараметрыОбмена.АдресВоВременномХранилище);
		КонецЕсли;
		
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
		
	КонецЕсли;
	
	ЗаписатьЛогЗапросовВоВременноеХранилищеВозвращаемогоЗначения(ПараметрыОбмена, ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗагрузитьВходящиеДокументыУниверсально(ПараметрыЗагрузки, ПараметрыОбмена) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
	ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресДанныхЛогаЗапроса",         Неопределено);
	ВозвращаемоеЗначение.Вставить(
		"ИзвлекатьДанныеЛогаЗапросов",
		ИнтеграцияИСКлиентСерверПовтИсп.ЭтоФоновоеЗаданиеНаСервере());
	
	Организации = Новый Массив;
	Если ТипЗнч(ПараметрыЗагрузки.Организация) = Тип("Массив") Тогда
		Организации = ПараметрыЗагрузки.Организация;
	Иначе
		Организации.Добавить(ПараметрыЗагрузки.Организация);
	КонецЕсли;
	
	Операция           = Перечисления.ВидыОперацийИСМП.ЗагрузкаВходящихДокументов;
	ВидыПродукцииУчета = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(, Ложь);

	Если ВидыПродукцииУчета.Найти(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС) <> Неопределено Тогда
		ВидМолочнойПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС;
	ИначеЕсли ВидыПродукцииУчета.Найти(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС) <> Неопределено Тогда
		ВидМолочнойПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС;
	КонецЕсли;
	
	СообщенияJSON = Новый Массив;
	Для Каждого ОрганизацияДляОбмена Из Организации Цикл
		
		Для Каждого ВидПродукции Из ВидыПродукцииУчета Цикл
			
			Если ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ВидПродукции)
				И ВидМолочнойПродукции <> ВидПродукции Тогда
				Продолжить;
			КонецЕсли;
			
			АбстрактноеСообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
			
			АбстрактноеСообщениеJSON.ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
			АбстрактноеСообщениеJSON.Идентификатор       = СокрЛП(Новый УникальныйИдентификатор());
			
			АбстрактноеСообщениеJSON.Организация       = ОрганизацияДляОбмена;
			АбстрактноеСообщениеJSON.Документ          = Неопределено;
			АбстрактноеСообщениеJSON.ДокументОснование = Неопределено;
			
			АбстрактноеСообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(
				Операция, Неопределено, Неопределено);
			
			АбстрактноеСообщениеJSON.ТекстСообщенияJSON  = Неопределено;
			АбстрактноеСообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
			АбстрактноеСообщениеJSON.Версия              = Неопределено;
			АбстрактноеСообщениеJSON.ТребуетсяПодписание = Ложь;
			АбстрактноеСообщениеJSON.ПараметрыЗапроса    = ПараметрыЗагрузки; //.Инервал;
			
			АбстрактноеСообщениеJSON.ВидПродукции              = ВидПродукции;
			АбстрактноеСообщениеJSON.Операция                  = Операция;
			АбстрактноеСообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.ИСМП;
			АбстрактноеСообщениеJSON.СтанцияУправленияЗаказами = Неопределено;
			
			СообщенияJSON.Добавить(АбстрактноеСообщениеJSON);
			
		КонецЦикла;
		
	КонецЦикла;
	
	СертификатыДляПодписанияНаСервере  = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ДатаСледующейИтерации = ОбработатьОчередьСообщений(ПараметрыОбмена);
	
	ЕстьОшибки = Ложь;
	Если ПараметрыОбмена.УникальныйИдентификатор <> Неопределено Тогда
		Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
			Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТребуетсяОжидание = ДатаСледующейИтерации <> Неопределено
	               Или (Не ЕстьОшибки И ПараметрыОбмена.ОчередьСообщений.Количество() > 0);
	
	ТребуетсяПодписание = (ПараметрыОбмена.СообщенияКПодписанию <> Неопределено
	                       И ПараметрыОбмена.СообщенияКПодписанию.Количество())
	                       Или (ПараметрыОбмена.КОбновлениюКлючейСессии <> Неопределено
	                       И ПараметрыОбмена.КОбновлениюКлючейСессии.Количество());
	
	Если ТребуетсяОжидание И Не ТребуетсяПодписание Тогда
		
		Если ДатаСледующейИтерации <> Неопределено Тогда
			ВремяОжидания = Окр(ДатаСледующейИтерации - ТекущаяДатаСеанса(), 0, РежимОкругления.Окр15как20);
		Иначе
			ВремяОжидания = 0;
		КонецЕсли;
		
		Если ПараметрыОбмена.ОжидатьНаСервере Тогда
			ИнтеграцияИС.Ожидать(ВремяОжидания, ПараметрыОбмена);
			Возврат ПродолжитьВыполнениеОбменаУниверсально(
				Неопределено,
				ПараметрыОбмена);
		ИначеЕсли Не ПараметрыОбмена.ОжидатьНаКлиенте Тогда
			Возврат ПродолжитьВыполнениеОбменаУниверсально(
				Неопределено,
				ПараметрыОбмена);
		КонецЕсли;
		
	КонецЕсли;
	
	Если (ТребуетсяОжидание Или ТребуетсяПодписание)
		И ПараметрыОбмена.АдресВоВременномХранилище <> Неопределено Тогда
		
		ДоступныеСертификаты = Неопределено;
		Если ТребуетсяПодписание Тогда
			
			ПроверитьКлючиСессии(
				ПараметрыОбмена.СообщенияКПодписанию,
				СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
			
			ДоступныеСертификаты(ПараметрыОбмена.СообщенияКПодписанию,    ДоступныеСертификаты);
			ДоступныеСертификаты(ПараметрыОбмена.КОбновлениюКлючейСессии, ДоступныеСертификаты);
			
		КонецЕсли;
		
		ВозвращаемоеЗначение.ДоступныеСертификаты           = ДоступныеСертификаты;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = ПараметрыОбмена.КОбновлениюКлючейСессии;
		ВозвращаемоеЗначение.ТребуетсяПодписание            = ПараметрыОбмена.СообщенияКПодписанию;
		
		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
		ПараметрыОбмена.ФоновоеЗадание          = Неопределено;
		ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено;
		ПараметрыОбмена.СообщенияКПодписанию    = Неопределено;
		
		ВозвращаемоеЗначение.Ожидать                   = ИнтеграцияИС.ВремяОжидания(ВремяОжидания);
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		
		Если ЗначениеЗаполнено(ПараметрыОбмена.АдресВоВременномХранилище) Тогда
			УдалитьИзВременногоХранилища(ПараметрыОбмена.АдресВоВременномХранилище);
		КонецЕсли;
		
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
		
	КонецЕсли;
	
	ЗаписатьЛогЗапросовВоВременноеХранилищеВозвращаемогоЗначения(ПараметрыОбмена, ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПродолжитьВыполнениеОбменаУниверсально(ПодписанныеСообщенияПоОрганизациям, ПараметрыОбмена) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
	ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресДанныхЛогаЗапроса",         Неопределено);
	ВозвращаемоеЗначение.Вставить(
		"ИзвлекатьДанныеЛогаЗапросов",
		ИнтеграцияИСКлиентСерверПовтИсп.ЭтоФоновоеЗаданиеНаСервере());
	
	ПараметрыОбмена.КОпределениюВидаУпаковки = Неопределено;

	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ВыполнитьИтерацию = Истина;
	ВремяОжидания     = Неопределено;
	Пока ВыполнитьИтерацию Цикл
		
		ДатаСледующейИтерации = ОбработатьОчередьСообщений(ПараметрыОбмена);
		
		ЕстьОшибки = Ложь;
		Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
			Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ТребуетсяОжидание = ДатаСледующейИтерации <> Неопределено
		               Или (Не ЕстьОшибки И ПараметрыОбмена.ОчередьСообщений.Количество() > 0);
		
		ТребуетсяПодписание = (ПараметрыОбмена.СообщенияКПодписанию <> Неопределено
		                   И ПараметрыОбмена.СообщенияКПодписанию.Количество())
		                   Или (ПараметрыОбмена.КОбновлениюКлючейСессии <> Неопределено
		                   И ПараметрыОбмена.КОбновлениюКлючейСессии.Количество());
		
		ТребуетсяОпределениеВидаУпаковки = ПараметрыОбмена.КОпределениюВидаУпаковки <> Неопределено;

		ДоступныеСертификаты          = Неопределено;
		АдресКОпределениюВидаУпаковки = "";

		Если ТребуетсяОпределениеВидаУпаковки Тогда

			СообщенияКОпределениюВидаУпаковок = СообщенияКОпределениюВидаУпаковок(ПараметрыОбмена);

			ПроверитьКлючиСессии(
				СообщенияКОпределениюВидаУпаковок,
				Неопределено, ПараметрыОбмена);

			ДоступныеСертификаты(СообщенияКОпределениюВидаУпаковок, ДоступныеСертификаты);

			АдресКОпределениюВидаУпаковки = ШтрихкодированиеИСМПСлужебный.ДанныеКОпределениюВидаУпаковки(ПараметрыОбмена);

			Если Не ЗначениеЗаполнено(АдресКОпределениюВидаУпаковки) Тогда
				ТребуетсяОпределениеВидаУпаковки = Ложь;
				ПараметрыОбмена.КОпределениюВидаУпаковки = Неопределено;
			КонецЕсли;

		КонецЕсли;

		Если ТребуетсяОжидание И Не ТребуетсяПодписание И Не ТребуетсяОпределениеВидаУпаковки Тогда
			
			Если ДатаСледующейИтерации <> Неопределено Тогда
				ВремяОжидания = Окр(ДатаСледующейИтерации - ТекущаяДатаСеанса(), 0, РежимОкругления.Окр15как20);
			Иначе
				ВремяОжидания = 0;
			КонецЕсли;
			
			Если ПараметрыОбмена.ОжидатьНаСервере Тогда
				ИнтеграцияИС.Ожидать(ВремяОжидания, ПараметрыОбмена);
			ИначеЕсли ПараметрыОбмена.ОжидатьНаКлиенте И ВремяОжидания <> 0 Тогда
				ВыполнитьИтерацию = Ложь;
			КонецЕсли;
			
		Иначе
			
			ВыполнитьИтерацию = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если (ТребуетсяОжидание Или ТребуетсяПодписание Или ТребуетсяОпределениеВидаУпаковки)
		И ПараметрыОбмена.АдресВоВременномХранилище <> Неопределено Тогда

		Если ТребуетсяПодписание Тогда
			
			ПроверитьКлючиСессии(
				ПараметрыОбмена.СообщенияКПодписанию,
				Неопределено, ПараметрыОбмена);
			
			ДоступныеСертификаты(ПараметрыОбмена.КОбновлениюКлючейСессии, ДоступныеСертификаты);
			ДоступныеСертификаты(ПараметрыОбмена.СообщенияКПодписанию,    ДоступныеСертификаты);
			
		КонецЕсли;
		
		ВозвращаемоеЗначение.ДоступныеСертификаты           = ДоступныеСертификаты;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = ПараметрыОбмена.КОбновлениюКлючейСессии;
		ВозвращаемоеЗначение.ТребуетсяПодписание            = ПараметрыОбмена.СообщенияКПодписанию;
		ВозвращаемоеЗначение.КОпределениюВидаУпаковки       = АдресКОпределениюВидаУпаковки;

		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
		ПараметрыОбмена.ФоновоеЗадание          = Неопределено;
		ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено;
		ПараметрыОбмена.СообщенияКПодписанию    = Неопределено;
		
		Для Каждого НастройкаОбменаСУЗ Из ПараметрыОбмена.НастройкиОбменаСУЗ.ОбменНаСервере Цикл
			Для Каждого НастройкаПоОрганизации Из НастройкаОбменаСУЗ.Значение Цикл
				НастройкаПоОрганизации.ФоновоеЗадание = Неопределено;
			КонецЦикла;
		КонецЦикла;
		
		ВозвращаемоеЗначение.Ожидать                   = ИнтеграцияИС.ВремяОжидания(ВремяОжидания);
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		
		Если ЗначениеЗаполнено(ПараметрыОбмена.АдресВоВременномХранилище) Тогда
			УдалитьИзВременногоХранилища(ПараметрыОбмена.АдресВоВременномХранилище);
		КонецЕсли;
		
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
		
	КонецЕсли;
	
	ЗаписатьЛогЗапросовВоВременноеХранилищеВозвращаемогоЗначения(ПараметрыОбмена, ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьОбменУниверсально(ПараметрыОбмена) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
	ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
	ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресДанныхЛогаЗапроса",         Неопределено);
	ВозвращаемоеЗначение.Вставить(
		"ИзвлекатьДанныеЛогаЗапросов",
		ИнтеграцияИСКлиентСерверПовтИсп.ЭтоФоновоеЗаданиеНаСервере());
	
	ДатаСледующейИтерации = ОбработатьОчередьСообщений(ПараметрыОбмена);
	
	ЕстьОшибки = Ложь;
	Если ПараметрыОбмена.УникальныйИдентификатор <> Неопределено Тогда
		Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
			Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТребуетсяОжидание = ДатаСледующейИтерации <> Неопределено
	               Или (Не ЕстьОшибки И ПараметрыОбмена.ОчередьСообщений.Количество() > 0);
	
	ТребуетсяПодписание = (ПараметрыОбмена.СообщенияКПодписанию <> Неопределено
	                       И ПараметрыОбмена.СообщенияКПодписанию.Количество())
	                       Или (ПараметрыОбмена.КОбновлениюКлючейСессии <> Неопределено
	                       И ПараметрыОбмена.КОбновлениюКлючейСессии.Количество());
	
	Если ТребуетсяОжидание И Не ТребуетсяПодписание Тогда
		
		Если ДатаСледующейИтерации <> Неопределено Тогда
			ВремяОжидания = Окр(ДатаСледующейИтерации - ТекущаяДатаСеанса(), 0, РежимОкругления.Окр15как20);
		Иначе
			ВремяОжидания = 0;
		КонецЕсли;
		
		Если ПараметрыОбмена.ОжидатьНаСервере Тогда
			ИнтеграцияИС.Ожидать(ВремяОжидания, ПараметрыОбмена);
			Возврат ПродолжитьВыполнениеОбменаУниверсально(Неопределено, ПараметрыОбмена);
		ИначеЕсли Не ПараметрыОбмена.ОжидатьНаКлиенте Тогда
			Возврат ПродолжитьВыполнениеОбменаУниверсально(Неопределено, ПараметрыОбмена);
		КонецЕсли;
		
	КонецЕсли;
	
	Если (ТребуетсяОжидание Или ТребуетсяПодписание)
		И ПараметрыОбмена.АдресВоВременномХранилище <> Неопределено Тогда
		
		ДоступныеСертификаты = Неопределено;
		Если ТребуетсяПодписание Тогда
			
			ПроверитьКлючиСессии(
				ПараметрыОбмена.СообщенияКПодписанию,
				Неопределено, ПараметрыОбмена);
			
			ДоступныеСертификаты(ПараметрыОбмена.КОбновлениюКлючейСессии, ДоступныеСертификаты);
			ДоступныеСертификаты(ПараметрыОбмена.СообщенияКПодписанию,    ДоступныеСертификаты);
			
		КонецЕсли;
		
		ВозвращаемоеЗначение.ДоступныеСертификаты           = ДоступныеСертификаты;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = ПараметрыОбмена.КОбновлениюКлючейСессии;
		ВозвращаемоеЗначение.ТребуетсяПодписание            = ПараметрыОбмена.СообщенияКПодписанию;
		
		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
		ПараметрыОбмена.ФоновоеЗадание          = Неопределено;
		ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено;
		ПараметрыОбмена.СообщенияКПодписанию    = Неопределено;
		
		Для Каждого НастройкаОбменаСУЗ Из ПараметрыОбмена.НастройкиОбменаСУЗ.ОбменНаСервере Цикл
			Для Каждого НастройкаПоОрганизации Из НастройкаОбменаСУЗ.Значение Цикл
				НастройкаПоОрганизации.ФоновоеЗадание = Неопределено;
			КонецЦикла;
		КонецЦикла;
		
		ВозвращаемоеЗначение.Ожидать                   = ИнтеграцияИС.ВремяОжидания(ВремяОжидания);
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		
		Если ЗначениеЗаполнено(ПараметрыОбмена.АдресВоВременномХранилище) Тогда
			УдалитьИзВременногоХранилища(ПараметрыОбмена.АдресВоВременномХранилище);
		КонецЕсли;
		
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
		
	КонецЕсли;
	
	ЗаписатьЛогЗапросовВоВременноеХранилищеВозвращаемогоЗначения(ПараметрыОбмена, ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВремяОжидания(НомерИтерации) Экспорт
	
	Если НомерИтерации <= 1 Тогда
		ВремяОжидания = 5;
	ИначеЕсли НомерИтерации < 15 Тогда
		ВремяОжидания = 5 * Pow(1.4, НомерИтерации - 1);
	Иначе
		ВремяОжидания = 120;
	КонецЕсли;
	
	Возврат ВремяОжидания;
	
КонецФункции

Функция ВремяОжиданияОбработкиКвитанции() Экспорт
	
	// Ожидать квитанция в течение суток.
	ВремяОжидания = 60*60*24;
	
	Возврат ВремяОжидания;
	
КонецФункции

// Формирует пустую структуру сообщения XML
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * ТекстОшибки                 - Строка - Текст ошибки.
//   * Ошибки                      - Соответствие - Описание ошибок.
//   * Описание                    - Строка - Описание для отображения в форме подписания.
//   * ТекстСообщенияJSON          - Строка - Текст сообщения JSON.
//   * ТипЗапроса                  - ПеречислениеСсылка.ТипыЗапросовИС - Тип сообщения.
//   * Организация                 - ОпределяемыйТип.Организация - Организация.
//   * Операция                    - ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции.
//   * Документ                    - ДокументСсылка - Документ.
//   * Версия                      - Строка - Версия сообщения.
//   * СообщениеОснование          - СправочникСсылка.ИСМППрисоединенныеФайлы - сообщение основание.
//   * ДанныеДляПолученияДокумента - Структура - Данные для получения документа.
//   * ДокументОснование           - ДокументСсылка - Документ основание.
Функция СтруктураСообщенияJSON() Экспорт
	
	СообщениеJSON = Новый Структура;
	
	СообщениеJSON.Вставить("ТекстОшибки", "");
	СообщениеJSON.Вставить("Ошибки", Новый Соответствие);
	СообщениеJSON.Вставить("ИдентификаторЗаявки");

	// Для отображения в форме подписания
	СообщениеJSON.Вставить("Описание", "");
	// Для управления очередностью
	СообщениеJSON.Вставить("Идентификатор");
	СообщениеJSON.Вставить("ЗагружатьДо");
	СообщениеJSON.Вставить("ЗагружатьПосле");
	
	// Для использования в механизмах электронной подписи
	СообщениеJSON.Вставить("ТекстСообщенияJSON");
	СообщениеJSON.Вставить("ТребуетсяПодписание");
	СообщениеJSON.Вставить("ТипСообщения");
	СообщениеJSON.Вставить("Версия", 0);
	
	// Для сохранения в Протокол обмена
	СообщениеJSON.Вставить("ВерсияГосИС");
	СообщениеJSON.Вставить("ВидПродукции");
	СообщениеJSON.Вставить("Операция");
	СообщениеJSON.Вставить("Назначение");
	СообщениеJSON.Вставить("ФорматОбмена");
	СообщениеJSON.Вставить("СтанцияУправленияЗаказами");
	СообщениеJSON.Вставить("ПроизводственныйОбъект");
	
	// Используется при запросах квитанций
	СообщениеJSON.Вставить("СообщениеОснование");
	
	// Используется при получении кодов маркировки из СУЗ
	СообщениеJSON.Вставить("ПараметрыЗапроса");
	СообщениеJSON.Вставить("ПараметрыПодключенияКСУЗ");
	
	// Для обновления в формах
	СообщениеJSON.Вставить("Организация");
	СообщениеJSON.Вставить("Документ");
	СообщениеJSON.Вставить("ДокументОснование");
	
	Возврат СообщениеJSON;
	
КонецФункции

// Добавить запись в протокол обмена.
//
// Параметры:
//  ТекстСообщенияJSON - Строка - Текст сообщения XML.
//  Реквизиты - Структура - Значения реквизитов сообщения.
//  ПроверятьХешБезСсылки - Булево - Признак проверки хеша без ссылки.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовоеСообщение - Булево - Это новое сообщение.
//   * Ссылка - СправочникСсылка.ИСМППрисоединенныеФайлы - Ссылка на присоединенный файл.
//
Функция ДобавитьЗаписьВПротоколОбмена(ТекстСообщенияJSON, Реквизиты, ПроверятьХешБезСсылки = Ложь) Экспорт
	
	Реквизиты.Вставить("ВладелецФайлов", Реквизиты.Документ);
	Возврат ИнтеграцияИС.ДобавитьЗаписьВПротоколОбмена(
		Метаданные.Справочники.ИСМППрисоединенныеФайлы,
		ТекстСообщенияJSON,
		Реквизиты,
		ПроверятьХешБезСсылки);
	
КонецФункции

Функция ОпределитьСтанциюУправленияЗаказами(СообщенияJSON, СообщениеJSON, Шапка, ДополнительныеПараметры) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Успешно",                   Истина);
	ВозвращаемоеЗначение.Вставить("СтанцияУправленияЗаказами", Неопределено);
	ВозвращаемоеЗначение.Вставить("НастройкаОбмена",           Неопределено);
	
	РезультатПолученияНастройки = НастройкаОбменаСУЗ(
		ДополнительныеПараметры.ПараметрыОбмена,
		НоваяСтруктураПоискаНастроекОбменаСУЗ(Шапка));
	
	Если Не РезультатПолученияНастройки.Успешно Тогда
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			РезультатПолученияНастройки.ТекстОшибки);
		СообщенияJSON.Добавить(СообщениеJSON);
		ВозвращаемоеЗначение.Успешно = Ложь;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ВозвращаемоеЗначение.НастройкаОбмена           = РезультатПолученияНастройки.НастройкаОбмена;
	ВозвращаемоеЗначение.СтанцияУправленияЗаказами = РезультатПолученияНастройки.НастройкаОбмена.СтанцияУправленияЗаказами;
	
	Если ВозвращаемоеЗначение.СтанцияУправленияЗаказами = Неопределено Тогда
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			СтрШаблон(НСтр("ru = 'Не удалось определить активный СУЗ для организации %1.'"), Шапка.Организация));
		СообщенияJSON.Добавить(СообщениеJSON);
		ВозвращаемоеЗначение.Успешно = Ложь;
	ИначеЕсли РезультатПолученияНастройки.НастройкаОбмена.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V1 Тогда
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			СтрШаблон(НСтр("ru = 'Формат обмена с СУЗ версии v1 не поддерживается для вида продукции: %1'") , Шапка.ВидПродукции));
		СообщенияJSON.Добавить(СообщениеJSON);
		ВозвращаемоеЗначение.Успешно = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОпределитьСтанциюУправленияЗаказамиУпрощенно(СообщенияJSON, Операция, Шапка, ДополнительныеПараметры) Экспорт

	СообщениеJSON = СтруктураСообщенияJSON();

	СообщениеJSON.Организация       = Шапка.Организация;
	СообщениеJSON.Документ          = Шапка.Документ;
	СообщениеJSON.ДокументОснование = Шапка.ДокументОснование;

	СообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(
		Операция, Шапка.Документ, Шапка.ПоследнийНомерВерсии + 1);

	РезультатОпределенияСУЗ = ИнтеграцияИСМПСлужебный.ОпределитьСтанциюУправленияЗаказами(
		СообщенияJSON, СообщениеJSON, Шапка, ДополнительныеПараметры);

	Возврат РезультатОпределенияСУЗ;

КонецФункции

Функция НоваяСтруктураПоискаНастроекОбменаСУЗ(Основание = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Организация");
	ВозвращаемоеЗначение.Вставить("Документ");
	ВозвращаемоеЗначение.Вставить("Назначение");
	ВозвращаемоеЗначение.Вставить("СтанцияУправленияЗаказами");
	ВозвращаемоеЗначение.Вставить("ПроизводственныйОбъект");
	
	Если Основание <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Основание);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ДлительныеОперации

Процедура ПодготовитьКПередачеДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ПараметрыОбмена   = ПараметрыФоновогоЗадания.ПараметрыОбмена;
	ВходящиеДанные    = ПараметрыФоновогоЗадания.ВходящиеДанные;
	ПараметрыСеансаИС = ПараметрыФоновогоЗадания.ПараметрыСеансаИС;
	
	ПрочитатьПараметрыСеансаИС(ПараметрыСеансаИС);
	
	ВозвращаемоеЗначение = ПодготовитьКПередачеУниверсально(ВходящиеДанные, ПараметрыОбмена);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

Процедура ЗагрузитьВходящиеДокументыДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ПараметрыОбмена   = ПараметрыФоновогоЗадания.ПараметрыОбмена;
	ПараметрыЗагрузки = ПараметрыФоновогоЗадания.ПараметрыЗагрузки;
	ПараметрыСеансаИС = ПараметрыФоновогоЗадания.ПараметрыСеансаИС;
	
	ПрочитатьПараметрыСеансаИС(ПараметрыСеансаИС);
	
	ВозвращаемоеЗначение = ЗагрузитьВходящиеДокументыУниверсально(ПараметрыЗагрузки, ПараметрыОбмена);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

Процедура ВыполнитьОбменДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ПараметрыОбмена   = ПараметрыФоновогоЗадания.ПараметрыОбмена;
	ПараметрыСеансаИС = ПараметрыФоновогоЗадания.ПараметрыСеансаИС;
	
	ПрочитатьПараметрыСеансаИС(ПараметрыСеансаИС);
	
	ВозвращаемоеЗначение = ВыполнитьОбменУниверсально(ПараметрыОбмена);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеОбменаДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ПодписанныеСообщенияПоОрганизациям = ПараметрыФоновогоЗадания.ПодписанныеСообщенияПоОрганизациям;
	ПараметрыОбмена                    = ПараметрыФоновогоЗадания.ПараметрыОбмена;
	ПараметрыСеансаИС                  = ПараметрыФоновогоЗадания.ПараметрыСеансаИС;
	
	ПрочитатьПараметрыСеансаИС(ПараметрыСеансаИС);
	
	ВозвращаемоеЗначение = ПродолжитьВыполнениеОбменаУниверсально(ПодписанныеСообщенияПоОрганизациям, ПараметрыОбмена);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

// Длительная операция актуализации списка и времени отклика CDN-площадок
// 
// Параметры:
//  ПараметрыФоновогоЗадания - Структура - Параметры запуска фонового задания
//  АдресРезультата - Строка - адрес возврата результата
Процедура ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ПараметрыФоновогоЗадания.Свойство("ПараметрыЛогированияЗапросовИСМП") Тогда
		
		ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ВыполнятьЛогирование = Истина;
		
	КонецЕсли;
	
	Если ПараметрыФоновогоЗадания.Свойство("ОбновлятьБезПроверкиДатыОбновления") И ПараметрыФоновогоЗадания.ОбновлятьБезПроверкиДатыОбновления Тогда
		ТребуетсяОбновлениеCDNПлощадок = Истина;
	Иначе
		ТребуетсяОбновлениеCDNПлощадок = ИнтеграцияИСМП.ТребуетсяОбновлениеСпискаCDNПлощадок();
	КонецЕсли;
	
	Если Не ТребуетсяОбновлениеCDNПлощадок Тогда
		
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
		Возврат;
		
	КонецЕсли;
	
	РезультатОбновления = ИнтерфейсИСМП.АктуализацияСпискаCDNПлощадок(ПараметрыФоновогоЗадания.Организация);
	
	Если ВыполнятьЛогирование Тогда
		ЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(РезультатОбновления);
	КонецЕсли;
	
	Если РезультатОбновления.СписокПлощадок.Количество() Тогда
		
		РезультатЗаписи = ЗаписатьДанныеСостоянияCDNПлощадокВРегистр(РезультатОбновления.СписокПлощадок);
		
		Если РезультатЗаписи.Отказ Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатЗаписи.ТекстОшибки;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатОбновления.ТекстОшибки;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ЕстьОшибки                            = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
		ВозвращаемоеЗначение.ТекстОшибки                           = РезультатОбновления.ТекстОшибки;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

// Длительная операция обновления настроек при включении товарных групп разрешительного режима
// 
// Параметры:
//  ПараметрыФоновогоЗадания - Структура - Параметры запуска фонового задания
//  АдресРезультата - Строка - адрес возврата результата
Процедура ВыполнитьОбновлениеНастроекДляРазрешительногоРежимаДлительнаяОперация(ПараметрыФоновогоЗадания, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",  Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");
	
	Если ПараметрыФоновогоЗадания.Свойство("ПараметрыЛогированияЗапросовИСМП") Тогда
		
		ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
		ВыполнятьЛогирование = Истина;
		
	КонецЕсли;
	
	РезультатОбновления = Обработки.ПанельАдминистрированияИСМП.ВключитьПроверкуРозничнымМетодомДляОпределенныхТоварныхГрупп();
	
	Если ВыполнятьЛогирование Тогда
		ЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(РезультатОбновления);
	КонецЕсли;
	
	ВозвращаемоеЗначение.ЕстьОшибки  = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
	ВозвращаемоеЗначение.ТекстОшибки = РезультатОбновления.ТекстОшибки;
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

Процедура ПроверитьЗаполнениеШтрихкодовУпаковок(Объект, Отказ) Экспорт
	
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(Объект, Неопределено, Объект.ВидПродукции); 
	
	СписокУпаковок = Объект.ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки");
	
	ЭтоМаркировкаМолочнойПродукции = (ТипЗнч(Объект) = Тип("ДокументОбъект.МаркировкаТоваровИСМП")
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.УточнениеСведенийОКодахМаркировкиИСМП"))
		И ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(Объект.ВидПродукции);

	Если ЭтоМаркировкаМолочнойПродукции Тогда
		УпаковкиБезУточнения = Объект.ШтрихкодыУпаковок.НайтиСтроки(
			Новый Структура("СрокГодности,ИдентификаторПроисхожденияВЕТИС",
				Дата(1,1,1), ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("ИдентификаторПроисхожденияВЕТИС")));
		Если УпаковкиБезУточнения.Количество()<>СписокУпаковок.Количество() Тогда
			СписокУпаковок = Новый Массив;
			Для Каждого СтрокаТабличнойЧасти Из Объект.ШтрихкодыУпаковок Цикл
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СрокГодности)
						Или ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторПроисхожденияВЕТИС) Тогда
					СписокУпаковок.Добавить(СтрокаТабличнойЧасти.ШтрихкодУпаковки);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = ТаблицаТоварыСоответствуетСпискуУпаковокМаркируемойПродукции(Объект.Товары, СписокУпаковок, ПараметрыСканирования); 
	
	Если РезультатПроверки.ДанныеСоответствуют Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки = НСтр("ru = 'В строке %1 для номенклатурной позиции %2 должно быть указано %5 %3, а подобрано - %4'");
	ШаблонОшибкиЛишниеКоды = НСтр("ru = 'Для номенклатурной позиции %1 подобрано %3 %2, а соответствующая им строка табличной части ""Товары"" отсутствует'");
	Если ЭтоМаркировкаМолочнойПродукции Тогда
		ШаблонОшибки = НСтр("ru = 'Для номенклатурной позиции %1 подобрано %3 %2, а суммарно в табличной части ""Товары"" должно быть указано - %4'");
	КонецЕсли;
	
	Для Каждого Расхождение Из РезультатПроверки.СтрокиСРасхождением Цикл
		Если Расхождение.НомерСтроки = -1 Тогда
			ТекстОшибки = СтрШаблон(ШаблонОшибкиЛишниеКоды, Расхождение.Номенклатура, Расхождение.Указано, Расхождение.Представление);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект,"Товары",, Отказ);
		ИначеЕсли ЭтоМаркировкаМолочнойПродукции Тогда
			ТекстОшибки = СтрШаблон(ШаблонОшибки,
				Расхождение.Номенклатура, Расхождение.Указано, Расхождение.Представление, Расхождение.Необходимо);
			ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Расхождение.НомерСтроки, Расхождение.Поле);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект, ПутьКТабличнойЧасти,, Отказ);
		Иначе
			ТекстОшибки = СтрШаблон(ШаблонОшибки,
				Расхождение.НомерСтроки, Расхождение.Номенклатура, Расхождение.Необходимо, Расхождение.Указано, Расхождение.Представление);
			ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Расхождение.НомерСтроки, Расхождение.Поле);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект, ПутьКТабличнойЧасти,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область ОперацииОбменаДанными

// Сформировать описание операции для документа
//
// Параметры:
//  Описание - Строка - Описание операции
//  ДокументСсылка - ДокументСсылка - Документ
//  НомерВерсии - Число - Номер версии
//  ТекстПоКоличествуСообщений - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции.
//
Функция ОписаниеОперации(Описание, ДокументСсылка, НомерВерсии = Неопределено, ТекстПоКоличествуСообщений = Неопределено) Экспорт
	
	Если НомерВерсии = Неопределено И ДокументСсылка = Неопределено Тогда
		ТекстВозврата = Описание;
	ИначеЕсли НомерВерсии = Неопределено И ДокументСсылка <> Неопределено Тогда
		ТекстВозврата = СтрШаблон(НСтр("ru = '%1 по документу ""%2""'"), Описание, ДокументСсылка);
	ИначеЕсли НомерВерсии <> Неопределено И ДокументСсылка = Неопределено Тогда
		ТекстВозврата = СтрШаблон(НСтр("ru = '%1. Версия %2'"), Описание, НомерВерсии);
	Иначе
		ТекстВозврата = СтрШаблон(НСтр("ru = '%1 по документу ""%2"". Версия %3'"), Описание, ДокументСсылка, НомерВерсии);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстПоКоличествуСообщений) Тогда
		ТекстВозврата = ТекстВозврата + ". " + ТекстПоКоличествуСообщений;
	КонецЕсли;
	
	Возврат ТекстВозврата;

КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  ОперацияПередачиДанных - ПеречислениеСсылка.ВидыОперацийИСМП - Операция обмена с ЕГАИС
//  ДокументСсылка - ДокументСсылка - Документ ссылка
//  НомерВерсии - Число - Номер версии
//  ТекстПоКоличествуСообщений - Строка - Текст с количеством сообщений
// 
// Возвращаемое значение:
//  Строка - Описание операции
//
Функция ОписаниеОперацииПередачиДанных(ОперацияПередачиДанных, ДокументСсылка = Неопределено, НомерВерсии = Неопределено, ТекстПоКоличествуСообщений = Неопределено) Экспорт
	
	КатегорииОпераций = КатегорииОпераций();
	ОписаниеОперации = КатегорииОпераций.ПередачаДанных.Получить(ОперацияПередачиДанных);
	
	Возврат ОписаниеОперации(ОписаниеОперации, ДокументСсылка, НомерВерсии, ТекстПоКоличествуСообщений);
	
КонецФункции

// Формирует текст счетчика по формату N из M.
//
// Параметры:
// 	ТекущийНомерГруппы - Число - текущий номер в группе.
// 	КоличествоГрупп - Число - Всего элементов в группе.
// Возвращаемое значение:
// 	Строка - Сформированный текст счетчика.
Функция ТекстКоличествоИзГруппы(ТекущийНомерГруппы, КоличествоГрупп) Экспорт
	Если КоличествоГрупп > ТекущийНомерГруппы Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 из %2'"), ТекущийНомерГруппы, КоличествоГрупп);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

// Сформировать описание операции для документа
//
// Параметры:
//  ОперацияПередачиДанных - ПеречислениеСсылка.ВидыОперацийИСМП - Операция обмена с ЕГАИС
//  ДокументСсылка - ДокументСсылка - Документ ссылка
//  НомерВерсии - Число - Номер версии
// 
// Возвращаемое значение:
//  Строка - Описание операции
//
Функция ОписаниеОперацииПолученияДанных(ОперацияПередачиДанных) Экспорт
	
	КатегорииОпераций = КатегорииОпераций();
	ОписаниеОперации = КатегорииОпераций.ПолучениеДанных.Получить(ОперацияПередачиДанных);
	
	Возврат ОписаниеОперации(ОписаниеОперации, Неопределено, Неопределено);
	
КонецФункции

// Возвращает операции обмена с ИС МП, разбитые на категории
// 
// Возвращаемое значение:
//  Структура - со свойствами:
//    * ПередачаДанных - Соответствие - Операции передачи данных.
//    * ПолучениеДанных - Соответствие - Операции получения данных.
//
Функция КатегорииОпераций() Экспорт
	
	ПередачаДанных = Новый Соответствие;
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки,
		НСтр("ru = 'Оформление заказа на эмиссию кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки,
		НСтр("ru = 'Оформление GTIN для маркировки остатков продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиРасчетСтатуса,
		НСтр("ru = 'Расчет статуса заказа на эмиссию (Абстрактная операция)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо,
		НСтр("ru = 'Дозагрузки кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ,
		НСтр("ru = 'Закрытие заказа на эмиссию кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗакрытиеЗаказаНаЭмиссиюСУЗ,
		НСтр("ru = 'Закрытие заказа на эмиссию'"));


	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.Агрегация,
		НСтр("ru = 'Передача сведений об агрегации кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияСоздание,
		НСтр("ru = 'Передача сведений о формировании агрегата'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора,
		НСтр("ru = 'Передача сведений о формировании набора'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияИзменение,
		НСтр("ru = 'Передача сведений о переагрегации'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияУдаление,
		НСтр("ru = 'Передача сведений о расформировании агрегата'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияРасчетСтатуса,
		НСтр("ru = 'Передача сведений в СУЗ об агрегации кодов маркировки (Расчет статуса)'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АТК,
		НСтр("ru = 'Передача сведений об обработке кодов АТК'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АТКСоздание,
		НСтр("ru = 'Передача сведений о формировании АТК'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АТКИзменение,
		НСтр("ru = 'Передача сведений о трансформации АТК'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АТКУдаление,
		НСтр("ru = 'Передача сведений о расформировании АТК'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияИзменениеРасчетСтатуса,
		НСтр("ru = 'Передача сведений о переагрегации (абстрактная операция)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.АгрегацияПроверкаСтатусаОбработкиДокумента,
		НСтр("ru = 'Проверка статуса обработки документа агрегации'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборот,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной продукции собственного производства'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной импортной продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной импортной продукции (с ФТС)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной импортной продукции (мех, с ФТС)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной продукции, произведенной по договору'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика,
		НСтр("ru = 'Передача сведений о вводе в оборот маркированной продукции, произведенной по договору'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц,
		НСтр("ru = 'Передача сведений о вводе в оборот продукции, полученной от физических лиц'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков,
		НСтр("ru = 'Передача сведений о вводе в оборот остатков продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля,
		НСтр("ru = 'Передача сведений о вводе в оборот при трансграничной торговле'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВводВОборотРасчетСтатуса,
		НСтр("ru = 'Передача сведений о вводе в оборот (Расчет статуса)'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ИндивидуализацияКИЗ,
		НСтр("ru = 'Передача сведений об индивидуализации КИЗ'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ,
		НСтр("ru = 'Передача сведений о подтверждении поступления КИЗ'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗРасчетСтатуса,
		НСтр("ru = 'Передача сведений о подтверждении поступления КИЗ (расчет статуса)'"));

	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборота,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаКонфискацияТовара,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при конфискации товаров'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаУничтожениеТовара,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при уничтожении товаров'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЛиквидацияПредприятия,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при банкротстве или ликвидации организации'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаБезвозмезднаяПередача,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при безвозмездной передаче товара'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при внутреннем использовании продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаВозвратФизическомуЛицу,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при возврате товара физическому лицу'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаВПроцессеРеализацииПоДоговоруРассрочки,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции в процессе реализации продукции по договору рассрочки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаКредитныйДоговор,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при розничной продаже по кредитному договору'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаУтратаПовреждениеТовара,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при порче или учере товара'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРеализацияКонфискованныхТоваров,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при реализации конфискованной продукции'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРеализацияПоДоговоруРассрочки,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при реализации по договору рассрочки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при розничной продаже'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЭкспортВСтраныЕАЭС,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при экспорте в ЕАЭС'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЭкспортЗаПределыСтранЕАЭС,
		НСтр("ru = 'Передача сведений о выводе из оборота продукции при экспорте за пределы ЕАЭС'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа,
		НСтр("ru = 'Передача сведений о выводе из оборота при дистанционной торговле'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаПоОбразцам,
		НСтр("ru = 'Передача сведений о выводе из оборота при продаже по образцам'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаДистанционнаяПродажа,
		НСтр("ru = 'Передача сведений о выводе из оборота при дистанционной продаже'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаБрак,
		НСтр("ru = 'Передача сведений о выводе из оборота бракованного товара'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИстечениеСрокаГодности,
		НСтр("ru = 'Передача сведений о выводе из оборота товара по истечению срока годности'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЛабораторныеОбразцы,
		НСтр("ru = 'Передача сведений о выводе из оборота лабораторных образцов'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаОтзывСРынка,
		НСтр("ru = 'Передача сведений о выводе из оборота при отзыве с рынка'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРекламации,
		НСтр("ru = 'Передача сведений о выводе из оборота при рекламации'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаДругиеПричины,
		НСтр("ru = 'Передача сведений о выводе из оборота по другим причинам'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаТестированиеПродукта,
		НСтр("ru = 'Передача сведений о выводе из оборота при тестировании продукта'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаДругое,
		НСтр("ru = 'Передача сведений о выводе из оборота по другим причинам'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаПоСделкеСоставляющейГосударственнуюТайну,
		НСтр("ru = 'Передача сведений о выводе из оборота при продаже по сделкам, составляющим гос. тайну'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИспользованиеДляПроизводственныхЦелей,
		НСтр("ru = 'Передача сведений о выводе из оборота при использовании продукции для производственных целей'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаУтилизацияТовара,
		НСтр("ru = 'Передача сведений о выводе из оборота при утилизации товара'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаПоГосударственномуКонтракту,
		НСтр("ru = 'Передача сведений о выводе из оборота при продаже по государственному (муниципальному) контракту'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаФасовка,
		НСтр("ru = 'Передача сведений о выводе из оборота при фасовке'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаЧерезВендинговыйАппарат,
		НСтр("ru = 'Передача сведений о выводе из оборота при продаже через вендинговый аппарат'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРеализацияНезарегистрированномуУчастнику,
		НСтр("ru = 'Передача сведений о выводе из оборота при реализации незарегистрированному участнику'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПриОСУАннулирование,
		НСтр("ru = 'Передача сведений об отмене вывода из оборота'"));

	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборот,
		НСтр("ru = 'Передача сведений о возврате в оборот при дистанционной торговле'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриДистанционномСпособеПродажи,
		НСтр("ru = 'Передача сведений о возврате в оборот при дистанционной торговле'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриРозничнойРеализации,
		НСтр("ru = 'Передача сведений о возврате в оборот при розничной реализации'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотТовараВыведенногоДляСобственныхНужд,
		НСтр("ru = 'Передача сведений о возврате товара, выведенного из оборота для собственных нужд'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотТовараВыведенногоДляПроизводственныхЦелей,
		НСтр("ru = 'Передача сведений о возврате товара, выведенного из оборота для производственных целей'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотТовараПриобретавшегосяНеДляПродажи,
		НСтр("ru = 'Передача сведений о возврате товара, возвращенного покупателем, приобретавшим его в целях, не связанных с последующей реализацией'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриПродажеЧерезВендинговыйАппарат,
		НСтр("ru = 'Передача сведений о возврате в оборот при продаже через вендинговый аппарат'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииКодовМаркировки,
		НСтр("ru = 'Передача сведений в СУЗ об использовании кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПроизводственнуюЛинию,
		НСтр("ru = 'Передача сведений в СУЗ о передаче кодов маркировки на производственную линию'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПринтер,
		НСтр("ru = 'Передача сведений в СУЗ о передаче кодов маркировки на принтер'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПечатиКМ,
		НСтр("ru = 'Передача сведений в СУЗ о печати кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПотереРаспечатанныхКМ,
		НСтр("ru = 'Передача сведений в СУЗ о потере распечатанных кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ,
		НСтр("ru = 'Передача сведений в СУЗ о верификации нанесенных кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииРасчетСтатуса,
		НСтр("ru = 'Передача сведений в СУЗ об использовании кодов маркировки (Расчет статуса)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииПроверкаСтатусаКодовМаркировки,
		НСтр("ru = 'Передача сведений в СУЗ об использовании кодов маркировки (Проверка статуса кодов маркировки)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.КвитанцияДокумента,
		НСтр("ru = 'Передача сведений в СУЗ для запроса квитанции об обработке документа'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки,
		НСтр("ru = 'Передача сведений о списании эмитированных кодов маркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиПриПоступлении,
		НСтр("ru = 'Передача сведений о списании эмитированных кодов маркировки (при поступлении)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СписаниеВведенныхВОборотКодовМаркировки,
		НСтр("ru = 'Передача сведений о списании введенных в оборот кодов маркировки для последующей перемаркировки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента,
		НСтр("ru = 'Проверка статуса обработки документа списание'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиРасчетСтатуса,
		НСтр("ru = 'Передача сведений о списании эмитированных кодов маркировки (Абстрактная операция)'"));

	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.Перемаркировка,
		НСтр("ru = 'Передача сведений о перемаркировке продукции'"));
		
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаПродажа,
		НСтр("ru = 'Передача сведений об отгрузке товаров при продаже'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаАгент,
		НСтр("ru = 'Передача сведений об отгрузке товаров при передаче от агента к принципалу'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаБезвозмезднаяПередача,
		НСтр("ru = 'Передача сведений об отгрузке товаров при безвозмездной передаче'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаКомиссия,
		НСтр("ru = 'Передача сведений об отгрузке товаров при передаче от комитента комиссионеру'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаПриобретениеГосПредприятием,
		НСтр("ru = 'Передача сведений об отгрузке товаров при продаже по гос.контракту'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаДляСобственныхНуждПокупателя,
		НСтр("ru = 'Передача сведений об отгрузке товаров при продаже для собственных нужд покупателя'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ,
		НСтр("ru = 'Передача сведений об отгрузке товаров в ЕАЭС с признанием КИ'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ,
		НСтр("ru = 'Передача сведений об отгрузке товаров в ЕАЭС при объемно-сортовом учете'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулировать,
		НСтр("ru = 'Передача сведений об аннулировании отгрузки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулирование,
		НСтр("ru = 'Передача сведений об аннулировании отгрузки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.Приемка,
		НСтр("ru = 'Передача сведений о приемке товаров'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаПродажа,
		НСтр("ru = 'Передача сведений о приемке товаров при продаже'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаАгент,
		НСтр("ru = 'Передача сведений о приемке товаров при передаче от агента к принципалу'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаБезвозмезднаяПередача,
		НСтр("ru = 'Передача сведений о приемке товаров при безвозмездной передаче'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаКомиссия,
		НСтр("ru = 'Передача сведений о приемке товаров при передаче от комитента комиссионеру'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаПриобретениеГосПредприятием,
		НСтр("ru = 'Передача сведений о приемке товаров при продаже по гос.контракту'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаДляСобственныхНуждПокупателя,
		НСтр("ru = 'Передача сведений о приемке товаров при продаже для собственных нужд покупателя'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля,
		НСтр("ru = 'Передача сведений о приемке товаров при продаже (трансграничная торговля)'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ,
		НСтр("ru = 'Передача сведений о приемке товаров из ЕАЭС с признанием КИ'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ,
		НСтр("ru = 'Передача сведений о приемке товаров из ЕАЭС при объемно-сортовом учете'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаОтклонить,
		НСтр("ru = 'Передача сведений об отклонении приемки'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен,
		НСтр("ru = 'Передача сведений об отклонении приемки'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗапросИдентификатораСоединенияСУЗ,
		НСтр("ru = 'Запрос идентификатора соединения для подключения к СУЗ'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗапросМестОсуществленияДеятельности,
		НСтр("ru = 'Запрос мест осуществления деятельности'"));
		
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот,
		НСтр("ru = 'Передача сведений о кодах идентификации для ввода в оборот'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот,
		НСтр("ru = 'Передача сведений о разрешительной документации для ввода в оборот'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании,
		НСтр("ru = 'Передача сведений о перевзвешивании'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ,
		НСтр("ru = 'Передача корректировки сведений о кодах'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД,
		НСтр("ru = 'Передача корректировки сведений о сроках годности и ВСД'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодности,
		НСтр("ru = 'Передача корректировки сведений о сроках годности'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес,
		НСтр("ru = 'Передача корректировки сведений о фактическом весе'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозлива,
		НСтр("ru = 'Подключение кега к оборудованию для розлива'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозливаРасчетСтатуса,
		НСтр("ru = 'Подключение кега к оборудованию для розлива'"));
	
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетИСМПСведенияОбОтклонениях,
		НСтр("ru = 'Запрос сведений об отклонениях'"));
	ПередачаДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетИСМПСписокКИНаБалансе,
		НСтр("ru = 'Запрос списка кодов идентификации'"));
	
	ПолучениеДанных = Новый Соответствие;
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
		НСтр("ru = 'Получение результата обработки документа ИС МП'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиЗаказаНаЭмиссиюКодовМаркировки,
		НСтр("ru = 'Получение результата обработки Заказа на эмиссию кодов маркировки ИС МП'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗ,
		НСтр("ru = 'Получение кодов маркировки из СУЗ'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо,
		НСтр("ru = 'Получение кодов маркировки из СУЗ'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПовторноеПолучениеКодовМаркировкиИзСУЗ,
		НСтр("ru = 'Повторное получение кодов маркировки из СУЗ'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ПолучениеСтатусаПулаКодовМаркировкиИзСУЗ,
		НСтр("ru = 'Получение статуса пула кодов маркировки из СУЗ'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки,
		НСтр("ru = 'Оформление GTIN для маркировки остатков продукции'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ЗагрузкаВходящихДокументов,
		НСтр("ru = 'Загрузка входящих документов'"));
	ПолучениеДанных.Вставить(
		Перечисления.ВидыОперацийИСМП.ОтчетИСМППолучениеРезультатаВыгрузки,
		НСтр("ru = 'Получение результата выгрузки ГИС МТ'"));
	
	Категории = Новый Структура;
	Категории.Вставить("ПередачаДанных",  ПередачаДанных);
	Категории.Вставить("ПолучениеДанных", ПолучениеДанных);
	
	Возврат Категории;
	
КонецФункции

#КонецОбласти

#Область ОбработкаОшибок

// Формирует пустую структуру изменений данных
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//
Функция СтруктураИзменения() Экспорт
	
	СтруктураИзменения = Новый Структура;
	
	// Назначение сообщений: ИСМП, МОТП или СУЗ
	СтруктураИзменения.Вставить("Операция");
	СтруктураИзменения.Вставить("Назначение");
	СтруктураИзменения.Вставить("СтанцияУправленияЗаказами");
	
	// Источник
	СтруктураИзменения.Вставить("Организация");
	СтруктураИзменения.Вставить("Объект");
	СтруктураИзменения.Вставить("ДокументОснование");
	
	// Событие
	СтруктураИзменения.Вставить("ТекстОшибки",           "");
	СтруктураИзменения.Вставить("ПодготовленоКПередаче", Ложь);
	СтруктураИзменения.Вставить("Передано",              Ложь);
	СтруктураИзменения.Вставить("Принято",               Ложь);
	СтруктураИзменения.Вставить("ОбъектИзменен",         Ложь);
	СтруктураИзменения.Вставить("НовыйСтатус",           Неопределено);
	
	// Описание, протокол
	СтруктураИзменения.Вставить("Сообщение");
	СтруктураИзменения.Вставить("ТекстСообщения");
	СтруктураИзменения.Вставить("ПредставлениеПротоколаОбмена");
	
	Возврат СтруктураИзменения;
	
КонецФункции

// Выполняет запись ошибки в журнал регистрации, добавляя имя события ИС МП.
//
// Параметры:
//  ТекстОшибки      - Строка           - текст ошибки.
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных с ошибкой.
//  Данные           - Произвольный     - объект данных с ошибкой.
Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных = Неопределено, Данные = Неопределено) Экспорт
	
	ИнтеграцияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
		ТекстОшибки,
		НСтр("ru = 'ИС МП'", ОбщегоНазначения.КодОсновногоЯзыка()),
		ОбъектМетаданных,
		Данные);
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаОстатков

// Заполняет колонку GTIN в переданный таблице значениями, пригодными для маркировки остатков, полученными с помощью
// (См. ИнтерфейсИСМП.НайтиПродукциюПоИННПроизводителя)
//
// Параметры:
// 	ТаблицаНоменклатуры   - ДанныеФормыКоллекция                      - Таблица номенклатуры для заполнения колонки GTIN:
// 	 * ЦелевойПол         - ПеречислениеСсылка.ЦелевойПолИСМП         - Целевой пол.
// 	 * СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ - Способ ввода в оборот.
// 	 * КодТНВЭД           - Строка                                    - Код ТНВЭД будет взято первые два символа.
// 	 * GTIN               - Строка                                    - Поле GTIN, значение которого требуется заполнить,
// 	                                                                    если не заполнено.
// 	Организация  - ОпределяемыйТип.Организация - Оранизация-владелец.
// 	ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
// Возвращаемое значение:
//  Структура - Заполнить GTINМаркировки остатков:
// * ТребуетсяОбновлениеКлючаСессии - Булево - Обновление ключа сессии.
// * ТекстОшибки - Неопределено, Строка - Текст ошибки.
Функция ЗаполнитьGTINМаркировкиОстатков(ТаблицаНоменклатуры, Организация, ВидПродукции) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    Неопределено);
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	НомерСтраницы           = 0;
	ПовторятьИтерацию       = Истина;
	СоответствиеСтрокПоиска = Новый Соответствие;
	
	Для Каждого СтрокаТовары Из ТаблицаНоменклатуры Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска = СтрокаДляПоискаGTINМаркировкиОстатков(ВидПродукции, СтрокаТовары);
		
		МассивСтрокТоварыПоСоответствию  = СоответствиеСтрокПоиска[СтрокаПоиска];
		
		Если МассивСтрокТоварыПоСоответствию = Неопределено Тогда
			МассивСтрокТоварыПоСоответствию = Новый Массив;
			СоответствиеСтрокПоиска.Вставить(СтрокаПоиска, МассивСтрокТоварыПоСоответствию);
		КонецЕсли;
		
		МассивСтрокТоварыПоСоответствию.Добавить(СтрокаТовары);
		
	КонецЦикла;
	
	КешОписанияОстатков = Новый Соответствие();
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ВидПродукции",        ВидПродукции);
	ПараметрыЗаполнения.Вставить("Организация",         Организация);
	ПараметрыЗаполнения.Вставить("КешОписанияОстатков", КешОписанияОстатков);
	ПараметрыЗаполнения.Вставить("СтрокиПоиска",        СоответствиеСтрокПоиска);
	
	Если ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции) Тогда
		
		ДанныеКэшаОписанияОстатков = РегистрыСведений.КэшОписанияОстатковИСМП.ДанныеДляПоискаПриЗаполненииGTIN(ПараметрыЗаполнения);
		ЗаполнитьПоОписаниюОстатков(
			ПараметрыЗаполнения,
			ДанныеКэшаОписанияОстатков);
		
	КонецЕсли;
	
	Пока СоответствиеСтрокПоиска.Количество() И ПовторятьИтерацию Цикл
		
		РезультатЗапроса = ИнтерфейсИСМП.НайтиПродукциюПоИННПроизводителя(Неопределено, ВидПродукции, НомерСтраницы, Организация);
		НомерСтраницы    = НомерСтраницы + 1;
		
		Если РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии Тогда
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат ВозвращаемоеЗначение;
		ИначеЕсли РезультатЗапроса.ДанныеПродукцииПоШтрихкодуEAN = Неопределено Тогда
			ВозвращаемоеЗначение.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
			Прервать;
		ИначеЕсли РезультатЗапроса.ДанныеПродукцииПоШтрихкодуEAN.Количество() = 0 Тогда
			ПовторятьИтерацию = Ложь;
		КонецЕсли;
		
		ЗаполнитьПоОписаниюОстатков(
			ПараметрыЗаполнения,
			РезультатЗапроса.ДанныеПродукцииПоШтрихкодуEAN,
			Истина);
		
		Если СоответствиеСтрокПоиска.Количество() = 0 Тогда
			ПовторятьИтерацию = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрыСведений.КэшОписанияОстатковИСМП.СохранитьПредставлениеОписанияОстатков(КешОписанияОстатков);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Формирует строку для передачи описания остатков
// 
// Параметры:
// 	СтрокаТовары - СтрокаТабличнойЧасти - Строка докумемента Заказа на эмиссию СУЗ
// 	ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
// Возвращаемое значение:
// 	Структура - Описание:
// * release_method - Строка - Способ ввода в оборот;
// * name           - Строка - Наименование товара;
// * model          - Строка - Модель;
// * tnved_code_2   - Число  - Начало кода ТНВЭД.
// * product_gender - Строка - Целевой пол.
// * consumer_age   - Строка - Возрастная категория.
Функция ОбязательныеПоляОписанияОстатковПоСтрокеДокумента(СтрокаТовары, ВидПродукции) Экспорт
	
	СтрокаОписания = Новый Структура;
	ЗначениеТНВЭД  = ИнтеграцияИСКлиентСервер.КодТНВЭДДляПередачиВИСМП(СтрокаТовары.КодТНВЭД, ВидПродукции);
	
	Если ВидПродукции = Перечисления.ВидыПродукцииИС.Духи Тогда
		СтрокаОписания.Вставить("tnved_code", ЗначениеТНВЭД);
	ИначеЕсли ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции) Тогда
		СтрокаОписания.Вставить("tnved_code_4", ЗначениеТНВЭД);
	Иначе
		СтрокаОписания.Вставить("tnved_code_2", ЗначениеТНВЭД);
	КонецЕсли;
	
	ПараметрыОписанияОстатков = ИнтеграцияИСКлиентСервер.ИспользованиеПараметровОписанияОстатковПоВидуПродукции(
		ВидПродукции, ЗначениеТНВЭД);
	
	Если ПараметрыОписанияОстатков.ИспользоватьЦелевойПол Тогда
		СтрокаОписания.Вставить("product_gender", ИнтерфейсСУЗСлужебный.ЦелевойПол(СтрокаТовары.ЦелевойПол));
	КонецЕсли;
	
	Если ПараметрыОписанияОстатков.ИспользоватьВозрастнуюКатегорию Тогда
		СтрокаОписания.Вставить("consumer_age",
			ИнтерфейсСУЗСлужебный.ВозрастнаяКатегория(СтрокаТовары.ВозрастнаяКатегория));
	КонецЕсли;
	
	Если ПараметрыОписанияОстатков.ИспользоватьМодель Тогда
		СтрокаОписания.Вставить("model", СокрЛП(СтрокаТовары.Модель));
	КонецЕсли;
	
	Если ПараметрыОписанияОстатков.ИспользоватьТоварныйЗнак Тогда
		ТоварныйЗнак = СокрЛП(СтрокаТовары.ТоварныйЗнак);
		Если Не ЗначениеЗаполнено(ТоварныйЗнак)
			И (ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции)
			Или ВидПродукции = Перечисления.ВидыПродукцииИС.Духи) Тогда
			ТоварныйЗнак = "Отсутствует";
		КонецЕсли;
		СтрокаОписания.Вставить("brand", ТоварныйЗнак);
	КонецЕсли;
	
	Если ПараметрыОписанияОстатков.ИспользоватьНаименование Тогда
		Если ЗначениеЗаполнено(СтрокаТовары.Наименование) Тогда
			СтрокаОписания.Вставить(
				"name", СтрокаТовары.Наименование);
		Иначе
			СтрокаОписания.Вставить(
				"name", ИнтеграцияИС.ПредставлениеНоменклатуры(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика));
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыОписанияОстатков.ИспользоватьСпособВводаВОборот Тогда
		СтрокаОписания.Вставить("release_method",
			ИнтерфейсСУЗСлужебный.СпособВыпускаВОборот(СтрокаТовары.СпособВводаВОборот, "ОСТАТКИ"));
	КонецЕсли;
	
	Возврат СтрокаОписания;
	
КонецФункции

Функция НормализованноеСтроковоеЗначение(Знач ВходноеЗначение) Экспорт
	
	ВходноеЗначение = НРег(СокрЛП(ВходноеЗначение));
	
	Пока СтрНайти(ВходноеЗначение, "  ") > 0 Цикл
		ВходноеЗначение = СтрЗаменить(ВходноеЗначение, "  ", " ");
	КонецЦикла;
	
	Возврат ВходноеЗначение;
	
КонецФункции

#КонецОбласти

#Область XDTO

// Устанавливает значение свойства объекта XDTO.
//
Процедура ЗаполнитьСвойствоXDTO(ОбъектXDTO, ИмяСвойства, ЗначениеСвойства = Неопределено, КешОшибок = Неопределено, Глубина = Неопределено) Экспорт
	
	//На текущий момент пользовательского макета расшифровки ошибок нет
	ДанныеДляРасшифровкиОшибок = ИнтеграцияИС.ДанныеДляРасшифровкиОшибок(,Глубина);
	ДанныеДляРасшифровкиОшибок.Таблица = ИнтеграцияИСМППовтИсп.ТаблицаПолейДанныйДляРасшифровкиОшибок();
	
	ИнтеграцияИС.ЗаполнитьСвойствоXDTO(ОбъектXDTO, ИмяСвойства, ЗначениеСвойства, КешОшибок, ДанныеДляРасшифровкиОшибок);
	
КонецПроцедуры

#КонецОбласти

Функция ПодготовитьОчередьЗагрузкиКодовМаркировкиПоЗаказуНаЭмиссию(ПараметрыЗапроса, ЭлементОчереди, ЗагружатьДо, ПараметрыОбмена, НастройкаОбменаСУЗ) Экспорт
	
	Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗ;
	
	СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
	СообщениеJSON.Идентификатор     = Строка(Новый УникальныйИдентификатор);
	СообщениеJSON.ЗагружатьДо       = ЗагружатьДо;
	
	СообщениеJSON.Организация       = ЭлементОчереди.Организация;
	СообщениеJSON.Документ          = ЭлементОчереди.Документ;
	СообщениеJSON.ДокументОснование = ЭлементОчереди.ДокументОснование;
	
	СообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПолученияДанных(
		Операция);
	
	СообщениеJSON.ТекстСообщенияJSON  = Неопределено;
	СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	СообщениеJSON.Версия              = Неопределено;
	СообщениеJSON.ТребуетсяПодписание = Ложь;
	СообщениеJSON.СообщениеОснование  = ЭлементОчереди.Сообщение;
	СообщениеJSON.ПараметрыЗапроса    = ПараметрыЗапроса;
	
	СообщениеJSON.ВидПродукции              = ЭлементОчереди.ВидПродукции;
	СообщениеJSON.Операция                  = Операция;
	СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами;
	СообщениеJSON.ФорматОбмена              = НастройкаОбменаСУЗ.ФорматОбмена;
	СообщениеJSON.СтанцияУправленияЗаказами = НастройкаОбменаСУЗ.СтанцияУправленияЗаказами;
	
	СообщенияJSON = Новый Массив;
	СообщенияJSON.Добавить(СообщениеJSON);
	
	КоличествоДоВыполненияОперации = ПараметрыОбмена.ОчередьСообщений.Количество();
	ПодготовитьСообщенияКПередаче(
		СообщенияJSON, ПараметрыОбмена,
		СтроковоеПредставлениеПустогоУникальногоИдентификатора());
	КоличествоПослеВыполненияОперации = ПараметрыОбмена.ОчередьСообщений.Количество();
	
	Индекс = КоличествоДоВыполненияОперации;
	Если Индекс < КоличествоПослеВыполненияОперации Тогда
		Возврат ПараметрыОбмена.ОчередьСообщений[Индекс];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПодготовитьКПередачеСообщениеНаЗакрытиеПодзаказаНаЭмиссиюКодовМаркировки(ЭлементОчередиОснование, Знач ЗагружатьДо, ПараметрыЗапроса, ПараметрыОбмена, НастройкаОбменаСУЗ) Экспорт
	
	ЗагружатьДо = Строка(ЗагружатьДо);
	Операция    = Перечисления.ВидыОперацийИСМП.ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ;
	
	СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
	СообщениеJSON.Идентификатор = Строка(Новый УникальныйИдентификатор);
	СообщениеJSON.ЗагружатьДо   = ЗагружатьДо;
	
	СообщениеJSON.Организация       = ЭлементОчередиОснование.Организация;
	СообщениеJSON.Документ          = ЭлементОчередиОснование.Документ;
	СообщениеJSON.ДокументОснование = ЭлементОчередиОснование.ДокументОснование;
	
	СообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПолученияДанных(
		Операция);
	
	СообщениеJSON.ТекстСообщенияJSON  = Неопределено;
	СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	СообщениеJSON.Версия              = Неопределено;
	СообщениеJSON.ТребуетсяПодписание = Ложь;
	СообщениеJSON.СообщениеОснование  = ЭлементОчередиОснование.Сообщение;
	СообщениеJSON.ПараметрыЗапроса    = ПараметрыЗапроса;
	
	СообщениеJSON.ВидПродукции              = ЭлементОчередиОснование.ВидПродукции;
	СообщениеJSON.Операция                  = Операция;
	СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами;
	СообщениеJSON.ФорматОбмена              = НастройкаОбменаСУЗ.ФорматОбмена;
	СообщениеJSON.СтанцияУправленияЗаказами = НастройкаОбменаСУЗ.СтанцияУправленияЗаказами;
	
	СообщенияJSON = Новый Массив;
	СообщенияJSON.Добавить(СообщениеJSON);
	
	ДанныеПовторногоПолучения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ДанныеПовторногоПолучения");
	
	Если ДанныеПовторногоПолучения <> Неопределено Тогда
		
		ЗагружатьДо = СообщениеJSON.Идентификатор;
		Операция    = Перечисления.ВидыОперацийИСМП.ПовторноеПолучениеКодовМаркировкиИзСУЗ;
		
		СообщениеJSON = СтруктураСообщенияJSON();
		СообщениеJSON.Идентификатор = Строка(Новый УникальныйИдентификатор);
		СообщениеJSON.ЗагружатьДо   = ЗагружатьДо;
		
		СообщениеJSON.Организация       = ЭлементОчередиОснование.Организация;
		СообщениеJSON.Документ          = ЭлементОчередиОснование.Документ;
		СообщениеJSON.ДокументОснование = ЭлементОчередиОснование.ДокументОснование;
		
		СообщениеJSON.Описание = ОписаниеОперацииПолученияДанных(
			Операция);
		
		СообщениеJSON.ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
		СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
		СообщениеJSON.ТребуетсяПодписание = Ложь;
		СообщениеJSON.СообщениеОснование  = ЭлементОчередиОснование.Сообщение;
		
		СообщениеJSON.ПараметрыЗапроса          = ПараметрыЗапроса;
		
		СообщениеJSON.ВидПродукции              = ЭлементОчередиОснование.ВидПродукции;
		СообщениеJSON.Операция                  = Операция;
		СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами;
		СообщениеJSON.ФорматОбмена              = НастройкаОбменаСУЗ.ФорматОбмена;
		СообщениеJSON.СтанцияУправленияЗаказами = НастройкаОбменаСУЗ.СтанцияУправленияЗаказами;
		
		СообщенияJSON.Вставить(0, СообщениеJSON);
		
	КонецЕсли;
	
	КоличествоДоВыполненияОперации = ПараметрыОбмена.ОчередьСообщений.Количество();
	ПодготовитьСообщенияКПередаче(
		СообщенияJSON, ПараметрыОбмена,
		СтроковоеПредставлениеПустогоУникальногоИдентификатора());
	КоличествоПослеВыполненияОперации = ПараметрыОбмена.ОчередьСообщений.Количество();
	
	Индекс = КоличествоДоВыполненияОперации;
	Если Индекс < КоличествоПослеВыполненияОперации Тогда
		Возврат ПараметрыОбмена.ОчередьСообщений[Индекс];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗапроситьУстановитьКлючСессии(ТребуетсяЗапроситьУстановитьКлючСессии, ПодписанныеСообщенияПоОрганизациям,
	ПараметрыОбмена) Экспорт
	
	Если ТребуетсяЗапроситьУстановитьКлючСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкиУстановкиКлючаСессииПоОрганизациям = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ТребуетсяЗапроситьУстановитьКлючСессии Цикл
		
		Организация                   = КлючИЗначение.Ключ;
		ДанныеДляУстановкиКлючаСессии = КлючИЗначение.Значение;
		
		МассивОшибок = Новый Массив;
		
		Для Каждого ЭлементДанных Из ДанныеДляУстановкиКлючаСессии Цикл
			
			РезультатЗапросаИУстановкиКлючаСессии = ИнтерфейсАвторизацииИСМПСлужебный.ЗапроситьУстановитьКлючСессии(
				ЭлементДанных.ПараметрыЗапроса,
				ЭлементДанных.ПараметрыАвторизации,
				ПодписьИзСвойствПодписи(ЭлементДанных.СвойстваПодписи));
			
			Если Не РезультатЗапросаИУстановкиКлючаСессии.КлючСессииУстановлен
				И ПодписанныеСообщенияПоОрганизациям <> Неопределено Тогда
				
				// Вывести сообщение об ошибке установке ключа сессии.
				// Дальнейший обмен по организации невозможен.
				Сообщения = ПодписанныеСообщенияПоОрганизациям[Организация];
				Для Каждого Сообщение Из Сообщения Цикл
					Сообщение.ТекстОшибки = РезультатЗапросаИУстановкиКлючаСессии.ТекстОшибки;
				КонецЦикла;
				
			ИначеЕсли ЗначениеЗаполнено(РезультатЗапросаИУстановкиКлючаСессии.ТекстОшибки) Тогда
				
				ЗаголовокОшибки = "";
				СтруктураТекстаОшибки = РазобратьТекстОшибки(РезультатЗапросаИУстановкиКлючаСессии.ТекстОшибки, ЗаголовокОшибки);
				Если СтруктураТекстаОшибки = Неопределено
					Или Не СтруктураТекстаОшибки.Свойство("error_message") Тогда
					ОписаниеОшибки = РезультатЗапросаИУстановкиКлючаСессии.ТекстОшибки;
				Иначе
					ОписаниеОшибки = СтруктураТекстаОшибки.error_message;
					ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапросаИУстановкиКлючаСессии.ТекстОшибки);
				КонецЕсли;
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Ошибка авторизации в сервисе ИС МП:
					           |%1 по организации %2'"),
					ОписаниеОшибки, Организация);
				
				МассивОшибок.Добавить(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивОшибок.Количество() > 0 Тогда
			ОшибкиУстановкиКлючаСессииПоОрганизациям.Вставить(Организация, СтрСоединить(МассивОшибок, Символы.ПС));
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОшибкиУстановкиКлючаСессииПоОрганизациям.Количество() > 0 Тогда
		
		ОчередьСообщений = ПараметрыОбмена.ОчередьСообщений;
		Для Каждого Сообщение Из ОчередьСообщений Цикл
			
			ТекстОшибки = ОшибкиУстановкиКлючаСессииПоОрганизациям.Получить(Сообщение.Организация);
			Если ТекстОшибки <> Неопределено Тогда
				ПриОтменеТранзакции(Сообщение, ТекстОшибки, ПараметрыОбмена);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыСеансаИС() Экспорт
	
	ПараметрыСеансаИС = Новый Структура;
	ПараметрыСеансаИС.Вставить("ДанныеКлючаСессииИСМП",          Неопределено);
	ПараметрыСеансаИС.Вставить("ДанныеКлючаСессииСУЗ",           Неопределено);
	ПараметрыСеансаИС.Вставить("ДанныеКлючаСессииИСМПРозница",   Неопределено);
	ПараметрыСеансаИС.Вставить("CDNПлощадкиСОшибкамиОбменаИСМП", Неопределено);
	ПараметрыСеансаИС.Вставить(
		"ПараметрыЛогированияЗапросовИСМП",
		ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов());
	
	УчитываемыеВидыМаркируемойПродукции = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	
	Если УчитываемыеВидыМаркируемойПродукции.Количество() > 0 Тогда
		Попытка
			ПараметрыСеансаИС.Вставить("ДанныеКлючаСессииИСМП", ПараметрыСеанса.ДанныеКлючаСессииИСМП);
		Исключение
			// Действие не требуется
		КонецПопытки;
		Попытка
			ПараметрыСеансаИС.Вставить("ДанныеКлючаСессииСУЗ", ПараметрыСеанса.ДанныеКлючаСессииСУЗ);
		Исключение
			// Действие не требуется
		КонецПопытки;
		Попытка
			ПараметрыСеансаИС.Вставить("ДанныеКлючаСессииИСМПРозница", ПараметрыСеанса.ДанныеКлючаСессииИСМПРозница);
		Исключение
			// Действие не требуется
		КонецПопытки;
		Попытка
			ПараметрыСеансаИС.Вставить("CDNПлощадкиСОшибкамиОбменаИСМП", ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП);
		Исключение
			// Действие не требуется
		КонецПопытки;
	КонецЕсли;
	
	Возврат ПараметрыСеансаИС;
	
КонецФункции

Процедура ПрочитатьПараметрыСеансаИС(ПараметрыСеансаИС) Экспорт
	
	Если ПараметрыСеансаИС.ДанныеКлючаСессииИСМП <> Неопределено Тогда
		ПараметрыСеанса.ДанныеКлючаСессииИСМП = ПараметрыСеансаИС.ДанныеКлючаСессииИСМП;
	КонецЕсли;
	
	Если ПараметрыСеансаИС.ДанныеКлючаСессииСУЗ <> Неопределено Тогда
		ПараметрыСеанса.ДанныеКлючаСессииСУЗ = ПараметрыСеансаИС.ДанныеКлючаСессииСУЗ;
	КонецЕсли;
	
	Если ПараметрыСеансаИС.ДанныеКлючаСессииИСМПРозница <> Неопределено Тогда
		ПараметрыСеанса.ДанныеКлючаСессииИСМПРозница = ПараметрыСеансаИС.ДанныеКлючаСессииИСМПРозница;
	КонецЕсли;
	
	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыСеансаИС.ПараметрыЛогированияЗапросовИСМП);
	ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(ПараметрыСеансаИС.ПараметрыЛогированияЗапросовИСМП);
	
КонецПроцедуры

Функция СтроковоеПредставлениеПустогоУникальногоИдентификатора() Экспорт
	Возврат "00000000-0000-0000-0000-000000000000";
КонецФункции

Функция ИндексКартинкиПоВидуУпаковкиИВидуПродукции(ВидУпаковки, ВидПродукции) Экспорт
	
	Если ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
		Возврат -1;
	КонецЕсли;
	
	СмещениеВидаПродукции = 0;
	СмещениеВидаУпаковки  = 0;
	
	Если ВидПродукции = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
		СмещениеВидаПродукции = 1;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Велосипеды Тогда
		СмещениеВидаПродукции = 7;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Духи Тогда
		СмещениеВидаПродукции = 10;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.КреслаКоляски Тогда
		СмещениеВидаПродукции = 13;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
		Или ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
		СмещениеВидаПродукции = 16;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Обувь Тогда
		СмещениеВидаПродукции = 19;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность Тогда
		СмещениеВидаПродукции = 22;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
		СмещениеВидаПродукции = 25;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.УпакованнаяВода Тогда
		СмещениеВидаПродукции = 30;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
		СмещениеВидаПродукции = 33;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Шины Тогда
		СмещениеВидаПродукции = 36;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.БАДы Тогда
		СмещениеВидаПродукции = 39;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
		СмещениеВидаПродукции = 45;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Антисептики Тогда
		СмещениеВидаПродукции = 48;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво Тогда
		СмещениеВидаПродукции = 51;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		СмещениеВидаПродукции = 57;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.СоковаяПродукция Тогда
		СмещениеВидаПродукции = 54;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво Тогда
		СмещениеВидаПродукции = 51;
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС Тогда
		СмещениеВидаПродукции = 60;
	КонецЕсли;
	
	Если ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
		Или ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
		СмещениеВидаУпаковки = 1;
	КонецЕсли;
	
	Возврат СмещениеВидаПродукции + СмещениеВидаУпаковки;
	
КонецФункции

Функция КоличествоКодовВСообщенииАгрегация() Экспорт
	Возврат 25000;
КонецФункции

Функция КоличествоКодовВСообщенииПодтверждениеПоступленияКИЗ() Экспорт
	Возврат 25000;
КонецФункции

Функция КоличествоКодовВСообщенииВводВОборот(ЭтоМаркировкаОстатков = Ложь) Экспорт
	Если ЭтоМаркировкаОстатков Тогда
		Возврат 5000;
	Иначе
		Возврат 25000;
	КонецЕсли;
КонецФункции

Функция КоличествоКодовВСообщенииАТК() Экспорт
	Возврат 25000;
КонецФункции

// Запись данных площадок в регистр СостоянияCDNПлощадокИСМП
// 
// Параметры:
//  СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//   * Ключ - Строка - Адрес площадки.
//   * Значение - (см. ИнтерфейсИСМП.ЗамерыСкоростиCDNПлощадок)
// Возвращаемое значение:
//   - Структура из КлючИЗначение:
//     * Отказ - Булево
//     * ТекстОшибки - Строка - заполнено, если Отказ = Истина
Функция ЗаписатьДанныеСостоянияCDNПлощадокВРегистр(СписокПлощадок) Экспорт
	
	РезультатВозврата = Новый Структура("Отказ, ТекстОшибки", Ложь, "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияCDNПлощадокИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
	
		НаборЗаписей = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Для Каждого СтрокаСпискаПлощадок Из СписокПлощадок Цикл
			
			ЗаписьРегистра = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьМенеджерЗаписи();
			
			ЗаписьРегистра.АдресПлощадки          = СтрокаСпискаПлощадок.Ключ;
			ЗаписьРегистра.СреднееВремяОтвета     = СтрокаСпискаПлощадок.Значение.СреднееВремяОтвета;
			ЗаписьРегистра.СреднееВремяПроверкиКМ = СтрокаСпискаПлощадок.Значение.СреднееВремяПроверкиКМ;
			
			ЗаписьРегистра.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		РезультатВозврата.Отказ       = Истина;
		РезультатВозврата.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбмена

Функция НоваяСтруктураАктивныхЗаказовПоСУЗ() Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДатаПоследнегоЗапросаПревышения", '00010101');
	СтруктураВозврата.Вставить("ТекущееКоличествоЗаказов",        0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция МаксимальноеКоличествоЗаказовВОчередиСУЗ()
	Возврат 100;
КонецФункции

Функция ПериодичностьОтправкиЗаказовПослеПревышения()
	Возврат 60;
КонецФункции

#КонецОбласти

#Область МаркировкаОстатков

Процедура ЗаполнитьПоОписаниюОстатков(ПараметрыЗаполнения, ДанныеОписанияОстатков, СохранятьОписание = Ложь)
	
	КешОписанияОстатков = ПараметрыЗаполнения.КешОписанияОстатков;
	ВидПродукции        = ПараметрыЗаполнения.ВидПродукции;
	Организация         = ПараметрыЗаполнения.Организация;
	СтрокиПоиска        = ПараметрыЗаполнения.СтрокиПоиска;
	НайденныеКлючи      = Новый Массив;
		
	Для Каждого КлючИЗначениеИсточник Из СтрокиПоиска Цикл
		
		Для Каждого КлючИЗначение Из ДанныеОписанияОстатков Цикл
			
			Если КлючИЗначение.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИскомоеНаименование = КлючИЗначениеИсточник.Ключ;
			СтрокиТоваров       = КлючИЗначениеИсточник.Значение;
			GTIN                = ШтрихкодированиеИСКлиентСервер.GTINПоШтрихкодуEAN(КлючИЗначение.Ключ);
			ОписаниеПозиции     = КлючИЗначение.Значение;
			НаименованиеПолное  = ОписаниеПозиции.НаименованиеПолное;
			
			Если ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции)
				Или ВидПродукции = Перечисления.ВидыПродукцииИС.Духи Тогда
				ЧастиНазвания = Новый Массив();
				ЧастиНазвания.Добавить(ОписаниеПозиции.НаименованиеПолное);
				Если ЗначениеЗаполнено(ОписаниеПозиции.ТорговаяМарка) Тогда
					ЧастиНазвания.Добавить(ОписаниеПозиции.ТорговаяМарка);
				Иначе
					ЧастиНазвания.Добавить("Отсутствует");
				КонецЕсли;
				НаименованиеПолное = СтрСоединить(ЧастиНазвания, ". ");
			КонецЕсли;
			
			Если НормализованноеСтроковоеЗначение(НаименованиеПолное) = НормализованноеСтроковоеЗначение(ИскомоеНаименование) Тогда
				
				НайденныеСтроки = Новый Массив;
				
				Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
					
					Если Не СтрНачинаетсяС(СтрокаТовары.КодТНВЭД, ОписаниеПозиции.КодТНВЭД) Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаТовары.GTIN = GTIN;
					НайденныеСтроки.Добавить(СтрокаТовары);
					
					Если СохранятьОписание И КешОписанияОстатков.Получить(GTIN) = Неопределено Тогда
						СтруктураОписания = Новый Структура();
						СтруктураОписания.Вставить("Представление",  ОписаниеПозиции.НаименованиеПолное);
						СтруктураОписания.Вставить("КодТНВЭД",       ОписаниеПозиции.КодТНВЭД);
						СтруктураОписания.Вставить("Организация",    Организация);
						СтруктураОписания.Вставить("ВидПродукции",   ВидПродукции);
						СтруктураОписания.Вставить("ДанныеОписания", СтрокаТовары);
						КешОписанияОстатков.Вставить(GTIN, СтруктураОписания);
					КонецЕсли;
					
				КонецЦикла;
				
				Для Каждого УдаляемаяСтрока Из НайденныеСтроки Цикл
					СтрокиТоваров.Удалить(СтрокиТоваров.Найти(УдаляемаяСтрока));
				КонецЦикла;
				
				Если СтрокиТоваров.Количество() = 0 Тогда
					НайденныеКлючи.Добавить(ИскомоеНаименование);
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого СтрокаКлюч Из НайденныеКлючи Цикл
		СтрокиПоиска.Удалить(СтрокаКлюч);
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоЗапросСуществующихGTINНаОстатки(ЭлементОчереди, ПараметрыОбмена)
	
	Возврат (ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки
		И ЭлементОчереди.ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора());
	
КонецФункции

// Формирует массив сообщений в формате XML к передаче в УТМ.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, по которому формируется сообщение.
//  ДальнейшееДействие - ПеречислениеСсылка.ДальнейшиеДействияПоВзаимодействиюИСМП - Дальнейшее действие.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
// 
// Возвращаемое значение:
//  Массив - Сообщения к передаче см. ИнтеграцияЕГАИС.СтруктураСообщенияXML().
//
Функция СообщениеКПередачеJSON(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено)
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеИдентификаторСоединения Тогда
		
		Операция = Перечисления.ВидыОперацийИСМП.ЗапросИдентификатораСоединенияСУЗ;
		
		ПараметрыЗапросаИдентификатораСоединенияСУЗ = ДополнительныеПараметры.ПараметрыОбработкиДокумента.ДополнительныеПараметры;
		
		НомерВерсии = 1;
		
		СообщенияJSON = Новый Массив;
		
		СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
		СообщениеJSON.Организация = ПараметрыЗапросаИдентификатораСоединенияСУЗ.Организация;
		
		СообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(
			Операция, ДокументСсылка, НомерВерсии);
		
		СообщениеJSON.ПараметрыЗапроса = Новый Структура;
		СообщениеJSON.ПараметрыЗапроса.Вставить("address", ПараметрыЗапросаИдентификатораСоединенияСУЗ.ПараметрыЗапроса.Адрес);
		
		ТелоСообщенияJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(
			СообщениеJSON.ПараметрыЗапроса, Истина);
		
		СообщениеJSON.ТекстСообщенияJSON = ТелоСообщенияJSON;
		СообщениеJSON.ТипСообщения       = Перечисления.ТипыЗапросовИС.Исходящий;
		СообщениеJSON.Операция           = Операция;
		СообщениеJSON.Версия             = НомерВерсии;
		
		СообщениеJSON.ТребуетсяПодписание       = Истина;
		СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами;
		СообщениеJSON.ФорматОбмена              = Перечисления.ВерсииФорматаОбменаСУЗ.V2;
		СообщениеJSON.СтанцияУправленияЗаказами = ПараметрыЗапросаИдентификатораСоединенияСУЗ.СтанцияУправленияЗаказами;
		СообщениеJSON.ПроизводственныйОбъект    = ПараметрыЗапросаИдентификатораСоединенияСУЗ.ПроизводственныйОбъект;
		
		СообщениеJSON.ПараметрыПодключенияКСУЗ = ПараметрыЗапросаИдентификатораСоединенияСУЗ.ПараметрыПодключенияКСУЗ;
		
		СообщенияJSON.Добавить(СообщениеJSON);
		
		ВозвращаемоеЗначение = СообщенияJSON;
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеМестаОсуществленияДеятельности Тогда
		
		Операция = Перечисления.ВидыОперацийИСМП.ЗапросМестОсуществленияДеятельности;
		
		ПараметрыЗапросаМОД = ДополнительныеПараметры.ПараметрыОбработкиДокумента.ДополнительныеПараметры;
		
		НомерВерсии = 1;
		
		СообщенияJSON = Новый Массив;
		
		СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
		СообщениеJSON.Организация = ПараметрыЗапросаМОД.Организация;
		СообщениеJSON.ВидПродукции = ПараметрыЗапросаМОД.ВидПродукции;
		
		СообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(
			Операция, ДокументСсылка, НомерВерсии);
		
		СообщениеJSON.ПараметрыЗапроса = Новый Структура;
		
		ТелоСообщенияJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(
			СообщениеJSON.ПараметрыЗапроса, Истина);
		
		СообщениеJSON.ТекстСообщенияJSON = ТелоСообщенияJSON;
		СообщениеJSON.ТипСообщения       = Перечисления.ТипыЗапросовИС.Исходящий;
		СообщениеJSON.Операция           = Операция;
		СообщениеJSON.Версия             = НомерВерсии;
		
		СообщениеJSON.ТребуетсяПодписание       = Ложь;
		СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами;
		СообщениеJSON.ФорматОбмена              = Перечисления.ВерсииФорматаОбменаСУЗ.V2;
		СообщениеJSON.СтанцияУправленияЗаказами = ПараметрыЗапросаМОД.СтанцияУправленияЗаказами;
		СообщениеJSON.ПроизводственныйОбъект    = ПараметрыЗапросаМОД.ПроизводственныйОбъект;
		СообщениеJSON.ПараметрыПодключенияКСУЗ  = ПараметрыЗапросаМОД.ПараметрыПодключенияКСУЗ;
		
		СообщенияJSON.Добавить(СообщениеJSON);
		
		ВозвращаемоеЗначение = СообщенияJSON;
		
	Иначе
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ДокументСсылка);
		ВозвращаемоеЗначение = МенеджерОбъекта.СообщениеКПередачеJSON(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Подготавливает сообщения к передаче в ВЕТИС.
//
// Параметры:
//  Сообщения       - Массив - содержит структуру сообщений, которые подготавливаются к передаче
//    (см. ИнтеграцияВЕТИСКлиентСервер.СтруктураСообщенияXML).
//  ПараметрыОбмена - Структура, Неопределено - см. функцию ПараметрыОбмена().
Процедура ПодготовитьПодписанныеСообщенияКПередаче(ПодписанныеСообщенияПоОрганизациям, ПараметрыОбмена)
	
	Если ПодписанныеСообщенияПоОрганизациям = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ПодписанныеСообщенияПоОрганизациям Цикл
		
		СообщенияJSON = КлючИЗначение.Значение;
		
		ПодготовитьСообщенияКПередаче(СообщенияJSON, ПараметрыОбмена);
		
	КонецЦикла;
	
	ПодписанныеСообщенияПоОрганизациям = Неопределено;
	
КонецПроцедуры

// Подготавливает сообщения к передаче в ВЕТИС.
//
// Параметры:
//  Сообщения       - Массив - содержит структуру сообщений, которые подготавливаются к передаче
//    (см. ИнтеграцияВЕТИСКлиентСервер.СтруктураСообщенияXML).
//  ПараметрыОбмена - Структура, Неопределено - см. функцию ПараметрыОбмена().
Процедура ПодготовитьСообщенияКПередаче(СообщенияXML, ПараметрыОбмена, ИдентификаторЗаявки = Неопределено)
	
	Если ТипЗнч(СообщенияXML) = Тип("Структура") Тогда
		КоллекцияСообщенийXML = Новый Массив;
		КоллекцияСообщенийXML.Добавить(СообщенияXML);
	Иначе
		КоллекцияСообщенийXML = СообщенияXML;
	КонецЕсли;
	
	Для Каждого Сообщение Из КоллекцияСообщенийXML Цикл
		
		Если ЗначениеЗаполнено(Сообщение.ИдентификаторЗаявки) Тогда
			ТекущийИдентификаторЗаявки = Сообщение.ИдентификаторЗаявки;
		Иначе
			ТекущийИдентификаторЗаявки = ИдентификаторЗаявки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Сообщение.ТекстОшибки) Тогда
			
			РеквизитыОчереди = Новый Структура;
			// Назначение сообщений: ИСМП, МОТП или СУЗ
			РеквизитыОчереди.Вставить("ВидПродукции",                 Сообщение.ВидПродукции);
			РеквизитыОчереди.Вставить("Операция",                     Сообщение.Операция);
			РеквизитыОчереди.Вставить("Назначение",                   Сообщение.Назначение);
			РеквизитыОчереди.Вставить("СтанцияУправленияЗаказами",    Сообщение.СтанцияУправленияЗаказами);
			РеквизитыОчереди.Вставить("ПроизводственныйОбъект",       Сообщение.ПроизводственныйОбъект);
			
			// Источник
			РеквизитыОчереди.Вставить("Организация",                  Сообщение.Организация);
			РеквизитыОчереди.Вставить("Документ",                     Сообщение.Документ);
			РеквизитыОчереди.Вставить("ДокументОснование",            Сообщение.ДокументОснование);
			
			// Описание, протокол и очередь
			РеквизитыОчереди.Вставить("РеквизитыИсходящегоСообщения", Сообщение);
			РеквизитыОчереди.Вставить("ПротоколОбмена",               Неопределено);
			РеквизитыОчереди.Вставить("ЗагружатьПосле",               Сообщение.ЗагружатьПосле);
			РеквизитыОчереди.Вставить("ЗагружатьДо",                  Сообщение.ЗагружатьДо);
			РеквизитыОчереди.Вставить("ИдентификаторЗаявки",          ТекущийИдентификаторЗаявки);
			РеквизитыОчереди.Вставить("СообщениеОснование",           Сообщение.СообщениеОснование);
			
			Попытка
				
				Результат = ПодготовитьСообщениеКПередаче(
					Сообщение,
					РеквизитыОчереди);
				
				ТекстОшибки            = Результат.ТекстОшибки;
				ПодготовленоКПередаче  = Не ЗначениеЗаполнено(ТекстОшибки);
				ИсходящееСообщение     = Результат.ИсходящееСообщение;
				
			Исключение
				
				ТекстОшибки            = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ПодготовленоКПередаче  = Ложь;
				ИсходящееСообщение     = Неопределено;
				
			КонецПопытки;
			
		Иначе
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Сообщение ""%1"" не подготовлено к отправке в ИС МП:
				           |%2'"),
				Сообщение.Описание,
				Сообщение.ТекстОшибки);
			ПодготовленоКПередаче = Ложь;
			ИсходящееСообщение    = Неопределено;
			
		КонецЕсли;
		
		Если ПодготовленоКПередаче Тогда
			
			ЭлементОчереди = ПараметрыОбмена.ОчередьСообщений.Добавить();
			
			ЭлементОчереди.ДатаСоздания       = ТекущаяУниверсальнаяДата();
			ЭлементОчереди.Сообщение          = ИсходящееСообщение;
			ЭлементОчереди.СообщениеОснование = Сообщение.СообщениеОснование;
			
			ЭлементОчереди.Организация       = Сообщение.Организация;
			ЭлементОчереди.Документ          = Сообщение.Документ;
			ЭлементОчереди.ДокументОснование = Сообщение.ДокументОснование;
			
			ЭлементОчереди.ВидПродукции              = Сообщение.ВидПродукции;
			ЭлементОчереди.Операция                  = Сообщение.Операция;
			ЭлементОчереди.Назначение                = Сообщение.Назначение;
			ЭлементОчереди.СтанцияУправленияЗаказами = Сообщение.СтанцияУправленияЗаказами;
			ЭлементОчереди.ПроизводственныйОбъект    = Сообщение.ПроизводственныйОбъект;
			
			ЭлементОчереди.РеквизитыИсходящегоСообщения = Сообщение;
			ЭлементОчереди.ПротоколОбмена               = Неопределено;
			ЭлементОчереди.ИдентификаторЗаявки          = ТекущийИдентификаторЗаявки;
			
			Если ЗначениеЗаполнено(Сообщение.ЗагружатьПосле) Тогда
				НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
				НоваяЗависимость.Сообщение1     = ИсходящееСообщение;
				НоваяЗависимость.Сообщение2     = Сообщение.ЗагружатьПосле;
				НоваяЗависимость.Загрузка       = Ложь;
				НоваяЗависимость.Передача       = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Сообщение.ЗагружатьДо) Тогда
				НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
				НоваяЗависимость.Сообщение1     = Сообщение.ЗагружатьДо;
				НоваяЗависимость.Сообщение2     = ИсходящееСообщение;
				НоваяЗависимость.Загрузка       = Ложь;
				НоваяЗависимость.Передача       = Ложь;
			КонецЕсли;
			
		Иначе
			
			СтрокаРезультата = СтруктураИзменения();
			
			СтрокаРезультата.Операция                  = Сообщение.Операция;
			СтрокаРезультата.Назначение                = Сообщение.Назначение;
			СтрокаРезультата.СтанцияУправленияЗаказами = Сообщение.СтанцияУправленияЗаказами;
			
			СтрокаРезультата.Организация           = Сообщение.Организация;
			СтрокаРезультата.Объект                = Сообщение.Документ;
			СтрокаРезультата.ДокументОснование     = Сообщение.ДокументОснование;
			
			СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Ложь;
			СтрокаРезультата.Передано              = Ложь;
			СтрокаРезультата.Принято               = Ложь;
			СтрокаРезультата.НовыйСтатус           = Неопределено;
			СтрокаРезультата.ОбъектИзменен         = Ложь;
			
			СтрокаРезультата.Сообщение                    = Сообщение.Идентификатор;
			СтрокаРезультата.ТекстСообщения               = "";
			СтрокаРезультата.ПредставлениеПротоколаОбмена = "";
			
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена)
	
	НачатьТранзакцию();
	
	Попытка
		
		// Повторное формирование сообщений - это исключительно виртуальная операция
		ЭтоПовторноеФормированиеСообщения = ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений;
		Если Не ЭтоПовторноеФормированиеСообщения Тогда

			ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);

			Блокировка = Новый БлокировкаДанных;

			ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
			ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;

			Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
				ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчередиОснование;
			КонецЕсли;

			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");

			Блокировка.Заблокировать();

			НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
			НаборЗаписей.Прочитать();

			Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
				НаборЗаписейОснование = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
				НаборЗаписейОснование.Отбор.Сообщение.Установить(ЭлементОчередиОснование.Сообщение);
				НаборЗаписейОснование.Прочитать();
			КонецЕсли;

		КонецЕсли;
		
		Если ЭтоПовторноеФормированиеСообщения
			Или (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			Если Не ЭтоПовторноеФормированиеСообщения Тогда
				Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
					Если ЗначениеЗаполнено(ЗаписьНабора.ИдентификаторЗаявки)
						И ЗаписьНабора.ИдентификаторЗаявки <> СтроковоеПредставлениеПустогоУникальногоИдентификатора() Тогда

						ОтменитьТранзакцию();

						// Сообщение уже передано в ГИС МТ, но еще не обработано.
						ЭлементОчереди.ИдентификаторЗаявки = ЗаписьНабора.ИдентификаторЗаявки;
						Возврат;

					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.ИСМП Тогда
				
				Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
					ПодготовитьСообщенияПоАбстрактнойАгрегации(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТК Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииАТК(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииВводВОборотИмпортСФТС(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Приемка 
					Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонить Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииПриемкаИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулировать Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииОтгрузкаИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформации Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииСогласиеОПредоставлениеИнформации(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииПроверкаСтатусаКодовМаркировки Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииОтчетОбИспользовании(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений Тогда
					ПодготовитьСообщенияКПередачеПовторно(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозливаРасчетСтатуса Тогда
					ПодготовитьСообщенияПоАбстрактнойОперацииПодключениеКОборудованиюРозлива(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетИСМПСведенияОбОтклонениях
					Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетИСМПСписокКИНаБалансе Тогда
					ПодготовитьСообщенияПоЗапросуВыгрузкиИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				Иначе
					ПередатьСообщениеИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей, НаборЗаписейОснование);
				КонецЕсли;

			ИначеЕсли ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами Тогда
				
				Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗапросИдентификатораСоединенияСУЗ Тогда
					
					НастройкаОбменаСУЗ = ИнтерфейсСУЗСлужебный.НоваяНастройкаОбменаСУЗ();
					НастройкаОбменаСУЗ.Сервер                           = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.Адрес;
					НастройкаОбменаСУЗ.Порт                             = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.Порт;
					НастройкаОбменаСУЗ.Таймаут                          = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.Таймаут;
					НастройкаОбменаСУЗ.ИспользоватьЗащищенноеСоединение = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.ИспользоватьЗащищенноеСоединение;
					НастройкаОбменаСУЗ.СтанцияУправленияЗаказами        = ЭлементОчереди.РеквизитыИсходящегоСообщения.СтанцияУправленияЗаказами;
					НастройкаОбменаСУЗ.Идентификатор                    = ЭлементОчереди.РеквизитыИсходящегоСообщения.СтанцияУправленияЗаказами.Идентификатор;
					НастройкаОбменаСУЗ.Организация                      = ЭлементОчереди.РеквизитыИсходящегоСообщения.Организация;
					НастройкаОбменаСУЗ.ПроизводственныйОбъект           = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПроизводственныйОбъект;
					НастройкаОбменаСУЗ.ФорматОбмена                     = Перечисления.ВерсииФорматаОбменаСУЗ.V2;
					
					ПередатьЗапросНаПолучениеИдентификатораСоединения(
						ЭлементОчереди,
						ПараметрыОбмена,
						НаборЗаписей,
						НастройкаОбменаСУЗ,
						НаборЗаписейОснование);
					
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗапросМестОсуществленияДеятельности Тогда
					
					НастройкаОбменаСУЗ = ИнтерфейсСУЗСлужебный.НоваяНастройкаОбменаСУЗ();
					НастройкаОбменаСУЗ.Сервер                           = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.Адрес;
					НастройкаОбменаСУЗ.Порт                             = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.Порт;
					НастройкаОбменаСУЗ.Таймаут                          = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.Таймаут;
					НастройкаОбменаСУЗ.ИспользоватьЗащищенноеСоединение = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.ИспользоватьЗащищенноеСоединение;
					НастройкаОбменаСУЗ.ИдентификаторСоединения          = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыПодключенияКСУЗ.ИдентификаторСоединения;
					НастройкаОбменаСУЗ.СтанцияУправленияЗаказами        = ЭлементОчереди.РеквизитыИсходящегоСообщения.СтанцияУправленияЗаказами;
					НастройкаОбменаСУЗ.Идентификатор                    = ЭлементОчереди.РеквизитыИсходящегоСообщения.СтанцияУправленияЗаказами.Идентификатор;
					НастройкаОбменаСУЗ.Организация                      = ЭлементОчереди.РеквизитыИсходящегоСообщения.Организация;
					НастройкаОбменаСУЗ.ПроизводственныйОбъект           = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПроизводственныйОбъект;
					НастройкаОбменаСУЗ.ФорматОбмена                     = Перечисления.ВерсииФорматаОбменаСУЗ.V2;
					
					ПередатьЗапросНаПолучениеМестОсуществленияДеятельности(
						ЭлементОчереди,
						ПараметрыОбмена,
						НаборЗаписей,
						НастройкаОбменаСУЗ,
						НаборЗаписейОснование);
					
				ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений Тогда
					ПодготовитьСообщенияКПередачеПовторно(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
				Иначе
					
					РезультатПолученияНастройки = НастройкаОбменаСУЗ(
						ПараметрыОбмена,
						ЭлементОчереди,
						Истина);
					
					Если Не РезультатПолученияНастройки.Успешно Тогда
						Если РезультатПолученияНастройки.ТребуетсяОбновлениеКлючаСессии Тогда
							Возврат;
						Иначе
							ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
						КонецЕсли;
					КонецЕсли;
					
					Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
						ПередатьЗаказНаЭмиссиюКодовМаркировкиСУЗ(
							ЭлементОчереди,
							ПараметрыОбмена,
							НаборЗаписей,
							РезультатПолученияНастройки.НастройкаОбмена,
							НаборЗаписейОснование);
					Иначе
						ПередатьОтчетСУЗ(
							ЭлементОчереди,
							ПараметрыОбмена,
							НаборЗаписей,
							РезультатПолученияНастройки.НастройкаОбмена,
							НаборЗаписейОснование);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Иначе
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При передаче сообщения по документу %1 возникла ошибка:
			           |Текст ошибки: %2'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

// Проверяет статус агрегата, полученный по данным ИС МП, в строках дерева, и наличие в дереве наборов и групповых упаковок.
// 1. Если агрегат не сформирован, его статус Неопределен.
// 2. Если присутствуют наборы, то агрегацию необходимо выполнять до ввода в оборот.
// 
// Параметры:
//  СтрокаДереваВерхнегоУровня - СтрокаДереваЗначений - Строка дерева значений.
//  
// Возвращаемое значение:
//  Булево - Истина, если найдены сформированные по данным ИС МП агрегаты.
//
Функция НайтиСформированныеАгрегатыПоДаннымИСМП(СтрокаДереваВерхнегоУровня)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	
	Если СтрокаДереваВерхнегоУровня.Строки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокаДереваВерхнегоУровня.Статус <> Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен Тогда
		Результат.ЕстьОшибки = Истина;
		Если СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
			Или СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			Результат.ТекстОшибки = ТекстОшибкиНайденыКодыНаборовГрупповыхУпаковокПриИмпортеСФТС();
		Иначе
			Результат.ТекстОшибки = ТекстОшибкиНайденыСформированныеАгрегатыИСМППриИмпортеСФТС();
		КОнецЕсли;
	Иначе
		Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
			Результат = НайтиСформированныеАгрегатыПоДаннымИСМП(СтрокаДерева);
			Если Результат.ЕстьОшибки Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует и заполняет сообщения для операции "трансформация агрегатов" (с видом удаление) и "расформирование АТК" 
// по таблице маркированных товаров.
// 
// Параметры:
//  МаркированныеТовары - См. ШтрихкодированиеИСМПСлужебный.ВложенныеШтрихкодыУпаковокПоДокументу.
//  ОбщийЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ЗагружатьДо - Строка - Идентификатор сообщения.
//  СообщенияJSONТрансформация - Массив - соответствие сообщений для отправки, которое нужно заполнить 
//                                              сформированными сообщениями.
//   * Ключ - Структура - см. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON().
//   * Значение - Строка - Идентификатор сообщения.
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//  ПараметрыОбработки - Структура:
//   * ОбрабатыватьКодыАТК - Булево - Истина, если требуется подготовить сообщения для расформирования АТК.
//
Процедура ПодготовитьКПередачеСообщенияДляТрансформацииАгрегатовИСМП(МаркированныеТовары, ОбщийЭлементОчереди,
	Знач ЗагружатьДо, СообщенияJSONТрансформация, ПараметрыОбмена, ПараметрыОбработки) Экспорт
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
	
	НастройкиРазбораКодаМаркировки = Новый Структура;
	НастройкиРазбораКодаМаркировки.Вставить("Кеш",              РазборКодаМаркировкиИССлужебныйКлиентСервер.ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
	НастройкиРазбораКодаМаркировки.Вставить("Общие",            РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(, Ложь));
	НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);

	АТКДляРасформирования    = Новый Соответствие;
	УпаковкиДляТрансформации = Новый Соответствие;
	
	КешДанныхРазбора = Новый Соответствие;
	Для Каждого СтрокаМаркированногоТовара Из МаркированныеТовары Цикл
		Если ЗначениеЗаполнено(СтрокаМаркированногоТовара.РодительскаяУпаковка) Тогда
			
			ДанныеРазбораШтрихкода = ГрупповаяОбработкаШтрихкодовИС.ВидУпаковкиИПредставлениеШтрихкодаУпрощенныйРазбор(
				СтрокаМаркированногоТовара.РодительскаяУпаковка, ОбщийЭлементОчереди.ВидПродукции, КешДанныхРазбора,
				НастройкиРазбораКодаМаркировки);

			ДанныеРазбораИПримечание = КешДанныхРазбора[СтрокаМаркированногоТовара.РодительскаяУпаковка];
			ДанныеРазбора = ДанныеРазбораИПримечание.ДанныеРазбора;
			
			НормализованныйКодУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				ДанныеРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
			
			Если ДанныеРазбораШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод Тогда
				Если ПараметрыОбработки.ОбрабатыватьКодыАТК Тогда
					АТКДляРасформирования.Вставить(НормализованныйКодУпаковки);
				КонецЕсли;
			Иначе
				ВложенныеКодыМаркировки = УпаковкиДляТрансформации.Получить(НормализованныйКодУпаковки);
				Если ВложенныеКодыМаркировки = Неопределено Тогда
					ВложенныеКодыМаркировки = Новый Массив;
				КонецЕсли;
				
				РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкодаУпрощенныйРазбор(
					СтрокаМаркированногоТовара.Штрихкод, ОбщийЭлементОчереди.ВидПродукции, НастройкиРазбораКодаМаркировки);
				НормализованныйКодМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
					РезультатРазбора.ДанныеРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
				
				ВложенныеКодыМаркировки.Добавить(НормализованныйКодМаркировки);
				УпаковкиДляТрансформации[НормализованныйКодУпаковки] = ВложенныеКодыМаркировки;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если АТКДляРасформирования.Количество() Тогда
		products_list_atk = Новый Массив;
		Для Каждого КлючИЗначение Из АТКДляРасформирования Цикл
			products_list_atk.Добавить(Новый Структура("atk", КлючИЗначение.Ключ));
		КонецЦикла;
		
		ТелоЗапросаРазагрегация = Новый Структура;
		ТелоЗапросаРазагрегация.Вставить("trade_participant_inn", ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
		ТелоЗапросаРазагрегация.Вставить("products_list",         products_list_atk);
		
		Операция = Перечисления.ВидыОперацийИСМП.АТКУдаление;
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапросаРазагрегация, Операция, ОбщийЭлементОчереди);
		СообщениеJSON.ЗагружатьДо = ЗагружатьДо;
		СообщенияJSONТрансформация.Добавить(СообщениеJSON);
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из УпаковкиДляТрансформации Цикл
		
		Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение;
		КодУпаковки = КлючИЗначение.Ключ;
		
		ТелоЗапросаУдаление = Новый Структура;
		
		ТелоЗапросаУдаление.Вставить("participantId",      ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
		ТелоЗапросаУдаление.Вставить("participant_inn",    ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
		ТелоЗапросаУдаление.Вставить("reaggregation_type", "REMOVING");
		ТелоЗапросаУдаление.Вставить("uitu",               КодУпаковки);
		ТелоЗапросаУдаление.Вставить("uit_uitu_list",      Новый Массив);
	
		Для Каждого КодМаркировки Из КлючИЗначение.Значение Цикл
			reaggregationUnit = Новый Структура;
			reaggregationUnit.Вставить("uit_uitu", КодМаркировки);
			ТелоЗапросаУдаление.uit_uitu_list.Добавить(reaggregationUnit);
		КонецЦикла;
		
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапросаУдаление, Операция, ОбщийЭлементОчереди);
		
		СообщениеJSON.ЗагружатьДо   = ЗагружатьДо;
		СообщениеJSON.Описание = СтрШаблон("%1 %2 (изменение)", ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(Операция), КодУпаковки);
		
		СообщенияJSONТрансформация.Добавить(СообщениеJSON);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует и заполняет массив сообщений для формирования АТК по документу Маркировка товаров ИС МП.
// 
// Параметры:
//  ТаблицаКодовМаркировки - ТаблицаЗначений:
//   * Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура.
//   * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - штрихкод упаковки.
//   * Штрихкод - Строка - значение штрихкода.
//  ДанныеШапки - См. ШтрихкодированиеИС.ПолучитьСтруктуруРеквизитовДокумента.
//  ОбщийЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ЗагружатьДо - Строка - Идентификатор сообщения.
//  СообщенияJSON - Массив - массив сообщений для отправки (см. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON())
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//
Процедура ПодготовитьКПередачеСообщенияДляФормированияКодовАТКИСМП(ТаблицаКодовМаркировки, ДанныеШапки,
	ОбщийЭлементОчереди, Знач ЗагружатьДо, СообщенияJSON, ПараметрыОбмена) Экспорт
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ТаблицаКодовМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ТаблицаКодовМаркировки.Штрихкод         КАК Штрихкод,
	|	ТаблицаКодовМаркировки.Номенклатура     КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаКодовМаркировки
	|ИЗ
	|	&ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КодТНВЭД КАК КодТНВЭД,
	|	Товары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО 
	|	Товары.Номенклатура,
	|	Товары.КодТНВЭД,
	|	Товары.СтавкаНДС
	|");
	
	ТекстЗапросаТаблицаТовары  = "ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КодТНВЭД     КАК КодТНВЭД,
	|	Товары.СтавкаНДС    КАК СтавкаНДС,
	|	ТаблицаКодовМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ТаблицаКодовМаркировки.Штрихкод         КАК Штрихкод
	|ИЗ
	|	ТаблицаТовары КАК Товары
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки
	|	ПО Товары.Номенклатура = ТаблицаКодовМаркировки.Номенклатура
	|ИТОГИ ПО
	|	&ПоляИтогов";

	ВариантФормированияАТКИСМП = ДанныеШапки.ВариантФормированияАТКИСМП;
	Если ВариантФормированияАТКИСМП = Перечисления.ВариантыФормированияАТКИСМП.КодТНВЭД Тогда
		ПолеИтогов = "КодТНВЭД";
	ИначеЕсли ВариантФормированияАТКИСМП = Перечисления.ВариантыФормированияАТКИСМП.КодТНВЭДНДС Тогда
		ПолеИтогов = "КодТНВЭД, СтавкаНДС";
	ИначеЕсли ВариантФормированияАТКИСМП = Перечисления.ВариантыФормированияАТКИСМП.Номенклатура Тогда
		ПолеИтогов = "Номенклатура";
	КонецЕсли;
	
	ТекстЗапросаТаблицаТовары = СтрЗаменить(ТекстЗапросаТаблицаТовары, "&ПоляИтогов", ПолеИтогов);
	СписокЗапросов.Добавить(
		ТекстЗапросаТаблицаТовары,
		"ШтрихкодыКФормированию");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",                 ОбщийЭлементОчереди.Документ);
	Запрос.УстановитьПараметр("ТаблицаКодовМаркировки", ТаблицаКодовМаркировки);
	
	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	ШтрихкодыКФормированию = РезультатЗапроса["ШтрихкодыКФормированию"];
	
	РеквизитыОрганизации =  ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ДанныеШапки.Организация);
	
	Настройки = Новый Структура;
	Настройки.Вставить("ИННОрганизации", РеквизитыОрганизации.ИНН);
	Настройки.Вставить("КоличествоКодовВСообщенииАТК", КоличествоКодовВСообщенииАТК());

	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;

	Настройки.Вставить("ПараметрыНормализацииПрочее", ПараметрыНормализацииПрочее);

	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;

	НастройкиРазбораКодаМаркировки = Новый Структура;
	НастройкиРазбораКодаМаркировки.Вставить("Кеш",              РазборКодаМаркировкиИССлужебныйКлиентСервер.ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
	НастройкиРазбораКодаМаркировки.Вставить("Общие",            РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(, Ложь));
	НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);

	Настройки.Вставить("НастройкиРазбораКодаМаркировки", НастройкиРазбораКодаМаркировки);

	ДеревоУпаковок = ШтрихкодыКФормированию.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоУпаковок.Строки.Сортировать("Штрихкод", Истина);

	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		ЗаполнитьСообщенияJSONФормированиеАТК(
			СтрокаДерева,
			СообщенияJSON,
			ОбщийЭлементОчереди,
			ЗагружатьДо,
			Настройки);
	КонецЦикла;
	
КонецПроцедуры

// Формирует и заполняет массив сообщений для отправки для вида операции "Формирование АТК".
// 
// Параметры:
//  СтрокаДереваВерхнегоУровня - СтрокаДереваЗначений - Строка дерева значений.
//  СообщенияJSON - Массив - массив сообщений для заполнения (см. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON)
//  ОбщийЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ЗагружатьДо - Строка - Идентификатор сообщения.
//  ПараметрыНормализацииПрочее - См. РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки.
//  Настройки - Структура со свойствами:
//  * ИННОрганизации - Строка - ИНН организации.
//  * КоличествоКодовВСообщенииАТК - Число - максимальное количество кодов в сообщении.
//
Процедура ЗаполнитьСообщенияJSONФормированиеАТК(СтрокаДереваВерхнегоУровня, СообщенияJSON, ОбщийЭлементОчереди, ЗагружатьДо, Настройки)
	
	Если СтрокаДереваВерхнегоУровня.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Операция = Перечисления.ВидыОперацийИСМП.АТКСоздание;

	products_list = Новый Массив;
	ГруппаНормализованныхКодов = Новый Массив;

	КоличествоКодовВСообщенииАТК = Настройки.КоличествоКодовВСообщенииАТК;
	ТекущееКоличествоКодов       = 0;

	Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.Штрихкод) Тогда

			Если ТекущееКоличествоКодов = КоличествоКодовВСообщенииАТК Тогда
				ТелоЗапроса = Новый Структура;
				ТелоЗапроса.Вставить("trade_participant_inn", Настройки.ИННОрганизации);
				ТелоЗапроса.Вставить("products_list",         products_list);

				ПараметрыЗапроса = ОбщегоНазначения.СкопироватьРекурсивно(ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса);
				ПараметрыЗапроса.Вставить("ДанныеСообщения", ГруппаНормализованныхКодов);

				СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапроса, Операция, ОбщийЭлементОчереди);
				СообщениеJSON.ЗагружатьДо = ЗагружатьДо;
				СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;
				СообщениеJSON.Версия           = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;

				СообщенияJSON.Добавить(СообщениеJSON);

				products_list = Новый Массив;
				ГруппаНормализованныхКодов = Новый Массив;
				ТекущееКоличествоКодов = 0;
			КонецЕсли;

			РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкодаУпрощенныйРазбор(
				СтрокаДерева.Штрихкод, ОбщийЭлементОчереди.ВидПродукции, Настройки.НастройкиРазбораКодаМаркировки);
			КодДляПередачиИСМП = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				РезультатРазбора, ОбщийЭлементОчереди.ВидПродукции, Настройки.ПараметрыНормализацииПрочее);

			СтрокаТЧ = Новый Структура;
			СтрокаТЧ.Вставить("ki", КодДляПередачиИСМП);

			products_list.Добавить(СтрокаТЧ);

			ГруппаНормализованныхКодов.Добавить(КодДляПередачиИСМП);
			ТекущееКоличествоКодов = ТекущееКоличествоКодов + 1;

		Иначе
			ЗаполнитьСообщенияJSONФормированиеАТК(СтрокаДерева, СообщенияJSON, ОбщийЭлементОчереди, ЗагружатьДо, Настройки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если products_list.Количество() Тогда
		
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("trade_participant_inn", Настройки.ИННОрганизации);
		ТелоЗапроса.Вставить("products_list",         products_list);

		ПараметрыЗапроса = ОбщегоНазначения.СкопироватьРекурсивно(ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса);
		ПараметрыЗапроса.Вставить("ДанныеСообщения", ГруппаНормализованныхКодов);

		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапроса, Операция, ОбщийЭлементОчереди);
		СообщениеJSON.ЗагружатьДо = ЗагружатьДо;
		СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;
		СообщениеJSON.Версия           = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;

		СообщенияJSON.Добавить(СообщениеJSON);
		
	КонецЕсли;
	
КонецПроцедуры

// Создает структуру сообщения для отправки и заполняет основные значения по общему элементу очереди.
// 
// Параметры:
//  ТелоЗапроса - Структура - Структура данных для создания сообщения.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП -  операция обмена.
//  ОбщийЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  
// Возвращаемое значение:
//  Структура - см. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON.
//
Функция ЗаполнитьСообщениеJSONКПередаче(ТелоЗапроса, Операция, ОбщийЭлементОчереди)
	
	СообщениеJSON = СтруктураСообщенияJSON();
	СообщениеJSON.Идентификатор = Строка(Новый УникальныйИдентификатор());
	
	СообщениеJSON.Организация       = ОбщийЭлементОчереди.Организация;
	СообщениеJSON.Документ          = ОбщийЭлементОчереди.Документ;
	СообщениеJSON.ДокументОснование = ОбщийЭлементОчереди.ДокументОснование;
	
	СообщениеJSON.Описание = ОписаниеОперацииПередачиДанных(Операция, ОбщийЭлементОчереди.Документ);
	
	СообщениеJSON.ТекстСообщенияJSON  = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса, Истина);
	СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	СообщениеJSON.Версия              = Неопределено;
	СообщениеJSON.ТребуетсяПодписание = Истина;
	СообщениеJSON.СообщениеОснование  = ОбщийЭлементОчереди.Сообщение;
	СообщениеJSON.ПараметрыЗапроса    = Неопределено;
	
	СообщениеJSON.ВидПродукции = ОбщийЭлементОчереди.ВидПродукции;
	СообщениеJSON.Операция     = Операция;
	СообщениеJSON.Назначение   = Перечисления.НазначениеСообщенийИСМП.ИСМП;
	
	Возврат СообщениеJSON;
	
КонецФункции

// Создает и заполняет структуру абстрактного сообщения очереди.
// 
// Параметры:
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП -  операция обмена.
//  ОбщийЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  
// Возвращаемое значение:
//  Структура - см. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON.
//
Функция ЗаполнитьСообщениеJSONАбстрактнаяОперация(Операция, ОбщийЭлементОчереди)
	
	АбстрактноеСообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
	
	АбстрактноеСообщениеJSON.Организация       = ОбщийЭлементОчереди.Организация;
	АбстрактноеСообщениеJSON.Документ          = ОбщийЭлементОчереди.Документ;
	АбстрактноеСообщениеJSON.ДокументОснование = ОбщийЭлементОчереди.ДокументОснование;
	АбстрактноеСообщениеJSON.Идентификатор     = Строка(Новый УникальныйИдентификатор());
	АбстрактноеСообщениеJSON.ЗагружатьДо       = ОбщийЭлементОчереди.Сообщение;
	
	АбстрактноеСообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(Операция, ОбщийЭлементОчереди.Документ);
	
	АбстрактноеСообщениеJSON.ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	АбстрактноеСообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	АбстрактноеСообщениеJSON.Версия              = Неопределено;
	АбстрактноеСообщениеJSON.ТребуетсяПодписание = Ложь;
	АбстрактноеСообщениеJSON.ПараметрыЗапроса    = Неопределено;
	АбстрактноеСообщениеJSON.СообщениеОснование  = ОбщийЭлементОчереди.Сообщение;
	
	АбстрактноеСообщениеJSON.ВидПродукции              = ОбщийЭлементОчереди.ВидПродукции;
	АбстрактноеСообщениеJSON.Операция                  = Операция;
	АбстрактноеСообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.ИСМП;
	АбстрактноеСообщениеJSON.СтанцияУправленияЗаказами = Неопределено;
	
	Возврат АбстрактноеСообщениеJSON;
	
КонецФункции

Процедура ПодготовитьКПередачеСообщениеЗапросаСтатусаКодов(ЭлементОчереди, ПараметрыОбмена)
	
	Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииПроверкаСтатусаКодовМаркировки;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("КодыМаркировкиДляКонтроляСтатусов",                  Новый Массив);
	ПараметрыЗапроса.Вставить("ДопустимыеНачальныеСтатусыКодовОтчетОНанесении",     Новый Массив);
	ПараметрыЗапроса.Вставить("ОжидаемыеСтатусыКодовПослеПередачиОтчетаОНанесении", Новый Массив);
	ПараметрыЗапроса.Вставить("ОтчетПереданВСУЗ",                                   Ложь);
	ПараметрыЗапроса.Вставить("ПовторныйЗапросКвитанции",                           Ложь);
	ПараметрыЗапроса.Вставить("ИдентификаторЗаявки",                                "");
	ПараметрыЗапроса.Вставить("ИспользуетсяПакетнаяПередачаСообщений",              Ложь);
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса);
	ПараметрыЗапроса.ОтчетПереданВСУЗ = Истина;
	
	СообщениеJSON = ЗаполнитьСообщениеJSONАбстрактнаяОперация(Операция, ЭлементОчереди);
	СообщениеJSON.ИдентификаторЗаявки = ЭлементОчереди.ИдентификаторЗаявки;
	СообщениеJSON.ПараметрыЗапроса    = ПараметрыЗапроса;
	СообщениеJSON.Версия              = ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
	
	СообщенияJSON = Новый Массив;
	СообщенияJSON.Добавить(СообщениеJSON);
	
	ПодготовитьСообщенияКПередаче(СообщенияJSON, ПараметрыОбмена, СтроковоеПредставлениеПустогоУникальногоИдентификатора());
	
КонецПроцедуры

#Область Агрегация

// Формирует и заполняет массив сообщений для расформирования агрегатов и АТК по документу Маркировка товаров ИС МП.
// 
// Параметры:
//  МаркированныеТовары См. ШтрихкодированиеИСМПСлужебный.ВложенныеШтрихкодыУпаковокПоДокументу.
//  ОбщийЭлементОчереди -  СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ЗагружатьДо - Строка - Идентификатор сообщения.
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//  УпаковкиДокумента - Соответствие - соотвествие упаковок обрабатываемого документа:
//   * Ключ - Строка - нормализованный код упаковки.
//   * Значение - Строка - код родительской упаковки.
//  СообщенияJSONОперацияУдаление - Массив - Пакет сообщений для отправки, которое нужно заполнить 
//                                                 сформированными сообщениями.
// Возвращаемое значение:
//  Структура - результат подготовки сообщений:
//  * ЕстьОшибки - Булево - истина, если при получении данных по данным ИСМП возникли ошибки.
//  * ТекстОшибки - Строка - описание ошибки.
//  * ТребуетсяОбновлениеКлючаСессии - Булево - признак необходимости обновления ключа сессии.
Функция ПодготовитьКПередачеСообщенияДляРазагрегацииКодовМаркировкиИСМП(
	МаркированныеТовары, ОбщийЭлементОчереди, Знач ЗагружатьДо,
	ПараметрыОбмена, УпаковкиДокумента, СообщенияJSONОперацияУдаление) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
	
	products_list = Новый Массив;
	products_list_atk = Новый Массив;
	
	ПараметрыОбработкиУпаковок = Новый Структура;
	ПараметрыОбработкиУпаковок.Вставить("КешОбработаннныхУпаковок", Новый Соответствие);
	ПараметрыОбработкиУпаковок.Вставить("КешУпаковокКРазагрегации", Новый Соответствие);
	ПараметрыОбработкиУпаковок.Вставить("КешУпаковокВиртуальнаяРазагрегация", Новый Соответствие);
	
	Для Каждого СтрокаМаркированногоТовара Из МаркированныеТовары Цикл
		
		УпаковкаКРазагрегацииНайдена = Ложь;
		Если ЗначениеЗаполнено(СтрокаМаркированногоТовара.РодительскаяУпаковка) Тогда
			КодУпаковки = СтрокаМаркированногоТовара.РодительскаяУпаковка;
			
			Если ПараметрыОбработкиУпаковок.КешОбработаннныхУпаковок[КодУпаковки] <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОбработкиУпаковок.КешОбработаннныхУпаковок[КодУпаковки] = Истина;
			
			Если УпаковкиДокумента[КодУпаковки] = Неопределено Тогда
				
				РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
					СтрокаМаркированногоТовара.РодительскаяУпаковка, ОбщийЭлементОчереди.ВидПродукции, ПользовательскиеПараметрыРазбораКодаМаркировки);
				НормализованныйКодУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
					РезультатРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
				
				ПараметрыОбработкиУпаковок.КешОбработаннныхУпаковок[НормализованныйКодУпаковки] = Истина;
				
				Если УпаковкиДокумента[НормализованныйКодУпаковки] = Неопределено Тогда
					УпаковкаКРазагрегацииНайдена = Истина;
					Если РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод Тогда
						// Согласно документации в АТК указываются только номера КИ.
						products_list_atk.Добавить(Новый Структура("atk", НормализованныйКодУпаковки));
						Продолжить;
					Иначе
						ПараметрыОбработкиУпаковок.КешУпаковокКРазагрегации.Вставить(НормализованныйКодУпаковки, "uitu");
					КонецЕсли;
					
				Иначе
					УпаковкиДокумента[НормализованныйКодУпаковки] = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаМаркированногоТовара.СтрокаДерева <> Неопределено
				И СтрокаМаркированногоТовара.СтрокаДерева.Родитель <> Неопределено
				И ЗначениеЗаполнено(СтрокаМаркированногоТовара.СтрокаДерева.Родитель.РодительскаяУпаковка) Тогда
				
				РодительскаяУпаковка = СтрокаМаркированногоТовара.СтрокаДерева.Родитель.РодительскаяУпаковка;
				
				Результат = ОбработатьУпаковкиВерхнегоУровня(
					РодительскаяУпаковка,
					УпаковкиДокумента,
					ПараметрыОбработкиУпаковок,
					УпаковкаКРазагрегацииНайдена,
					ОбщийЭлементОчереди,
					ПараметрыНормализацииПрочее,
					ПараметрыОбмена);
				
				Если Результат.ЕстьОшибки Или Результат.ТребуетсяОбновлениеКлючаСессии Тогда
					Возврат Результат;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из УпаковкиДокумента Цикл

		Если ПараметрыОбработкиУпаковок.КешОбработаннныхУпаковок[КлючИЗначение.Ключ] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Результат = ОбработатьУпаковкиВерхнегоУровня(
			КлючИЗначение.Значение,
			УпаковкиДокумента,
			ПараметрыОбработкиУпаковок,
			УпаковкаКРазагрегацииНайдена,
			ОбщийЭлементОчереди,
			ПараметрыНормализацииПрочее,
			ПараметрыОбмена);

		Если Результат.ЕстьОшибки Или Результат.ТребуетсяОбновлениеКлючаСессии Тогда
			Возврат Результат;
		КонецЕсли;

	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ПараметрыОбработкиУпаковок.КешУпаковокКРазагрегации Цикл
		products_list.Добавить(Новый Структура(КлючИЗначение.Значение, КлючИЗначение.Ключ));
	КонецЦикла;
	
	Если products_list.Количество() Тогда
		ТелоЗапросаРазагрегация = Новый Структура;
		ТелоЗапросаРазагрегация.Вставить("participant_inn", ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
		ТелоЗапросаРазагрегация.Вставить("products_list",   products_list);
		
		Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление;
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапросаРазагрегация, Операция, ОбщийЭлементОчереди);
		СообщениеJSON.ЗагружатьДо = ЗагружатьДо;
		СообщенияJSONОперацияУдаление.Добавить(СообщениеJSON);
		
	КонецЕсли;
	
	Если products_list_atk.Количество() Тогда
		ТелоЗапросаРазагрегация = Новый Структура;
		ТелоЗапросаРазагрегация.Вставить("trade_participant_inn", ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
		ТелоЗапросаРазагрегация.Вставить("products_list",         products_list_atk);
		
		Операция = Перечисления.ВидыОперацийИСМП.АТКУдаление;
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапросаРазагрегация, Операция, ОбщийЭлементОчереди);
		СообщениеJSON.ЗагружатьДо = ЗагружатьДо;
		СообщенияJSONОперацияУдаление.Добавить(СообщениеJSON);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает иерархию родительских упаковок и заполняет соотвествие упаковок к разагрегации.
// Параметры:
//  РодительскаяУпаковка - Строка - значение кода родительской упаковки
//  УпаковкиДокумента - Соответствие - соотвествие упаковок обрабатываемого документа:
//   * Ключ - Строка - нормализованный код упаковки.
//   * Значение - Строка - код родительской упаковки.
//  ПараметрыОбработкиУпаковок - Структура:
//   * КешОбработаннныхУпаковок- Соответствие - кеш упаковок обработанных.
//   * КешУпаковокКРазагрегации - Соответствие - кеш упаковок для разагрегации.
//   * КешУпаковокВиртуальнаяРазагрегация - Соответствие - кеш упаковок, которые будут разагргегированы по данным сервиса.
//  ОбщийЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ПараметрыНормализацииПрочее - См. РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки.
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена. 
// 
// Возвращаемое значение:
//  Структура - результат подготовки сообщений:
//  * ЕстьОшибки - Булево - истина, если при получении данных по данным ИСМП возникли ошибки.
//  * ТекстОшибки - Строка - описание ошибки.
//  * ТребуетсяОбновлениеКлючаСессии - Булево - признак необходимости обновления ключа сессии.
Функция ОбработатьУпаковкиВерхнегоУровня(Знач РодительскаяУпаковка, УпаковкиДокумента, 
	ПараметрыОбработкиУпаковок, УпаковкаКРазагрегацииНайдена,
	ОбщийЭлементОчереди, ПараметрыНормализацииПрочее, ПараметрыОбмена)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
	
	Пока ЗначениеЗаполнено(РодительскаяУпаковка) Цикл
		РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
			РодительскаяУпаковка, ОбщийЭлементОчереди.ВидПродукции, ПользовательскиеПараметрыРазбораКодаМаркировки);
		НормализованныйКодУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			РезультатРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
		
		// Контроль иерархии упаковок, добавленных к разагрегации. Отправлять упаковку нижнего уровня, родительские упаковки будут расформированы автоматически.
		Если УпаковкиДокумента[НормализованныйКодУпаковки] = Неопределено 
			И УпаковкиДокумента[РодительскаяУпаковка] = Неопределено Тогда
			Если УпаковкаКРазагрегацииНайдена Тогда
				ПараметрыОбработкиУпаковок.КешУпаковокВиртуальнаяРазагрегация.Вставить(НормализованныйКодУпаковки);
				Если ПараметрыОбработкиУпаковок.КешУпаковокКРазагрегации.Получить(НормализованныйКодУпаковки) <> Неопределено Тогда
					ПараметрыОбработкиУпаковок.КешУпаковокКРазагрегации.Удалить(НормализованныйКодУпаковки);
					Прервать;
				КонецЕсли;
			Иначе
				ПараметрыОбработкиУпаковок.КешУпаковокКРазагрегации.Вставить(НормализованныйКодУпаковки, "uitu");
				УпаковкаКРазагрегацииНайдена = Истина;
			КонецЕсли;
		ИначеЕсли УпаковкаКРазагрегацииНайдена Тогда
			Прервать;
		КонецЕсли;
		
		ПараметрыОбработкиУпаковок.КешОбработаннныхУпаковок[РодительскаяУпаковка] = Истина;
		ПараметрыОбработкиУпаковок.КешОбработаннныхУпаковок[НормализованныйКодУпаковки] = Истина;
		
		МассивСтрокКодов = Новый Массив;
		ДанныеКодовМаркировки = ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки();
		СтрокаКодаМаркировки = ДанныеКодовМаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКодаМаркировки, РезультатРазбора);
		
		МассивСтрокКодов.Добавить(СтрокаКодаМаркировки);
		РезультатЗапросаДанных = ИнтерфейсИСМП.СтатусыКодовМаркировки(МассивСтрокКодов, ОбщийЭлементОчереди.Организация);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаДанных, ОбщийЭлементОчереди, ПараметрыОбмена) Тогда
			Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат Результат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатЗапросаДанных.ТекстОшибки) Тогда
			Результат.ЕстьОшибки = Истина;
			Результат.ТекстОшибки = РезультатЗапросаДанных.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		
		РезультатЗапросаПоСтроке = РезультатЗапросаДанных.СтатусыКодовМаркировки.Получить(СтрокаКодаМаркировки);
		
		Если РезультатЗапросаПоСтроке <> Неопределено
			И РезультатЗапросаПоСтроке.Свойство("РодительскаяУпаковка") Тогда
			РодительскаяУпаковка = РезультатЗапросаПоСтроке.РодительскаяУпаковка;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирование сообщения по абстрактной операции по расчету статусов агрегации при подготовке очереди сообщений для создания агрегатов или АТК
// и заполнение реквизитов "ЗагружатьДо, ЗагружатьПосле" в подготовленных сообщениях для отправки.
// Последовательность отправки сообщений должна быть: 
// 1. Трансформация (добавление) агрегатов.
// 2. Агрегация (формирование новых агрегатов).
// 3. Трансформация (удаление) агрегатов.
// 4. Разагрегация (агрегатов и АТК).
// 
// Параметры:
//  СообщенияJSON - Массив из См. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON- массив сообщений для заполнения (см. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON).
//  ОбщийЭлементОчереди -  СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ПакетСообщений - Соответствие - соответствие сообщений для обработки:
//   * Ключ - Число - Приоритет отправки.
//   * Значение - Массив - пакет сообщений одного уровня, могут обрабатываться параллельно.
//  СообщениеОснование - Строка - сообщение основание.
Процедура ПодготовитьКПередачеСообщениеАбстрактнаяАгрегацияИзменениеРасчетСтатуса(СообщенияJSON, ОбщийЭлементОчереди, ПакетСообщений, СообщениеОснование = "")

	ПриоритетыОбработки = Новый СписокЗначений();
	Для Каждого КлючИЗначение Из ПакетСообщений Цикл
		ПриоритетыОбработки.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	ПриоритетыОбработки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	ПредыдущийПакетСообщений = Неопределено;
	Для Каждого ЭлементСписка Из ПриоритетыОбработки Цикл
		
		Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменениеРасчетСтатуса;
		АбстрактноеСообщениеJSON = ЗаполнитьСообщениеJSONАбстрактнаяОперация(Операция, ОбщийЭлементОчереди);
		
		Если ЗначениеЗаполнено(СообщениеОснование) Тогда
			АбстрактноеСообщениеJSON.СообщениеОснование = СообщениеОснование;
		КонецЕсли;

		Если ПредыдущийПакетСообщений = Неопределено Тогда
			ПредыдущийПакетСообщений = СообщенияJSON;
		КонецЕсли;
		
		Для Каждого СообщениеJSON Из ПредыдущийПакетСообщений Цикл
			СообщениеJSON.ЗагружатьПосле = АбстрактноеСообщениеJSON.Идентификатор;
		КонецЦикла;
		
		СообщенияJSON.Добавить(АбстрактноеСообщениеJSON);
		
		Для Каждого СообщениеJSON Из ПакетСообщений[ЭлементСписка.Значение] Цикл
			СообщениеJSON.ЗагружатьДо = АбстрактноеСообщениеJSON.Идентификатор;
			СообщенияJSON.Добавить(СообщениеJSON);
		КонецЦикла;
		
		ПредыдущийПакетСообщений = ПакетСообщений[ЭлементСписка.Значение];
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИнициализироватьТелоЗапросаАгрегацияСоздание(ОбщийЭлементОчереди);
	
	Результат = Новый Структура;
	Результат.Вставить("participantId",    ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
	Результат.Вставить("participant_inn",  ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
	Результат.Вставить("aggregationUnits", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьТелоЗапросаРасформирование(ОбщийЭлементОчереди)

	ТелоЗапросаРасформированиеНабора = Новый Структура;
	ТелоЗапросаРасформированиеНабора.Вставить("participant_inn", ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
	ТелоЗапросаРасформированиеНабора.Вставить("products_list",   Новый Массив);

	Возврат ТелоЗапросаРасформированиеНабора;

КонецФункции

Функция ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиИСМППоДеревуУпаковок(
	ДеревоУпаковок, ОбщийЭлементОчереди, Знач ЗагружатьДо, СообщенияJSON,
	ПараметрыОбмена, УпаковкиДокумента, КешСтатусовКодовМаркировки);
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ПараметрыАгрегации = Новый Структура;
	ПараметрыАгрегации.Вставить("ОбработанныеУпаковки",                  УпаковкиДокумента);
	ПараметрыАгрегации.Вставить("ЗагружатьДо",                           ЗагружатьДо);
	ПараметрыАгрегации.Вставить("УровниАгрегации",                       Новый Соответствие);
	ПараметрыАгрегации.Вставить("СообщенияJSONОперацияУдаление",         Новый Массив);
	ПараметрыАгрегации.Вставить("МаксимальноеКоличествоКодовВДокументе", КоличествоКодовВСообщенииАгрегация());
	ПараметрыАгрегации.Вставить("КодыНаборовКПроверке",                  Новый Массив);
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Результат = ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиИСМП(
			СтрокаДерева, ОбщийЭлементОчереди, ЗагружатьДо, СообщенияJSON,
			ПараметрыОбмена, ПараметрыАгрегации, КешСтатусовКодовМаркировки);
		
		Если Результат.ТребуетсяОбновлениеКлючаСессии Тогда
			Возврат Результат;
		КонецЕсли;
		
		Если Результат.ЕстьОшибки Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	СообщенияАгрегации = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ПараметрыАгрегации.УровниАгрегации Цикл

		Если КлючИЗначение.Значение.ТелоЗапросаСоздание.aggregationUnits.Количество() Тогда
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ДанныеСообщения", КлючИЗначение.Значение.КодыУпаковокКАгрегации);

			СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(
				КлючИЗначение.Значение.ТелоЗапросаСоздание,
				Перечисления.ВидыОперацийИСМП.АгрегацияСоздание,
				ОбщийЭлементОчереди);

			СообщениеJSON.ЗагружатьДо      = ЗагружатьДо;
			СообщениеJSON.Версия           = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;

			КлючИЗначение.Значение.СообщенияJSONОперацияДобавление.Добавить(СообщениеJSON);

		КонецЕсли;

		Если КлючИЗначение.Значение.ТелоЗапросаСозданиеНабора.aggregationUnits.Количество() Тогда
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ДанныеСообщения", КлючИЗначение.Значение.КодыНаборовКАгрегации);

			СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(
				КлючИЗначение.Значение.ТелоЗапросаСозданиеНабора,
				Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора,
				ОбщийЭлементОчереди);

			СообщениеJSON.ЗагружатьДо      = ЗагружатьДо;
			СообщениеJSON.Версия           = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;
			
			КлючИЗначение.Значение.СообщенияJSONОперацияДобавление.Добавить(СообщениеJSON);
			
		КонецЕсли;

		Если КлючИЗначение.Значение.ТелоЗапросаРасформирование.products_list.Количество() Тогда

			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ДанныеСообщения", КлючИЗначение.Значение.КодыКРасформированию);

			// Сохранить пакет кодов в сообщение.
			СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(
				КлючИЗначение.Значение.ТелоЗапросаРасформирование,
				Перечисления.ВидыОперацийИСМП.АгрегацияУдаление,
				ОбщийЭлементОчереди);

			СообщениеJSON.ЗагружатьДо      = ЗагружатьДо;
			СообщениеJSON.Версия           = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;

			ПараметрыАгрегации.СообщенияJSONОперацияУдаление.Добавить(СообщениеJSON);

		КонецЕсли;

		СообщенияАгрегации.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.СообщенияJSONОперацияДобавление);

	КонецЦикла;
	
	МаксимальныйПриоритет = Неопределено;
	Для Каждого КлючИЗначение Из СообщенияАгрегации Цикл
		Если МаксимальныйПриоритет = Неопределено Тогда
			МаксимальныйПриоритет = КлючИЗначение.Ключ;
		ИначеЕсли КлючИЗначение.Ключ > МаксимальныйПриоритет Тогда
			МаксимальныйПриоритет = КлючИЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	Если ПараметрыАгрегации.СообщенияJSONОперацияУдаление.Количество() Тогда
		Если МаксимальныйПриоритет = Неопределено Тогда
			МаксимальныйПриоритет = 1;
		КонецЕсли;
		СообщенияАгрегации.Вставить(МаксимальныйПриоритет + 1, ПараметрыАгрегации.СообщенияJSONОперацияУдаление);
	КонецЕсли;

	Результат.Вставить("СообщенияАгрегации", СообщенияАгрегации);
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьКПередачеСообщениеАгрегацииКодовМаркировкиИСМП(СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди, Знач ЗагружатьДо, СообщенияJSON,
	ПараметрыОбмена, ПараметрыАгрегации)
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
	
	КодУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
		СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);

	Если СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
		Или СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
		ПараметрыАгрегации.ОбработанныеУпаковки[КодУпаковки] = СтрокаДереваВерхнегоУровня.РодительскаяУпаковка;
	КонецЕсли;

	aggregationUnit = Новый Структура;
	aggregationUnit.Вставить("unitSerialNumber", КодУпаковки);
	Если СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
		aggregationUnit.Вставить("aggregationType", "SETS_AGGREGATION");
	Иначе
		aggregationUnit.Вставить("aggregationType", "AGGREGATION");
	КонецЕсли;
	aggregationUnit.Вставить("sntins", Новый Массив);

	aggregationUnits = Новый Массив;
	aggregationUnits.Добавить(aggregationUnit);
	Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
		aggregationUnit.sntins.Добавить(
			РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				СтрокаДерева, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее));
	КонецЦикла;

	// Количество вложенных кодов + код агрегата
	ТекущееКоличествоКодов = aggregationUnit.sntins.Количество() + 1;

	УровеньАгрегации = СтрокаДереваВерхнегоУровня.Уровень();
	ДанныеУровняАгрегации = ПараметрыАгрегации.УровниАгрегации[УровеньАгрегации + 1];

	Если ДанныеУровняАгрегации = Неопределено Тогда
		
		ДанныеУровняАгрегации = Новый Структура;
		ДанныеУровняАгрегации.Вставить("КоличествоКодов",           0);
		ДанныеУровняАгрегации.Вставить("ТелоЗапросаСоздание",       ИнициализироватьТелоЗапросаАгрегацияСоздание(ОбщийЭлементОчереди));
		ДанныеУровняАгрегации.Вставить("КодыУпаковокКАгрегации",    Новый Массив);

		ДанныеУровняАгрегации.Вставить("КоличествоКодовНаборов",    0);
		ДанныеУровняАгрегации.Вставить("ТелоЗапросаСозданиеНабора", ИнициализироватьТелоЗапросаАгрегацияСоздание(ОбщийЭлементОчереди));
		ДанныеУровняАгрегации.Вставить("КодыНаборовКАгрегации",     Новый Массив);

		ДанныеУровняАгрегации.Вставить("КоличествоКодовКРасформированию", 0);
		ДанныеУровняАгрегации.Вставить("ТелоЗапросаРасформирование",      ИнициализироватьТелоЗапросаРасформирование(ОбщийЭлементОчереди));
		ДанныеУровняАгрегации.Вставить("КодыКРасформированию",            Новый Массив);

		ДанныеУровняАгрегации.Вставить("СообщенияJSONОперацияДобавление", Новый Массив);

		ПараметрыАгрегации.УровниАгрегации[УровеньАгрегации + 1] = ДанныеУровняАгрегации;

	КонецЕсли;

	// Дополнить текущий пакет кодов.
	Если СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
		
		Если ДанныеУровняАгрегации.КоличествоКодовНаборов + ТекущееКоличествоКодов >= ПараметрыАгрегации.МаксимальноеКоличествоКодовВДокументе
			И ДанныеУровняАгрегации.КоличествоКодовНаборов > 0 Тогда
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ДанныеСообщения", ДанныеУровняАгрегации.КодыНаборовКАгрегации);

			// Сохранить пакет кодов в сообщение.
			СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(
				Новый Структура, Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора, ОбщийЭлементОчереди);
			СообщениеJSON.ЗагружатьДо        = ЗагружатьДо;
			СообщениеJSON.Версия             = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSON.ТекстСообщенияJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ДанныеУровняАгрегации.ТелоЗапросаСоздание, Истина);
			СообщениеJSON.ПараметрыЗапроса   = ПараметрыЗапроса;

			ДанныеУровняАгрегации.СообщенияJSONОперацияДобавление.Добавить(СообщениеJSON);

			// Подготовка нового пакета к заполнению.
			ДанныеУровняАгрегации.ТелоЗапросаСозданиеНабора = ИнициализироватьТелоЗапросаАгрегацияСоздание(ОбщийЭлементОчереди);
			ДанныеУровняАгрегации.КоличествоКодовНаборов    = 0;
			ДанныеУровняАгрегации.КодыНаборовКАгрегации     = Новый Массив;

		КонецЕсли;

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеУровняАгрегации.ТелоЗапросаСозданиеНабора.aggregationUnits, aggregationUnits);
		ДанныеУровняАгрегации.КодыНаборовКАгрегации.Добавить(СтрокаДереваВерхнегоУровня.Штрихкод);

	Иначе

		Если ДанныеУровняАгрегации.КоличествоКодов + ТекущееКоличествоКодов >= ПараметрыАгрегации.МаксимальноеКоличествоКодовВДокументе
			И ДанныеУровняАгрегации.КоличествоКодов > 0 Тогда
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ДанныеСообщения", ДанныеУровняАгрегации.КодыУпаковокКАгрегации);

			// Сохранить пакет кодов в сообщение.
			СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(
				Новый Структура, Перечисления.ВидыОперацийИСМП.АгрегацияСоздание, ОбщийЭлементОчереди);
			СообщениеJSON.ЗагружатьДо        = ЗагружатьДо;
			СообщениеJSON.Версия             = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSON.ТекстСообщенияJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ДанныеУровняАгрегации.ТелоЗапросаСоздание, Истина);
			СообщениеJSON.ПараметрыЗапроса   = ПараметрыЗапроса;
			
			ДанныеУровняАгрегации.СообщенияJSONОперацияДобавление.Добавить(СообщениеJSON);
			
			// Подготовка нового пакета к заполнению.
			ДанныеУровняАгрегации.ТелоЗапросаСоздание    = ИнициализироватьТелоЗапросаАгрегацияСоздание(ОбщийЭлементОчереди);
			ДанныеУровняАгрегации.КоличествоКодов        = 0;
			ДанныеУровняАгрегации.КодыУпаковокКАгрегации = Новый Массив;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеУровняАгрегации.ТелоЗапросаСоздание.aggregationUnits, aggregationUnits);
		ДанныеУровняАгрегации.КодыУпаковокКАгрегации.Добавить(СтрокаДереваВерхнегоУровня.Штрихкод);
		
	КонецЕсли;

	ДанныеУровняАгрегации.КоличествоКодов = ДанныеУровняАгрегации.КоличествоКодов + ТекущееКоличествоКодов;

	Возврат ДанныеУровняАгрегации;

КонецФункции

Функция ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиИСМП(
	СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди, Знач ЗагружатьДо, СообщенияJSON,
	ПараметрыОбмена, ПараметрыАгрегации, КешСтатусовКодовМаркировки) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	Если СтрокаДереваВерхнегоУровня.Строки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;

	Если (СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
		И СтрокаДереваВерхнегоУровня.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен) Тогда
		
		ПодготовитьКПередачеСообщениеАгрегацииКодовМаркировкиИСМП(
			СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди, ЗагружатьДо, СообщенияJSON,
			ПараметрыОбмена, ПараметрыАгрегации);
		
	// Статус упаковки отличается от статуса новой упаковки, требуется переагрегация
	ИначеЕсли ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН = СтрокаДереваВерхнегоУровня.ИННВладельца Тогда
		
		Если ЗначениеЗаполнено(СтрокаДереваВерхнегоУровня.ВидПродукции)
			И СтрокаДереваВерхнегоУровня.ВидПродукции <> ОбщийЭлементОчереди.ВидПродукции Тогда
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Упаковка %1 принадлежит к товарной группе %2. Ожидаемая товарная группа %3'"),
				СтрокаДереваВерхнегоУровня.Штрихкод,
				СтрокаДереваВерхнегоУровня.ВидПродукции,
				ОбщийЭлементОчереди.ВидПродукции);
			Результат.ЕстьОшибки = Истина;
			Возврат Результат;
		КонецЕсли;
		
		КодУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
		
		ТелоЗапросаУдаление      = Неопределено;
		ТелоЗапросаДобавление    = Неопределено;
		РезультатЗапросаПоСтроке = Неопределено;
		
		СтрокаДереваОбработана = Ложь;
		
		Если (СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
				Или СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая) Тогда
			
			РезультатЗапросаПоСтроке = КешСтатусовКодовМаркировки[КодУпаковки];
			
			Если РезультатЗапросаПоСтроке = Неопределено Тогда
				
				ПодготовитьКПередачеСообщениеАгрегацииКодовМаркировкиИСМП(
					СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди, ЗагружатьДо, СообщенияJSON,
					ПараметрыОбмена, ПараметрыАгрегации);
				
				СтрокаДереваОбработана = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не СтрокаДереваОбработана Тогда
			
			Если РезультатЗапросаПоСтроке = Неопределено Тогда
				
				СтрокаКодаМаркировки = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(КодУпаковки, ОбщийЭлементОчереди.ВидПродукции);
				
				РезультатЗапросаДанных = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
					СтрокаКодаМаркировки,
					ОбщийЭлементОчереди.Организация);
				
				Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаДанных, ОбщийЭлементОчереди, ПараметрыОбмена) Тогда
					Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
					Возврат Результат;
				ИначеЕсли ЗначениеЗаполнено(РезультатЗапросаДанных.ТекстОшибки) Тогда
					Результат.ТекстОшибки = РезультатЗапросаДанных.ТекстОшибки;
					Результат.ЕстьОшибки = Истина;
					Возврат Результат;
				КонецЕсли;
				
				РезультатЗапросаПоСтроке = РезультатЗапросаДанных.СтатусыКодовМаркировки.Получить(СтрокаКодаМаркировки);
				
			КонецЕсли;
			
			ВложенныеШтрихкодыУпаковокИзРезультатаЗапросаДанных = Новый Соответствие;
			
			Если РезультатЗапросаПоСтроке <> Неопределено
				И РезультатЗапросаПоСтроке.ВложенныеУпаковки <> Неопределено Тогда
				
				Для Каждого КлючИЗначение Из РезультатЗапросаПоСтроке.ВложенныеУпаковки Цикл
					Если КлючИЗначение.Ключ.ДанныеРазбора = Неопределено Тогда
						КодМаркировки = КлючИЗначение.Ключ.Штрихкод;
					Иначе
						КодМаркировки = КлючИЗначение.Ключ.ДанныеРазбора.НормализованныйКодМаркировки;
					КонецЕсли;
					ВложенныеШтрихкодыУпаковокИзРезультатаЗапросаДанных[КодМаркировки] = КлючИЗначение.Ключ;
				КонецЦикла;
				
			КонецЕсли;
			
			ПараметрыАгрегации.ОбработанныеУпаковки[КодУпаковки] = СтрокаДереваВерхнегоУровня.РодительскаяУпаковка;
			
			ВложенныеУпаковки = Новый Соответствие;
			Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
				
				Если СтрокаДерева.ДанныеРазбора = Неопределено Тогда
					КодМаркировки = СтрокаДерева.Штрихкод;
				Иначе
					КодМаркировки = СтрокаДерева.ДанныеРазбора.НормализованныйКодМаркировки;
				КонецЕсли;
				
				ВложенныеУпаковки.Вставить(КодМаркировки, СтрокаДерева);
				
				ТребуетсяДобавление = (ВложенныеШтрихкодыУпаковокИзРезультатаЗапросаДанных[КодМаркировки] = Неопределено);
				Если ТребуетсяДобавление Тогда
					
					КодМаркировкиДляПередачи = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
						СтрокаДерева, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
					
					reaggregationUnit = Новый Структура;
					reaggregationUnit.Вставить("uit_uitu", КодМаркировкиДляПередачи);
					
					Если ТелоЗапросаДобавление = Неопределено Тогда
						ТелоЗапросаДобавление = Новый Структура;
						
						ТелоЗапросаДобавление.Вставить("participantId",      ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
						ТелоЗапросаДобавление.Вставить("participant_inn",    ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
						ТелоЗапросаДобавление.Вставить("reaggregation_type", "ADDING");
						ТелоЗапросаДобавление.Вставить("uitu",               КодУпаковки);
						ТелоЗапросаДобавление.Вставить("uit_uitu_list",      Новый Массив);
					КонецЕсли;
					
					ТелоЗапросаДобавление.uit_uitu_list.Добавить(reaggregationUnit);
					
					Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого КлючИЗначение Из ВложенныеШтрихкодыУпаковокИзРезультатаЗапросаДанных Цикл
				
				КодМаркировки = КлючИЗначение.Ключ;
				СтрокаДанных  = КлючИЗначение.Значение;
				
				ТребуетсяУдаление = (ВложенныеУпаковки[КодМаркировки] = Неопределено);
				Если ТребуетсяУдаление Тогда
					
					КодМаркировкиДляПередачи = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
						СтрокаДанных, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
					
					Если ТелоЗапросаУдаление = Неопределено Тогда
						ТелоЗапросаУдаление = Новый Структура;
						
						ТелоЗапросаУдаление.Вставить("participantId",      ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
						ТелоЗапросаУдаление.Вставить("participant_inn",    ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
						ТелоЗапросаУдаление.Вставить("reaggregation_type", "REMOVING");
						ТелоЗапросаУдаление.Вставить("uitu",               КодУпаковки);
						ТелоЗапросаУдаление.Вставить("uit_uitu_list",      Новый Массив);
					КонецЕсли;
					
					reaggregationUnit = Новый Структура;
					reaggregationUnit.Вставить("uit_uitu", КодМаркировкиДляПередачи);
					ТелоЗапросаУдаление.uit_uitu_list.Добавить(reaggregationUnit);
					
					Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Упаковка %1 принадлежит ИНН %2'"),
			СтрокаДереваВерхнегоУровня.Штрихкод,
			СтрокаДереваВерхнегоУровня.ИННВладельца);
		Результат.ЕстьОшибки = Истина;
		
		Возврат Результат;

	КонецЕсли;
	
	Если Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение Тогда
		
		Если ТелоЗапросаДобавление <> Неопределено И ТелоЗапросаДобавление.uit_uitu_list.Количество() > 0 Тогда
			
			СообщениеJSON = СтруктураСообщенияJSON();
			СообщениеJSON.Идентификатор = Строка(Новый УникальныйИдентификатор());
			СообщениеJSON.ЗагружатьДо   = ЗагружатьДо;
			
			СообщениеJSON.Организация       = ОбщийЭлементОчереди.Организация;
			СообщениеJSON.Документ          = ОбщийЭлементОчереди.Документ;
			СообщениеJSON.ДокументОснование = ОбщийЭлементОчереди.ДокументОснование;
			
			СообщениеJSON.Описание = СтрШаблон(
				НСтр("ru = '%1 %2 (добавление)'"),
				ОписаниеОперацииПередачиДанных(Операция),
				СтрокаДереваВерхнегоУровня.Штрихкод);
			
			СообщениеJSON.ТекстСообщенияJSON  = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапросаДобавление, Истина);
			СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
			СообщениеJSON.Версия              = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSON.ТребуетсяПодписание = Истина;
			СообщениеJSON.СообщениеОснование  = ОбщийЭлементОчереди.Сообщение;
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить(
				"ДанныеСообщения",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					СтрокаДереваВерхнегоУровня.Штрихкод));
			СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;
			
			СообщениеJSON.ВидПродукции = ОбщийЭлементОчереди.ВидПродукции;
			СообщениеJSON.Операция     = Операция;
			СообщениеJSON.Назначение   = Перечисления.НазначениеСообщенийИСМП.ИСМП;
			
			СообщенияJSON.Добавить(СообщениеJSON);
			
		КонецЕсли;
		
		Если ТелоЗапросаУдаление <> Неопределено И ТелоЗапросаУдаление.uit_uitu_list.Количество() > 0 Тогда
			
			СообщениеJSONУдаление = СтруктураСообщенияJSON();
			СообщениеJSONУдаление.Идентификатор = Строка(Новый УникальныйИдентификатор());
			СообщениеJSONУдаление.ЗагружатьДо   = ЗагружатьДо;
			
			СообщениеJSONУдаление.Организация       = ОбщийЭлементОчереди.Организация;
			СообщениеJSONУдаление.Документ          = ОбщийЭлементОчереди.Документ;
			СообщениеJSONУдаление.ДокументОснование = ОбщийЭлементОчереди.ДокументОснование;
			
			СообщениеJSONУдаление.Описание = СтрШаблон(
				НСтр("ru = '%1 %2 (изменение)'"),
				ОписаниеОперацииПередачиДанных(Операция),
				СтрокаДереваВерхнегоУровня.Штрихкод);
			
			СообщениеJSONУдаление.ТекстСообщенияJSON  = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапросаУдаление, Истина);
			СообщениеJSONУдаление.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
			СообщениеJSONУдаление.Версия              = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
			СообщениеJSONУдаление.ТребуетсяПодписание = Истина;
			СообщениеJSONУдаление.СообщениеОснование  = ОбщийЭлементОчереди.Сообщение;
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить(
				"ДанныеСообщения",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					СтрокаДереваВерхнегоУровня.Штрихкод));
			СообщениеJSONУдаление.ПараметрыЗапроса = ПараметрыЗапроса;
			
			СообщениеJSONУдаление.ВидПродукции = ОбщийЭлементОчереди.ВидПродукции;
			СообщениеJSONУдаление.Операция     = Операция;
			СообщениеJSONУдаление.Назначение   = Перечисления.НазначениеСообщенийИСМП.ИСМП;
			
			ПараметрыАгрегации.СообщенияJSONОперацияУдаление.Добавить(СообщениеJSONУдаление);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл

		Результат = ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиИСМП(
			СтрокаДерева, ОбщийЭлементОчереди,
			ЗагружатьДо, СообщенияJSON, ПараметрыОбмена, ПараметрыАгрегации, КешСтатусовКодовМаркировки);

		Если Результат.ЕстьОшибки Или Результат.ТребуетсяОбновлениеКлючаСессии Тогда
			Возврат Результат;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиМОТП(ПараметрыОбработки, СтрокаДереваВерхнегоУровня) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",  Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Если СтрокаДереваВерхнегоУровня.Строки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбщийЭлементОчереди = ПараметрыОбработки.ЭлементОчереди;
	ПространствоИмен    = ПараметрыОбработки.МетаданныеXDTO.АгрегацияМОТП.ПространствоИмен;
	
	КоличествоКодовВДокументе = КоличествоКодовВСообщенииАгрегация();
	
	Если ПараметрыОбработки.СообщениеАгрегации = Неопределено Тогда
		
		РеквизитыОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ПараметрыОбработки.ДанныеШапки.Организация);
		ПараметрыОбработки.ДанныеШапки.Вставить("ИНН", РеквизитыОрганизации.ИНН);
		
		ФайлXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "Файл");
		УведомлениеXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "Уведомление", ФайлXDTO);
		СведенияОбАгрегацииXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "СведенияОбАгрегации", УведомлениеXDTO);
		ПараметрыОбработки.Вставить("СведенияОбАгрегацииXDTO", СведенияОбАгрегацииXDTO);
		
		// Инициализация
		АгрегацияСоздание = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание;
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(Новый Структура, АгрегацияСоздание, ОбщийЭлементОчереди);
		СообщениеJSON.Версия = ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
		
		ПараметрыОбработки.СообщениеАгрегации = СообщениеJSON;
		
		ПараметрыОбработки.Вставить("КоличествоВТекущейГруппе", 0);
		ПараметрыОбработки.Вставить("ТекущийПакетКодов",        Новый Массив);
		ПараметрыОбработки.Вставить("КодыУпаковокКАгрегации",   Новый Массив);
		
		КоличествоВТекущейГруппе = 0;
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("ПакетКодовВерхнегоУровня", Новый Массив);
		ДанныеСообщения.Вставить("КодыУпаковокКАгрегации",   Новый Массив);
		
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
		
		РезультатПодготовкиСообщений = ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиМОТП(ПараметрыОбработки, СтрокаДерева);
		Если РезультатПодготовкиСообщений.ЕстьОшибки Тогда
			Возврат РезультатПодготовкиСообщений;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаДереваВерхнегоУровня) = Тип("ДеревоЗначений") Тогда
			
			Если КоличествоВТекущейГруппе + ПараметрыОбработки.КоличествоВТекущейГруппе > КоличествоКодовВДокументе Тогда
				
				Если ДанныеСообщения.ПакетКодовВерхнегоУровня.Количество() Тогда 
					ЗаполнитьДанныеОГрупповыхУпаковкахXDTO(ДанныеСообщения, ПараметрыОбработки);
					ДанныеСообщения.ПакетКодовВерхнегоУровня = Новый Массив;
					ДанныеСообщения.КодыУпаковокКАгрегации   = Новый Массив;
				КонецЕсли;
				
				КоличествоВТекущейГруппе = 0;
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеСообщения.ПакетКодовВерхнегоУровня, ПараметрыОбработки.ТекущийПакетКодов);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеСообщения.КодыУпаковокКАгрегации,   ПараметрыОбработки.КодыУпаковокКАгрегации);
			КоличествоВТекущейГруппе = КоличествоВТекущейГруппе + ПараметрыОбработки.КоличествоВТекущейГруппе;
			
			ПараметрыОбработки.ТекущийПакетКодов        = Новый Массив;
			ПараметрыОбработки.КоличествоВТекущейГруппе = 0;
			ПараметрыОбработки.КодыУпаковокКАгрегации   = Новый Массив;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(СтрокаДереваВерхнегоУровня) = Тип("ДеревоЗначений") Тогда
		
		Если КоличествоВТекущейГруппе > 0 Тогда
			ЗаполнитьДанныеОГрупповыхУпаковкахXDTO(ДанныеСообщения, ПараметрыОбработки);
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокаДереваВерхнегоУровня.Статус = Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен
		Или СтрокаДереваВерхнегоУровня.Статус = Неопределено
		Или ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН = СтрокаДереваВерхнегоУровня.ИННВладельца Тогда
		
		СведенияОбАгрегацииXDTO = ПараметрыОбработки.СведенияОбАгрегацииXDTO;
		ГрупповаяУпаковкаXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(
			ПространствоИмен, "ИнформацияОбАгрегировании", СведенияОбАгрегацииXDTO);
		
		КодУпаковки = ШтрихкодированиеИСМП.КодМаркировкиДляПередачиИСМП(
			СтрокаДереваВерхнегоУровня, ПараметрыОбработки.ПараметрыНормализации);
		
		ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(
			ГрупповаяУпаковкаXDTO, "КодГрупповойУпаковки", КодУпаковки, ПараметрыОбработки.СообщениеАгрегации);
		
		Если СтрокаДереваВерхнегоУровня.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(
				ГрупповаяУпаковкаXDTO, "ТипУпаковки", "Транспортная", ПараметрыОбработки.СообщениеАгрегации);
		Иначе
			ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(
				ГрупповаяУпаковкаXDTO, "ТипУпаковки", "Потребительская", ПараметрыОбработки.СообщениеАгрегации);
		КонецЕсли;
		
		ВложенныеКоды = Новый Массив;
		Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
			
			ВложенныеКоды.Добавить(
				ШтрихкодированиеИСМП.КодМаркировкиДляПередачиИСМП(
				СтрокаДерева, ПараметрыОбработки.ПараметрыНормализации));
			
		КонецЦикла;
		
		ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(
			ГрупповаяУпаковкаXDTO, "СписокКодовИдентификации",
			СтрСоединить(ВложенныеКоды, " "), ПараметрыОбработки.СообщениеАгрегации);
		
		ПараметрыОбработки.КоличествоВТекущейГруппе = ПараметрыОбработки.КоличествоВТекущейГруппе + ВложенныеКоды.Количество();
		ПараметрыОбработки.ТекущийПакетКодов.Добавить(ГрупповаяУпаковкаXDTO);
		ПараметрыОбработки.КодыУпаковокКАгрегации.Добавить(СтрокаДереваВерхнегоУровня.Штрихкод);
		
	Иначе
		
		Результат.ЕстьОшибки = Истина;
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Упаковка %1 принадлежит ИНН %2'"),
			СтрокаДереваВерхнегоУровня.Штрихкод,
			СтрокаДереваВерхнегоУровня.ИННВладельца);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.СообщениеАгрегации.ТекстОшибки) Тогда
		Результат.ЕстьОшибки = Истина;
		Результат.ТекстОшибки =СтрШаблон(
			НСтр("ru = 'Внутренная ошибка формирования XML:
			|%1'"),
			ПараметрыОбработки.СообщениеАгрегации.ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьФайлXDTOДляАгрегации(ПространствоИмен, ПараметрыОбработки, СообщениеJSON)
	ФайлXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "Файл");
	
	ВерсияПрограммы = ИнтерфейсМОТПСлужебный.ВерсияПрограммы();
	ИмяФайла        = ИнтерфейсМОТПСлужебный.ИмяФайлаXDTO(
		ПараметрыОбработки.ДанныеШапки, ПараметрыОбработки.МетаданныеXDTO.АгрегацияМОТП);
	
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(ФайлXDTO, "ИмяФайла",        ИмяФайла,        СообщениеJSON);
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(ФайлXDTO, "ВерсияПрограммы", ВерсияПрограммы, СообщениеJSON);
	
	// Уведомление
	УведомлениеXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "Уведомление", ФайлXDTO);
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(ФайлXDTO, "Уведомление", УведомлениеXDTO, СообщениеJSON);
	СведенияОбАгрегацииXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "СведенияОбАгрегации", УведомлениеXDTO);
	
	ЗначениеДаты = Формат(ПараметрыОбработки.ДанныеШапки.Дата, "ДФ=dd.MM.yyyy;");
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(СведенияОбАгрегацииXDTO, "Дата",  ЗначениеДаты,    СообщениеJSON);
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(СведенияОбАгрегацииXDTO, "Время", ПараметрыОбработки.ДанныеШапки.Дата, СообщениеJSON);
	
	// ИНН
	ИННXDTO = ИнтеграцияИС.ОбъектXDTOПоИмениСвойства(ПространствоИмен, "ИНН", СведенияОбАгрегацииXDTO);
	Если СтрДлина(ПараметрыОбработки.ДанныеШапки.ИНН) > 10 Тогда
		ИмяПоляИНН = "ИННФЛТип";
	Иначе
		ИмяПоляИНН = "ИННЮЛТип";
	КонецЕсли;
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(ИННXDTO, ИмяПоляИНН, ПараметрыОбработки.ДанныеШапки.ИНН, СообщениеJSON);
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(СведенияОбАгрегацииXDTO, "ИНН", ИННXDTO, СообщениеJSON);
	
	// Сведения об агрегации
	ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(
		УведомлениеXDTO, "СведенияОбАгрегации", СведенияОбАгрегацииXDTO, СообщениеJSON);
		
	Возврат ФайлXDTO;
КонецФункции

Процедура ЗаполнитьДанныеОГрупповыхУпаковкахXDTO(ДанныеСообщения, ПараметрыОбработки)
	
	ОбщийЭлементОчереди = ПараметрыОбработки.ЭлементОчереди;
	ПространствоИмен    = ПараметрыОбработки.МетаданныеXDTO.АгрегацияМОТП.ПространствоИмен;
	
	АгрегацияСоздание = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание;
	СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(Новый Структура, АгрегацияСоздание, ОбщийЭлементОчереди);
	СообщениеJSON.ЗагружатьДо = ОбщийЭлементОчереди.Сообщение;
	
	ПараметрыОбработки.СообщениеАгрегации = СообщениеJSON;
	
	ФайлXDTO = ПодготовитьФайлXDTOДляАгрегации(ПространствоИмен, ПараметрыОбработки, СообщениеJSON);
	
	Для Каждого ГрупповаяУпаковкаXDTO Из ДанныеСообщения.ПакетКодовВерхнегоУровня Цикл
		ИнтеграцияИСМПСлужебный.ЗаполнитьСвойствоXDTO(
			ФайлXDTO.Уведомление.СведенияОбАгрегации,
			"ИнформацияОбАгрегировании",
			ГрупповаяУпаковкаXDTO,
			ПараметрыОбработки.СообщениеАгрегации);
	КонецЦикла;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДанныеСообщения", ДанныеСообщения.КодыУпаковокКАгрегации);
	СообщениеJSON.ПараметрыЗапроса = ПараметрыЗапроса;
	
	ПараметрыОбработки.ДанныеСообщений.Вставить(СообщениеJSON, ФайлXDTO);
	
КонецПроцедуры

// Инициализация параметров проверки агрегатов при подготовке сообщений к передаче
//
// Возвращаемое значение:
//  Структура:
//  * ПараметрыПроверкиИерархииАгрегатов - Неопределено
//  * КонтролироватьДопустимуюИерархиюУпаковок - Булево.
//  * КонтролироватьСоставАгрегатаПоДаннымИСМП - Булево.
//  * ПараметрыНормализации - Неопределено.
//  * КонтролироватьСоставГрупповойУпаковки - Булево.
Функция ИнициализироватьПараметрыПроверкиАгрегатов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыПроверкиИерархииАгрегатов",       Неопределено);
	Результат.Вставить("КонтролироватьДопустимуюИерархиюУпаковок", Ложь);
	Результат.Вставить("КонтролироватьСоставАгрегатаПоДаннымИСМП", Ложь);
	Результат.Вставить("ПараметрыНормализации",                    Неопределено);
	Результат.Вставить("КонтролироватьСоставГрупповойУпаковки",    Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьКонтрольСоставаАгрегатаПоДаннымИСМП(СтрокаДереваВерхнегоУровня, ОбщийЭлементОчереди, ПараметрыОбмена, ПараметрыНормализации)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",  Ложь);
	Результат.Вставить("ОбщиеОшибки", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	Если СтрокаДереваВерхнегоУровня.Строки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокаДереваВерхнегоУровня.Статус <> Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен Тогда
		
		Если ОбщийЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН <> СтрокаДереваВерхнегоУровня.ИННВладельца Тогда
			
			Результат.ЕстьОшибки = Истина;
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Упаковка %1 принадлежит ИНН %2'"),
				СтрокаДереваВерхнегоУровня.Штрихкод,
				СтрокаДереваВерхнегоУровня.ИННВладельца);
			Возврат Результат;
			
		КонецЕсли;
		
		КодУпаковки = ШтрихкодированиеИСМП.КодМаркировкиДляПередачиИСМП(
			СтрокаДереваВерхнегоУровня, ПараметрыНормализации);
		
		ВложенныеКодыМаркировки = Новый Соответствие;
		Для Каждого СтрокаДерева Из СтрокаДереваВерхнегоУровня.Строки Цикл
			ВложенныеКодыМаркировки.Вставить(СтрокаДерева.НормализованныйШтрихкод, Истина);
		КонецЦикла;
		
		СтрокаКодаМаркировки = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(КодУпаковки, ОбщийЭлементОчереди.ВидПродукции);
		
		РезультатЗапросаДанных = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
			СтрокаКодаМаркировки,
			ОбщийЭлементОчереди.Организация);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаДанных, ОбщийЭлементОчереди, ПараметрыОбмена) Тогда
			Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат Результат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатЗапросаДанных.ТекстОшибки) Тогда
			Результат.ТекстОшибки = РезультатЗапросаДанных.ТекстОшибки;
			Результат.ЕстьОшибки  = Истина;
			Результат.ОбщиеОшибки = Истина;
			Возврат Результат;
		КонецЕсли;
		
		РезультатЗапросаПоСтроке = РезультатЗапросаДанных.СтатусыКодовМаркировки.Получить(СтрокаКодаМаркировки);
		
		Если РезультатЗапросаПоСтроке <> Неопределено
			И РезультатЗапросаПоСтроке.ВложенныеУпаковки <> Неопределено Тогда
			Для Каждого КлючИЗначение Из РезультатЗапросаПоСтроке.ВложенныеУпаковки Цикл
				Если ВложенныеКодыМаркировки.Получить(КлючИЗначение.Ключ.НормализованныйШтрихкод) = Неопределено Тогда
					Результат.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Упаковка %1 по данным ГИС МТ содержит коды, которых нет в новой агрегации.
					           |Операция удаления кодов из агрегатов для табачной продукции не поддерживается. Создайте новую упаковку.'"),
					КодУпаковки);
				Результат.ЕстьОшибки = Истина;
				Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Контроль вложенности упаковок при подготовке сообщений агрегации через СУЗ.
// 
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - строка верхнего уровня.
//  ПодчиненнаяСтрокаДерева - СтрокаДереваЗначений - добавляемая строка.
//  ПараметрыПроверки - См. ИнициализироватьПараметрыПроверкиАгрегатов.
// 
// Возвращаемое значение:
//  Строка - Описание ошибок, найденных при проверке. Пустая строка, если ошибок не найдено.
//
Функция ВыполнитьКонтрольДопустимойИерархииУпаковки(СтрокаДерева, ПодчиненнаяСтрокаДерева, ПараметрыПроверки) Экспорт
	
	Результат = "";
	ПараметрыПроверкиИерархииАгрегатов = ПараметрыПроверки.ПараметрыПроверкиИерархииАгрегатов;
	ДопустимыеВложенияПоВидуУпаковки   = ПараметрыПроверкиИерархииАгрегатов.Получить(СтрокаДерева.ВидУпаковки);
	ДопустимыеВложенияПоТипуШтрихкода  = ПараметрыПроверкиИерархииАгрегатов.Получить(СтрокаДерева.ТипШтрихкода);
	
	Если Не ЗначениеЗаполнено(ПодчиненнаяСтрокаДерева.ВидУпаковки) Тогда
		
		Результат = СтрШаблон(
			НСтр("ru = 'Не удалось определить вид упаковки (не заполнен коэффициент) для %1.'"),
			ПодчиненнаяСтрокаДерева.Штрихкод);
		
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаДерева.ВидУпаковки) Тогда
		
		Результат = СтрШаблон(
			НСтр("ru = 'Не удалось определить вид упаковки (не заполнен коэффициент) для %1.'"),
			СтрокаДерева.Штрихкод);
		
	ИначеЕсли ДопустимыеВложенияПоВидуУпаковки <> Неопределено
		И ДопустимыеВложенияПоВидуУпаковки.Найти(ПодчиненнаяСтрокаДерева.ВидУпаковки) = Неопределено
		И (СтрокаДерева.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
		   Или СтрокаДерева.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
		       И ДопустимыеВложенияПоТипуШтрихкода <> Неопределено
		       И ДопустимыеВложенияПоТипуШтрихкода.Найти(ПодчиненнаяСтрокаДерева.ВидУпаковки) = Неопределено) Тогда
		
		Результат = СтрШаблон(
			НСтр("ru = '%1 упаковка %2 не может содержать %3'"),
			СтрокаДерева.ВидУпаковки,
			СтрокаДерева.Штрихкод,
			ПодчиненнаяСтрокаДерева.Штрихкод);
		
	ИначеЕсли ПодчиненнаяСтрокаДерева.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
		И ДопустимыеВложенияПоТипуШтрихкода <> Неопределено Тогда
		Если ДопустимыеВложенияПоТипуШтрихкода.Найти(ПодчиненнаяСтрокаДерева.ТипШтрихкода) = Неопределено Тогда
			
			Результат = СтрШаблон(
				НСтр("ru = '%1 упаковка %2 не может содержать %3'"),
				СтрокаДерева.ТипШтрихкода,
				СтрокаДерева.Штрихкод,
				ПодчиненнаяСтрокаДерева.Штрихкод);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыПроверки.Свойство("КонтролироватьСоставГрупповойУпаковки")
		И ПараметрыПроверки.КонтролироватьСоставГрупповойУпаковки
		И СтрокаДерева.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая") Тогда
		
		ВложенныеСтрокиГрупповойУпаковки = СтрокаДерева.Строки;
		ТекущийТипШтрихкода              = ПодчиненнаяСтрокаДерева.ТипШтрихкода;
		
		Для Каждого ВложеннаяСтрокаДерева Из ВложенныеСтрокиГрупповойУпаковки Цикл
			
			Если ВложеннаяСтрокаДерева.ТипШтрихкода <> ТекущийТипШтрихкода Тогда
				Результат = СтрШаблон(
					НСтр("ru = '%1 упаковка %2 не может содержать разные шаблоны кодов маркировки'"),
					СтрокаДерева.ВидУпаковки,
					СтрокаДерева.Штрихкод);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыПроверки.КонтролироватьСоставГрупповойУпаковки = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСоставДопустимуюИерерхиюДереваУпаковок(ДеревоУпаковок, ОбщийЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	МассивОшибок = Новый Массив;

	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		РезультатПроверки = ПроверитьСоставДопустимуюИерархиюУпаковки(СтрокаДерева, ОбщийЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки);
		Если РезультатПроверки.ЕстьОшибки Тогда
			Результат.ЕстьОшибки = Истина;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОшибок, РезультатПроверки.НайденныеОшибки);
		КонецЕсли;
		
		Если РезультатПроверки.ТребуетсяОбновлениеКлючаСессии Тогда
			Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.ЕстьОшибки Тогда
		Результат.ТекстОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСоставДопустимуюИерархиюУпаковки(СтрокаДерева, ОбщийЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки", Ложь);
	Результат.Вставить("НайденныеОшибки", Новый Массив);
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	Если ПараметрыПроверки.КонтролироватьСоставАгрегатаПоДаннымИСМП Тогда
		
		РезультатПроверки = ВыполнитьКонтрольСоставаАгрегатаПоДаннымИСМП(СтрокаДерева, ОбщийЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки.ПараметрыНормализации);
		Если РезультатПроверки.ТребуетсяОбновлениеКлючаСессии Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		Если РезультатПроверки.ЕстьОшибки Тогда
			Результат.НайденныеОшибки.Добавить(РезультатПроверки.ТекстОшибки);
		КонецЕсли;
		Если РезультатПроверки.ОбщиеОшибки Тогда
			ПараметрыПроверки.КонтролироватьСоставАгрегатаПоДаннымИСМП = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыПроверкиВложенныхСтрок = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыПроверки);
	
	Для Каждого ПодчиненнаяСтрокаДерева Из СтрокаДерева.Строки Цикл
		
		Если ПараметрыПроверки.КонтролироватьДопустимуюИерархиюУпаковок Тогда
			РезультатПроверки = ВыполнитьКонтрольДопустимойИерархииУпаковки(СтрокаДерева, ПодчиненнаяСтрокаДерева, ПараметрыПроверкиВложенныхСтрок);
			Если ЗначениеЗаполнено(РезультатПроверки) Тогда
				Результат.НайденныеОшибки.Добавить(РезультатПроверки);
			КонецЕсли;
		КонецЕсли;
		
		Если ПодчиненнаяСтрокаДерева.Строки.Количество() Тогда
			
			РезультатПроверки = ПроверитьСоставДопустимуюИерархиюУпаковки(ПодчиненнаяСтрокаДерева, ОбщийЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки);
			Если РезультатПроверки.ТребуетсяОбновлениеКлючаСессии Тогда
				Возврат РезультатПроверки;
			КонецЕсли;
			Если РезультатПроверки.ЕстьОшибки Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат.НайденныеОшибки, РезультатПроверки.НайденныеОшибки);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если Результат.НайденныеОшибки.Количество() Тогда
		Результат.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПриемкаТоваровИСМП

//Преобразовывает вид операции документа к строковому представлению для передачи в ИС МП
//
// Параметры:
//  ОперацияДокумента - ПеречислениеСсылка.ВидыОперацийИСМП - операция документа.
//  СообщениеJSON - См. ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON.
//
// Возвращаемое значение:
//  Строка, Неопределено - вид операции для ИС МП.
Функция ВидОперацииДокументаИСМП(ОперацияДокумента, СообщениеJSON)
	
	ВидОперации = Неопределено;
	
	Если ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаПродажа Тогда
		ВидОперации = "SELLING";
	ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаКомиссия Тогда
		ВидОперации = "COMMISSION";
	ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаАгент Тогда
		ВидОперации = "AGENT";
	ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаБезвозмезднаяПередача Тогда
		ВидОперации = "SELLING";
	ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаПриобретениеГосПредприятием Тогда
		ВидОперации = "SELLING";
	ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаДляСобственныхНуждПокупателя Тогда
		ВидОперации = "SELLING";
	ИначеЕсли ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля
		Или ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ
		Или ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ Тогда
		ВидОперации = "";
	Иначе
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			СтрШаблон(
				НСтр("ru = 'Неизвестный вид операции документа Приемка товаров ИС МП: %1'"), ОперацияДокумента));
	КонецЕсли;
	
	Возврат ВидОперации;
	
КонецФункции

Процедура ДополнитьКолонкиДереваДаннымиОперацииЕАЭС(ДеревоУпаковок)
	
	ДеревоУпаковок.Колонки.Добавить("ЗаполнятьДанныеОперацииЕАЭС", Новый ОписаниеТипов("Булево"));
	ДеревоУпаковок.Колонки.Добавить("КодТНВЭД", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	ДеревоУпаковок.Колонки.Добавить("Цена",     ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ДеревоУпаковок.Колонки.Добавить("СуммаНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ДеревоУпаковок.Колонки.Добавить("ВидДокументаСертификации",   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДокументовОбязательнойСертификацииИС"));
	ДеревоУпаковок.Колонки.Добавить("НомерДокументаСертификации", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДеревоУпаковок.Колонки.Добавить("ДатаДокументаСертификации",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
КонецПроцедуры

Функция ДополнитьДеревоУпаковокДаннымиТоваров(ДеревоУпаковок, ИсточникДанных, ИменаКолонокДляЗаполнения, СообщениеJSON)
	
	ЕстьОшибки = Ложь;
	
	ПараметрыОтбора = ИнтеграцияИС.ПоляПоискаМаркируемойПродукции(Истина);
	ПараметрыОтбораGTIN = Новый Структура("GTIN");
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаДерева);
			СтрокаДерева.ЗаполнятьДанныеОперацииЕАЭС = Истина;
			НайденныеСтроки = ИсточникДанных.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 И ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
				ЗаполнитьЗначенияСвойств(ПараметрыОтбораGTIN, СтрокаДерева);
				НайденныеСтроки = ИсточникДанных.НайтиСтроки(ПараметрыОтбораGTIN);
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Если ЗначениеЗаполнено(СтрокаДерева.Номенклатура) Тогда
					ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
						СообщениеJSON,
						СтрШаблон(
							НСтр("ru = 'В табличной части ""Товары"" не найдена номенклатура %1.'"),
							ИнтеграцияИС.ПредставлениеНоменклатуры(
								ПараметрыОтбора.Номенклатура,
								ПараметрыОтбора.Характеристика,,
								ПараметрыОтбора.Серия)));
					ЕстьОшибки = Истина;
				Иначе
					ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
						СообщениеJSON,
						СтрШаблон(
							НСтр("ru = 'В табличной части ""Товары"" не найдена строка с GTIN %1.'"),
							ПараметрыОтбораGTIN.GTIN));
					ЕстьОшибки = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СтрокаИсточникаДанных Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаИсточникаДанных, ИменаКолонокДляЗаполнения);
				Прервать;
			КонецЦикла;
		Иначе
			ЕстьОшибки = ЕстьОшибки Или ДополнитьДеревоУпаковокДаннымиТоваров(СтрокаДерева, ИсточникДанных, ИменаКолонокДляЗаполнения, СообщениеJSON);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьОшибки;
	
КонецФункции

// Выполняет сравнение двух деревьев значений: Дерева по данным информационной базы, сформированнное по данным документа
//  и дерева, полученного из сервиса ИС МП.
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - См. ИнициализироватьДеревоУпаковок.
//  ДеревоУпаковокПоДаннымСервиса - ДеревоЗначений - Дерево, полученное из сервиса Гос. ИС.
//  ПолнаяПроверкаДеревьев - Булево - Истина, если требуется двухстороннее сравнение деревьев.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами - См. ВыявитьРасхожденияВСтрокахДеревьев
Функция ВыявитьРасхожденияВСоставахДеревьев(ДеревоУпаковок, ДеревоУпаковокПоДаннымСервиса, ПолнаяПроверкаДеревьев = Истина)
	
	КэшПроверенныхСтрок = Новый Соответствие;
	КэшНенайденныхСтрок = Новый Массив;

	ДеревоУпаковокПоДаннымСервиса.Строки.Сортировать("Штрихкод", Истина);
	
	ДеревоУпаковокПоДаннымСервиса.Колонки.Добавить("НарушенСостав",         Новый ОписаниеТипов("Булево"));
	ДеревоУпаковокПоДаннымСервиса.Колонки.Добавить("НайденаВДругойКоробке", Новый ОписаниеТипов("Булево"));
	ДеревоУпаковокПоДаннымСервиса.Колонки.Добавить("ОтсутствуетПоДаннымИБ", Новый ОписаниеТипов("Булево"));
	
	Если ПолнаяПроверкаДеревьев Тогда
		РезультатПроверки = ВыявитьРасхожденияВСтрокахДеревьев(ДеревоУпаковок, ДеревоУпаковокПоДаннымСервиса, КэшПроверенныхСтрок,
			КэшНенайденныхСтрок, Истина);
		Если РезультатПроверки.ЕстьОшибки и КэшНенайденныхСтрок.Количество() > 0 Тогда
			РезультатПроверки.ТекстОшибки = СтрШаблон(
				НСтр("ru='Невозможно принять документ, выявлены излишки. %1'"),
				КэшНенайденныхСтрок[0].Штрихкод);
			Возврат РезультатПроверки;
		КонецЕсли;
	КонецЕсли;
	РезультатПроверки = ВыявитьРасхожденияВСтрокахДеревьев(ДеревоУпаковокПоДаннымСервиса, ДеревоУпаковок, КэшПроверенныхСтрок,
		КэшНенайденныхСтрок, Ложь);
	
	Если РезультатПроверки.ЕстьОшибки
		И Не ЗначениеЗаполнено(РезультатПроверки.ТекстОшибки) Тогда
		РезультатПроверки.ТекстОшибки = СтрШаблон(
			НСтр("ru='Невозможно принять документ, выявлены расхождения. %1'"),
			КэшНенайденныхСтрок[0].Штрихкод);
	КонецЕсли;

	Возврат РезультатПроверки;
	
КонецФункции

// Выполняет поиск переданной строки в дереве значений. Поиск выполняется полным перебором строк в дереве значений
//
// Параметры:
//  СтрокаПоиска - СтрокаДереваЗначений - Строка дерева значений
//  ДеревоПроверки - ДеревоЗначений - Дерево значений, в котором осуществляется поиск
//
// Возвращаемое значение:
//  Неопределено, СтрокаДереваЗначений - Найденная строка дерева значений.
Функция НайтиСтрокиВИсходномДереве(СтрокаПоиска, ДеревоПроверки) Экспорт
	
	НайденнаяСтрока = Неопределено;
	СоответствующаяСтрокаДереваПроверки = ДеревоПроверки.Строки.Найти(СтрокаПоиска.НормализованныйШтрихкод, "НормализованныйШтрихкод");
	
	Если СоответствующаяСтрокаДереваПроверки = Неопределено Тогда
		Для Каждого СтрокаДереваПоиска Из ДеревоПроверки.Строки Цикл
			Если СтрокаДереваПоиска.Строки.Количество() Тогда 
				НайденнаяСтрока = НайтиСтрокиВИсходномДереве(СтрокаПоиска, СтрокаДереваПоиска);
				Если НайденнаяСтрока <> Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НайденнаяСтрока = СоответствующаяСтрокаДереваПроверки;
	КонецЕсли;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

// Получает код маркировки строки дерева в виде, необходимом для системы ИС МП.
//
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Строка дерева значений
//
// Возвращаемое значение
//  Неопределено, Строка - Код маркировки после нормализации.
Функция КодМаркировкиДляПередачиИСМП(СтрокаДерева)
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
	
	РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
		СтрокаДерева.Штрихкод, СтрокаДерева.ВидПродукции, ПользовательскиеПараметрыРазбораКодаМаркировки);
	Возврат ШтрихкодированиеИСМП.КодМаркировкиДляПередачиИСМП(РезультатРазбора, ПараметрыНормализацииПрочее);
	
КонецФункции

// Проверят Дерево значений 1 на соотствие Дерева значений 2. Подготавливает данные для отправки в ИС МП. Фиксирует расхождения.
//
// Параметры:
//  ДеревоЗначений1 - ДеревоЗначений - Дерево значений для проверки
//  ДеревоЗначений2 - ДеревоЗначений - Дерево значений для поиска
//  КэшПроверенныхСтрок - Соответствие - соответствие совпадающих строк, найденных при первой итерации
//  КэшНенайденныхСтрок - Массив - Массив ненайденных строк
//  ПерваяИтерация - Булево - признак первой итерации операции сравнения
//  ДеревоПроверкиИсходное - ДеревоЗначений, Неопределено - Дерево упаковок для сравнения полным перебором.
//
// Возвращаемое значение
//  Структура - Структура со свойствами:
//  * НарушенСостав - Булево - Истина, если расхождений по коробке не выявлено.
//  * СоставУпаковок - Массив - Массив структур для формирования свойства products сообщения JSON.
//  * ЕстьОшибки - Булево - Истина, если выявлены расхождения при первой итерации.
Функция ВыявитьРасхожденияВСтрокахДеревьев(ДеревоЗначений1, ДеревоЗначений2, КэшПроверенныхСтрок,
	КэшНенайденныхСтрок, ПерваяИтерация, ДеревоПроверкиИсходное = Неопределено)
	
	Если ПерваяИтерация И ДеревоПроверкиИсходное = Неопределено Тогда
		ДеревоПроверкиИсходное = ДеревоЗначений2;
	КонецЕсли;
	
	ПараметрыПроверки = НовыйРезультатОбработкиВложенийПриемкиТоваровИСМП();
	
	СоставКоробки = Новый Массив;
	
	ПромежуточныйМассив = Новый Массив;
	
	Для Каждого СтрокаДерева1 Из ДеревоЗначений1.Строки Цикл
		
		СоответствующаяСтрокаДерева2 = КэшПроверенныхСтрок.Получить(СтрокаДерева1);
		Если СоответствующаяСтрокаДерева2 <> Неопределено Тогда
			ПараметрыПроверкиВложенныхСтрок = ВыявитьРасхожденияВСтрокахДеревьев(СтрокаДерева1, СоответствующаяСтрокаДерева2,
				КэшПроверенныхСтрок, КэшНенайденныхСтрок, ПерваяИтерация, ДеревоПроверкиИсходное);
			Если ТипЗнч(ДеревоЗначений1) = Тип("СтрокаДереваЗначений") Тогда
				
				Если ПараметрыПроверкиВложенныхСтрок.НарушенСостав Или СтрокаДерева1.НайденаВДругойКоробке
					Или СтрокаДерева1.НарушенСостав Тогда
					ПараметрыПроверки.НарушенСостав = Истина;
				КонецЕсли;
				
			Иначе
				
				ПараметрыПроверки.НарушенСостав = Ложь;
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПромежуточныйМассив, ПараметрыПроверкиВложенныхСтрок.СоставУпаковок);
			Продолжить;
			
		КонецЕсли;
		
		Если ПерваяИтерация Тогда
			
			НайденнаяСтрокаДерева2 = ДеревоЗначений2.Строки.Найти(СтрокаДерева1.Штрихкод, "Штрихкод");
			
			Если НайденнаяСтрокаДерева2 = Неопределено Тогда
				
				НайденнаяСтрокаДерева2 = НайтиСтрокиВИсходномДереве(СтрокаДерева1, ДеревоПроверкиИсходное);
				
				Если НайденнаяСтрокаДерева2 <> Неопределено Тогда
					
					НайденнаяСтрокаДерева2.НайденаВДругойКоробке = Истина;
					КэшПроверенныхСтрок.Вставить(НайденнаяСтрокаДерева2, СтрокаДерева1);
					ДополнитьДанныеСтрокиДереваДляОперацийЕАЭС(НайденнаяСтрокаДерева2, СтрокаДерева1);
					
					Если ТипЗнч(ДеревоЗначений2) = Тип("СтрокаДереваЗначений") Тогда
						ДеревоЗначений2.НарушенСостав = Истина;
						КэшПроверенныхСтрок.Вставить(ДеревоЗначений2, ДеревоЗначений1);
					КонецЕсли;
					
					Если НайденнаяСтрокаДерева2.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
						ПараметрыПроверкиВложенныхСтрок = ВыявитьРасхожденияВСтрокахДеревьев(СтрокаДерева1, НайденнаяСтрокаДерева2,
							КэшПроверенныхСтрок, КэшНенайденныхСтрок, ПерваяИтерация, ДеревоПроверкиИсходное);
						ПараметрыПроверки.ЕстьОшибки = ПараметрыПроверкиВложенныхСтрок.ЕстьОшибки;
					КонецЕсли;
				Иначе
					
					КэшНенайденныхСтрок.Добавить(СтрокаДерева1);
					ПараметрыПроверки.ЕстьОшибки = Истина;
					Прервать;
					
				КонецЕсли;
				
			Иначе
				КэшПроверенныхСтрок.Вставить(НайденнаяСтрокаДерева2, СтрокаДерева1);
				ДополнитьДанныеСтрокиДереваДляОперацийЕАЭС(НайденнаяСтрокаДерева2, СтрокаДерева1);
				ПараметрыПроверкиВложенныхСтрок = ВыявитьРасхожденияВСтрокахДеревьев(СтрокаДерева1, НайденнаяСтрокаДерева2,
					КэшПроверенныхСтрок, КэшНенайденныхСтрок, ПерваяИтерация, ДеревоПроверкиИсходное);
				ПараметрыПроверки.ЕстьОшибки = ПараметрыПроверкиВложенныхСтрок.ЕстьОшибки;
				Если ПараметрыПроверки.ЕстьОшибки Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			СтрокаДерева1.ОтсутствуетПоДаннымИБ = Истина;
			ПараметрыПроверкиВложенныхСтрок =  ВыявитьРасхожденияВСтрокахДеревьев(СтрокаДерева1, НайденнаяСтрокаДерева2,
				КэшПроверенныхСтрок, КэшНенайденныхСтрок, ПерваяИтерация, ДеревоПроверкиИсходное);
			
			Если ТипЗнч(ДеревоЗначений1) = Тип("СтрокаДереваЗначений") Тогда
				Если ПараметрыПроверкиВложенныхСтрок.НарушенСостав Или СтрокаДерева1.НайденаВДругойКоробке Тогда
					ПараметрыПроверки.НарушенСостав = Истина;
				КонецЕсли;
			Иначе
				ПараметрыПроверки.НарушенСостав = Ложь;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПромежуточныйМассив, ПараметрыПроверкиВложенныхСтрок.СоставУпаковок);
			
		КонецЕсли;
		
	КонецЦикла;
	Если Не ПерваяИтерация Тогда
		Если ТипЗнч(ДеревоЗначений1) = Тип("СтрокаДереваЗначений") Тогда
			
			СтрокаJSON = Новый Структура;
			
			Если ДеревоЗначений1.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
				ИмяРеквизитаКИ = "uit_code";
			ИначеЕсли ДеревоЗначений1.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				ИмяРеквизитаКИ = "uitu_code";
			КонецЕсли;
			
			Если ПараметрыПроверки.НарушенСостав Или ДеревоЗначений1.ОтсутствуетПоДаннымИБ
				Или ДеревоЗначений1.НарушенСостав Тогда
				СтрокаJSON.Вставить("accepted", Ложь);
			Иначе
				СтрокаJSON.Вставить("accepted", Истина);
				ДополнитьДанныеJSONДляОперацийЕАЭС(ДеревоЗначений1, СтрокаJSON);
			КонецЕсли;
			
			СтрокаJSON.Вставить(ИмяРеквизитаКИ, КодМаркировкиДляПередачиИСМП(ДеревоЗначений1));
			
			Если ДеревоЗначений1.Строки.Количество()=0 Тогда
				СоставКоробки.Добавить(СтрокаJSON);
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыПроверки.СоставУпаковок, СоставКоробки);
			Иначе
				СтрокаJSON.Вставить("children", ПромежуточныйМассив);
				СоставКоробки.Добавить(СтрокаJSON);
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыПроверки.СоставУпаковок, СоставКоробки);
			КонецЕсли;
			
			Если ДеревоЗначений1.НайденаВДругойКоробке Или ДеревоЗначений1.ОтсутствуетПоДаннымИБ
				Или ДеревоЗначений1.НарушенСостав Тогда
				ПараметрыПроверки.НарушенСостав = Истина;
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыПроверки.СоставУпаковок, ПромежуточныйМассив);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыПроверки;
КонецФункции

// Новый результат обработки вложений приемки товаров ИСМП.
//
// Возвращаемое значение:
//  Структура - Новый результат обработки вложений приемки товаров ИСМП:
// * НарушенСостав - Булево -
// * СоставУпаковок - Массив -
// * ЕстьОшибки - Булево -
// * ТекстОшибки - Неопределено, Строка -
Функция НовыйРезультатОбработкиВложенийПриемкиТоваровИСМП()

	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("НарушенСостав",  Ложь);
	ПараметрыПроверки.Вставить("СоставУпаковок", Новый Массив);
	ПараметрыПроверки.Вставить("ЕстьОшибки",     Ложь);
	ПараметрыПроверки.Вставить("ТекстОшибки",    Неопределено);

	Возврат ПараметрыПроверки

КонецФункции

Процедура ДополнитьДанныеСтрокиДереваДляОперацийЕАЭС(СтрокаПриемник, СтрокаИсточник)
	
	СписокСвойствДляЗаполнения = "ЗаполнятьДанныеОперацииЕАЭС, КодТНВЭД, Цена, СуммаНДС,
	                             |ВидДокументаСертификации, НомерДокументаСертификации, ДатаДокументаСертификации";
	Если СтрокаИсточник.ЗаполнятьДанныеОперацииЕАЭС Тогда
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, СписокСвойствДляЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеJSONДляОперацийЕАЭС(СтрокаДанных, СтрокаJSON);
	
	Если ТипЗнч(СтрокаДанных) <> Тип("СтрокаДереваЗначений")
		Или (СтрокаДанных.ЗаполнятьДанныеОперацииЕАЭС
		И СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская) Тогда
		
		СтрокаJSON.Вставить("tnved_code",   СтрокаДанных.КодТНВЭД);
		СтрокаJSON.Вставить("product_cost", СтрокаДанных.Цена     * 100);
		СтрокаJSON.Вставить("product_tax",  СтрокаДанных.СуммаНДС * 100);
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидДокументаСертификации) Тогда
			
			СтрокаJSON.Вставить("certificate_document_data", Новый Массив);
			
			ДанныеСертификации = Новый Структура;
			ДанныеСертификации.Вставить("certificate_type",   ИнтерфейсИСМПСлужебный.ВидДокументаСертификации(СтрокаДанных.ВидДокументаСертификации));
			ДанныеСертификации.Вставить("certificate_number", СтрокаДанных.НомерДокументаСертификации);
			ДанныеСертификации.Вставить("certificate_date",   ИнтеграцияИС.ДатаUTC(СтрокаДанных.ДатаДокументаСертификации));
			
			СтрокаJSON.certificate_document_data.Добавить(ДанныеСертификации);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗагрузитьРезультатОбработкиДокумента(ЭлементОчереди, ПараметрыОбмена)
	
	РезультатОбработкиЗаявки = ИнтерфейсИСМП.СтатусОбработкиДокументаПоИдентификатору(
		ЭлементОчереди.ИдентификаторЗаявки,
		ЭлементОчереди.Организация, ЭлементОчереди.ВидПродукции, ЭлементОчереди.Операция);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		ИначеЕсли ЭлементОчереди.ТекущийСтатус = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления
			Или ЭлементОчереди.ТекущийСтатус = Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Неопределено;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		ОбработкаЗагрузкиПереданногоДокумента(
			ЭлементОчереди,
			ПараметрыОбмена,
			РезультатОбработкиЗаявки,
			ПараметрыОбновленияСтатуса);
		
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			РезультатОбработкиЗаявки.Операция,
			ПараметрыОбновленияСтатуса);
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
			РезультатОбработкиЗаявки);
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаАннулирована
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетРегистрациюУчастникаГИСМТ
			Тогда
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             РезультатОбработкиЗаявки.ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена))
			
		КонецЕсли;
		
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаАннулирована) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

Процедура ЗагрузитьСодержаниеРезультатаОбработкиДокумента(ЭлементОчереди, ПараметрыОбмена)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КоличествоЗаписей", 300);
	ПараметрыОтбора.Вставить("Идентификатор",     ЭлементОчереди.ИдентификаторЗаявки);
	
	ПараметрыОбработки                    = ИнтерфейсИСМП.НовыеПараметрыОбработкиСоставаДокумента();
	ПараметрыОбработки.РасширенныеСтатусы = Истина;
	ПараметрыОбработки.ИмяПоляТела        = "products_list";
	Если ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.Духи Тогда
		ПараметрыОбработки.ИмяПоляСортировки = "name";
	Иначе
		ПараметрыОбработки.ИмяПоляСортировки = "key";
	КонецЕсли;
	
	РезультатОбработкиЗаявки = СоставДокументаПоИдентификатору(ЭлементОчереди, ПараметрыОтбора, ПараметрыОбработки);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		ИначеЕсли ЭлементОчереди.ТекущийСтатус = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления
			Или ЭлементОчереди.ТекущийСтатус = Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Неопределено;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		ОбработкаЗагрузкиПереданногоДокумента(
			ЭлементОчереди,
			ПараметрыОбмена,
			РезультатОбработкиЗаявки,
			ПараметрыОбновленияСтатуса);
		
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			РезультатОбработкиЗаявки.Операция,
			ПараметрыОбновленияСтатуса);
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
			РезультатОбработкиЗаявки);
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаАннулирована
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетРегистрациюУчастникаГИСМТ
			Тогда
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             РезультатОбработкиЗаявки.ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена))
			
		КонецЕсли;
		
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		ТранзакцияЗафиксирована = Истина;
				
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаАннулирована) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

Процедура ОбработкаЗагрузкиПереданногоДокумента(ЭлементОчереди, ПараметрыОбмена, РезультатОбработкиЗаявки, ПараметрыОбновленияСтатуса)
	
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТК Тогда

		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
			РезультатФормированияАТК = ПараметрыЗапроса.РезультатФормированияАТК;

			Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ОтчетПроизводственнойЛинии", Ложь) Тогда

				Для Каждого ДанныеАТК Из РезультатФормированияАТК Цикл
					ДанныеЗаписи = Новый Структура;
					ДанныеЗаписи.Вставить("ДокументОснование", ЭлементОчереди.Документ);
					ДанныеЗаписи.Вставить("АТК",               ДанныеАТК.КодАТК);
					ДанныеЗаписи.Вставить("ДанныеАТК",         Новый ХранилищеЗначения(ДанныеАТК.ВложенныеКоды));
					ДанныеЗаписи.Вставить("Версия",            ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
					РегистрыСведений.ВложенныеШтрихкодыАТКИСМП.СохранитьАТКПоДокументу(ДанныеЗаписи);
				КонецЦикла;

			Иначе

				БлокировкаДокумент = Новый БлокировкаДанных;

				ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
				ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
					"Ссылка", Новый ОписаниеТипов("ДокументСсылка.МаркировкаТоваровИСМП"));
				ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;

				ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.МаркировкаТоваровИСМП");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
				БлокировкаДокумент.Заблокировать();

				ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();

				УстановитьПривилегированныйРежим(Истина);
				Для Каждого ДанныеАТК Из РезультатФормированияАТК Цикл

					НовыйЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
					НовыйЭлемент.ЗначениеШтрихкода = ДанныеАТК.КодАТК;

					ШтрихкодыУпаковок = ШтрихкодированиеИС.ШтрихкодыУпаковок(ДанныеАТК.ВложенныеКоды);
					НоменклатураУпаковки   = Новый Соответствие;

					НоменклатураУпаковки   = Новый Соответствие;
					ХарактеристикаУпаковки = Новый Соответствие;

					Для Каждого СтрокаТаблицы Из ШтрихкодыУпаковок Цикл
						СтрокаТЧ = НовыйЭлемент.ВложенныеШтрихкоды.Добавить();
						СтрокаТЧ.Штрихкод = СтрокаТаблицы.Ссылка;
						НоменклатураУпаковки.Вставить(СтрокаТаблицы.Номенклатура, Истина);
						ХарактеристикаУпаковки.Вставить(СтрокаТаблицы.Характеристика, Истина);
					КонецЦикла;

					Если НоменклатураУпаковки.Количество() > 1 Или ХарактеристикаУпаковки.Количество() > 1 Тогда
						НовыйЭлемент.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МультитоварнаяУпаковка");
					Иначе
						НовыйЭлемент.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МонотоварнаяУпаковка");
					КонецЕсли;

					Если Не ЗначениеЗаполнено(НовыйЭлемент.ДатаУпаковки) Тогда
						НовыйЭлемент.ДатаУпаковки = ТекущаяДатаСеанса();
					КонецЕсли;

					НовыйЭлемент.Записать();

					СтрокаТЧ = ДокументОбъект.ШтрихкодыАТК.Добавить();
					СтрокаТЧ.ШтрихкодУпаковки = НовыйЭлемент.Ссылка;

				КонецЦикла;

				ДокументОбъект.Записать();

			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки Тогда
		
		ПараметрыОбновленияСтатуса.Статус = КонвертированныйОбщийСтатусДокумента(
			РезультатОбработкиЗаявки.Статус, ЭлементОчереди.Документ);
			
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			БлокировкаДокумент = Новый БлокировкаДанных;
			
			ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
				"Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ"));
			ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;
			
			ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			БлокировкаДокумент.Заблокировать();
			
			КешОписанияОстатков = Новый Соответствие();
			ДокументОбъект      = ЭлементОчереди.Документ.ПолучитьОбъект();
			МассивСтрокОтвета   = РезультатОбработкиЗаявки.СоставДокумента;
			
			Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураПоиска = ОбязательныеПоляОписанияОстатковПоСтрокеДокумента(
					СтрокаТовары, ДокументОбъект.ВидПродукции);
					
				Для Каждого СтрокаОтвета Из МассивСтрокОтвета Цикл
					
					СтрокаРезультатаСоответствуетЗапросу = Истина;
					
					Для Каждого КлючИЗначение Из СтруктураПоиска Цикл
						ЗначениеПоиска = Неопределено;
						Если Не СтрокаОтвета.Свойство(КлючИЗначение.Ключ, ЗначениеПоиска) Тогда
							Если ЗначениеЗаполнено(СтруктураПоиска[КлючИЗначение.Ключ]) Тогда
								СтрокаРезультатаСоответствуетЗапросу = Ложь;
								Прервать;
							КонецЕсли;
						ИначеЕсли НормализованноеСтроковоеЗначение(ЗначениеПоиска) <> НормализованноеСтроковоеЗначение(СтруктураПоиска[КлючИЗначение.Ключ]) Тогда
							СтрокаРезультатаСоответствуетЗапросу = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Не СтрокаРезультатаСоответствуетЗапросу Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаТовары.GTIN = СтрокаОтвета.gtin;
					
					Если КешОписанияОстатков.Получить(СтрокаТовары.GTIN) = Неопределено Тогда
						СтруктураОписания = Новый Структура();
						Если СтрокаОтвета.Свойство("name") Тогда
							СтруктураОписания.Вставить("Представление", СтрокаОтвета.name);
						Иначе
							ПараметрыОписанияОстатков = ИнтеграцияИСКлиентСервер.ИспользованиеПараметровОписанияОстатковПоВидуПродукции(
								ДокументОбъект.ВидПродукции,
								ИнтеграцияИСКлиентСервер.КодТНВЭДДляПередачиВИСМП(СтрокаТовары.КодТНВЭД, ДокументОбъект.ВидПродукции));
							Если ПараметрыОписанияОстатков.ИспользоватьНаименование Тогда
								Если ЗначениеЗаполнено(СтрокаТовары.Наименование) Тогда
									СтруктураОписания.Вставить("Представление", СтрокаТовары.Наименование);
								Иначе
									СтруктураОписания.Вставить(
										"Представление",
									ИнтеграцияИС.ПредставлениеНоменклатуры(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика));
								КонецЕсли;
							Иначе
								СтруктураОписания.Вставить(
									"Представление",
										СтрокаДляПоискаGTINМаркировкиОстатков(
										ДокументОбъект.ВидПродукции,
										СтрокаТовары));
							КонецЕсли;
						КонецЕсли;
						СтруктураОписания.Вставить("Организация",    ДокументОбъект.Организация);
						СтруктураОписания.Вставить("ВидПродукции",   ДокументОбъект.ВидПродукции);
						СтруктураОписания.Вставить("ДанныеОписания", СтрокаТовары);
						СтруктураОписания.Вставить("КодТНВЭД",       СтрокаТовары.КодТНВЭД);
						КешОписанияОстатков.Вставить(СтрокаТовары.GTIN, СтруктураОписания);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			РегистрыСведений.КэшОписанияОстатковИСМП.СохранитьПредставлениеОписанияОстатков(КешОписанияОстатков);
			
			Если ДокументОбъект.Модифицированность() Тогда
				ДокументОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаПродажа
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАгент
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаКомиссия
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаБезвозмезднаяПередача
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаДляСобственныхНуждПокупателя
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаПриобретениеГосПредприятием
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ Тогда
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетПодтверждения
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетРегистрациюУчастникаГИСМТ Тогда
			
			БлокировкаДокумент = Новый БлокировкаДанных;
			
			ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
				"Ссылка", Новый ОписаниеТипов("ДокументСсылка.ОтгрузкаТоваровИСМП"));
			ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;
			
			ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.ОтгрузкаТоваровИСМП");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			БлокировкаДокумент.Заблокировать();
			
			ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
			ДокументОбъект.ИдентификаторЗаявкиНаОтгрузку = ЭлементОчереди.ИдентификаторЗаявки;
			ДокументОбъект.Записать();
			
		КонецЕсли;
		
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот Тогда
		
		ИспользуетсяРегистрДляХраненияДанныхОтчета = Ложь;
		ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		ПараметрыЗапроса.Свойство("ИспользуетсяРегистрДляХраненияДанныхОтчета", ИспользуетсяРегистрДляХраненияДанныхОтчета);
		
		ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
			"Ссылка", Новый ОписаниеТипов("ДокументСсылка.МаркировкаТоваровИСМП"));
		ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;

		Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда

			Блокировка                = Новый БлокировкаДанных();
			ЭлементБлокировки         = Блокировка.Добавить("РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП");
			ЭлементБлокировки.Режим   = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Документ", ЭлементОчереди.Документ);

			Блокировка.Заблокировать();

			НаборЗаписей = РегистрыСведений.ДанныеОтчетаПроизводственнойЛинииИСМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(ЭлементОчереди.Документ);

			НаборЗаписей.Прочитать();

		Иначе

			БлокировкаДокумент = Новый БлокировкаДанных;

			ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.МаркировкаТоваровИСМП");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			БлокировкаДокумент.Заблокировать();

			ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
			ДанныеОтчета = ДокументОбъект.ДанныеОтчетаПроизводственнойЛинии;

		КонецЕсли;
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			УдалитьПолныеКодовМаркировкиИзПула = (ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииРасчетСтатуса)
				Или Не ИнтеграцияИСКлиентСервер.ВидПродукцииИспользуетОтчетыОНанесенииКодовМаркировки(ЭлементОчереди.ВидПродукции)
					И Не ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха
					И (ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотРасчетСтатуса
					   Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот);

			Если УдалитьПолныеКодовМаркировкиИзПула Тогда
				ЭтоМолочнаяПродукция = ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ЭлементОчереди.ВидПродукции);
				КодыМаркировки = ШтрихкодированиеИСМП.НоваяТаблицаПоискаКодаМаркировкиВПуле(ЭтоМолочнаяПродукция);
				СоответствиеКодовУпаковокДляПоискаВПуле = Новый Соответствие;

				ГруппаКолонокДляПоискаВПулеКодовМаркировки = Новый Массив;
				ГруппаКолонокДляПоискаВПулеКодовМаркировки.Добавить("НормализованноеЗначениеШтрихкода");
				ГруппаКолонокДляПоискаВПулеКодовМаркировки.Добавить("НормализованноеЗначениеШтрихкодаУпаковки");

			КонецЕсли;
			
			Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда
				
				ДанныеОтчета = НаборЗаписей.Выгрузить(, "Документ, КлючЗаписи, НормализованноеЗначениеШтрихкода, НормализованноеЗначениеШтрихкодаУпаковки");
				НаборЗаписей.Загрузить(ДанныеОтчета);
				НаборЗаписей.Записать();

				Если УдалитьПолныеКодовМаркировкиИзПула Тогда
					Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
						ДобавитьКодыМаркировкиСтрокиОтчетаВТаблицуДляПоискаВПуле(
							СтрокаОтчета,
							КодыМаркировки,
							СоответствиеКодовУпаковокДляПоискаВПуле,
							ГруппаКолонокДляПоискаВПулеКодовМаркировки);
					КонецЦикла;
				КонецЕсли;

			Иначе

				Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл

					СтрокаОтчета.ЗначениеШтрихкода                    = "";
					СтрокаОтчета.ЗначениеШтрихкодаУпаковки            = "";
					СтрокаОтчета.ФорматBase64                         = Ложь;
					СтрокаОтчета.ТекстОшибкиЗначениеШтрихкода         = "";
					СтрокаОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки = "";

					Если УдалитьПолныеКодовМаркировкиИзПула Тогда
						ДобавитьКодыМаркировкиСтрокиОтчетаВТаблицуДляПоискаВПуле(
							СтрокаОтчета,
							КодыМаркировки,
							СоответствиеКодовУпаковокДляПоискаВПуле,
							ГруппаКолонокДляПоискаВПулеКодовМаркировки);
					КонецЕсли;

				КонецЦикла;

				Если ДокументОбъект.Модифицированность() Тогда
					ДокументОбъект.Записать();
				КонецЕсли;

			КонецЕсли;
			
			Если УдалитьПолныеКодовМаркировкиИзПула Тогда
				
				УдалитьПолныеКодовМаркировкиИзПулаПослеУспешнойОбработкиСообщения(
					ЭлементОчереди,
					КодыМаркировки,
					ЭтоМолочнаяПродукция);
				
			КонецЕсли;
			
			БлокировкаНаборЗаписей = Новый БлокировкаДанных();
			ЭлементБлокировки = БлокировкаНаборЗаписей.Добавить("РегистрСведений.ПакетыКодовМаркировкиИСМП");
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументОснование", "Ссылка");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаНаборЗаписей.Заблокировать();
			
			РегистрыСведений.ПакетыКодовМаркировкиИСМП.УдалитьЗаписиПоДокументу(ЭлементОчереди.Документ);

		Иначе // ошибка или частично
			
			Если Не РезультатОбработкиЗаявки.Свойство("ПовторныйЗапросКвитанции")
				Или РезультатОбработкиЗаявки.Свойство("ОбновитьДанныеОтчета") Тогда
				
				КодыОбработанныеСОшибками = РегистрыСведений.ПакетыКодовМаркировкиИСМП.ПолучитьДанныеПоДокументу(ЭлементОчереди.Документ);
				
				Если КодыОбработанныеСОшибками.Количество() Тогда
					
					Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда
						ДанныеОтчета = НаборЗаписей.Выгрузить();
					КонецЕсли;
					
					ЗаполнитьОшибкиПриОбработкеВГИСМТ(ДанныеОтчета, КодыОбработанныеСОшибками, ИспользуетсяРегистрДляХраненияДанныхОтчета);
					
					Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда
						НаборЗаписей.Загрузить(ДанныеОтчета);
						НаборЗаписей.Записать();
					ИначеЕсли ДокументОбъект.Модифицированность() Тогда
						ДокументОбъект.Записать();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияРасчетСтатуса Тогда
		
		ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		ИспользуетсяРегистрДляХраненияДанныхОтчета = Ложь;
		ПараметрыЗапроса.Свойство("ИспользуетсяРегистрДляХраненияДанныхОтчета", ИспользуетсяРегистрДляХраненияДанныхОтчета);
		
		ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
			"Ссылка", Новый ОписаниеТипов("ДокументСсылка.МаркировкаТоваровИСМП"));
		ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;
		
		Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда

			Блокировка                = Новый БлокировкаДанных();
			ЭлементБлокировки         = Блокировка.Добавить("РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП");
			ЭлементБлокировки.Режим   = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Документ", ЭлементОчереди.Документ);

			Блокировка.Заблокировать();

		Иначе

			БлокировкаДокумент = Новый БлокировкаДанных;

			ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.МаркировкаТоваровИСМП");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			БлокировкаДокумент.Заблокировать();

		КонецЕсли;
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			// При успешной первой отправке не нужно очищать данные отчета:
			// 1. При отправке через СУЗ коды нормализованы и сохранены в документ.
			// 2. Строки данных отчета не содержат ошибок.
			Если ПараметрыЗапроса.ПовторнаяОтправка Тогда

				Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда
					НаборЗаписей = РегистрыСведений.ДанныеОтчетаПроизводственнойЛинииИСМП.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ЭлементОчереди.Документ);

					НаборЗаписей.Прочитать();
					ДанныеОтчета = НаборЗаписей.Выгрузить(, "Документ, КлючЗаписи, НормализованноеЗначениеШтрихкода, НормализованноеЗначениеШтрихкодаУпаковки");
					НаборЗаписей.Загрузить(ДанныеОтчета);
					НаборЗаписей.Записать();

				Иначе
					ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
					ДанныеОтчета = ДокументОбъект.ДанныеОтчетаПроизводственнойЛинии;
					Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
						СтрокаОтчета.ЗначениеШтрихкода                    = "";
						СтрокаОтчета.ЗначениеШтрихкодаУпаковки            = "";
						СтрокаОтчета.ФорматBase64                         = Ложь;
						СтрокаОтчета.ТекстОшибкиЗначениеШтрихкода         = "";
						СтрокаОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки = "";
					КонецЦикла;
					Если ДокументОбъект.Модифицированность() Тогда
						ДокументОбъект.Записать();
					КонецЕсли;
				КонецЕсли;
			
				БлокировкаНаборЗаписей = Новый БлокировкаДанных();
				ЭлементБлокировки = БлокировкаНаборЗаписей.Добавить("РегистрСведений.ПакетыКодовМаркировкиИСМП");
				ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументОснование", "Ссылка");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				БлокировкаНаборЗаписей.Заблокировать();
				РегистрыСведений.ПакетыКодовМаркировкиИСМП.УдалитьЗаписиПоДокументу(ЭлементОчереди.Документ);

			КонецЕсли;
			
		Иначе // ошибка или частично
			
			КодыОбработанныеСОшибками = РегистрыСведений.ПакетыКодовМаркировкиИСМП.ПолучитьДанныеПоДокументу(ЭлементОчереди.Документ);
			
			Если КодыОбработанныеСОшибками.Количество() Тогда
				
				Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда
					ДанныеОтчета = НаборЗаписей.Выгрузить();
				Иначе
					ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
					ДанныеОтчета = ДокументОбъект.ДанныеОтчетаПроизводственнойЛинии;
				КонецЕсли;

				ЗаполнитьОшибкиПриОбработкеВГИСМТ(ДанныеОтчета, КодыОбработанныеСОшибками, ИспользуетсяРегистрДляХраненияДанныхОтчета);
				
				Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда
					НаборЗаписей.Загрузить(ДанныеОтчета);
					НаборЗаписей.Записать();
				ИначеЕсли ДокументОбъект.Модифицированность() Тогда
					ДокументОбъект.Записать();
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
		
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодности
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес Тогда
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
				"Ссылка", Новый ОписаниеТипов("ДокументСсылка.УточнениеСведенийОКодахМаркировкиИСМП"));
			ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;
			
			БлокировкаДокумент = Новый БлокировкаДанных;
			
			ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.УточнениеСведенийОКодахМаркировкиИСМП");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			БлокировкаДокумент.Заблокировать();
			
			ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
			
			УдалитьПолныеКодовМаркировкиИзПула = ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес
				Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании;
			Если УдалитьПолныеКодовМаркировкиИзПула Тогда
				
				ЭтоМолочнаяПродукция = ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ЭлементОчереди.ВидПродукции);
				КодыМаркировки = ШтрихкодированиеИСМП.НоваяТаблицаПоискаКодаМаркировкиВПуле(ЭтоМолочнаяПродукция);
				СоответствиеКодовУпаковокДляПоискаВПуле = Новый Соответствие;
				
				ГруппаКолонокДляПоискаВПулеКодовМаркировки = Новый Массив;
				ГруппаКолонокДляПоискаВПулеКодовМаркировки.Добавить("НормализованноеЗначениеШтрихкода");
				
			КонецЕсли;
			
			ДанныеОтчета = ДокументОбъект.ДанныеОтчетаПроизводственнойЛинии;
			
			Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
				
				СтрокаОтчета.ЗначениеШтрихкода = "";
				СтрокаОтчета.ТекстОшибкиЗначениеШтрихкода = "";
				СтрокаОтчета.ФорматBase64      = Ложь;
				
				Если УдалитьПолныеКодовМаркировкиИзПула Тогда
					ДобавитьКодыМаркировкиСтрокиОтчетаВТаблицуДляПоискаВПуле(
						СтрокаОтчета,
						КодыМаркировки,
						СоответствиеКодовУпаковокДляПоискаВПуле,
						ГруппаКолонокДляПоискаВПулеКодовМаркировки);
				КонецЕсли;
				
			КонецЦикла;
			
			Если УдалитьПолныеКодовМаркировкиИзПула Тогда
				
				УдалитьПолныеКодовМаркировкиИзПулаПослеУспешнойОбработкиСообщения(
					ЭлементОчереди,
					КодыМаркировки,
					ЭтоМолочнаяПродукция);
				
			КонецЕсли;
			
			Если ДокументОбъект.Модифицированность() Тогда
				ДокументОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли (ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки
			И ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.ИСМП
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КвитанцияДокумента
				И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ОперацияДокумента")
				И (ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОперацияДокумента =
					Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки))
		И РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		Тогда
		
		ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
			"Ссылка", Новый ОписаниеТипов("ДокументСсылка.СписаниеКодовМаркировкиИСМП"));
		ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;
		
		БлокировкаДокумент = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.СписаниеКодовМаркировкиИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		БлокировкаДокумент.Заблокировать();
		
		ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
		
		ЭтоМолочнаяПродукция = ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ЭлементОчереди.ВидПродукции);
		КодыМаркировки = ШтрихкодированиеИСМП.НоваяТаблицаПоискаКодаМаркировкиВПуле(ЭтоМолочнаяПродукция);
		СоответствиеКодовУпаковокДляПоискаВПуле = Новый Соответствие;
		
		ГруппаКолонокДляПоискаВПулеКодовМаркировки = Новый Массив;
		ГруппаКолонокДляПоискаВПулеКодовМаркировки.Добавить("НормализованноеЗначениеШтрихкода");
		
		ДанныеОтчета = ДокументОбъект.ДанныеОтчетаПроизводственнойЛинии;
		
		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			
			СтрокаОтчета.ЗначениеШтрихкода                    = "";
			СтрокаОтчета.ЗначениеШтрихкодаУпаковки            = "";
			СтрокаОтчета.ФорматBase64                         = Ложь;
			СтрокаОтчета.ТекстОшибкиЗначениеШтрихкода         = "";
			СтрокаОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки = "";
			
			ДобавитьКодыМаркировкиСтрокиОтчетаВТаблицуДляПоискаВПуле(
				СтрокаОтчета,
				КодыМаркировки,
				СоответствиеКодовУпаковокДляПоискаВПуле,
				ГруппаКолонокДляПоискаВПулеКодовМаркировки);
			
		КонецЦикла;
		
		УдалитьПолныеКодовМаркировкиИзПулаПослеУспешнойОбработкиСообщения(
			ЭлементОчереди,
			КодыМаркировки,
			ЭтоМолочнаяПродукция);
		
		Если ДокументОбъект.Модифицированность() Тогда
			ДокументОбъект.Записать();
		КонецЕсли;
		
	ИначеЕсли (ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиРасчетСтатуса)
		И РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда

		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗРасчетСтатуса Тогда
			ОписаниеТипа = Новый ОписаниеТипов("ДокументСсылка.МаркировкаТоваровИСМП");
		Иначе
			ОписаниеТипа = Новый ОписаниеТипов("ДокументСсылка.СписаниеКодовМаркировкиИСМП");
		КонецЕсли;

		ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить("Ссылка", ОписаниеТипа);
		ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;

		БлокировкаНаборЗаписей = Новый БлокировкаДанных();
		ЭлементБлокировки = БлокировкаНаборЗаписей.Добавить("РегистрСведений.ПакетыКодовМаркировкиИСМП");
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументОснование", "Ссылка");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаНаборЗаписей.Заблокировать();

		РегистрыСведений.ПакетыКодовМаркировкиИСМП.УдалитьЗаписиПоДокументу(ЭлементОчереди.Документ);

	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗакрытиеЗаказаНаЭмиссиюСУЗ Тогда

		ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ"));
		ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;

		БлокировкаДанных = Новый БлокировкаДанных();

		ЭлементБлокировки = БлокировкаДанных.Добавить("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ");
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");

		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ПулКодовМаркировкиСУЗ");
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаказНаЭмиссию", "Ссылка");

		БлокировкаДанных.Заблокировать();

		ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		РегистрыСведений.ПулКодовМаркировкиСУЗ.ОчисткаПулаКодовМаркировкиПоЗаказуНаЭмиссию(
			ЭлементОчереди.Документ, ПараметрыЗапроса.ИдентификаторБизнесЗаказа);
	
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозлива Тогда
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		
		МенеджерОбъекта.ОбработкаЗагрузкиПереданногоДокумента(
			ЭлементОчереди,
			ПараметрыОбмена,
			РезультатОбработкиЗаявки,
			ПараметрыОбновленияСтатуса);
			
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетИСМПСведенияОбОтклонениях
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетИСМПСписокКИНаБалансе Тогда
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		
		МенеджерОбъекта.ОбработкаЗагрузкиПереданногоДокумента(
			ЭлементОчереди,
			ПараметрыОбмена,
			РезультатОбработкиЗаявки,
			ПараметрыОбновленияСтатуса);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатОбработкиЗапросаЗаказНаЭмиссиюСУЗАбстрактнаяОперация(ЭлементОчереди, ПараметрыОбмена)
	
	СтатусОбработки  = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ОсновнаяОперация = Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиЗаказаНаЭмиссиюКодовМаркировки;
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура")
		И ПараметрыЗапроса.Свойство("ОсновнаяОперация") Тогда
		ОсновнаяОперация = ПараметрыЗапроса.ОсновнаяОперация;
	КонецЕсли;

	Если ОсновнаяОперация = Перечисления.ВидыОперацийИСМП.ЗакрытиеЗаказаНаЭмиссиюСУЗ Тогда
		
		Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗЗакрыт;

	Иначе
		
		ДанныеСтатусаПоПулу = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДанныеРасчетаСтатусаЗаказаПоПулу(ЭлементОчереди.Документ, ЭлементОчереди.ВидПродукции);
		Статус              = ДанныеСтатусаПоПулу.Статус;
		СтатусОбработки     = ДанныеСтатусаПоПулу.СтатусОбработки;

	КонецЕсли;
	
	МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
	
	ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
	ПараметрыОбновленияСтатуса.Статус            = Статус;
	ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
	ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
	ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
	ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
		ЭлементОчереди.Документ,
		ОсновнаяОперация,
		ПараметрыОбновленияСтатуса);
	
	УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
	
	УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	
КонецПроцедуры

Процедура ЗагрузитьРезультатОбработкиАбстрактнойОперацииРасчетСтатуса(ЭлементОчереди, ПараметрыОбмена)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИСМППрисоединенныеФайлы.Документ        КАК Ссылка,
	|	ИСМППрисоединенныеФайлы.Описание        КАК Описание,
	|	ИСМППрисоединенныеФайлы.СтатусОбработки КАК СтатусОбработки
	|ИЗ
	|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
	|ГДЕ
	|	ИСМППрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Исходящий)
	|	И ИСМППрисоединенныеФайлы.Версия     = &Версия
	|	И ИСМППрисоединенныеФайлы.Операция   = &Операция
	|	И ИСМППрисоединенныеФайлы.Документ   = &Документ");
	
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	ОперацияДокумента = ПараметрыЗапроса.ОперацияДокумента;

	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозливаРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиРасчетСтатуса Тогда
		Операция = ОперацияДокумента;
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗРасчетСтатуса Тогда
		Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ;
	Иначе
		Операция = Перечисления.ВидыОперацийИСМП.Агрегация;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документ", ЭлементОчереди.Документ);
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("Версия",   ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
	
	ВыборкаОшибок = Запрос.Выполнить().Выбрать();
	
	ЕстьОшибки  = Ложь;
	ЕстьУспешно = Ложь;
	ЭтоПовторнаяОтправка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыЗапроса, "ПовторнаяОтправка", Ложь);
	
	МассивОшибок          = Новый Массив;
	ОбработанЧастично     = Ложь;
	ЕстьСтатусНеопределен = Ложь;
	
	ЭтоПовторныйЗапросКвитанции = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыЗапроса, "ПовторныйЗапросКвитанции", Ложь);
	
	Если ЭтоПовторныйЗапросКвитанции Тогда
		ЕстьОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ЕстьПакетыКодовОшибками", Ложь);
	КонецЕсли;
	
	Пока ВыборкаОшибок.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаОшибок.Описание) Тогда
			МассивОшибок.Добавить(ВыборкаОшибок.Описание);
			Если ВыборкаОшибок.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен Тогда
				ЕстьСтатусНеопределен = Истина;
			Иначе
				ЕстьОшибки = Истина;
			КонецЕсли;
		Иначе
			ЕстьУспешно = Истина;
		КонецЕсли;
		Если ВыборкаОшибок.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично Тогда
			ОбработанЧастично = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ОписаниеОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
	
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииРасчетСтатуса Тогда
		Если ЕстьОшибки И (ЕстьУспешно Или ЭтоПовторнаяОтправка)
			Или ЕстьСтатусНеопределен И (ЕстьУспешно Или ЭтоПовторнаяОтправка)
			Или ОбработанЧастично Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесеныЧастично;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ИначеЕсли Не (ЕстьОшибки Или ЕстьСтатусНеопределен) Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесены;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
		ИначеЕсли Не ЕстьОшибки Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетСтатусНеопределен;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен;
		Иначе
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетОшибкаПередачи;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		КонецЕсли;
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотРасчетСтатуса
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот Тогда
		Если ЕстьОшибки И (ЕстьУспешно Или ЭтоПовторнаяОтправка) Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборотЧастично;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ИначеЕсли Не ЕстьОшибки Тогда
			Если ОперацияДокумента = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС
				И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "КодыАгрегированы", Ложь) Тогда
				Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборотИАгрегированы;
			Иначе
				Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборот;
			КонецЕсли;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
		Иначе
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотОшибкаПередачи;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		КонецЕсли;
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗРасчетСтатуса Тогда
		Если ЕстьОшибки И (ЕстьУспешно Или ЭтоПовторнаяОтправка) Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ПоступлениеКИЗПодтвержденоЧастично;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ИначеЕсли Не ЕстьОшибки Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ПоступлениеКИЗПодтверждено;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
		Иначе
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ПодтверждениеПоступленияКИЗОшибкаПередачи;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		КонецЕсли;
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиРасчетСтатуса Тогда
		Если ЕстьОшибки И (ЕстьУспешно Или ЭтоПовторнаяОтправка) Тогда
			Статус          = Перечисления.СтатусыОбработкиСписанияКодовМаркировкиИСМП.КодыМаркировкиСписаныЧастично;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ИначеЕсли Не ЕстьОшибки Тогда
			Статус          = Перечисления.СтатусыОбработкиСписанияКодовМаркировкиИСМП.КодыМаркировкиСписаны;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
		Иначе
			Статус          = Перечисления.СтатусыОбработкиСписанияКодовМаркировкиИСМП.ОшибкаПередачи;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		КонецЕсли;
	Иначе // АгрегацияРасчетСтатуса
		Если ЕстьОшибки И (ЕстьУспешно Или ЭтоПовторнаяОтправка) Тогда
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированыЧастично;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ИначеЕсли Не ЕстьОшибки Тогда
			Если ОперацияДокумента = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
				Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированы;
			ИначеЕсли ИнтеграцияИСМПКлиентСервер.ОперацииНанесенияКодовМаркировки().Найти(ОперацияДокумента) <> Неопределено Тогда
				Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесеныИАгрегированы;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ТребуетсяВводВОборот", Ложь) Тогда
				Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированы;
			Иначе
				Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборотИАгрегированы;
			КонецЕсли;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
		Иначе
			Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияОшибкаПередачи;
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаРезультата = СтруктураИзменения();
	СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
	СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
	СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
	
	СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
	СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
	СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
	
	СтрокаРезультата.ТекстОшибки           = ОписаниеОшибки;
	СтрокаРезультата.ПодготовленоКПередаче = Ложь;
	СтрокаРезультата.Передано              = Ложь;
	СтрокаРезультата.Принято               = Истина;
	СтрокаРезультата.НовыйСтатус           = СтатусОбработки;
	СтрокаРезультата.ОбъектИзменен         = Ложь;
	
	СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
	
	МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
	
	ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
	ПараметрыОбновленияСтатуса.Статус            = Статус;
	ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
	ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
	ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
	ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ПараметрыЗапроса;
	
	// Для расчета действия "Запросите квитанцию".
	ПараметрыОбновленияСтатуса.Вставить("ЕстьСтатусНеопределен", ЕстьСтатусНеопределен);
	
	РезультатОбработкиЗаявки = Новый Структура;
	РезультатОбработкиЗаявки.Вставить("СтатусОбработки", СтатусОбработки);
	
	Если ЭтоПовторныйЗапросКвитанции Тогда
		
		РезультатОбработкиЗаявки.Вставить("ПовторныйЗапросКвитанции", Истина);
		Если ЕстьУспешно Или ОбработанЧастично Тогда
			РезультатОбработкиЗаявки.Вставить("ОбновитьДанныеОтчета", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	СоздаватьШтрихкодыУпаковок = Ложь;
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		И ПараметрыЗапроса.Свойство("СоздаватьШтрихкодыУпаковок")
		И ПараметрыЗапроса.СоздаватьШтрихкодыУпаковок Тогда
		
		ДанныеДереваУпаковок = ПодготовитьДеревоУпаковокВерхнегоУровняПоДокументу(ЭлементОчереди.Документ);
		
		Если ЗначениеЗаполнено(ДанныеДереваУпаковок.ТекстОшибки) Тогда
			СтрокаРезультата.ТекстОшибки = ДанныеДереваУпаковок.ТекстОшибки;
			ПараметрыОбновленияСтатуса.Вставить("ОшибкаПриСозданииШтрихкодовУпаковок", Истина);
		Иначе
			СоздаватьШтрихкодыУпаковок = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ОбработкаЗагрузкиПереданногоДокумента(
			ЭлементОчереди,
			ПараметрыОбмена,
			РезультатОбработкиЗаявки,
			ПараметрыОбновленияСтатуса);
		
		СтрокаРезультата.ОбъектИзменен = Истина;
		
		МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ПараметрыЗапроса, "ПовторнаяОтправкаНеТребуется", Ложь) Тогда
			
			ПротоколОбмена = ИнтеграцияИСМПСлужебный.ИнициализироватьТаблицуПротоколОбмена();
			ОтветТело = СтрШаблон(
				НСтр("ru = 'Не найдено кодов маркировки, требующих повторной отправки в ГИС МТ.
				           |Обработка кодов для операции ""%1"" завершена.'"),
				ОписаниеОперацииПередачиДанных(Операция));
			
			ЗаписьПротокола = ПротоколОбмена.Добавить();
			ЗаписьПротокола.ДатаУниверсальная = ТекущаяУниверсальнаяДата();
			ЗаписьПротокола.Операция = Операция;
			ЗаписьПротокола.ОтветТело = ОтветТело;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
			Реквизиты.Вставить("Описание",             "");
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ПротоколОбмена);
			ИнтеграцияИСМПСлужебный.ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
		КонецЕсли;
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		ЗафиксироватьТранзакцию();
		
		ТранзакцияЗафиксирована = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных, ЭлементОчереди.Документ);
		
		ТранзакцияЗафиксирована = Ложь;
		
	КонецПопытки;
	
	ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
	
	Если ТранзакцияЗафиксирована Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Если СоздаватьШтрихкодыУпаковок Тогда
			НачатьТранзакцию();
			Попытка
				Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодыУпаковокПоДаннымДерева(
					ДанныеДереваУпаковок.ДеревоУпаковок,
					ДанныеДереваУпаковок.ПараметрыСканирования);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИмяСобытияЖурналРегистрации = НСтр(
					"ru = 'ГосИС: Запись штрихкодов упаковок верхнего уровня при обработке очереди сообщений'",
					ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
				ВызватьИсключение ПодробноеПредставлениеОшибки;
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатОбработкиЗаказаНаЭмиссиюКодовМаркировкиСУЗ(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	ТребуетсяУдалитьИзОчереди = Истина;

	Если ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда

		ДанныеСтатусаИзменены     = Истина;
		ДобавитьВПротоколОбмена   = Истина;
		ТребуетсяУдалитьИзОчереди = Ложь;

		НачатьТранзакцию();

		Попытка

			Блокировка = Новый БлокировкаДанных;
			ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
			ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
			Блокировка.Заблокировать();

			НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
			НаборЗаписей.Прочитать();

			Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
				Если НаборЗаписей.Количество() = 0 Тогда
					УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
					ЗафиксироватьТранзакцию();
				Иначе
					ОтменитьТранзакцию();
				КонецЕсли;
				// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
				УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
				Возврат;
			КонецЕсли;

			Если ЭлементОчереди.ТекущийСтатус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗОтгруженоЗаказчику Тогда

				ТребуетсяУдалитьИзОчереди = Истина;
				ДобавитьВПротоколОбмена   = Ложь;

			Иначе

				ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса[0];
				РезультатЗапросаСтатуса = ИнтерфейсСУЗ.СтатусЗаказаПоИдентификатору(
					ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ, ЭлементОчереди.ИдентификаторЗаявки);

				Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаСтатуса, ЭлементОчереди, ПараметрыОбмена) Тогда
					ОтменитьТранзакцию();
					Возврат;
				КонецЕсли;

				Если РезультатЗапросаСтатуса.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка Тогда

					ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
					Если РезультатЗапросаСтатуса.КодСостояния = 404
						Или РезультатЗапросаСтатуса.КодСостояния = 400 Тогда // Заявка отсутствует или обработанная сервисом ошибка

						ТребуетсяУдалитьИзОчереди             = Истина;
						ЭлементОчереди.ТекущийСтатус          = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка;
						ЭлементОчереди.ТекущийСтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

					Иначе
						УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
						ДобавитьВПротоколОбмена = Ложь;
						ДанныеСтатусаИзменены   = Ложь;
					КонецЕсли;

				ИначеЕсли РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗАннулирован
					Или РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Аннулирован
					Или РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка
					Или РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗУничтожено
					Или РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗЗакрыт Тогда

					ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
					Если РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка
						И ЗначениеЗаполнено(РезультатЗапросаСтатуса.ТекстОшибки) Тогда
						ТекстОшибки = РезультатЗапросаСтатуса.ТекстОшибки;
					Иначе
						ТекстОшибки = СтрШаблон(
							НСтр("ru = 'Заказ %1 находится в состоянии %2.'"),
							ЭлементОчереди.ИдентификаторЗаявки,
							РезультатЗапросаСтатуса.Статус);
					КонецЕсли;

					ЭлементОчереди.ТекущийСтатус          = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка;
					ЭлементОчереди.ТекущийСтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
					ТребуетсяУдалитьИзОчереди             = Истина;
					ДанныеСтатусаИзменены                 = Ложь; // Для следующей обработки абстрактного сообщения

				ИначеЕсли РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗОтгруженоЗаказчику Тогда

					ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
					ЭлементОчереди.ТекущийСтатус          = РезультатЗапросаСтатуса.Статус;
					ЭлементОчереди.ТекущийСтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;

					ПараметрыЗапроса.ИдентификаторБизнесЗаказа = ЭлементОчереди.ИдентификаторЗаявки;

					ПодготовитьОчередьЗагрузкиКодовМаркировкиПоЗаказуНаЭмиссию(
						ПараметрыЗапроса, ЭлементОчереди, ЭлементОчереди.Сообщение, ПараметрыОбмена, НастройкаОбменаСУЗ);

				Иначе

					Если ЭлементОчереди.ТекущийСтатус = РезультатЗапросаСтатуса.Статус Тогда
						ДанныеСтатусаИзменены = Ложь;
					Иначе
						ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
						ЭлементОчереди.ТекущийСтатус = РезультатЗапросаСтатуса.Статус;
					КонецЕсли;
					ЭлементОчереди.ТекущийСтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;

					Если РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПринятКОбработке
						Или РезультатЗапросаСтатуса.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПодтвержденИСМП Тогда
						ОтложитьОбработкуЭлементаОчереди(ЭлементОчереди, ПараметрыОбмена);
					Иначе
						ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

			Если ДобавитьВПротоколОбмена
				И ДобавлятьЗаписьВПротоколОбмена(ЭлементОчереди, РезультатЗапросаСтатуса) Тогда
				ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
					ЭлементОчереди,
					РезультатЗапросаСтатуса);
			КонецЕсли;

			Если ДанныеСтатусаИзменены Тогда

				СтрокаРезультата = СтруктураИзменения();

				СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
				СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
				СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = ЭлементОчереди.ТекущийСтатус;
				СтрокаРезультата.ОбъектИзменен         = Ложь;

				СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
				Если РезультатЗапросаСтатуса <> Неопределено Тогда
					СтрокаРезультата.ТекстСообщения = РезультатЗапросаСтатуса.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
					СтрокаРезультата.ТекстОшибки    = РезультатЗапросаСтатуса.ТекстОшибки;
				КонецЕсли;

				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);

			КонецЕсли;

			Если Не ТребуетсяУдалитьИзОчереди
				Или ДанныеСтатусаИзменены Тогда
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,,,
					Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
			КонецЕсли;

			ТранзакцияЗафиксирована = Истина;
			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();

			ТранзакцияЗафиксирована = Ложь;

			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'При обработке документа %1 возникла ошибка:
				           |Текст ошибки: %2
				           |Организация: %3
				           |Текст JSON см. в журнале регистрации.'"),
				ЭлементОчереди.Документ,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
				ЭлементОчереди.Организация);

			ТекстОшибкиЖурналРегистрации = СтрШаблон(
				НСтр("ru = 'При обработке документа %1 возникла ошибка:
				           |Текст ошибки: %2
				           |Организация: %3'"),
				ЭлементОчереди.Документ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				ЭлементОчереди.Организация);

			ОбъектМетаданных = Неопределено;
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
			КонецЕсли;

			ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);

		КонецПопытки;

		Если Не ТранзакцияЗафиксирована Тогда
			ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
			Возврат;
		КонецЕсли;

	КонецЕсли;

	Если ТребуетсяУдалитьИзОчереди Тогда
		ЗаписатьПротоколОбменаВФайлСОписаниемОшибкиИзПротокола(ЭлементОчереди, ТекстОшибки);
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьПротоколОбменаВФайлСОписаниемОшибкиИзПротокола(ЭлементОчереди, ТекстОшибки = Неопределено)

	СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	Описание = ОшибкаИзПротоколаОбмена(ЭлементОчереди, СтатусОбработки);
	Если Не ЗначениеЗаполнено(Описание) Тогда
		Описание = Строка(ТекстОшибки);
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
	Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
	Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
	Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
	Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
	Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
	Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
	Реквизиты.Вставить("Описание",             Описание);
	
	ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
	ДобавитьЗаписьВПротоколОбмена(
		ПротоколаОбменаXML,
		Реквизиты);

КонецПроцедуры

Функция ОшибкаИзПротоколаОбмена(ЭлементОчереди, СтатусОбработки)
	
	ТекстОшибки = "";
	
	Для Каждого СтрокаТЧ Из ЭлементОчереди.ПротоколОбмена Цикл
		Если СтрокаТЧ.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Или СтрокаТЧ.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ОтветТело) Тогда
				ДанныеОтвета = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(СтрокаТЧ.ОтветТело);
				Если ДанныеОтвета <> Неопределено Тогда
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОтвета, "rejectionReason") Тогда
					
						ТекстыОшибок = Новый Массив;
						ТекстыОшибок.Добавить(ДанныеОтвета.rejectionReason);

						Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОтвета, "poolInfos")
							И ТипЗнч(ДанныеОтвета.poolInfos) = Тип("Массив") Тогда

							Для каждого СтрокаПула Из ДанныеОтвета.poolInfos Цикл

								Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаПула, "rejectionReason")
									И ТекстыОшибок.Найти(СтрокаПула.rejectionReason) = Неопределено Тогда
									ТекстыОшибок.Добавить(СтрокаПула.rejectionReason);
								КонецЕсли;
							КонецЦикла;

						КонецЕсли;

						ТекстОшибки = СокрЛП(СтрСоединить(ТекстыОшибок, Символы.ПС));
						Прервать;
					ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОтвета, "errorCode")
						И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОтвета, "errorText") Тогда
						ТекстОшибки = СтрШаблон("%1 (%2)", ДанныеОтвета.errorText, ДанныеОтвета.errorCode)
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ЗагрузитьРезультатОбработкиВводаВОборот(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИСМППрисоединенныеФайлы.Документ КАК Ссылка,
	|	ИСМППрисоединенныеФайлы.Описание
	|ИЗ
	|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
	|ГДЕ
	|	ИСМППрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Исходящий)
	|	И ИСМППрисоединенныеФайлы.Версия     = &Версия
	|	И ИСМППрисоединенныеФайлы.Операция   = &Операция
	|	И ИСМППрисоединенныеФайлы.Документ   = &Документ");

	Запрос.УстановитьПараметр("Документ", ЭлементОчереди.Документ);
	Запрос.УстановитьПараметр("Операция", ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОперацияДокумента);
	Запрос.УстановитьПараметр("Версия",   ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);

	ВыборкаОшибок = Запрос.Выполнить().Выбрать();
	
	ЕстьОшибки  = Ложь;
	ЕстьУспешно = Ложь;
	
	Пока ВыборкаОшибок.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаОшибок.Описание) Тогда
			ЕстьОшибки = Истина;
		Иначе
			ЕстьУспешно = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибки И ЕстьУспешно Тогда
		Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборот;
		СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли Не ЕстьОшибки Тогда
		Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборот;
		СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	Иначе
		Статус          = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотОшибкаПередачи;
		СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
	КонецЕсли;
	
	МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
	
	ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
	ПараметрыОбновленияСтатуса.Статус            = Статус;
	ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
	ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
	ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
	ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
		ЭлементОчереди.Документ,
		Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
		ПараметрыОбновленияСтатуса);
	
	УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
	
	УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	
КонецПроцедуры

// Компанует строку наименования - ключ для поиска в национальном каталоге GTIN для маркировки остатков, используя
// переданные параметры.
//
// Параметры:
// 	ВидПродукции       - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
// 	СтрокаТовары       - СтрокаТабличнойЧасти               - Строка табличной части.
// Возвращаемое значение:
// 	Строка - Итоговое наименование в каталоге.
//
Функция СтрокаДляПоискаGTINМаркировкиОстатков(ВидПродукции, СтрокаТовары)
	
	ТребуетсяВозрастнаяКатегория = Ложь;
	
	ЧастиНазвания = Новый Массив();
	
	Если ВидПродукции = Перечисления.ВидыПродукцииИС.Обувь Тогда
		ЧастиНазвания.Добавить("Остатки");
		ЧастиНазвания.Добавить("Обувь");
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Шины Тогда
		ЧастиНазвания.Добавить("Шины");
		ЧастиНазвания.Добавить(ОписаниеТоварногоЗнака(СтрокаТовары.ТоварныйЗнак));
		ЧастиНазвания.Добавить(СокрЛП(СтрокаТовары.Модель));
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
		ЧастиНазвания.Добавить(
			ИнтеграцияИС.ПредставлениеНоменклатуры(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика));
	ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность Тогда
		ТребуетсяВозрастнаяКатегория = ИнтеграцияИСКлиентСервер.КодТНВЭДТребуетВозрастнуюКатегорию(
			ИнтеграцияИСКлиентСервер.КодТНВЭДДляПередачиВИСМП(СтрокаТовары.КодТНВЭД, ВидПродукции));
		Если ТребуетсяВозрастнаяКатегория Тогда
			ЧастиНазвания.Добавить("Белье");
		Иначе
			ЧастиНазвания.Добавить("Одежда");
		КонецЕсли;
		ЧастиНазвания.Добавить(ОписаниеТоварногоЗнака(СтрокаТовары.ТоварныйЗнак));
	ИначеЕсли ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции)
		Или ВидПродукции = Перечисления.ВидыПродукцииИС.Духи Тогда
		Если ЗначениеЗаполнено(СтрокаТовары.Наименование) Тогда
			ЧастиНазвания.Добавить(СокрЛП(СтрокаТовары.Наименование));
		Иначе
			ЧастиНазвания.Добавить(
				СокрЛП(
					ИнтеграцияИС.ПредставлениеНоменклатуры(
						СтрокаТовары.Номенклатура,
						СтрокаТовары.Характеристика)));
		КонецЕсли;
		ЧастиНазвания.Добавить(ОписаниеТоварногоЗнака(СтрокаТовары.ТоварныйЗнак, "Отсутствует"));
	КонецЕсли;
	
	Если ТребуетсяВозрастнаяКатегория Тогда
		Если ЗначениеЗаполнено(СтрокаТовары.ВозрастнаяКатегория) Тогда
			ЧастиНазвания.Добавить(СокрЛП(СтрокаТовары.ВозрастнаяКатегория));
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(СтрокаТовары.ЦелевойПол) Тогда
			ЧастиНазвания.Добавить(ЦелевойПолПредставлениеДляПоискаGTIN(СтрокаТовары.ЦелевойПол));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции) Тогда
		Если СтрокаТовары.СпособВводаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Производство") Тогда
			ЧастиНазвания.Добавить("Произведен в РФ");
		ИначеЕсли СтрокаТовары.СпособВводаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Импорт") Тогда
			ЧастиНазвания.Добавить("Ввезен в РФ");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиНазвания, ". ");
	
КонецФункции

Функция ЦелевойПолПредставлениеДляПоискаGTIN(ЦелевойПол)
	
	Если ЦелевойПол = ПредопределенноеЗначение("Перечисление.ЦелевойПолИСМП.Мужская") Тогда
		Представление = "Мужская";
	ИначеЕсли ЦелевойПол = ПредопределенноеЗначение("Перечисление.ЦелевойПолИСМП.Женская") Тогда
		Представление = "Женская";
	ИначеЕсли ЦелевойПол = ПредопределенноеЗначение("Перечисление.ЦелевойПолИСМП.Детская") Тогда
		Представление = "Детская";
	ИначеЕсли ЦелевойПол = ПредопределенноеЗначение("Перечисление.ЦелевойПолИСМП.Унисекс") Тогда
		Представление = "Унисекс";
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Целевой пол %1 не поддерживается'"),
			Представление);
	КонецЕсли;
	
	Возврат Представление;

КонецФункции

Процедура ЗапроситьСуществующиеGTINНаОстатки(ЭлементОчереди, ПараметрыОбмена)

	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();

	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		БлокировкаДокумент = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылокДокумент = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылокДокумент.Колонки.Добавить(
			"Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ"));
		ТаблицыБлокируемыхСсылокДокумент.Добавить().Ссылка = ЭлементОчереди.Документ;
		
		ЭлементБлокировки = БлокировкаДокумент.Добавить("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылокДокумент;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		БлокировкаДокумент.Заблокировать();
		
		ДокументОбъект = ЭлементОчереди.Документ.ПолучитьОбъект();
		ТекстОшибки    = "";
		
		РезультатЗаполнения = ЗаполнитьGTINМаркировкиОстатков(
			ДокументОбъект.Товары,
			ДокументОбъект.Организация,
			ДокументОбъект.ВидПродукции);
		
		Если ЗначениеЗаполнено(РезультатЗаполнения.ТекстОшибки) Тогда
			ВызватьИсключение РезультатЗаполнения.ТекстОшибки;
		КонецЕсли;
		
		Если ДокументОбъект.Модифицированность() Тогда
			ДокументОбъект.Записать();
		КонецЕсли;
		
		ТребуетсяОписатьОстатки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ТребуетсяЗапросGTIN(ДокументОбъект);
		СтатусОбработки         = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
		МенеджерОбъекта         = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		
		Если ТребуетсяОписатьОстатки Тогда
			
			Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.ИСМПОбрабатывается;
			
			СообщенияJSON = МенеджерОбъекта.ОписаниеОстатковJSON(ЭлементОчереди.Документ, Неопределено);
			
			СертификатыДляПодписанияНаСервере  = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
			ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
			
			ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
			
			ПодготовитьПодписанныеСообщенияКПередаче(
				ПодписанныеСообщенияПоОрганизациям,
				ПараметрыОбмена);
			
		Иначе
			
			Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.ИСМПGTINНаОстаткиПолучены;
			
		КонецЕсли;
		
		ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		
		ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
		
		КонецЕсли;
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Статус;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			ЭлементОчереди.Операция,
			ПараметрыОбновленияСтатуса);
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
			Реквизиты.Вставить("Описание",             ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Иначе
		
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена))
		
		КонецЕсли;
		
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = "";
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При получении GTIN на остатки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
			
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

Функция ОписаниеТоварногоЗнака(ТоварныйЗнак, ЗначениеТоварногоЗнакаПоУмолчанию = "Без товарного знака")
	Если ЗначениеЗаполнено(ТоварныйЗнак) Тогда
		Возврат СокрЛП(ТоварныйЗнак);
	Иначе
		Возврат ЗначениеТоварногоЗнакаПоУмолчанию;
	КонецЕсли;
КонецФункции

#КонецОбласти

Процедура ЗагрузитьРезультатОбработкиОтчетаСУЗ(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	РезультатОбработкиЗаявки = ИнтерфейсСУЗ.СтатусОбработкиОтчета_V2(
		ЭлементОчереди.ИдентификаторЗаявки, ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ, ЭлементОчереди.Операция);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерацииЗапросаКСУЗ(ЭлементОчереди);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
			РезультатОбработкиЗаявки);
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			
			ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             РезультатОбработкиЗаявки.ТекстОшибки);
			
			Если Не ЗначениеЗаполнено(Реквизиты.Описание)
				И РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
				Реквизиты.Описание = НСтр("ru = 'Ошибка обработки сообщения. Заявка отклонена.'");
			КонецЕсли;
			
			Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
				
				ОбработкаЗагрузкиПереданногоДокумента(
					ЭлементОчереди,
					ПараметрыОбмена,
					РезультатОбработкиЗаявки,
					Неопределено);

				Если ПараметрыЗапроса <> Неопределено Тогда
					
					Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ
						Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки Тогда
						ОперацияИСМП = Перечисления.ВидыОперацийИСМП.КвитанцияДокумента;
					ИначеЕсли ПараметрыЗапроса.Свойство("КонтролироватьСтатусДокументаАгрегацияИСМП") Тогда
						ОперацияИСМП = Перечисления.ВидыОперацийИСМП.АгрегацияПроверкаСтатусаОбработкиДокумента;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ОперацияИСМП <> Неопределено Тогда
					
					СообщениеJSON = ЗаполнитьСообщениеJSONАбстрактнаяОперация(ОперацияИСМП, ЭлементОчереди);
					СообщениеJSON.ИдентификаторЗаявки = ЭлементОчереди.ИдентификаторЗаявки;
					СообщениеJSON.ПараметрыЗапроса    = ПараметрыЗапроса;
					СообщениеJSON.Версия              = ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
					
					Если ОперацияИСМП = Перечисления.ВидыОперацийИСМП.КвитанцияДокумента Тогда
						СообщениеJSON.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами;
					КонецЕсли;
					
					СообщенияJSON = Новый Массив;
					СообщенияJSON.Добавить(СообщениеJSON);
					
					ПодготовитьСообщенияКПередаче(СообщенияJSON, ПараметрыОбмена, СтроковоеПредставлениеПустогоУникальногоИдентификатора());
					
					ОбновитьИдентификаторЗаявкиСообщенияОчереди(
						НаборЗаписей,,,
						Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
					
				Иначе
					
					ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
					ДобавитьЗаписьВПротоколОбмена(
						ПротоколаОбменаXML,
						Реквизиты);
					
					УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
					
				КонецЕсли;
				
			Иначе
				
				ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
				ДобавитьЗаписьВПротоколОбмена(
					ПротоколаОбменаXML,
					Реквизиты);
				
				Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса <> Неопределено
					И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ДанныеСообщения") Тогда
					ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчереди,, ЭлементОчереди.ИдентификаторЗаявки);
				КонецЕсли;
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				
			КонецЕсли;
			
		Иначе
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
			
		КонецЕсли;
		
		Если Не ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ИспользуетсяПакетнаяПередачаСообщений") Тогда
			// При пакетной обработке статус ранее установлен "Обрабатывается".
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			
			ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
			ПараметрыОбновленияСтатуса.Статус            = Неопределено;
			ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
			ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
			ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
			ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
			
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
				ЭлементОчереди.Документ,
				РезультатОбработкиЗаявки.Операция,
				ПараметрыОбновленияСтатуса);
			
		КонецЕсли;
		
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			СтрокаРезультата = СтруктураИзменения();
			
			СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
			СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
			СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
			
			СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
			СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
			СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
			
			СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Ложь;
			СтрокаРезультата.Передано              = Ложь;
			СтрокаРезультата.Принято               = Истина;
			СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
			СтрокаРезультата.ОбъектИзменен         = Ложь;
			
			СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
			СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
			СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
			
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки отчета об использовании кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки отчета об использовании кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
		   Или (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		        И ОперацияИСМП = Неопределено)) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерацииЗапросаКСУЗ(ЭлементОчереди);
	
КонецПроцедуры

Функция ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭлементОчереди.СообщениеОснование) Тогда
		Возврат ЭлементОчереди;
	Иначе
		Возврат ПараметрыОбмена.ОчередьСообщений.Найти(ЭлементОчереди.СообщениеОснование, "Сообщение");
	КонецЕсли;
	
КонецФункции

Функция ЗапроситьКодыМаркировкиИзБизнесЗаказа(ПараметрыЗапроса, ДанныеПула, ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	СтрокиЗаказа = ДанныеПоТоварамЗаказаНаЭмиссию(ЭлементОчереди, ДанныеПула, ПараметрыЗапроса);

	Если ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		МаксимальноеКоличествоКодовМаркировкиЗагружаемыхИзПула = 500000;
		КоличествоЗагружаемыхКодов = МаксимальноеКоличествоКодовМаркировкиЗагружаемыхИзПула;
	Иначе
		Если ЗначениеЗаполнено(НастройкаОбменаСУЗ.ПолучатьКодовЗаИтерацию) Тогда
			МаксимальноеКоличествоКодовМаркировкиЗагружаемыхИзПула = НастройкаОбменаСУЗ.ПолучатьКодовЗаИтерацию;
		Иначе
			МаксимальноеКоличествоКодовМаркировкиЗагружаемыхИзПула = 1000;
		КонецЕсли;
		Если МаксимальноеКоличествоКодовМаркировкиЗагружаемыхИзПула > ДанныеПула.Остаток Тогда
			КоличествоЗагружаемыхКодов = ДанныеПула.Остаток;
		Иначе
			КоличествоЗагружаемыхКодов = МаксимальноеКоличествоКодовМаркировкиЗагружаемыхИзПула;
		КонецЕсли;
	КонецЕсли;


	Если НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V1 Тогда
		РезультатЗапросаКодовМаркировки = ИнтерфейсСУЗ.ЗапроситьКодыМаркировкиИзБизнесЗаказа_V1(
			ПараметрыЗапроса, КоличествоЗагружаемыхКодов,
			НастройкаОбменаСУЗ);
	ИначеЕсли НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V2 Тогда
		РезультатЗапросаКодовМаркировки = ИнтерфейсСУЗ.ЗапроситьКодыМаркировкиИзБизнесЗаказа_V2(
			ПараметрыЗапроса, КоличествоЗагружаемыхКодов, ЭлементОчереди.ИдентификаторПоследнегоБлокаКодов,
			ЭлементОчереди, НастройкаОбменаСУЗ);
		Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаКодовМаркировки, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат РезультатЗапросаКодовМаркировки;
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Формат обмена %1 не поддерживается'"),
			ЭлементОчереди.ФорматОбмена);
	КонецЕсли;

	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо Тогда
		ПараметрыЗагрузки = ПараметрыОбмена.ПараметрыЗагрузкиКодовМаркировкиВПул[ЭлементОчереди.Сообщение];
		Если ПараметрыЗагрузки.ТребуетсяПоискСуществующихКодов
			И РезультатЗапросаКодовМаркировки.ДанныеБлока <> Неопределено
			И ПараметрыЗагрузки.СуществующиеКоды.Количество() Тогда
			РезультатЗапросаКодовМаркировки.ДанныеБлока.КодыМаркировки = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
				РезультатЗапросаКодовМаркировки.ДанныеБлока.КодыМаркировки, ПараметрыЗагрузки.СуществующиеКоды);
		КонецЕсли;
	КонецЕсли;

	Если РезультатЗапросаКодовМаркировки.СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается Тогда
		ЭлементОчередиДляЗаписиПротоколаОбмена = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
		Если ЭлементОчередиДляЗаписиПротоколаОбмена <> Неопределено Тогда
			ДобавитьВПротоколОбмена(
				ЭлементОчередиДляЗаписиПротоколаОбмена,
				РезультатЗапросаКодовМаркировки);
		КонецЕсли;
	КонецЕсли;

	Если РезультатЗапросаКодовМаркировки.ДанныеБлока <> Неопределено Тогда

		НаборЗаписейПулКодовМаркировкиСУЗ = РегистрыСведений.ПулКодовМаркировкиСУЗ.СоздатьНаборЗаписей();
		НаборЗаписейПулКодовМаркировкиСУЗ.Отбор.ЗаказНаЭмиссию.Установить(ЭлементОчереди.Документ, Истина);
		НаборЗаписейПулКодовМаркировкиСУЗ.Отбор.ДокументОснование.Установить(ЭлементОчереди.ДокументОснование, Истина);

		МассивДанныхRFID = Новый Массив();

		ПараметрыСтрокЗаказа = Новый Структура();
		ПараметрыСтрокЗаказа.Вставить("СтрокиЗаказа",      СтрокиЗаказа);
		ПараметрыСтрокЗаказа.Вставить("ТекущаяСтрока",     Неопределено);
		ПараметрыСтрокЗаказа.Вставить("РежимПереполнения", Ложь);
		ПараметрыСтрокЗаказа.Вставить("ВидПродукции",      ЭлементОчереди.ВидПродукции);

		КэшРазбораКодаМаркировки = Неопределено;

		ДатаЭмиссииУниверсальная = ТекущаяУниверсальнаяДата();
		Для Каждого ЗначениеШтрихкода Из РезультатЗапросаКодовМаркировки.ДанныеБлока.КодыМаркировки Цикл

			ПараметрыКода = РезультатЗапросаКодовМаркировки.ДанныеБлока.ПараметрыКодовМаркировки[ЗначениеШтрихкода];

			ВыбратьСтрокуДляРаспределенияКодовМаркировки(ПараметрыСтрокЗаказа, ПараметрыКода);

			СтрокаЗаказаНаЭмиссию = ПараметрыСтрокЗаказа.ТекущаяСтрока;

			ЗаписьНабора = НаборЗаписейПулКодовМаркировкиСУЗ.Добавить();
			// Измерения
			ЗаписьНабора.ЗаказНаЭмиссию    = ЭлементОчереди.Документ;
			ЗаписьНабора.ДокументОснование = ЭлементОчереди.ДокументОснование;

			// Ресурсы
			ЗаписьНабора.Статус                    = Перечисления.СтатусыКодовМаркировкиСУЗ.Сгенерирован;
			// Реквизиты
			ЗаписьНабора.Организация               = ЭлементОчереди.Организация;
			ЗаписьНабора.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

			ЗаписьНабора.Номенклатура              = СтрокаЗаказаНаЭмиссию.Номенклатура;
			ЗаписьНабора.Характеристика            = СтрокаЗаказаНаЭмиссию.Характеристика;

			ЗаписьНабора.ВидПродукции              = СтрокаЗаказаНаЭмиссию.ВидПродукции;

			СпособВводаВОборот = Неопределено;
			Если СтрокаЗаказаНаЭмиссию.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда

				ЗаписьНабора.КодМаркировки = ЗначениеШтрихкода;
				ЗаписьНабора.ТипШтрихкода  = Перечисления.ТипыШтрихкодов.Code128;

				СпособВводаВОборот                     = ПараметрыКода.СпособВводаВОборот;
				ЗаписьНабора.ВидКИЗ                    = ПараметрыКода.ВидКИЗ;
				ЗаписьНабора.РазмерКИЗ                 = ПараметрыКода.РазмерКИЗ;
				ЗаписьНабора.GTIN                      = ПараметрыКода.GTIN;
				ЗаписьНабора.ДатаПечатиУниверсальная   = ДатаЭмиссииУниверсальная;
				ЗаписьНабора.ДатаЭмиссииУниверсальная  = УниверсальноеВремя(ПараметрыКода.ДатаЭмиссии);

				ДанныеRDFID = РегистрыСведений.ДанныеRFIDИСМП.НовыйЭлементЗаписиДанных();
				ДанныеRDFID.ЗначениеШтрихкода = ЗначениеШтрихкода;
				ДанныеRDFID.RFIDTID           = ПараметрыКода.RFIDTID;
				Если ЗначениеЗаполнено(ПараметрыКода.SGTIN) Тогда
					ДанныеRDFID.EPCGTIN = ПараметрыКода.GTIN;
					ДанныеRDFID.RFIDEPC = МенеджерОборудованияКлиентСервер.СформироватьДанныеSGTIN96(
						ПараметрыКода.GTIN, СтрРазделить(ПараметрыКода.SGTIN, ".")[3], 1);
				КонецЕсли;
				МассивДанныхRFID.Добавить(ДанныеRDFID);

			Иначе

				РезультатРазбора = РазобратьКодМаркировкиДляБизнесЗаказа(
					ЗначениеШтрихкода,
					СтрокаЗаказаНаЭмиссию,
					КэшРазбораКодаМаркировки);

				ЗаписьНабора.GTIN                      = ДанныеПула.GTIN;
				ЗаписьНабора.ПолныйКодМаркировки       = ШтрихкодированиеИСКлиентСервер.ШтрихкодВBase64(ЗначениеШтрихкода);
				ЗаписьНабора.МаркировкаОстатков        = СтрокаЗаказаНаЭмиссию.МаркировкаОстатков;
				ЗаписьНабора.ДатаЭмиссииУниверсальная  = ДатаЭмиссииУниверсальная;
				СпособВводаВОборот                     = СтрокаЗаказаНаЭмиссию.СпособВводаВОборот;

				ЗаписьНабора.КодМаркировки = РезультатРазбора.НормализованныйКодМаркировки;
				ЗаписьНабора.ТипШтрихкода  = РезультатРазбора.ТипШтрихкода;

			КонецЕсли;

			Если СтрокаЗаказаНаЭмиссию.ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
				ЗаписьНабора.МаксимальнаяРозничнаяЦена = СтрокаЗаказаНаЭмиссию.МаксимальнаяРозничнаяЦена;
			ИначеЕсли СтрокаЗаказаНаЭмиссию.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС Тогда
				ЗаписьНабора.СрокГодности = РезультатРазбора.СрокГодности;
			КонецЕсли;

			ЗаписьНабора.СпособВводаВОборот        = СпособВводаВОборот;
			ЗаписьНабора.Шаблон                    = СтрокаЗаказаНаЭмиссию.Шаблон;
			ЗаписьНабора.ХешСуммаКодаМаркировки    = ИнтеграцияИС.ХешированиеДанныхSHA256(ЗаписьНабора.КодМаркировки);
			ЗаписьНабора.ИдентификаторБлокаСУЗ     = РезультатЗапросаКодовМаркировки.ДанныеБлока.ИдентификаторПоследнегоБлокаКодов;
			ЗаписьНабора.ИдентификаторЗаказаСУЗ    = ПараметрыЗапроса.ИдентификаторБизнесЗаказа;

			СтрокаЗаказаНаЭмиссию.КоличествоПолучено = СтрокаЗаказаНаЭмиссию.КоличествоПолучено + 1;

		КонецЦикла;

		Если НаборЗаписейПулКодовМаркировкиСУЗ.Количество() Тогда
			НаборЗаписейПулКодовМаркировкиСУЗ.Записать(Ложь);
		КонецЕсли;

		Если МассивДанныхRFID.Количество() Тогда
			РезультатЗаписи = РегистрыСведений.ДанныеRFIDИСМП.ЗаписатьДанные(МассивДанныхRFID);
			Если Не РезультатЗаписи.Успешно Тогда
				ВызватьИсключение РезультатЗаписи.ТекстОшибки;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Возврат РезультатЗапросаКодовМаркировки;

КонецФункции

Функция ДанныеПоТоварамЗаказаНаЭмиссию(ЭлементОчереди, ДанныеПула, ПараметрыЗапроса)

	Если ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПараметрыЗаказа.СпособВводаВОборот КАК СпособВводаВОборот,
		|	ПараметрыЗаказа.GTIN               КАК GTIN,
		|	ПараметрыЗаказа.ВидКИЗ             КАК ВидКИЗ,
		|	ПараметрыЗаказа.РазмерКИЗ          КАК РазмерКИЗ,
		|	ПараметрыЗаказа.КодТНВЭД           КАК КодТНВЭД,
		|	ПараметрыЗаказа.Шаблон             КАК Шаблон
		|ПОМЕСТИТЬ ПараметрыЗаказа
		|ИЗ
		|	&ПараметрыЗаказа КАК ПараметрыЗаказа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шапка.ВидПродукции                       КАК ВидПродукции,
		|	ТабличнаяЧасть.СпособВводаВОборот        КАК СпособВводаВОборот,
		|	ТабличнаяЧасть.Номенклатура              КАК Номенклатура,
		|	ТабличнаяЧасть.Характеристика            КАК Характеристика,
		|	ТабличнаяЧасть.GTIN                      КАК GTIN,
		|	ТабличнаяЧасть.ВидКИЗ                    КАК ВидКИЗ,
		|	ТабличнаяЧасть.РазмерКИЗ                 КАК РазмерКИЗ,
		|	ТабличнаяЧасть.Шаблон                    КАК Шаблон,
		|	ПОДСТРОКА(ТабличнаяЧасть.КодТНВЭД, 1, 4) КАК КодТНВЭД,
		|	СУММА(ТабличнаяЧасть.Количество)         КАК Количество
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ТабличнаяЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК Шапка
		|		ПО ТабличнаяЧасть.Ссылка = Шапка.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыЗаказа КАК ПараметрыЗаказа
		|		ПО ТабличнаяЧасть.СпособВводаВОборот = ПараметрыЗаказа.СпособВводаВОборот
		|			И ТабличнаяЧасть.GTIN            = ПараметрыЗаказа.GTIN
		|			И ТабличнаяЧасть.ВидКИЗ          = ПараметрыЗаказа.ВидКИЗ
		|			И ТабличнаяЧасть.РазмерКИЗ       = ПараметрыЗаказа.РазмерКИЗ
		|			И ТабличнаяЧасть.Шаблон          = ПараметрыЗаказа.Шаблон
		|			И ПОДСТРОКА(ТабличнаяЧасть.КодТНВЭД, 1, 4) = ПараметрыЗаказа.КодТНВЭД
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Шапка.ВидПродукции,
		|	ТабличнаяЧасть.СпособВводаВОборот,
		|	ТабличнаяЧасть.Шаблон,
		|	ТабличнаяЧасть.Номенклатура,
		|	ТабличнаяЧасть.Характеристика,
		|	ТабличнаяЧасть.GTIN,
		|	ТабличнаяЧасть.РазмерКИЗ,
		|	ТабличнаяЧасть.ВидКИЗ,
		|	ПОДСТРОКА(ТабличнаяЧасть.КодТНВЭД, 1, 4)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПулКодовМаркировкиСУЗ.СпособВводаВОборот КАК СпособВводаВОборот,
		|	ПулКодовМаркировкиСУЗ.Шаблон             КАК Шаблон,
		|	ПулКодовМаркировкиСУЗ.ВидКИЗ             КАК ВидКИЗ,
		|	ПулКодовМаркировкиСУЗ.РазмерКИЗ          КАК РазмерКИЗ,
		|	ПулКодовМаркировкиСУЗ.Номенклатура       КАК Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика     КАК Характеристика,
		|	ПулКодовМаркировкиСУЗ.GTIN               КАК GTIN,
		|	СУММА(1)                                 КАК КоличествоПолучено
		|ПОМЕСТИТЬ ДанныеПула
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыЗаказа КАК ПараметрыЗаказа
		|		ПО ПулКодовМаркировкиСУЗ.СпособВводаВОборот = ПараметрыЗаказа.СпособВводаВОборот
		|			И ПулКодовМаркировкиСУЗ.GTIN            = ПараметрыЗаказа.GTIN
		|			И ПулКодовМаркировкиСУЗ.ВидКИЗ          = ПараметрыЗаказа.ВидКИЗ
		|			И ПулКодовМаркировкиСУЗ.РазмерКИЗ       = ПараметрыЗаказа.РазмерКИЗ
		|			И ПулКодовМаркировкиСУЗ.Шаблон          = ПараметрыЗаказа.Шаблон
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПулКодовМаркировкиСУЗ.СпособВводаВОборот,
		|	ПулКодовМаркировкиСУЗ.ВидКИЗ,
		|	ПулКодовМаркировкиСУЗ.РазмерКИЗ,
		|	ПулКодовМаркировкиСУЗ.GTIN,
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика,
		|	ПулКодовМаркировкиСУЗ.Шаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ВидПродукции                           КАК ВидПродукции,
		|	ТабличнаяЧасть.СпособВводаВОборот                     КАК СпособВводаВОборот,
		|	ТабличнаяЧасть.ВидКИЗ                                 КАК ВидКИЗ,
		|	ТабличнаяЧасть.РазмерКИЗ                              КАК РазмерКИЗ,
		|	ТабличнаяЧасть.Номенклатура                           КАК Номенклатура,
		|	ТабличнаяЧасть.Характеристика                         КАК Характеристика,
		|	ТабличнаяЧасть.GTIN                                   КАК GTIN,
		|	ТабличнаяЧасть.Шаблон                                 КАК Шаблон,
		|	ТабличнаяЧасть.Количество                             КАК Количество,
		|	ТабличнаяЧасть.КодТНВЭД                               КАК КодТНВЭД,
		|	ЕСТЬNULL(ПулКодовМаркировкиСУЗ.КоличествоПолучено, 0) КАК КоличествоПолучено
		|ИЗ
		|	ТаблицаТовары КАК ТабличнаяЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПула КАК ПулКодовМаркировкиСУЗ
		|		ПО ТабличнаяЧасть.Номенклатура      = ПулКодовМаркировкиСУЗ.Номенклатура
		|		И ТабличнаяЧасть.Характеристика     = ПулКодовМаркировкиСУЗ.Характеристика
		|		И ТабличнаяЧасть.СпособВводаВОборот = ПулКодовМаркировкиСУЗ.СпособВводаВОборот
		|		И ТабличнаяЧасть.ВидКИЗ             = ПулКодовМаркировкиСУЗ.ВидКИЗ
		|		И ТабличнаяЧасть.GTIN               = ПулКодовМаркировкиСУЗ.GTIN
		|		И ТабличнаяЧасть.РазмерКИЗ          = ПулКодовМаркировкиСУЗ.РазмерКИЗ
		|		И ТабличнаяЧасть.Шаблон             = ПулКодовМаркировкиСУЗ.Шаблон");

		ПараметрыЗаказа = НоваяТаблицаПараметровЗаказаКодовМаркировки();
		Для Каждого ПараметрЗаказа Из ПараметрыЗапроса.ПараметрыЗаказа Цикл
			НоваяСтрока = ПараметрыЗаказа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрЗаказа);
		КонецЦикла;
		Запрос.УстановитьПараметр("ПараметрыЗаказа", ПараметрыЗаказа);
		Запрос.УстановитьПараметр("Ссылка",          ЭлементОчереди.Документ);

		СтрокиЗаказа = Запрос.Выполнить().Выгрузить();

		Если СтрокиЗаказа.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Внутренняя ошибка:
			                             |При загрузке кодов маркировки не найдена исходная строка заказа на эмиссию'");
		КонецЕсли;

	Иначе

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Шапка.ВидПродукции            КАК ВидПродукции,
		|	ВЫБОР
		|		КОГДА Шапка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
		|			ТОГДА ТабличнаяЧасть.СпособВводаВОборот
		|		ИНАЧЕ Шапка.СпособВводаВОборот
		|	КОНЕЦ                         КАК СпособВводаВОборот,
		|	ВЫБОР
		|		КОГДА Шапка.БезУчетаНоменклатуры И ПОДСТРОКА(ТабличнаяЧасть.GTIN, 1, 3) = &НачалоGTIN
		|			ТОГДА &ПустаяНоменклатура
		|		ИНАЧЕ ТабличнаяЧасть.Номенклатура
		|	КОНЕЦ                         КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА Шапка.БезУчетаНоменклатуры И ПОДСТРОКА(ТабличнаяЧасть.GTIN, 1, 3) = &НачалоGTIN
		|			ТОГДА &ПустаяХарактеристика
		|		ИНАЧЕ ТабличнаяЧасть.Характеристика
		|	КОНЕЦ                         КАК Характеристика,
		|
		|	ТабличнаяЧасть.GTIN           КАК GTIN,
		|	ТабличнаяЧасть.Шаблон         КАК Шаблон,
		|	ТабличнаяЧасть.СрокГодности   КАК СрокГодности,
		|	ВЫБОР
		|		КОГДА
		|			ТабличнаяЧасть.СпособФормированияСерийногоНомера = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСерийногоНомераСУЗ.Самостоятельно)
		|				ИЛИ Шапка.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Табак)
		|				ИЛИ Шапка.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.АльтернативныйТабак)
		|				ИЛИ Шапка.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция)
		|				ИЛИ ТабличнаяЧасть.Шаблон = ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИС)
		|				ИЛИ ТабличнаяЧасть.Шаблон = ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.СкоропортящаясяМолочнаяПродукцияВЕТИС)
		|				ТОГДА ТабличнаяЧасть.ИдентификаторСтроки
		|		ИНАЧЕ """"
		|	КОНЕЦ                                    КАК ИдентификаторСтроки,
		|	ТабличнаяЧасть.МаксимальнаяРозничнаяЦена КАК МаксимальнаяРозничнаяЦена,
		|	СУММА(ТабличнаяЧасть.Количество)         КАК Количество,
		|	ВЫБОР
		|		КОГДА Шапка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МаркировкаОстатков
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ТабличнаяЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК Шапка
		|		ПО ТабличнаяЧасть.Ссылка = Шапка.Ссылка
		|ГДЕ
		|	ТабличнаяЧасть.Ссылка = &Ссылка
		|	И ТабличнаяЧасть.GTIN = &GTIN
		|СГРУППИРОВАТЬ ПО
		|	Шапка.ВидПродукции,
		|	ВЫБОР
		|		КОГДА Шапка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
		|			ТОГДА ТабличнаяЧасть.СпособВводаВОборот
		|		ИНАЧЕ Шапка.СпособВводаВОборот
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Шапка.БезУчетаНоменклатуры И ПОДСТРОКА(ТабличнаяЧасть.GTIN, 1, 3) = &НачалоGTIN
		|			ТОГДА &ПустаяНоменклатура
		|		ИНАЧЕ ТабличнаяЧасть.Номенклатура
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Шапка.БезУчетаНоменклатуры И ПОДСТРОКА(ТабличнаяЧасть.GTIN, 1, 3) = &НачалоGTIN
		|			ТОГДА &ПустаяХарактеристика
		|		ИНАЧЕ ТабличнаяЧасть.Характеристика
		|	КОНЕЦ,
		|	ТабличнаяЧасть.GTIN,
		|	ТабличнаяЧасть.Шаблон,
		|	ТабличнаяЧасть.СрокГодности,
		|	ВЫБОР
		|		КОГДА
		|			ТабличнаяЧасть.СпособФормированияСерийногоНомера = ЗНАЧЕНИЕ(Перечисление.СпособыФормированияСерийногоНомераСУЗ.Самостоятельно)
		|				ИЛИ Шапка.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Табак)
		|				ИЛИ Шапка.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.АльтернативныйТабак)
		|				ИЛИ Шапка.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция)
		|				ИЛИ ТабличнаяЧасть.Шаблон = ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИС)
		|				ИЛИ ТабличнаяЧасть.Шаблон = ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.СкоропортящаясяМолочнаяПродукцияВЕТИС)
		|				ТОГДА ТабличнаяЧасть.ИдентификаторСтроки
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ТабличнаяЧасть.МаксимальнаяРозничнаяЦена,
		|	ВЫБОР
		|		КОГДА Шапка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПулКодовМаркировкиСУЗ.МаксимальнаяРозничнаяЦена КАК МаксимальнаяРозничнаяЦена,
		|	ПулКодовМаркировкиСУЗ.СпособВводаВОборот КАК СпособВводаВОборот,
		|	ПулКодовМаркировкиСУЗ.Номенклатура       КАК Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика     КАК Характеристика,
		|	ПулКодовМаркировкиСУЗ.GTIN               КАК GTIN,
		|	ПулКодовМаркировкиСУЗ.Шаблон             КАК Шаблон,
		|	ПулКодовМаркировкиСУЗ.СрокГодности       КАК СрокГодности,
		|	СУММА(1)                                 КАК КоличествоПолучено
		|ПОМЕСТИТЬ ДанныеПула
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &Ссылка
		|	И ПулКодовМаркировкиСУЗ.GTIN = &GTIN
		|СГРУППИРОВАТЬ ПО
		|	ПулКодовМаркировкиСУЗ.МаксимальнаяРозничнаяЦена,
		|	ПулКодовМаркировкиСУЗ.СпособВводаВОборот,
		|	ПулКодовМаркировкиСУЗ.GTIN,
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика,
		|	ПулКодовМаркировкиСУЗ.Шаблон,
		|	ПулКодовМаркировкиСУЗ.СрокГодности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.ВидПродукции                           КАК ВидПродукции,
		|	ТабличнаяЧасть.СпособВводаВОборот                     КАК СпособВводаВОборот,
		|	ТабличнаяЧасть.Номенклатура                           КАК Номенклатура,
		|	ТабличнаяЧасть.Характеристика                         КАК Характеристика,
		|	ТабличнаяЧасть.GTIN                                   КАК GTIN,
		|	ТабличнаяЧасть.Шаблон                                 КАК Шаблон,
		|	ТабличнаяЧасть.ИдентификаторСтроки                    КАК ИдентификаторСтроки,
		|	ТабличнаяЧасть.СпособВводаВОборот                     КАК ТоварыСпособВводаВОборот,
		|	ТабличнаяЧасть.МаксимальнаяРозничнаяЦена              КАК МаксимальнаяРозничнаяЦена,
		|	ТабличнаяЧасть.Количество                             КАК Количество,
		|	ЕСТЬNULL(ПулКодовМаркировкиСУЗ.КоличествоПолучено, 0) КАК КоличествоПолучено,
		|	ТабличнаяЧасть.МаркировкаОстатков                     КАК МаркировкаОстатков
		|ИЗ
		|	ТаблицаТовары КАК ТабличнаяЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПула КАК ПулКодовМаркировкиСУЗ
		|		ПО ТабличнаяЧасть.Номенклатура      = ПулКодовМаркировкиСУЗ.Номенклатура
		|		И ТабличнаяЧасть.Характеристика     = ПулКодовМаркировкиСУЗ.Характеристика
		|		И ТабличнаяЧасть.СпособВводаВОборот = ПулКодовМаркировкиСУЗ.СпособВводаВОборот
		|		И ТабличнаяЧасть.СрокГодности       = ПулКодовМаркировкиСУЗ.СрокГодности
		|		И ТабличнаяЧасть.Шаблон             = ПулКодовМаркировкиСУЗ.Шаблон
		|		И ТабличнаяЧасть.МаксимальнаяРозничнаяЦена = ПулКодовМаркировкиСУЗ.МаксимальнаяРозничнаяЦена");
	
		Запрос.УстановитьПараметр("GTIN",       ДанныеПула.GTIN);
		Запрос.УстановитьПараметр("Ссылка",     ЭлементОчереди.Документ);
		Запрос.УстановитьПараметр("НачалоGTIN", ИнтеграцияИСМПСлужебныйКлиентСервер.НачалоGTINМаркировкиОстатков());
		Запрос.УстановитьПараметр(
			"ПустаяНоменклатура",
			ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура"));
		Запрос.УстановитьПараметр(
			"ПустаяХарактеристика",
			ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры"));

		Товары = Запрос.Выполнить().Выгрузить();

		СтруктураПоискаСтрокиЗаказа = Новый Структура;
		СтруктураПоискаСтрокиЗаказа.Вставить("GTIN",                ДанныеПула.GTIN);
		СтруктураПоискаСтрокиЗаказа.Вставить("ИдентификаторСтроки", ПараметрыЗапроса.ИдентификаторСтрокиЗаказа);
		СтруктураПоискаСтрокиЗаказа.Вставить("Шаблон",              ПараметрыЗапроса.Шаблон);

		МассивПолейИндекса = Новый Массив();
		Для Каждого КлючИЗначение Из СтруктураПоискаСтрокиЗаказа Цикл
			МассивПолейИндекса.Добавить(КлючИЗначение.Ключ);
		КонецЦикла;
		Товары.Индексы.Добавить(СтрСоединить(МассивПолейИндекса, ","));

		СтрокиЗаказа = Товары.НайтиСтроки(СтруктураПоискаСтрокиЗаказа);
		Если СтрокиЗаказа.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Внутренняя ошибка:
			                             |При загрузке кодов маркировки не найдена исходная строка заказа на эмиссию'");
		КонецЕсли;

	КонецЕсли;
	
	Возврат СтрокиЗаказа;
	
КонецФункции

Процедура ВыбратьСтрокуДляРаспределенияКодовМаркировки(ПараметрыСтрокЗаказа, ПараметрыКода)
	
	Если ПараметрыСтрокЗаказа.СтрокиЗаказа.Количество() = 1 Тогда
		ПараметрыСтрокЗаказа.ТекущаяСтрока = ПараметрыСтрокЗаказа.СтрокиЗаказа[0];
		Возврат;
	КонецЕсли;
	
	ЭтоМех = (ПараметрыСтрокЗаказа.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха);

	Если ПараметрыСтрокЗаказа.РежимПереполнения Тогда
		
		НоваяСтрока             = Неопределено;
		МинимальноеПереполнение = Неопределено;
		
		Для Каждого ТекущаяСтрока Из ПараметрыСтрокЗаказа.СтрокиЗаказа Цикл
			
			Если ЭтоМех И Не СтрокаЗаказаСоответствуетПараметруКода(ТекущаяСтрока, ПараметрыКода) Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущееПереполнение = ТекущаяСтрока.КоличествоПолучено / ТекущаяСтрока.Количество;
			
			Если МинимальноеПереполнение = Неопределено Тогда
				МинимальноеПереполнение = ТекущееПереполнение;
				НоваяСтрока = ТекущаяСтрока;
				Продолжить;
			КонецЕсли;
			
			Если ТекущееПереполнение < МинимальноеПереполнение Тогда
				МинимальноеПереполнение = ТекущееПереполнение;
				НоваяСтрока = ТекущаяСтрока;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НоваяСтрока = Неопределено Тогда
			Для Каждого СтрокаЗаказа Из ПараметрыСтрокЗаказа.СтрокиЗаказа Цикл
				Если ЭтоМех И Не СтрокаЗаказаСоответствуетПараметруКода(СтрокаЗаказа, ПараметрыКода) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = СтрокаЗаказа;
				Прервать;
			КонецЦикла;
			Если НоваяСтрока = Неопределено Тогда
				НоваяСтрока = ПараметрыСтрокЗаказа.СтрокиЗаказа[0];
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыСтрокЗаказа.ТекущаяСтрока = НоваяСтрока;
		
	Иначе
		
		Если ПараметрыСтрокЗаказа.ТекущаяСтрока = Неопределено Тогда
			Для Каждого СтрокаЗаказа Из ПараметрыСтрокЗаказа.СтрокиЗаказа Цикл
				Если ЭтоМех И Не СтрокаЗаказаСоответствуетПараметруКода(СтрокаЗаказа, ПараметрыКода) Тогда
					Продолжить;
				КонецЕсли;
				ПараметрыСтрокЗаказа.ТекущаяСтрока = СтрокаЗаказа;
				Прервать;
			КонецЦикла;
			Если ПараметрыСтрокЗаказа.ТекущаяСтрока = Неопределено Тогда
				ВызватьИсключение НСтр("ru = 'Внутренняя ошибка:
			                                 |При загрузке кодов маркировки не найдена исходная строка заказа на эмиссию'");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыСтрокЗаказа.ТекущаяСтрока.Количество >= ПараметрыСтрокЗаказа.ТекущаяСтрока.КоличествоПолучено Тогда
			
			НоваяСтрока = Неопределено;
			Для Каждого ТекущаяСтрока Из ПараметрыСтрокЗаказа.СтрокиЗаказа Цикл
				
				Если ЭтоМех И Не СтрокаЗаказаСоответствуетПараметруКода(ТекущаяСтрока, ПараметрыКода) Тогда
					Продолжить;
				КонецЕсли;
				Если ТекущаяСтрока.Количество > ТекущаяСтрока.КоличествоПолучено Тогда
					НоваяСтрока = ТекущаяСтрока;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НоваяСтрока = Неопределено Тогда
				ПараметрыСтрокЗаказа.РежимПереполнения = Истина;
				ПараметрыСтрокЗаказа.ТекущаяСтрока     = Неопределено;
				ВыбратьСтрокуДляРаспределенияКодовМаркировки(ПараметрыСтрокЗаказа, ПараметрыКода);
			Иначе
				ПараметрыСтрокЗаказа.ТекущаяСтрока = НоваяСтрока;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтрокаЗаказаСоответствуетПараметруКода(СтрокаЗаказа, ПараметрыКода)

	Возврат (СтрокаЗаказа.GTIN = ПараметрыКода.GTIN
		И СтрокаЗаказа.ВидКИЗ = ПараметрыКода.ВидКИЗ
		И СтрокаЗаказа.РазмерКИЗ = ПараметрыКода.РазмерКИЗ
		И СтрокаЗаказа.СпособВводаВОборот = ПараметрыКода.СпособВводаВОборот
		И СтрокаЗаказа.КодТНВЭД = ПараметрыКода.КодТНВЭД);

КонецФункции

// Новая таблица параметров заказа кодов маркировки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица параметров заказа кодов маркировки:
// * СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ -
// * Шаблон - ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ -
// * GTIN - ОпределяемыйТип.GTIN
// * ВидКИЗ - ПеречислениеСсылка.ВидыКиЗГИСМ -
// * РазмерКИЗ - ПеречислениеСсылка.РазмерыКиЗГИСМ -
// * КодТНВЭД - Строка -
Функция НоваяТаблицаПараметровЗаказаКодовМаркировки() Экспорт

	ПараметрыЗаказа = Новый ТаблицаЗначений();
	ПараметрыЗаказа.Колонки.Добавить("СпособВводаВОборот", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	ПараметрыЗаказа.Колонки.Добавить("Шаблон",             Новый ОписаниеТипов("ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ"));
	ПараметрыЗаказа.Колонки.Добавить("GTIN",               ОпределяемыеТипы().GTIN.Тип);
	ПараметрыЗаказа.Колонки.Добавить("ВидКИЗ",             Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКиЗГИСМ"));
	ПараметрыЗаказа.Колонки.Добавить("РазмерКИЗ",          Новый ОписаниеТипов("ПеречислениеСсылка.РазмерыКиЗГИСМ"));
	ПараметрыЗаказа.Колонки.Добавить("КодТНВЭД",           ОбщегоНазначения.ОписаниеТипаСтрока(10));

	Возврат ПараметрыЗаказа;

КонецФункции

Функция ЗапроситьСтатусПулаКодовМаркировкиПоСтрокеЗаказаИПолучитьКоды(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	РезультатОбработкиПула = Новый Структура;
	РезультатОбработкиПула.Вставить("ОбработкаПулаЗавершена",                      Ложь);
	РезультатОбработкиПула.Вставить("ИдентификаторПоследнегоБлокаКодов");
	РезультатОбработкиПула.Вставить("ОбновитьИдентификаторЗаявкиСообщенияОчереди", Ложь);
	РезультатОбработкиПула.Вставить("ТребуетсяОбновлениеКлючаСессии",              Ложь);
	РезультатОбработкиПула.Вставить("ТекстОшибки",                                 Неопределено);

	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	ТребуетсяAPIv3   = (ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха);

	Если НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V1 Тогда
		Результат = ИнтерфейсСУЗ.СтатусПулаКодовМаркировкиИзБизнесЗаказа_V1(
			ПараметрыЗапроса,
			НастройкаОбменаСУЗ);
	ИначеЕсли НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V2 Тогда
		Если ТребуетсяAPIv3 Тогда
			Результат = ИнтерфейсСУЗ.СтатусЗаказаПоИдентификатору(ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ, ПараметрыЗапроса.ИдентификаторБизнесЗаказа)
		Иначе
			Результат = ИнтерфейсСУЗ.СтатусПулаКодовМаркировкиИзБизнесЗаказа_V2(
				ПараметрыЗапроса, ЭлементОчереди.ВидПродукции,
				НастройкаОбменаСУЗ);
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Формат обмена %1 не поддерживается'"),
			ЭлементОчереди.ФорматОбмена);
	КонецЕсли;
	
	КодыМожноЗагружать = Истина;
	Если ТребуетсяAPIv3 Тогда
		Если Результат.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗОтгруженоЗаказчику Тогда
			СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Готов;
		ИначеЕсли Результат.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка Тогда
			КодыМожноЗагружать = Ложь;
		Иначе
			СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Закрыт;
		КонецЕсли;
	ИначеЕсли Результат.ДанныеПула <> Неопределено Тогда
		ДанныеПула = Результат.ДанныеПула;
		СтатусПула = ДанныеПула.Статус;
	Иначе
		КодыМожноЗагружать = Ложь;
	КонецЕсли;

	Если КодыМожноЗагружать Тогда
		
		ОбработатьПараметрыЗагрузкиКодовПриВыполненииОперации(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);

		ЭлементОчередиСообщенияОснования = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);

		Если ДобавлятьЗаписьВПротоколОбмена(ЭлементОчередиСообщенияОснования, Результат) Тогда
			ДобавитьВПротоколОбмена(
				ЭлементОчередиСообщенияОснования,
				Результат);
			РезультатОбработкиПула.ОбновитьИдентификаторЗаявкиСообщенияОчереди = Истина;
		КонецЕсли;
		
		Если СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Готов Тогда
			
			РезультатЗапросаКодовМаркировки = ЗапроситьКодыМаркировкиИзБизнесЗаказа(
				ПараметрыЗапроса, ДанныеПула,
				ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
			
			Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаКодовМаркировки, ЭлементОчереди, ПараметрыОбмена) Тогда
				РезультатОбработкиПула.ТребуетсяОбновлениеКлючаСессии = Истина;
				Возврат РезультатОбработкиПула;
			КонецЕсли;
			
			Если РезультатЗапросаКодовМаркировки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается Тогда
				
				// Требуется ожидание
				Если ЭлементОчереди.ТекущийСтатус = СтатусПула
					И ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки Тогда
					// Если с момента последнего изменения статуса прошло более 5 минут,
					// то отложим обработку элемента очереди до следующей попытки обмена.
					Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
						И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
						ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
					Иначе
						УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
					КонецЕсли;
				Иначе
					
					ЭлементОчереди.ТекущийСтатус          = СтатусПула;
					ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки;
					
					Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
						ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
					КонецЕсли;
					
				КонецЕсли;
				
				РезультатОбработкиПула.ОбработкаПулаЗавершена = Ложь;
				
			Иначе
				
				Если ЗначениеЗаполнено(РезультатЗапросаКодовМаркировки.ТекстОшибки) Тогда
					Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо Тогда
						РезультатОбработкиПула.ОбработкаПулаЗавершена = Истина;
					Иначе
						ВызватьИсключение РезультатЗапросаКодовМаркировки.ТекстОшибки;
					КонецЕсли;
				ИначеЕсли ТребуетсяAPIv3 Тогда
					РезультатОбработкиПула.ОбработкаПулаЗавершена = Истина;
					РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов = РезультатЗапросаКодовМаркировки.ДанныеБлока.ИдентификаторПоследнегоБлокаКодов;
				Иначе
					РезультатОбработкиПула.ОбработкаПулаЗавершена = (ДанныеПула.Остаток - РезультатЗапросаКодовМаркировки.ДанныеБлока.КодыМаркировки.Количество()) <= 0;
					РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов = РезультатЗапросаКодовМаркировки.ДанныеБлока.ИдентификаторПоследнегоБлокаКодов;
				КонецЕсли;
				
				ЭлементОчереди.ТекущийСтатус          = СтатусПула;
				ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки;
				
				Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
					ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Обрабатывается Тогда
			
			// Требуется ожидание
			Если ЭлементОчереди.ТекущийСтатус = СтатусПула
				И ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки Тогда
				// Если с момента последнего изменения статуса прошло более 5 минут,
				// то отложим обработку элемента очереди до следующей попытки обмена.
				Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
					И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
					ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
				Иначе
					УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
				КонецЕсли;
			Иначе
				
				ЭлементОчереди.ТекущийСтатус          = СтатусПула;
				ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки;
				
				Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
					ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
				КонецЕсли;
				
			КонецЕсли;
			
			РезультатОбработкиПула.ОбработкаПулаЗавершена = Ложь;
			
		ИначеЕсли СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Закрыт Тогда
			
			// Элемент очереди отработан
			РезультатОбработкиПула.ОбработкаПулаЗавершена = Истина;
			
			ЭлементОчереди.ТекущийСтатус          = СтатусПула;
			ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки;
			
			Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
				ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
			КонецЕсли;
			
		ИначеЕсли СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка
			Или СтатусПула = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Отклонен Тогда
			
			// Элемент очереди отработан
			РезультатОбработкиПула.ОбработкаПулаЗавершена = Истина;
			
			ЭлементОчереди.ТекущийСтатус          = СтатусПула;
			ЭлементОчереди.ТекущийСтатусОбработки = Результат.СтатусОбработки;
			
			Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
				ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Результат.РезультатОтправкиЗапроса <> Неопределено
		И Результат.РезультатОтправкиЗапроса.КодСостояния = 400 Тогда
		
		// Элемент очереди отработан
		РезультатОбработкиПула.ОбработкаПулаЗавершена = Истина;
		
	ИначеЕсли Результат.РезультатОтправкиЗапроса <> Неопределено
		И Результат.РезультатОтправкиЗапроса.КодСостояния = 404 Тогда
		
		// Подзаказ утерян
		РезультатОбработкиПула.ОбработкаПулаЗавершена = Истина;
		ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Подзаказ %1 не найден в ГИС МТ.'"),
			ПараметрыЗапроса.ИдентификаторБизнесЗаказа);
			
		Результат.ТекстОшибки = ТекстОшибки + Символы.ПС + Результат.ТекстОшибки;
		
		ЭлементОчередиСообщенияОснования = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
		Если ЭлементОчередиСообщенияОснования <> Неопределено Тогда
			ДобавитьВПротоколОбмена(
				ЭлементОчередиСообщенияОснования,
				Результат);
		КонецЕсли;
		
		ЭлементОчереди.ТекущийСтатус          = Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка;
		ЭлементОчереди.ТекущийСтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;

	ИначеЕсли Результат.ТребуетсяОбновлениеКлючаСессии Тогда
		
		РезультатОбработкиПула.ТребуетсяОбновлениеКлючаСессии = Истина;
		
	Иначе
		
		ВызватьИсключение Результат.ТекстОшибки;
		
	КонецЕсли;
	
	Возврат РезультатОбработкиПула;
	
КонецФункции

Процедура ОбработатьПараметрыЗагрузкиКодовПриВыполненииОперации(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)

	Если ЭлементОчереди.Операция <> Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо Тогда
		Возврат;
	КонецЕсли;

	Если Не ПараметрыОбмена.Свойство("ПараметрыЗагрузкиКодовМаркировкиВПул") Тогда
		ПараметрыОбмена.Вставить("ПараметрыЗагрузкиКодовМаркировкиВПул", Новый Соответствие());
	КонецЕсли;

	ПараметрыЗагрузкиКодовМаркировкиВПул = ПараметрыОбмена.ПараметрыЗагрузкиКодовМаркировкиВПул[ЭлементОчереди.Сообщение];
	Если ПараметрыЗагрузкиКодовМаркировкиВПул = Неопределено Тогда
		ПараметрыЗагрузкиКодовМаркировкиВПул = ПараметрыЗагрузкиКодовМаркировкиВПул();
		ПараметрыЗагрузкиКодовМаркировкиВПул.ТребуетсяПоискСуществующихКодов = (ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо);
		ПараметрыОбмена.ПараметрыЗагрузкиКодовМаркировкиВПул.Вставить(
			ЭлементОчереди.Сообщение,
			ПараметрыЗагрузкиКодовМаркировкиВПул);
	КонецЕсли;

	Если ПараметрыЗагрузкиКодовМаркировкиВПул.ТребуетсяПоискСуществующихКодов
		И Не ПараметрыЗагрузкиКодовМаркировкиВПул.СуществуюшиеКодыПрочитаны Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки
			|ИЗ
			|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
			|ГДЕ
			|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &Документ";

		Запрос.УстановитьПараметр("Документ", ЭлементОчереди.Документ);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПараметрыЗагрузкиКодовМаркировкиВПул.СуществующиеКоды.Добавить(ВыборкаДетальныеЗаписи.КодМаркировки);
		КонецЦикла;
		ПараметрыЗагрузкиКодовМаркировкиВПул.СуществуюшиеКодыПрочитаны = Истина;
	КонецЕсли;

КонецПроцедуры

Функция ДобавлятьЗаписьВПротоколОбмена(ЭлементОчередиСообщения, Результат)

	ДобавлятьЗаписьВПротоколОбмена = Истина;
	Если ЭлементОчередиСообщения.ПротоколОбмена = Неопределено Тогда
		Возврат ДобавлятьЗаписьВПротоколОбмена;
	КонецЕсли;
	Если ЭлементОчередиСообщения <> Неопределено Тогда
		КоличествоСтрокПротоколаОбмена = ЭлементОчередиСообщения.ПротоколОбмена.Количество();
		Если КоличествоСтрокПротоколаОбмена > 0 Тогда
			ПоследняяЗаписьПротокола = ЭлементОчередиСообщения.ПротоколОбмена[КоличествоСтрокПротоколаОбмена - 1];
			Если ПоследняяЗаписьПротокола.СтатусОбработки = Результат.СтатусОбработки
				И ПоследняяЗаписьПротокола.ОтветТело = Результат.РезультатОтправкиЗапроса.ТекстВходящегоСообщения Тогда
				ДобавлятьЗаписьВПротоколОбмена = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДобавлятьЗаписьВПротоколОбмена = Ложь;
	КонецЕсли;

	Возврат ДобавлятьЗаписьВПротоколОбмена;

КонецФункции

Процедура ЗагрузитьРезультатОбработкиЗаказаНаЭмиссиюКодовМаркировкиИСМП(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	РезультатОбработкиЗаявки = ИнтерфейсИСМП.СтатусОбработкиДокументаПоИдентификатору(
		ЭлементОчереди.ИдентификаторЗаявки, ЭлементОчереди.Организация,, Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	// Ошибка валидации. Один или несколько запрошенных ID заказов не найдены.
	// Способ обхода: повтор запроса.
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
		РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.Объект,
		"error_code")
		И РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.Объект.error_code = 412102 Тогда
		ТребуетсяПовторОперации = Истина;
	КонецЕсли;
	
	СтатусыЗаказов = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП;
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		ИначеЕсли РезультатОбработкиЗаявки.Статус = СтатусыЗаказов.ИСМПНаРассмотренииОператором
			Или РезультатОбработкиЗаявки.Статус = СтатусыЗаказов.КОплате Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПолноеИмя = ЭлементОчереди.Документ.Метаданные().ПолноеИмя();
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Неопределено;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			РезультатОбработкиЗаявки.Операция,
			ПараметрыОбновленияСтатуса);
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
			РезультатОбработкиЗаявки);
	
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             РезультатОбработкиЗаявки.ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
		КонецЕсли;
		
		Если РезультатОбработкиЗаявки.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПринятКПроизводству
			Или РезультатОбработкиЗаявки.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗКодыМаркировкиЭмитированыЧастично Тогда
			
			ТребуетсяЗапроситьКоды = Истина;
			Если РезультатОбработкиЗаявки.Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗКодыМаркировкиЭмитированыЧастично Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК КодМаркировки
				|ИЗ
				|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
				|ГДЕ
				|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &ЗаказНаЭмиссию");
				Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЭлементОчереди.Документ);
				ТребуетсяЗапроситьКоды = Не Запрос.Выполнить().Пустой();
			КонецЕсли;
			
			Объект = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.Объект;
			Если Объект <> Неопределено И ТребуетсяЗапроситьКоды Тогда
				
				ЗагружатьДо = ЭлементОчереди.Сообщение;
				
				document_information = Объект.document_information;
				Для Каждого ЭлементДанных Из document_information.products_information Цикл
					
					ПараметрыЗапроса = Новый Структура;
					ПараметрыЗапроса.Вставить("ИдентификаторБизнесЗаказа", ЭлементОчереди.ИдентификаторЗаявки);
					ПараметрыЗапроса.Вставить("ИдентификаторСтрокиЗаказа", ЭлементДанных.order_line_id);
					ПараметрыЗапроса.Вставить("GTIN",                      ЭлементДанных.gtin);
					
					НовыйЭлементОчереди = ПодготовитьОчередьЗагрузкиКодовМаркировкиПоЗаказуНаЭмиссию(
						ПараметрыЗапроса,
						ЭлементОчереди, ЗагружатьДо, ПараметрыОбмена, НастройкаОбменаСУЗ);
					
					Если НовыйЭлементОчереди <> Неопределено Тогда
						
						// Коды маркировки загружаются строго последовательно.
						ЗагружатьДо = НовыйЭлементОчереди.Сообщение;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаРезультата = СтруктураИзменения();
		СтрокаРезультата.Организация               = ЭлементОчереди.Организация;
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		СтрокаРезультата.НовыйСтатус       = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен     = Ложь;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

Процедура УстановитьДатуСледующейИтерации(ЭлементОчереди, Инкремент = 1)
	
	Если Инкремент > 0 Тогда
		ЭлементОчереди.КоличествоИтераций = ЭлементОчереди.КоличествоИтераций + Инкремент;
	Иначе
		ЭлементОчереди.КоличествоИтераций = 1;
	КонецЕсли;
	
	ЭлементОчереди.ДатаСледующейИтерации = ТекущаяДатаСеанса() + ВремяОжидания(ЭлементОчереди.КоличествоИтераций);
	
КонецПроцедуры

Процедура УстановитьДатуСледующейИтерацииЗапросаКСУЗ(ЭлементОчереди)

	ВремяОжидания = ИнтерфейсСУЗ.ИнтервалПолученияСтатусаОбработкиОтчетаСУЗ();
	Если ВремяОжидания > 0 Тогда
		ЭлементОчереди.ДатаСледующейИтерации = ТекущаяДатаСеанса() + ВремяОжидания;
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьКодыМаркировки(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	РезультатОбработкиПула = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.СообщениеОснование;
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
		НаборЗаписейОснования.Прочитать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		РезультатОбработкиПула = ЗапроситьСтатусПулаКодовМаркировкиПоСтрокеЗаказаИПолучитьКоды(
			ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиПула, ЭлементОчереди, ПараметрыОбмена) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Если РезультатОбработкиПула.ОбновитьИдентификаторЗаявкиСообщенияОчереди
			И ЭлементОчередиОснование <> Неопределено Тогда
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписейОснования,,,
				Новый ХранилищеЗначения(ЭлементОчередиОснование.ПротоколОбмена));
		КонецЕсли;
		
		ОбновитьИдентификаторЗаявкиСообщенияОчереди(
			НаборЗаписей,,,,
			РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов);
		
		Если РезультатОбработкиПула.ОбработкаПулаЗавершена Тогда
			
			Если НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V2 Тогда
				
				Если ЭлементОчереди.ТекущийСтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
					И ЭлементОчереди.ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
					
					ПараметрыЗапроса = Новый Структура;
					ПараметрыЗапроса.Вставить("ИдентификаторБизнесЗаказа",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ИдентификаторБизнесЗаказа);
					ПараметрыЗапроса.Вставить("ИдентификаторСтрокиЗаказа",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ИдентификаторСтрокиЗаказа);
					ПараметрыЗапроса.Вставить("GTIN",                              ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.GTIN);
					ПараметрыЗапроса.Вставить("Шаблон",                            ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Шаблон);
					ПараметрыЗапроса.Вставить("ИдентификаторПоследнегоБлокаКодов", РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов);
					ПараметрыЗапроса.Вставить("ДанныеПовторногоПолучения",         Неопределено);
					
					РезультатДанныхПовтороногоПолучения = ДанныеПовторногоПолученияКодов(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
					Если ТребуетсяОбновлениеКлючаСессии(РезультатДанныхПовтороногоПолучения, ЭлементОчереди, ПараметрыОбмена) Тогда
						Возврат;
					КонецЕсли;
					ПараметрыЗапроса.ДанныеПовторногоПолучения = РезультатДанныхПовтороногоПолучения.Данные;
					
					Если ЭлементОчередиОснование = Неопределено Тогда
						ЭлементОчередиКПередаче            = ЭлементОчереди;
						ЭлементОчередиКПередачеЗагружатьДо = "";
					Иначе
						ЭлементОчередиКПередаче            = ЭлементОчередиОснование;
						ЭлементОчередиКПередачеЗагружатьДо = ЭлементОчередиОснование.Сообщение;
					КонецЕсли;
					
					ПодготовитьКПередачеСообщениеНаЗакрытиеПодзаказаНаЭмиссиюКодовМаркировки(
						ЭлементОчередиКПередаче, ЭлементОчередиКПередачеЗагружатьДо, ПараметрыЗапроса, ПараметрыОбмена, НастройкаОбменаСУЗ);
					
				КонецЕсли;
				
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;

		ТранзакцияЗафиксирована = Истина;

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();

		ТранзакцияЗафиксирована = Ложь;

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);

		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			"");

		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;

		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);

	КонецПопытки;

	Если (РезультатОбработкиПула <> Неопределено
		И РезультатОбработкиПула.ОбработкаПулаЗавершена)
		И ТранзакцияЗафиксирована Тогда

		ЭлементОчереди.ИдентификаторПоследнегоБлокаКодов = РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов;
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);

	ИначеЕсли Не ТранзакцияЗафиксирована Тогда

		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);

		Возврат;

	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьКодыМаркировкиНезависимо(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)

	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	РезультатОбработкиПула = Неопределено;

	НачатьТранзакцию();

	Попытка

		Блокировка = Новый БлокировкаДанных;

		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;

		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");

		Блокировка.Заблокировать();

		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();

		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			ЗафиксироватьТранзакцию();
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			Возврат;
		КонецЕсли;

		РезультатОбработкиПула = ЗапроситьСтатусПулаКодовМаркировкиПоСтрокеЗаказаИПолучитьКоды(
			ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);

		Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиПула, ЭлементОчереди, ПараметрыОбмена) Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;

		ОбновитьИдентификаторЗаявкиСообщенияОчереди(
			НаборЗаписей,,,,
			РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов);

		Если РезультатОбработкиПула.ОбработкаПулаЗавершена Тогда
			ЗаписатьПротоколОбменаВФайлСОписаниемОшибкиИзПротокола(ЭлементОчереди);
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			ОбработатьРезультатПолученияСообщения(РезультатОбработкиПула, ЭлементОчереди, ПараметрыОбмена);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			"");
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если (РезультатОбработкиПула <> Неопределено
		И РезультатОбработкиПула.ОбработкаПулаЗавершена)
		И ТранзакцияЗафиксирована Тогда
		
		ЭлементОчереди.ИдентификаторПоследнегоБлокаКодов = РезультатОбработкиПула.ИдентификаторПоследнегоБлокаКодов;
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьКодыМаркировкиПовторно(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.СообщениеОснование;
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
		НаборЗаписейОснования.Прочитать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		Для Каждого СтрокаПовторногоПолучения Из ПараметрыЗапроса.ДанныеПовторногоПолучения Цикл
		
			ДанныеПулаПовторно = Новый Структура();
			ДанныеПулаПовторно.Вставить("GTIN",    ПараметрыЗапроса.GTIN);
			ДанныеПулаПовторно.Вставить("Остаток", СтрокаПовторногоПолучения.Количество);
			
			ЭлементОчереди.ИдентификаторПоследнегоБлокаКодов = СтрокаПовторногоПолучения.ИдентификаторБлока;
			
			РезультатЗапросаКодовМаркировки = ЗапроситьКодыМаркировкиИзБизнесЗаказа(
				ПараметрыЗапроса, ДанныеПулаПовторно,
				ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
			
			Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаКодовМаркировки, ЭлементОчереди, ПараметрыОбмена) Тогда
				Возврат;
			КонецЕсли;
			
			ДанныеОбработаны = Истина;
			
			Если РезультатЗапросаКодовМаркировки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается Тогда
				
				// Требуется ожидание
				Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
					И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
					ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
				Иначе
					УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
				КонецЕсли;
				ЭлементОчереди.ТекущийСтатус = Перечисления.СтатусыДокументовИСМП.Обрабатывается;
			
				ДанныеОбработаны = Ложь;
				
			ИначеЕсли РезультатЗапросаКодовМаркировки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
				
				ЭлементОчереди.ТекущийСтатус                = Перечисления.СтатусыДокументовИСМП.Принят;
				ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
				
			Иначе
				
				ЭлементОчереди.ТекущийСтатус                = Перечисления.СтатусыДокументовИСМП.Ошибка;
				ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
				
			КонецЕсли;
			
			Если ДанныеОбработаны Тогда
				ИндексСтроки = ПараметрыЗапроса.ДанныеПовторногоПолучения.Найти(СтрокаПовторногоПолучения);
				ПараметрыЗапроса.ДанныеПовторногоПолучения.Удалить(ИндексСтроки);
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
		Если ПараметрыЗапроса.ДанныеПовторногоПолучения.Количество() = 0 Тогда
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке кодов маркировки (повторно) по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке кодов маркировки (повторно) по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			"");
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ПараметрыЗапроса.ДанныеПовторногоПолучения.Количество() = 0
		И ТранзакцияЗафиксирована Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыЗагрузкиКодовМаркировкиВПул()

	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ТребуетсяПоискСуществующихКодов", Ложь);
	ВозвращаемоеЗначение.Вставить("СуществуюшиеКодыПрочитаны",       Ложь);
	ВозвращаемоеЗначение.Вставить("СуществующиеКоды",                Новый Массив());

	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция ДанныеПовторногоПолученияКодов(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("Данные",                         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	ПараметрыЗапросаКодов = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	Количество = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапросаКодов, "Количество", 0);
	GTIN       = ПараметрыЗапросаКодов.GTIN;
	
	Если Не ЗначениеЗаполнено(Количество) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПулКодовМаркировкиСУЗ.КодМаркировки) КАК Количество,
		|	ПулКодовМаркировкиСУЗ.ИдентификаторБлокаСУЗ     КАК ИдентификаторБлока
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию           = &ЗаказНаЭмиссию
		|	И ПулКодовМаркировкиСУЗ.ИдентификаторЗаказаСУЗ = &ИдентификаторЗаказаСУЗ
		|	И ПулКодовМаркировкиСУЗ.GTIN                   = &GTIN
		|СГРУППИРОВАТЬ ПО
		|	ПулКодовМаркировкиСУЗ.ИдентификаторБлокаСУЗ";
	
	Запрос.УстановитьПараметр("GTIN",                   GTIN);
	Запрос.УстановитьПараметр("ИдентификаторЗаказаСУЗ", ПараметрыЗапросаКодов.ИдентификаторБизнесЗаказа);
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию",         ЭлементОчереди.Документ);
	
	ТаблицаБлоков = Запрос.Выполнить().Выгрузить();
	ПолученоКодов = ТаблицаБлоков.Итог("Количество");
	
	Если ПолученоКодов >= Количество Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	РезультатЗапроса = ИнтерфейсСУЗ.ЗапроситьСписокИдентификаторовПакетовБизнесЗаказа_V2(
		ПараметрыЗапросаКодов, ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ);
	
	Если РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если РезультатЗапроса.СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеПовторногоПолучения = Новый Массив();
	
	Для Каждого СтрокаРезультат Из РезультатЗапроса.ДанныеБлоков Цикл
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("ИдентификаторБлока", СтрокаРезультат.ИдентификаторБлока);
		
		ПоискБлоков = ТаблицаБлоков.НайтиСтроки(СтруктураПоиска);
		
		Если ПоискБлоков.Количество() = 0 Тогда
			ДанныеПовторногоПолучения.Добавить(СтрокаРезультат);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеПовторногоПолучения.Количество() <> 0 Тогда
		ВозвращаемоеЗначение.Данные = ДанныеПовторногоПолучения
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ЗагрузитьРезультатОбработкиАгрегацииПриемкиОтгрузкиТоваров(ЭлементОчереди, ПараметрыОбмена)
	
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление Тогда
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультатАгрегации";
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулирование Тогда
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультатОтгрузкиТоваровИСМП";
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКУдаление Тогда
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультатУдаленияАТК";
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКИзменение Тогда
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультаИзмененияАТК";
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКСоздание Тогда
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультатСозданияАТК";
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозлива Тогда
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультатОбработкиДокумента";
	Иначе
		КлючеваяОперация = "ОбщийМодуль.ИнтеграцияИСМПСлужебный.ЗагрузитьРезультатПриемкиТоваровИСМП";
	КонецЕсли;
	
	РезультатОбработкиЗаявки = ИнтерфейсИСМП.СтатусОбработкиДокументаПоИдентификатору(
		ЭлементОчереди.ИдентификаторЗаявки,
		ЭлементОчереди.Организация,
		ЭлементОчереди.ВидПродукции,
		ЭлементОчереди.Операция);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчередиОснование.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
		НаборЗаписейОснования.Прочитать();

		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования.Количество() = 0 Тогда

				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();

			Иначе

				ОтменитьТранзакцию();

			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиОснование,
			РезультатОбработкиЗаявки);
			
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетРегистрациюУчастникаГИСМТ
			Тогда
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			
			ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
			ПараметрыОбновленияСтатуса.Статус            = Неопределено;
			ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
			ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
			ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
			ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
			
			Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКУдаление Тогда
				ЕстьЗависимыеСообщения = Истина;
			Иначе
				ЕстьЗависимыеСообщения = Ложь;
				Для Каждого ЭлементОчередиКУдалению Из ПараметрыОбмена.ОчередьСообщений Цикл
					Если ЭлементОчередиКУдалению.Сообщение <> ЭлементОчереди.Сообщение
						И ЭлементОчередиКУдалению.СообщениеОснование = ЭлементОчереди.СообщениеОснование Тогда
						ЕстьЗависимыеСообщения = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;

			ПараметрыОбновленияСтатуса.Вставить("ЕстьЗависимыеСообщения", ЕстьЗависимыеСообщения);
			
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
				ЭлементОчереди.Документ,
				Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
				ПараметрыОбновленияСтатуса);
			
			Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда

				Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКСоздание Тогда

					КодАТК = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.Объект[0].body.atk;
					ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
					ВложенныеКоды    = ПараметрыЗапроса.ДанныеСообщения;

					ПараметрыЗапросаКОбновлению = ЭлементОчередиОснование.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
					Если ПараметрыЗапросаКОбновлению.Свойство("РезультатФормированияАТК") Тогда
						РезультатФормированияАТК = ПараметрыЗапросаКОбновлению.РезультатФормированияАТК;
					Иначе
						РезультатФормированияАТК = Новый Массив;
						ПараметрыЗапросаКОбновлению.Вставить("РезультатФормированияАТК", РезультатФормированияАТК);
					КонецЕсли;
					РезультатФормированияАТК.Добавить(Новый Структура("КодАТК, ВложенныеКоды", КодАТК, ВложенныеКоды));

					ОбновитьПараметрыЗапросаИсходящегоСообщенияВОчереди(ЭлементОчередиОснование, ПараметрыЗапросаКОбновлению);

				Иначе

					ОбработкаЗагрузкиПереданногоДокумента(
						ЭлементОчереди,
						ПараметрыОбмена,
						РезультатОбработкиЗаявки,
						ПараметрыОбновленияСтатуса);

				КонецЕсли;

			ИначеЕсли РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
				И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса <> Неопределено 
				И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ДанныеСообщения") Тогда

				ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчереди);

			КонецЕсли;
			
			Если РезультатОбработкиЗаявки.СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
				СтрокаРезультата = СтруктураИзменения();
				СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
				СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
				
				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
				СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
				
				СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
				СтрокаРезультата.ОбъектИзменен         = Ложь;
				
				СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
				СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
				
				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;
		
		ОбновитьИдентификаторЗаявкиСообщенияОчереди(
			НаборЗаписейОснования,,,
			Новый ХранилищеЗначения(ЭлементОчередиОснование.ПротоколОбмена));
			
		ТранзакцияЗафиксирована = Истина;
				
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьВходящиеДокументы(ЭлементОчереди, ПараметрыОбмена)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТипИСМП = "ЗагрузитьВходящиеДокументы";
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		// Загрузка входящих документов в ИБ
		ПараметрыЗагрузки = Новый Структура;
		Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("НачалоПериода")
			Или ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("КонецПериода") Тогда
			ПараметрыЗагрузки.Вставить("НачалоПериода", ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.НачалоПериода);
			ПараметрыЗагрузки.Вставить("КонецПериода",  ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.КонецПериода);
		КонецЕсли;
		
		Результат = ЗагрузитьДокументы(ЭлементОчереди, ПараметрыОбмена, ПараметрыЗагрузки);
		
		Если ТребуетсяОбновлениеКлючаСессии(Результат, ЭлементОчереди, ПараметрыОбмена)
			Или ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = Результат.ТекстОшибки;
			ТранзакцияЗафиксирована = Ложь;
			
		Иначе
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
			
			ТранзакцияЗафиксирована = Истина;
			
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке входящих документов возникла ошибка:
			           |Текст ошибки: %1
			           |Организация: %2
			           |Текст JSON см. в журнале регистрации.'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке входящих документов возникла ошибка:
			           |Текст ошибки: %1
			           |Организация: %2'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, Неопределено, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована Тогда
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	Иначе
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ЗагрузкаДокументовПриемкаТоваровИСМП

// Загрузка входящих документов Приемка товаров из ИС МП.
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//  ПараметрыЗагрузки - Структура - параметры отбора для загрузки
//   * НачалоПериода - Дата - дата начала отбора по периоду.
//   * КонецПериода  - Дата - дата окончания отбора по периоду.
// 
// Возвращаемое значение:
//  Структура - См. ИнтерфейсИСМП.НайтиДокументыПоОтбору, ИнтерфейсИСМП.СоставДокументаПоИдентификатору.
Функция ЗагрузитьДокументы(ЭлементОчереди, ПараметрыОбмена, ПараметрыЗагрузки)
	
	РезультатЗапросаДокументов = ВходящиеДокументы(ЭлементОчереди, ПараметрыЗагрузки);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаДокументов, ЭлементОчереди, ПараметрыОбмена)
		Или ЗначениеЗаполнено(РезультатЗапросаДокументов.ТекстОшибки)
		Или РезультатЗапросаДокументов.НайденныеДокументы = Неопределено Тогда
		Возврат РезультатЗапросаДокументов;
	КонецЕсли;
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ДоступныеДокументы.Идентификатор Как Идентификатор
	|ПОМЕСТИТЬ втДоступныеДокументы
	|ИЗ
	|	&ДоступныеДокументы как ДоступныеДокументы
	|ИНДЕКСИРОВАТЬ ПО 
	|	ДоступныеДокументы.Идентификатор");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	втДоступныеДокументы.Идентификатор
	|ИЗ
	|	втДоступныеДокументы КАК втДоступныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемкаТоваровИСМП КАК ПриемкаТоваровИСМП
	|		ПО втДоступныеДокументы.Идентификатор = ПриемкаТоваровИСМП.НомерЗаявкиНаОтгрузку
	|		И НЕ ПриемкаТоваровИСМП.ПометкаУдаления
	|ГДЕ
	|	ПриемкаТоваровИСМП.Ссылка ЕСТЬ NULL",
	"ДокументыДляЗагрузки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоступныеДокументы", РезультатЗапросаДокументов.ДоступныеДокументы);
	
	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	ДокументыДляЗагрузки = РезультатЗапроса["ДокументыДляЗагрузки"].Выгрузить();
	
	Если ДокументыДляЗагрузки.Количество() = 0 Тогда
		Возврат РезультатЗапросаДокументов;
	КонецЕсли;
	
	Для Каждого ИдентификаторДокумента Из ДокументыДляЗагрузки Цикл
		
		ЭлементОчередиДляЗагрузкиДокумента = Новый Структура;
		ЭлементОчередиДляЗагрузкиДокумента.Вставить("ПротоколОбмена");
		ЭлементОчередиДляЗагрузкиДокумента.Вставить("СообщениеОснование");
		ЭлементОчередиДляЗагрузкиДокумента.Вставить("Операция",     Перечисления.ВидыОперацийИСМП.ЗагрузкаВходящихДокументов);
		ЭлементОчередиДляЗагрузкиДокумента.Вставить("Организация",  ЭлементОчереди.Организация);
		ЭлементОчередиДляЗагрузкиДокумента.Вставить("ВидПродукции", ЭлементОчереди.ВидПродукции);
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Идентификатор",     ИдентификаторДокумента.Идентификатор);
		
		Если ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ЭлементОчереди.ВидПродукции) Тогда
			ПараметрыОбработки = ИнтерфейсИСМП.НовыеПараметрыОбработкиСоставаДокумента();
			ПараметрыОбработки.ИмяПоляСортировки = "gtin";
		КонецЕсли;

		СтруктураОбработкиДокумента = СоставДокументаПоИдентификатору(
			ЭлементОчередиДляЗагрузкиДокумента, ПараметрыОтбора, ПараметрыОбработки);
		
		Если ЗначениеЗаполнено(СтруктураОбработкиДокумента.ТекстОшибки)
			Или СтруктураОбработкиДокумента.ТребуетсяОбновлениеКлючаСессии
			Или СтруктураОбработкиДокумента.ДанныеДокумента = Неопределено Тогда
			
			Возврат СтруктураОбработкиДокумента;
			
		КонецЕсли;
		
		СоставДокумента = СтруктураОбработкиДокумента.СоставДокумента;
		Если СоставДокумента.Количество() > 0 Тогда
			
			РезультатПроверкиТоварнойГруппы = Неопределено;
			ПроверитьВидПродукцииДокументаПоДаннымСервиса(
				СоставДокумента, 
				ЭлементОчереди.Организация,
				ЭлементОчереди.ВидПродукции,
				РезультатПроверкиТоварнойГруппы);
			
			Если РезультатПроверкиТоварнойГруппы <> Неопределено Тогда
					
				Если РезультатПроверкиТоварнойГруппы.Свойство("РазличныеТоварныеГруппы") Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРезультата = СтруктураИзменения();
				
				СтрокаРезультата.Операция          = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение        = ЭлементОчереди.Назначение;
				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = Неопределено;
				СтрокаРезультата.ДокументОснование = Неопределено;
				
				СтрокаРезультата.ТекстОшибки           = РезультатПроверкиТоварнойГруппы.ТекстОшибки;
				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = Неопределено;
				СтрокаРезультата.ОбъектИзменен         = Ложь;
				
				СтрокаРезультата.Сообщение             = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ТекстСообщения        = "";
				
				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
				Продолжить;
			КонецЕсли;
			
			Для Каждого ДанныеДокумента Из СтруктураОбработкиДокумента.ДанныеДокумента Цикл
			
				ДокументОбъект = Документы.ПриемкаТоваровИСМП.СоздатьДокумент();
				ДокументОбъект.Организация  = ЭлементОчереди.Организация;
				ДокументОбъект.ВидПродукции = ЭлементОчереди.ВидПродукции;
				
				ТелоДокумента             = ДанныеДокумента.body;
				ВыводИзОборота            = Ложь;
				ЭтоТрансграничнаяОперация = Ложь;
				ЭтоОбъемноСортовойУчет    = Ложь;
				ВидБезвозмезднойОперации = Неопределено;
				Если ТелоДокумента.Свойство("withdrawal_from_turnover", ВыводИзОборота) и ВыводИзОборота Тогда
					ВидБезвозмезднойОперации = ТелоДокумента.withdrawal_type;
				КонецЕсли;
				
				Если ТелоДокумента.Свойство("sender_inn") Тогда
					ИННОтправителя = ТелоДокумента.sender_inn;
				КонецЕсли;
				Если ТелоДокумента.Свойство("turnover_type") Тогда
					ДокументОбъект.Операция = ВидОперацииПриемкаТоваров(ТелоДокумента.turnover_type, ВидБезвозмезднойОперации);
				ИначеЕсли ДанныеДокумента.Свойство("type") Тогда
					Если ДанныеДокумента.type = "LP_SHIP_GOODS_CROSSBORDER" Тогда
						ДокументОбъект.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля;
						ЭтоТрансграничнаяОперация = Истина;
					ИначеЕсли ДанныеДокумента.type = "EAS_CROSSBORDER" Тогда
						ДокументОбъект.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ;
						ЭтоТрансграничнаяОперация = Истина;
					ИначеЕсли ДанныеДокумента.type = "EAS_GTIN_CROSSBORDER_IMPORT" Тогда
						ДокументОбъект.Операция   = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ;
						ЭтоОбъемноСортовойУчет    = Истина;
					КонецЕсли;
					Если ЭтоТрансграничнаяОперация
						Или ЭтоОбъемноСортовойУчет Тогда
						Если ТелоДокумента.Свойство("exporter_taxpayer_id") Тогда
							ИННОтправителя = ТелоДокумента.exporter_taxpayer_id;
						КонецЕсли;
						ДокументОбъект.ИННОператора = ТелоДокумента.sender_inn;
					КонецЕсли;
				КонецЕсли;
				СертификацияИспользуется = (ЭтоТрансграничнаяОперация Или ЭтоОбъемноСортовойУчет);

				ДокументОбъект.НомерПервичногоДокумента = ТелоДокумента.document_num;
				Если ЗначениеЗаполнено(ТелоДокумента.document_date) Тогда
					ДокументОбъект.ДатаПервичногоДокумента = ПрочитатьДатуJSON(ТелоДокумента.document_date, ФорматДатыJSON.ISO);
				КонецЕсли;
				
				ДокументОбъект.ИННОтправителя = ИННОтправителя;
				
				Если ИнтеграцияИСМПСлужебныйКлиентСервер.ЭтоПриемкаИзСтранЕАЭС(ДокументОбъект.Операция) Тогда
					КонтрагентПоИНН = ИнтеграцияИСМП.КонтрагентПоНалоговомуНомеру(ДокументОбъект.ИННОтправителя);
				Иначе
					КонтрагентПоИНН = ИнтеграцияИСМП.КонтрагентПоИНН(ДокументОбъект.ИННОтправителя);
				КонецЕсли;
				
				Если КонтрагентПоИНН <> Неопределено Тогда
					ДокументОбъект.Контрагент = КонтрагентПоИНН;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТелоДокумента.transfer_date) Тогда
					ДокументОбъект.ДатаОтгрузки = ПрочитатьДатуJSON(ТелоДокумента.transfer_date, ФорматДатыJSON.ISO);
				КонецЕсли;
				
				ДокументОбъект.НомерЗаявкиНаОтгрузку = ДанныеДокумента.number;
				
				ДанныеШтрихкодов = Новый Массив;
				
				ЭтоМех = ДокументОбъект.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха;

				Для Каждого СтрокаКодаМаркировки Из СоставДокумента Цикл
					Если СтрокаКодаМаркировки.Свойство("cis") Тогда
						ИмяСвойстваКодМаркировки = "cis";
					ИначеЕсли СтрокаКодаМаркировки.Свойство("uit_code") Тогда
						ИмяСвойстваКодМаркировки = "uit_code";
					ИначеЕсли СтрокаКодаМаркировки.Свойство("uitu_code") Тогда
						ИмяСвойстваКодМаркировки = "uitu_code";
					ИначеЕсли СтрокаКодаМаркировки.Свойство("gtin") Тогда
						ИмяСвойстваКодМаркировки = "gtin";
					Иначе
						Продолжить;
					КонецЕсли;
					
					СтруктураШтрихкодов = Новый Структура;
					СтруктураШтрихкодов.Вставить("Штрихкод",   СтрокаКодаМаркировки[ИмяСвойстваКодМаркировки]);
					СтруктураШтрихкодов.Вставить("Количество", 1);
					СтруктураШтрихкодов.Вставить("Цена",       0);
					СтруктураШтрихкодов.Вставить("СуммаНДС",   0);
					СтруктураШтрихкодов.Вставить("GTIN",       "");
					
					Если СтрокаКодаМаркировки.Свойство("product_cost") Тогда
						СтруктураШтрихкодов.Цена = СтрокаКодаМаркировки.product_cost/100;
					КонецЕсли;
					Если СтрокаКодаМаркировки.Свойство("product_tax") Тогда
						СтруктураШтрихкодов.СуммаНДС = СтрокаКодаМаркировки.product_tax/100;
					КонецЕсли;
					Если (ЭтоМех Или ЭтоОбъемноСортовойУчет)
						И СтрокаКодаМаркировки.Свойство("gtin") Тогда
						СтруктураШтрихкодов.GTIN = СтрокаКодаМаркировки.gtin;
					КонецЕсли;
					
					Если ЭтоТрансграничнаяОперация Тогда
						СтруктураШтрихкодов.Вставить("КодТНВЭД", "");
						Если СтрокаКодаМаркировки.Свойство("tnved_code") Тогда
							СтруктураШтрихкодов.КодТНВЭД = СтрокаКодаМаркировки.tnved_code;
						КонецЕсли;
					ИначеЕсли ЭтоОбъемноСортовойУчет Тогда
						Если ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ДокументОбъект.ВидПродукции) Тогда
							СтруктураШтрихкодов.Вставить("ВСД", "");
							Если СтрокаКодаМаркировки.Свойство("vsd_number") Тогда
								СтруктураШтрихкодов.ВСД = СтрокаКодаМаркировки.vsd_number;
							КонецЕсли;
						КонецЕсли;
						Если СтрокаКодаМаркировки.Свойство("cis_quantity") Тогда
							СтруктураШтрихкодов.Количество = СтрокаКодаМаркировки.cis_quantity;
						КонецЕсли;
					КонецЕсли;

					Если СертификацияИспользуется Тогда
						СтруктураШтрихкодов.Вставить("ВидДокументаСертификации",   "");
						СтруктураШтрихкодов.Вставить("НомерДокументаСертификации", "");
						СтруктураШтрихкодов.Вставить("ДатаДокументаСертификации",  "");
						Если СтрокаКодаМаркировки.Свойство("certificate_document_data") Тогда
							Для Каждого ДанныеСерификации Из СтрокаКодаМаркировки.certificate_document_data Цикл
								СтруктураШтрихкодов.ВидДокументаСертификации   = ИнтерфейсИСМПСлужебный.ВидДокументаСертификации(ДанныеСерификации.certificate_type);
								СтруктураШтрихкодов.НомерДокументаСертификации = ДанныеСерификации.certificate_number;
								СтруктураШтрихкодов.ДатаДокументаСертификации  = ПрочитатьДатуJSON(ДанныеСерификации.certificate_date, ФорматДатыJSON.ISO);
								Прервать;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					
					ДанныеШтрихкодов.Добавить(СтруктураШтрихкодов);

					СтрокаШтрихкода = ДокументОбъект.ШтрихкодыУпаковок.Добавить();
					СтрокаШтрихкода.ЗначениеШтрихкода = СтруктураШтрихкодов.Штрихкод;
					СтрокаШтрихкода.Цена              = СтруктураШтрихкодов.Цена;
					СтрокаШтрихкода.СуммаНДС          = СтруктураШтрихкодов.СуммаНДС;
					СтрокаШтрихкода.GTIN              = СтруктураШтрихкодов.GTIN;
					Если СтрокаКодаМаркировки.Свойство("count_children") Тогда
						СтрокаШтрихкода.КоличествоУпаковок = СтрокаКодаМаркировки.count_children;
					ИначеЕсли СтрокаКодаМаркировки.Свойство("cis_quantity") Тогда
						СтрокаШтрихкода.КоличествоУпаковок = СтрокаКодаМаркировки.cis_quantity;
					Иначе
						СтрокаШтрихкода.КоличествоУпаковок = 1;
					КонецЕсли;

				КонецЦикла;
				
				Если ЭтоОбъемноСортовойУчет Тогда
					ШтрихкодированиеИСМПСлужебный.ЗаменитьЗначенияШтрихкодаНаОбъемноСортовойУчет(
						ДокументОбъект.ШтрихкодыУпаковок, "ЗначениеШтрихкода", "КоличествоУпаковок");
					ОбработкаДокументаОбъемноСортовогоУчета(ДокументОбъект, ДанныеШтрихкодов);
				Иначе

					РезультатЗапросаВложенныхШтриходов = Неопределено;
					ДополнитьТабличныеЧастиПоДаннымИСМП(ДокументОбъект, ДанныеШтрихкодов, РезультатЗапросаВложенныхШтриходов);

					Если РезультатЗапросаВложенныхШтриходов <> Неопределено Тогда
						СтрокаРезультата = СтруктураИзменения();

						СтрокаРезультата.Операция          = ЭлементОчереди.Операция;
						СтрокаРезультата.Назначение        = ЭлементОчереди.Назначение;
						СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
						СтрокаРезультата.Объект            = Неопределено;
						СтрокаРезультата.ДокументОснование = Неопределено;

						СтрокаРезультата.ТекстОшибки           = РезультатЗапросаВложенныхШтриходов.ТекстОшибки;
						СтрокаРезультата.ПодготовленоКПередаче = Ложь;
						СтрокаРезультата.Передано              = Ложь;
						СтрокаРезультата.Принято               = Истина;
						СтрокаРезультата.НовыйСтатус           = Неопределено;
						СтрокаРезультата.ОбъектИзменен         = Ложь;

						СтрокаРезультата.Сообщение             = ЭлементОчереди.Сообщение;
						СтрокаРезультата.ТекстСообщения        = "";

						ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
						Продолжить;
					КонецЕсли;
				
				КонецЕсли;

				ДокументОбъект.Дата = ТекущаяДатаСеанса();
				
				ДокументОбъект.Записать();
				
			КонецЦикла;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ДокументОбъект.Ссылка);
			Реквизиты.Вставить("ИдентификаторЗапроса", Неопределено);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.Сообщение);
			Реквизиты.Вставить("Версия",               "1.0");
			Реквизиты.Вставить("ТипСообщения",         Перечисления.ТипыЗапросовИС.Входящий);
			Реквизиты.Вставить("СтатусОбработки",      Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята);
			Реквизиты.Вставить("Описание",             "");
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчередиДляЗагрузкиДокумента.ПротоколОбмена);
			ИнтеграцияИСМПСлужебный.ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Назначение",      Перечисления.НазначениеСообщенийИСМП.ИСМП);
			ДополнительныеПараметры.Вставить("СтатусОбработки", Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята);
			ДополнительныеПараметры.Вставить("ВидПродукции",    ЭлементОчереди.ВидПродукции);
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ДокументОбъект.Ссылка);
			
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
				ДокументОбъект.Ссылка, ЭлементОчереди.Операция, ДополнительныеПараметры);
			
			СтрокаРезультата = СтруктураИзменения();
			
			СтрокаРезультата.Операция          = ЭлементОчереди.Операция;
			СтрокаРезультата.Назначение        = ЭлементОчереди.Назначение;
			СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
			СтрокаРезультата.Объект            = ДокументОбъект.Ссылка;
			СтрокаРезультата.ДокументОснование = Неопределено;
			
			СтрокаРезультата.ТекстОшибки           = СтруктураОбработкиДокумента.ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Ложь;
			СтрокаРезультата.Передано              = Ложь;
			СтрокаРезультата.Принято               = Истина;
			СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
			СтрокаРезультата.ОбъектИзменен         = Истина;
			
			СтрокаРезультата.Сообщение             = ЭлементОчереди.Сообщение;
			СтрокаРезультата.ТекстСообщения        = "";
			
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОбработкиДокумента;
	
КонецФункции

//Инициализация таблицы документов для входящих документов из ИС МП
//
// Возвращаемое значение:
//  ТаблицаЗначений - Описание:
//  * Идентификатор - Строка - Идентификатор документа.
//  * Статус - ПеречислениеСсылка.СтатусыДокументовИСМП - Статус документа.
Функция ИнициализироватьТаблицуДокументов()
	
	ТаблицаЗагруженныхДокументов = Новый ТаблицаЗначений;
	ТаблицаЗагруженныхДокументов.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ТаблицаЗагруженныхДокументов.Колонки.Добавить("Статус",        Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументовИСМП"));
	
	Возврат ТаблицаЗагруженныхДокументов;
	
КонецФункции

// Инициализация таблицы протокола обмена элемента очереди из ИС МП
//
// Возвращаемое значение:
//  ТаблицаЗначений - Описание:
//  * ДатаУниверсальная - Дата - Дата.
//  * Операция - ПеречислениеСсылка.ВидыОперацийИСМП - вид операции.
//  * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - статус обработки сообщения.
//  * Запрос - Строка - запрос.
//  * ЗапросЗаголовки - Строка - заголовки запроса.
//  * ЗапросТело - Строка - тело запроса.
//  * ОтветЗаголовки - Строка - заголовки ответа.
//  * ОтветТело - Строка - ответ.
//  * КодСостояния - Строка - код состояния запроса.
Функция ИнициализироватьТаблицуПротоколОбмена(ВключитьКодСостояния = Ложь) Экспорт
	
	ПротоколОбмена = Новый ТаблицаЗначений;
	ПротоколОбмена.Колонки.Добавить("ДатаУниверсальная", Новый ОписаниеТипов("Дата"));
	ПротоколОбмена.Колонки.Добавить("Операция",          Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийИСМП"));
	ПротоколОбмена.Колонки.Добавить("СтатусОбработки",   Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП"));
	ПротоколОбмена.Колонки.Добавить("Запрос",            Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ЗапросЗаголовки",   Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ЗапросТело",        Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ОтветЗаголовки",    Новый ОписаниеТипов("Строка"));
	ПротоколОбмена.Колонки.Добавить("ОтветТело",         Новый ОписаниеТипов("Строка"));
	Если ВключитьКодСостояния Тогда
		ПротоколОбмена.Колонки.Добавить("КодСостояния", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Возврат ПротоколОбмена;
	
КонецФункции

// Получает из сервиса ИС МП доступные для загрузки документы со статусом ОжидаетсяПодтверждениеПоступления
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ПараметрыЗагрузки - Структура - параметры отбора для загрузки.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//  * ТребуетсяОбновлениеКлючаСессии - Булево - Необходимость обновления ключа сессии.
//  * РезультатОтправкиЗапроса - (См. ИнтерфейсМОТПСлужебный.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
//  * НайденныеДокументы - Массив Из См. ИнтерфейсИСМПСлужебный.ИнициализироватьДанныеШапкиДокумента.
//                       - Неопределено - Если при получении данных возникла ошибка.
//  * ТекстОшибки        - Строка - Текст сообщения об ошибке.
//  * ПараметрыНавигации - Структура - (См. ИнтерфейсИСМПСлужебный.ИнициализироватьПараметрыНавигацииПоДокументам).
//                       - Неопределено - Если при получении данных возникла ошибка.
//  * ДоступныеДокументы - См. ИнициализироватьТаблицуДокументов.
Функция ВходящиеДокументы(ЭлементОчереди, ПараметрыЗагрузки)
	
	ДоступныеДокументы = ИнициализироватьТаблицуДокументов();
	
	РезультатЗапроса = Новый Структура;
	
	СведенияОбОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ЭлементОчереди.Организация);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипЗапроса",    Перечисления.ТипыЗапросовИС.Входящий);
	ПараметрыОтбора.Вставить("ПолучательИНН", СведенияОбОрганизации.ИНН);
	
	Если ЗначениеЗаполнено(ПараметрыЗагрузки.НачалоПериода)
		Или ЗначениеЗаполнено(ПараметрыЗагрузки.КонецПериода) Тогда
		ПараметрыОтбора.Вставить("Интервал",      Истина);
		ПараметрыОтбора.Вставить("НачалоПериода", ПараметрыЗагрузки.НачалоПериода);
		Если ЗначениеЗаполнено(ПараметрыЗагрузки.КонецПериода) Тогда
			ПараметрыОтбора.Вставить("КонецПериода",  КонецДня(ПараметрыЗагрузки.КонецПериода));
		Иначе
			ПараметрыОтбора.Вставить("КонецПериода",  ПараметрыЗагрузки.КонецПериода);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОтбора.Вставить("КоличествоЗаписей", 10);
	ПараметрыОтбора.Вставить(
		"ТипДокумента",
		"LP_SHIP_GOODS_CROSSBORDER,LP_SHIP_GOODS,LP_SHIP_GOODS_CSV,LP_SHIP_GOODS_XML,EAS_CROSSBORDER,EAS_GTIN_CROSSBORDER_IMPORT");
	
	ПараметрыНавигации = Неопределено;
	
	Пока ПараметрыНавигации = Неопределено 
		Или ПараметрыНавигации.КоличествоЗаписейОбработано = ПараметрыОтбора.КоличествоЗаписей Цикл
		
		РезультатЗапроса = ИнтерфейсИСМП.НайтиДокументыПоОтбору(
			ЭлементОчереди.Организация, ЭлементОчереди.ВидПродукции,
			ПараметрыОтбора, ПараметрыНавигации);
		
		Если ЗначениеЗаполнено(РезультатЗапроса.ТекстОшибки)
			Или РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии
			Или РезультатЗапроса.НайденныеДокументы = Неопределено
			Или РезультатЗапроса.НайденныеДокументы.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого ЭлементМассива Из РезультатЗапроса.НайденныеДокументы Цикл
			Если ЭлементМассива.Статус = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления Тогда
				ЗаполнитьЗначенияСвойств(ДоступныеДокументы.Добавить(), ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	РезультатЗапроса.Вставить("ДоступныеДокументы", ДоступныеДокументы);
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Получает из сервиса ИС МП состав продукции по идентификатору документа
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ПараметрыОтбора - Структура - параметры отбора для загрузки:
//  * КоличествоЗаписей - Число - Количество считываемых записей.
//  * Идентификатор - Строка - Идентификатор документа.
//  ПараметрыОбработки - Структура, Неопределено - Параметры обработки результата.
// Возвращаемое значение:
//  Структура - Структура со свойствами - См. ИнтерфейсИСМП.СоставДокументаПоИдентификатору.
Функция СоставДокументаПоИдентификатору(ЭлементОчереди, ПараметрыОтбора, ПараметрыОбработки = Неопределено)
	
	Результат = Новый Структура;
	
	РезультатЗапроса = ИнтерфейсИСМП.СоставДокументаПоИдентификатору(
		ЭлементОчереди.Организация, ЭлементОчереди.ВидПродукции,
		ПараметрыОтбора,, ПараметрыОбработки);
	
	Если РезультатЗапроса.СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Если РезультатЗапроса.СоставДокумента = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = РезультатЗапроса;
	
	ДобавитьВПротоколОбмена(ЭлементОчереди, РезультатЗапроса);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьВидПродукцииДокументаПоДаннымСервиса(СоставДокумента, Организация, ВидПродукции, РезультатЗапроса)
	
	ПакетКодовМаркировки = Новый Массив();
	Для Каждого СтрокаКодаМаркировки Из СоставДокумента Цикл
		
		Если СтрокаКодаМаркировки.Свойство("uit_code") Тогда
			ИмяСвойстваКодМаркировки = "uit_code";
		ИначеЕсли СтрокаКодаМаркировки.Свойство("uitu_code") Тогда
			ИмяСвойстваКодМаркировки = "uitu_code";
		Иначе
			Продолжить;
		КонецЕсли;
		
		ПакетКодовМаркировки.Добавить(СтрокаКодаМаркировки[ИмяСвойстваКодМаркировки]);
		Прервать;
		
	КонецЦикла;
	
	Если ПакетКодовМаркировки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РезультатПолученияДанных = ИнтерфейсИСМП.ТоварнаяГруппаПоКодамИдентификации(ПакетКодовМаркировки, Организация);
	
	Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
		РезультатЗапроса = РезультатПолученияДанных;
		Возврат;
	КонецЕсли;
	
	Если РезультатПолученияДанных.ВидПродукции <> ВидПродукции Тогда
		РезультатЗапроса = РезультатПолученияДанных;
		РезультатЗапроса.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Товарная группа сообщения %1 отличается от товарной группы документа %2.
			|Документ пропущен для загрузки'"),
			ВидПродукции,
			РезультатЗапроса.ВидПродукции);
		РезультатЗапроса.Вставить("РазличныеТоварныеГруппы", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

//Выполняет заполнение табличных частей переданного документа по данным ИС МП
//
// Параметры:
//  ДокументПриемка - ДокументОбъект.ПриемкаТоваровИСМП - документ для заполнения.
//  ДанныеШтрихкодов - Массив - Массив из подготовленных структур для получения данных вложенных штрихкодов по данным ИС МП.
Процедура ДополнитьТабличныеЧастиПоДаннымИСМП(ДокументПриемка, ДанныеШтрихкодов, РезультатЗапроса)
	
	ВидПродукции          = ДокументПриемка.ВидПродукции;
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(ДокументПриемка, Неопределено, ВидПродукции);
	ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Ложь);
	
	СоответствиеНормализованныхШтрихкодов = Новый Соответствие;
	
	ЭтоПриемкаИзЕАЭССПризнаниемКМ    = (ДокументПриемка.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ);
	ЭтоПриемкаТрансграничнаяТорговля = (ДокументПриемка.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля);
	ЭтоПриемкаПродукцииИзМеха        = ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха;
	
	РезультатПолученияДанных      = ШтрихкодированиеИСМПСлужебный.ВложенныеШтрихкодыПоДаннымИСМП(
		ДанныеШтрихкодов, ПараметрыСканирования);
	
	Если РезультатПолученияДанных.ЕстьОшибки Тогда
		РезультатЗапроса = РезультатПолученияДанных;
		Возврат;
	КонецЕсли;
	
	МаркированныеТовары = РезультатПолученияДанных.ВложенныеШтрихкоды.МаркированныеТовары.Скопировать(,
		"GTIN, Номенклатура, Характеристика, Серия, Количество, КоличествоПотребительскихУпаковок");
	МаркированныеТовары.Свернуть(
		"GTIN, Номенклатура, Характеристика, Серия",
		"Количество, КоличествоПотребительскихУпаковок");
	ДокументПриемка.Товары.Загрузить(МаркированныеТовары);
	
	Если ЭтоПриемкаПродукцииИзМеха Тогда
		
		СтруктураДействий = Новый Структура;
		
		ДанныеДокументаПоGTIN = Новый Соответствие;
		МаркированныеТоварыИСМП = РезультатПолученияДанных.ВложенныеШтрихкоды.МаркированныеТовары;
		МаркированныеТоварыИСМП.Индексы.Добавить("Штрихкод");
		ПараметрыОтбора = Новый Структура("Штрихкод");
		
		Для Каждого СтрокаДанных Из ДанныеШтрихкодов Цикл
			
			GTIN = СтрокаДанных.GTIN;
			Если Не ЗначениеЗаполнено(GTIN) Тогда
				ПараметрыОтбора.Штрихкод = СтрокаДанных.Штрихкод;
				НайденныеСтроки = МаркированныеТоварыИСМП.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() Тогда
					GTIN = НайденныеСтроки[0].GTIN;
				КонецЕсли;
			КонецЕсли;
			ДанныеСтрокиПоGTIN = ДанныеДокументаПоGTIN[GTIN];

			Если ДанныеСтрокиПоGTIN = Неопределено Тогда
				ДанныеСтрокиПоGTIN = ИнициализироватьСтруктуруЗаполненияДанныхШтрихкодовПродукцияИзНатуральногоМеха();
			КонецЕсли;

			ДанныеСтрокиПоGTIN.Количество = ДанныеСтрокиПоGTIN.Количество + 1;
			ДанныеСтрокиПоGTIN.Сумма      = ДанныеСтрокиПоGTIN.Сумма      + СтрокаДанных.Цена;
			ДанныеСтрокиПоGTIN.СуммаНДС   = ДанныеСтрокиПоGTIN.СуммаНДС   + СтрокаДанных.СуммаНДС;

			ДанныеДокументаПоGTIN[GTIN] = ДанныеСтрокиПоGTIN;

		КонецЦикла;

	ИначеЕсли ЭтоПриемкаИзЕАЭССПризнаниемКМ Или ЭтоПриемкаТрансграничнаяТорговля Тогда
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьКодТНВЭД");
		
		ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
		ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов                                = ПараметрыСканирования.ПроверятьАлфавитКодовМаркировки;
		ПользовательскиеПараметрыРазбораКодаМаркировки.РасширеннаяДетализация                                   = Ложь;
		ПользовательскиеПараметрыРазбораКодаМаркировки.ВалидироватьШтрихкодЛогистическойУпаковкиGS1128СОшибками = Истина;
		
		НастройкиРазбораКодаМаркировки = Новый Структура;
		НастройкиРазбораКодаМаркировки.Вставить("Кеш",              РазборКодаМаркировкиИССлужебныйКлиентСервер.ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
		НастройкиРазбораКодаМаркировки.Вставить("Общие",            РазборКодаМаркировкиИССлужебныйПовтИсп.НастройкиРазбораКодаМаркировки());
		НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);

		КешДанныхРазбора      = Новый Соответствие;
		ДанныеДокументаПоGTIN = Новый Соответствие;

		Для Каждого СтрокаДанных Из ДанныеШтрихкодов Цикл
		
			ДанныеРазбора = ГрупповаяОбработкаШтрихкодовИС.ВидУпаковкиИПредставлениеШтрихкодаУпрощенныйРазбор(
				СтрокаДанных.Штрихкод, ВидПродукции, КешДанныхРазбора, НастройкиРазбораКодаМаркировки);
			ДанныеРазбораИРезультат = КешДанныхРазбора[СтрокаДанных.Штрихкод];
			
			GTIN = Неопределено;
			Если ДанныеРазбораИРезультат <> Неопределено
				И ДанныеРазбораИРезультат.ДанныеРазбора <> Неопределено
				И ДанныеРазбораИРезультат.ДанныеРазбора.СоставКодаМаркировки <> Неопределено Тогда
				ДанныеРазбораИРезультат.ДанныеРазбора.СоставКодаМаркировки.Свойство("GTIN", GTIN);
				СоответствиеНормализованныхШтрихкодов.Вставить(ДанныеРазбора.НормализованныйШтрихкод, 	СтрокаДанных.Штрихкод);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(GTIN) Тогда
				
				ДанныеСтрокиПоGTIN = ДанныеДокументаПоGTIN[GTIN];
				
				Если ДанныеСтрокиПоGTIN = Неопределено Тогда
					ДанныеСтрокиПоGTIN = ИнициализироватьСтруктуруЗаполненияДанныхШтрихкодовПриПриемкеИзЕАЭССпризнаниемКИ();
					ЗаполнитьЗначенияСвойств(ДанныеСтрокиПоGTIN, СтрокаДанных, "КодТНВЭД, ВидДокументаСертификации, НомерДокументаСертификации, ДатаДокументаСертификации");
				КонецЕсли;
				
				ДанныеСтрокиПоGTIN.Количество = ДанныеСтрокиПоGTIN.Количество + 1;
				ДанныеСтрокиПоGTIN.Сумма      = ДанныеСтрокиПоGTIN.Сумма      + СтрокаДанных.Цена;
				ДанныеСтрокиПоGTIN.СуммаНДС   = ДанныеСтрокиПоGTIN.СуммаНДС   + СтрокаДанных.СуммаНДС;
				
				ДанныеДокументаПоGTIN[GTIN] = ДанныеСтрокиПоGTIN;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	Для Каждого СтрокаТоваров Из ДокументПриемка.Товары Цикл
		
		Если СтрокаТоваров.Количество = 0 И Не ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			СтрокаТоваров.Количество = СтрокаТоваров.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		
		СтрокаТоваров.КоличествоУпаковок = СтрокаТоваров.Количество;
		Если ЭтоПриемкаПродукцииИзМеха Тогда

			Если ЗначениеЗаполнено(СтрокаТоваров.GTIN) Тогда
				ДанныеСтрокиПоGTIN = ДанныеДокументаПоGTIN[СтрокаТоваров.GTIN];
				Если ДанныеСтрокиПоGTIN <> Неопределено Тогда
					ЗаполнитьЦенуСуммуНДСПоДаннымВходящегоДокумента(СтрокаТоваров, ДанныеСтрокиПоGTIN);
				КонецЕсли;
			КонецЕсли;

			Если ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
				ИнтеграцияИСПереопределяемый.ОбработатьСтрокуТабличнойЧасти(СтрокаТоваров, СтруктураДействий);
			КонецЕсли;

		ИначеЕсли ЭтоПриемкаИзЕАЭССПризнаниемКМ Тогда
			
			Если ЗначениеЗаполнено(СтрокаТоваров.GTIN) Тогда
				ДанныеСтрокиПоGTIN = ДанныеДокументаПоGTIN[СтрокаТоваров.GTIN];
				Если ДанныеСтрокиПоGTIN <> Неопределено Тогда
					ЗаполнитьЦенуСуммуНДСПоДаннымВходящегоДокумента(СтрокаТоваров, ДанныеСтрокиПоGTIN);
					ЗаполнитьЗначенияСвойств(
						СтрокаТоваров,
						ДанныеСтрокиПоGTIN,
						"КодТНВЭД, ВидДокументаСертификации, НомерДокументаСертификации, ДатаДокументаСертификации");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
				ИнтеграцияИСПереопределяемый.ОбработатьСтрокуТабличнойЧасти(СтрокаТоваров, СтруктураДействий);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыУказанияСерий = ИнтеграцияИС.ПараметрыУказанияСерийФормыОбъекта(ДокументПриемка, Документы.ПриемкаТоваровИСМП);
	ИнтеграцияИСПереопределяемый.ЗаполнитьСтатусыУказанияСерий(ДокументПриемка, ПараметрыУказанияСерий);
	
	ДанныеУпаковокСКоличеством = ЗаполнитьКоличествоПотребительскихУпаковок(РезультатПолученияДанных.ВложенныеШтрихкоды.ДеревоУпаковок, СоответствиеНормализованныхШтрихкодов);
	
	Для Каждого СтрокаУпаковки Из ДокументПриемка.ШтрихкодыУпаковок Цикл
		КоличествоУпаковок = ДанныеУпаковокСКоличеством.Получить(СтрокаУпаковки.ЗначениеШтрихкода);
		Если КоличествоУпаковок <> Неопределено Тогда
			СтрокаУпаковки.КоличествоУпаковок = КоличествоУпаковок;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЦенуСуммуНДСПоДаннымВходящегоДокумента(СтрокаТоваров, ИсточникДанных)

	СтрокаТоваров.Цена = ИсточникДанных.Сумма / ?(СтрокаТоваров.Количество = 0, 1, СтрокаТоваров.Количество);
	СтрокаТоваров.СуммаНДС = ИсточникДанных.СуммаНДС / ?(СтрокаТоваров.Количество = 0, 1, СтрокаТоваров.Количество);

КонецПроцедуры

//Выполняет заполнение документа данными объемно-сортового учета.
//
// Параметры:
//  ДокументПриемка  - ДокументОбъект.ПриемкаТоваровИСМП - документ для заполнения.
//  ДанныеШтрихкодов - Массив - Массив из подготовленных структур для заполнения Товаров.
Процедура ОбработкаДокументаОбъемноСортовогоУчета(ДокументПриемка, ДанныеШтрихкодов)

	ВидПродукцииДокумента = ДокументПриемка.ВидПродукции;
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(ДокументПриемка, Неопределено, ВидПродукцииДокумента);

	Если ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ВидПродукцииДокумента) Тогда
		ПараметрыСканирования.ДопустимыеВидыПродукции = Новый Массив();
		ВидыПродукцииУчета = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(, Ложь);
		Для Каждого ВидПродукции Из ВидыПродукцииУчета Цикл
			Если ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ВидПродукции) Тогда
				ПараметрыСканирования.ДопустимыеВидыПродукции.Добавить(ВидПродукции);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ИспользуетсяПодсистемаВетИС = ИнтеграцияИСМПВЕТИС.ИспользуетсяПодсистемаВетИС();
	Если ИспользуетсяПодсистемаВетИС Тогда
		ИмяТаблицыСправочникаВСД = "ВетеринарноСопроводительныйДокументВЕТИС";
		КешПоискаВСД = Новый Структура(
			"ПараметрыПреобразования",
			Новый Структура(
				"НайденныеСсылки",
				Новый Структура(ИмяТаблицыСправочникаВСД, Новый Соответствие)));
	КонецЕсли;

	GTINПотребительскихУпаковок = Новый Соответствие();
	ШтрихкодыEAN = Новый Массив;
	Для Каждого СтрокаШтрихкода Из ДанныеШтрихкодов Цикл
		ШтрихкодыEAN.Добавить(ШтрихкодированиеИСКлиентСервер.ШтрихкодEANИзGTIN(СтрокаШтрихкода.Штрихкод));
		GTINПотребительскихУпаковок.Вставить(СтрокаШтрихкода.Штрихкод, Истина);
	КонецЦикла;
	ДанныеПоШтрихкодамEAN = ШтрихкодированиеИС.ДанныеПоШтрихкодамEAN(
		ШтрихкодыEAN, ПараметрыСканирования, GTINПотребительскихУпаковок);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
	ВидыПродукцииПоТоварам = Новый Массив();

	Для Каждого СтрокаДанных Из ДанныеШтрихкодов Цикл

		ВидПродукцииСтроки             = ВидПродукцииДокумента;
		НоваяСтрока                    = ДокументПриемка.Товары.Добавить();
		НоваяСтрока.GTIN               = СтрокаДанных.Штрихкод;
		НоваяСтрока.КоличествоУпаковок = СтрокаДанных.Количество;
		НоваяСтрока.Количество         = СтрокаДанных.Количество;
		НоваяСтрока.Цена               = СтрокаДанных.Цена;
		НоваяСтрока.СуммаНДС           = СтрокаДанных.СуммаНДС * НоваяСтрока.Количество;
		НоваяСтрока.Сумма              = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.КоличествоПотребительскихУпаковок = СтрокаДанных.Количество;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных, "ВидДокументаСертификации, НомерДокументаСертификации, ДатаДокументаСертификации");

		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("ШтрихкодEAN", ШтрихкодированиеИСКлиентСервер.ШтрихкодEANИзGTIN(СтрокаДанных.Штрихкод));

		СтрокиПоEAN = ДанныеПоШтрихкодамEAN.НайтиСтроки(СтруктураПоиска);

		Если СтрокиПоEAN.Количество() = 1 Тогда
			СтрокаПоEAN = СтрокиПоEAN[0];
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоEAN, "Номенклатура, Характеристика, Серия, Упаковка");
			Если СтрокаПоEAN.ПроизвольнаяЕдиницаУчета Тогда
				Если ЗначениеЗаполнено(СтрокаПоEAN.Коэффициент) Тогда
					НоваяСтрока.КоличествоУпаковок = СтрокаДанных.Количество * СтрокаПоEAN.Коэффициент;
					НоваяСтрока.Количество         = НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.Сумма              = НоваяСтрока.Цена      * НоваяСтрока.КоличествоУпаковок;
					НоваяСтрока.СуммаНДС           = СтрокаДанных.СуммаНДС * НоваяСтрока.КоличествоУпаковок;
				КонецЕсли;
			КонецЕсли;
			ВидПродукцииСтроки = СтрокаПоEAN.ВидПродукции;
		ИначеЕсли ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ВидПродукцииДокумента)
			И ЗначениеЗаполнено(СтрокаДанных.ВСД)
			И ВидыПродукцииУчета.Найти(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС) <> Неопределено Тогда
			ВидПродукцииСтроки = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС;
		КонецЕсли;

		Если ВидыПродукцииПоТоварам.Найти(ВидПродукцииСтроки) <> Неопределено Тогда
			ВидыПродукцииПоТоварам.Добавить(ВидПродукцииСтроки);
		КонецЕсли;

		Если ВидПродукцииСтроки = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
			И ЗначениеЗаполнено(СтрокаДанных.ВСД) Тогда

			ИдентификаторПроисхожденияВЕТИССтрокой = ИнтеграцияИСКлиентСервер.ПреобразоватьИдентификаторВСД(
				СокрЛП(СтрокаДанных.ВСД));

			Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПроисхожденияВЕТИССтрокой)Тогда
				НоваяСтрока.ИдентификаторПроисхожденияВЕТИССтрокой = ИдентификаторПроисхожденияВЕТИССтрокой;
				Если ИспользуетсяПодсистемаВетИС Тогда
					ИнтеграцияИСМПВЕТИС.ПолучитьСсылкуПоСтроковомуИдентификаторуПроисхождения(ИдентификаторПроисхожденияВЕТИССтрокой, НоваяСтрока.ИдентификаторПроисхожденияВЕТИС, КешПоискаВСД);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			ИсходнаяСуммаНДС = СтрокаДанных.СуммаНДС;
			ИнтеграцияИСПереопределяемый.ОбработатьСтрокуТабличнойЧасти(НоваяСтрока, СтруктураДействий);
			Если НоваяСтрока.СуммаНДС <> ИсходнаяСуммаНДС Тогда
				НоваяСтрока.СуммаНДС  = ИсходнаяСуммаНДС;
				НоваяСтрока.СтавкаНДС = Неопределено;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Если ВидыПродукцииПоТоварам.Найти(Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС) <> Неопределено
		И ВидПродукцииДокумента <> Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС Тогда
		ДокументПриемка.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС;
	КонецЕсли;

	ПараметрыУказанияСерий = ИнтеграцияИС.ПараметрыУказанияСерийФормыОбъекта(ДокументПриемка, Документы.ПриемкаТоваровИСМП);
	ИнтеграцияИСПереопределяемый.ЗаполнитьСтатусыУказанияСерий(ДокументПриемка, ПараметрыУказанияСерий);

КонецПроцедуры

//Заполняет соотвествие штрихкодов упаковок количеством вложенных единиц продукции
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений, СтрокаДереваЗначений - дерево упаковок.
//
// Возвращаемое значение:
//  Соответствие:
//  * Ключ - См. ШтрихкодированиеИСМП.КодМаркировкиДляПередачиИСМП
//  * Значение - Число - Количество вложенных потребительских упаковок
Функция ЗаполнитьКоличествоПотребительскихУпаковок(ДеревоУпаковок, СоответствиеНормализованныхШтрихкодов)
	
	СоответствиеУпаковок = Новый Соответствие;
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Количество = КоличествоВложенныхПотребительскихУпаковок(СтрокаДерева);
		
		НормализованныйКодМаркировки = СоответствиеНормализованныхШтрихкодов[СтрокаДерева.Штрихкод];
		Если НормализованныйКодМаркировки = Неопределено Тогда
			НормализованныйКодМаркировки = НормализованноеПредставлениеКодаМаркировкиДляПередачиИСМППоВидуПродукции(
				СтрокаДерева.Штрихкод, СтрокаДерева.ВидПродукции);
		КонецЕсли;
		
		СоответствиеУпаковок.Вставить(НормализованныйКодМаркировки, Количество);
		
	КонецЦикла;
	
	Возврат СоответствиеУпаковок;
	
КонецФункции

Функция НормализованноеПредставлениеКодаМаркировкиДляПередачиИСМППоВидуПродукции(КодМаркировки, ВидПродукции)
	
	// В отличии от метода КодМаркировкиДляПередачиИСМП, не выдает исключение, если код маркировки разобрать не удалось.
	
	ПримечаниеКРезультатуРазбора = Неопределено;
	
	ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(
		КодМаркировки, ВидПродукции, ПримечаниеКРезультатуРазбора);
	
	Если ДанныеРазбора = Неопределено Тогда
		Возврат КодМаркировки;
	КонецЕсли;
	
	ПараметрыНормализации = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализации.НачинаетсяСоСкобки = Ложь;
	
	НормализованныйКодМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
		ДанныеРазбора, ВидПродукции, ПараметрыНормализации);
	
	Возврат НормализованныйКодМаркировки;
	
КонецФункции

//Выполняет расчет количество вложенных потребительских упаковок в дереве упаковок
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений, СтрокаДереваЗначений - дерево упаковок.
//
// Возвращаемое значение:
//  Число - количество вложенных единиц.
Функция КоличествоВложенныхПотребительскихУпаковок(ДеревоУпаковок)
	
	КоличествоПотребительскихУпаковок = 0;
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		КоличествоПотребительскихУпаковок = КоличествоПотребительскихУпаковок + КоличествоВложенныхПотребительскихУпаковок(СтрокаДерева);
	КонецЦикла;
	
	Если ДеревоУпаковок.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат КоличествоПотребительскихУпаковок;
	
КонецФункции

//Преобразовывает тип операции, полученный по данным ИС МП в перечисление для документов Отгрузка товаров ИС МП, Приемка товаров ИС МП
//
// Параметры:
//  ТипОперацииПродажа - Строка - тип операции по данным сервиса.
//  ВидБезвозмезднойОперации - Строка - вид операции по данным сервиса.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - вид операции для документа.
Функция ВидОперацииПриемкаТоваров(ТипОперацииПродажа, ВидБезвозмезднойОперации = Неопределено)
	Если ТипОперацииПродажа = "SELLING" Тогда
		Если ВидБезвозмезднойОперации = Неопределено Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПриемкаПродажа;
		ИначеЕсли ВидБезвозмезднойОперации = "DONATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПриемкаБезвозмезднаяПередача;
		ИначеЕсли ВидБезвозмезднойОперации = "STATE_ENTERPRISE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПриемкаПриобретениеГосПредприятием;
		ИначеЕсли ВидБезвозмезднойОперации = "NO_RETAIL_USE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПриемкаДляСобственныхНуждПокупателя;
		КонецЕсли;
	ИначеЕсли ТипОперацииПродажа = "COMMISSION" Тогда
		Возврат Перечисления.ВидыОперацийИСМП.ПриемкаКомиссия;
	ИначеЕсли ТипОперацииПродажа = "AGENT" Тогда
		Возврат Перечисления.ВидыОперацийИСМП.ПриемкаАгент;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ИнициализироватьСтруктуруЗаполненияДанныхШтрихкодовПриПриемкеИзЕАЭССпризнаниемКИ()
	
	Результат = Новый Структура;
	Результат.Вставить("КодТНВЭД", "");
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("Количество", 0);
	Результат.Вставить("ВидДокументаСертификации", "");
	Результат.Вставить("НомерДокументаСертификации", "");
	Результат.Вставить("ДатаДокументаСертификации", "");
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьСтруктуруЗаполненияДанныхШтрихкодовПродукцияИзНатуральногоМеха()

	Результат = Новый Структура;
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("СуммаНДС", 0);
	Результат.Вставить("Количество", 0);

	Возврат Результат;

КонецФункции

#КонецОбласти

// Дополняет таблицу протокола обмена данными лога запросов.
// 
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений()).
//  СлужебныйПротоколОбмена - См. ИнициализироватьТаблицуПротоколОбмена
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - Статус обработки сообщения.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП -  операция обмена.
// 
// Возвращаемое значение:
//  Строка - представление протокола обмена.
Функция ДополнитьПротоколОбмена(ЭлементОчереди, СлужебныйПротоколОбмена, СтатусОбработки, Операция)
	
	Если ЭлементОчереди.ПротоколОбмена = Неопределено Тогда
		ЭлементОчереди.ПротоколОбмена = ИнициализироватьТаблицуПротоколОбмена();
	КонецЕсли;
	
	МассивСтрокПротокола = Новый Массив;
	Для Каждого ЗаписьПротокола Из СлужебныйПротоколОбмена Цикл
		
		ЗаписьПротокола.СтатусОбработки = СтатусОбработки;
		ЗаписьПротокола.Операция        = Операция;
		
		МассивСтрокПротокола.Добавить(ЗаписьПротокола.Запрос);
		МассивСтрокПротокола.Добавить(ЗаписьПротокола.ЗапросТело);
		МассивСтрокПротокола.Добавить(ЗаписьПротокола.КодСостояния);
		МассивСтрокПротокола.Добавить(ЗаписьПротокола.ОтветТело);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СлужебныйПротоколОбмена, ЭлементОчереди.ПротоколОбмена);
	
	Результат = СтрСоединить(МассивСтрокПротокола, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьВПротоколОбмена(ЭлементОчереди, ДанныеОбработки)
	
	Если ЭлементОчереди.ПротоколОбмена = Неопределено Тогда
		
		ПротоколОбмена = ИнициализироватьТаблицуПротоколОбмена();
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОбработки, "Статус") Тогда
			ТипыСтатуса = Новый Массив;
			ТипыСтатуса.Добавить(ТипЗнч(ДанныеОбработки.Статус));
			ПротоколОбмена.Колонки.Добавить("Статус", Новый ОписаниеТипов(ТипыСтатуса));
		КонецЕсли;
		
		ЭлементОчереди.ПротоколОбмена = ПротоколОбмена;
		
	Иначе
		ПротоколОбмена = ЭлементОчереди.ПротоколОбмена;
	КонецЕсли;
	
	ДополнительныеПараметрыHTTP   = ДанныеОбработки.РезультатОтправкиЗапроса.ДополнительныеПараметры;
	ПараметрыОтправкиHTTPЗапросов = ДополнительныеПараметрыHTTP.ПараметрыОтправкиHTTPЗапросов;
	HTTPМетод                     = ДополнительныеПараметрыHTTP.HTTPМетод;
	HTTPЗапрос                    = ДополнительныеПараметрыHTTP.HTTPЗапрос;
	HTTPОтвет                     = ДополнительныеПараметрыHTTP.HTTPОтвет;
	
	ЗапросЗаголовки = Новый Массив;
	Для Каждого КлючИЗначение Из HTTPЗапрос.Заголовки Цикл
		ЗапросЗаголовки.Добавить(
			СтрШаблон("%1: %2", КлючИЗначение.Ключ, КлючИЗначение.Значение));
	КонецЦикла;
	
	ЗаписьПротокола = ПротоколОбмена.Добавить();
	ЗаписьПротокола.ДатаУниверсальная = ТекущаяУниверсальнаяДата();
	ЗаписьПротокола.Операция          = ДанныеОбработки.Операция;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЗаписьПротокола, "Статус")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОбработки, "Статус") Тогда
		ЗаписьПротокола.Статус = ДанныеОбработки.Статус;
	КонецЕсли;
	ЗаписьПротокола.СтатусОбработки   = ДанныеОбработки.СтатусОбработки;
	ЗаписьПротокола.Запрос            = ИнтеграцияИСМП.URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод);
	ЗаписьПротокола.ЗапросЗаголовки   = СтрСоединить(ЗапросЗаголовки, Символы.ПС);
	ЗаписьПротокола.ЗапросТело        = HTTPЗапрос.ПолучитьТелоКакСтроку();
	
	Если (ДанныеОбработки.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗ
		Или ДанныеОбработки.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо
		Или ДанныеОбработки.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеПолучениеКодовМаркировкиИзСУЗ)
		И ДанныеОбработки.ДанныеБлока <> Неопределено
		И ДанныеОбработки.ДанныеБлока.КодыМаркировки <> Неопределено Тогда
		
		КоличествоКодовВБлоке = ДанныеОбработки.ДанныеБлока.КодыМаркировки.Количество();
		
		Если КоличествоКодовВБлоке > 1 Тогда
			ПервыйКодМаркировки = СтрШаблон(
				НСтр("ru = '%1... (+ еще %2)'"),
				Лев(ДанныеОбработки.ДанныеБлока.КодыМаркировки[0], 21),
				КоличествоКодовВБлоке - 1);
		ИначеЕсли КоличествоКодовВБлоке = 1 Тогда
			ПервыйКодМаркировки = СтрШаблон("%1...", Лев(ДанныеОбработки.ДанныеБлока.КодыМаркировки[0], 21));
		КонецЕсли;
		
		ЗаписьПротокола.ОтветЗаголовки = ЗаголовкиИзHTTPОтвета(HTTPОтвет);
		
		Если КоличествоКодовВБлоке = 0 Тогда
			ЗаписьПротокола.ОтветТело = СтрШаблон(
				НСтр("ru = '
					       |Новые коды маркировки отсутствуют.
				 	       |Идентификатор последнего блока кодов: %1'"),
				ДанныеОбработки.ДанныеБлока.ИдентификаторПоследнегоБлокаКодов);
		Иначе
			ЗаписьПротокола.ОтветТело = СтрШаблон(
				НСтр("ru = '{
				           |  %1
				           |}
				           |Коды маркировки записаны в пул. Количество: %2
				           |Идентификатор последнего блока кодов: %3'"),
				ПервыйКодМаркировки, КоличествоКодовВБлоке,
				ДанныеОбработки.ДанныеБлока.ИдентификаторПоследнегоБлокаКодов);
		КонецЕсли;
		
	ИначеЕсли HTTPОтвет <> Неопределено Тогда
		
		ЗаписьПротокола.ОтветЗаголовки = ЗаголовкиИзHTTPОтвета(HTTPОтвет);
		
		Если ТипЗнч(HTTPОтвет) = Тип("Структура") Тогда
			ЗаписьПротокола.ОтветТело = HTTPОтвет.Тело;
		Иначе
			ЗаписьПротокола.ОтветТело = HTTPОтвет.ПолучитьТелоКакСтроку();
		КонецЕсли;
		
		Если ДанныеОбработки.Свойство("ТекстОшибки")
			И Не ЗначениеЗаполнено(ЗаписьПротокола.ОтветТело) Тогда
			ЗаписьПротокола.ОтветТело = ДанныеОбработки.ТекстОшибки;
		КонецЕсли;
			
	Иначе
		ЗаписьПротокола.ОтветТело = ДанныеОбработки.ТекстОшибки;
	КонецЕсли;
	
	ПредставлениеПротоколаОбмена = ИнтеграцияИСМП.ВывестиHTTPЗапросВЛог(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод)
	                             + ИнтеграцияИСМП.ВывестиHTTPЗапросВЛог(HTTPОтвет,  Неопределено, Неопределено,, ДанныеОбработки.ТекстОшибки);
	
	Возврат ПредставлениеПротоколаОбмена;
	
КонецФункции

//Добавляет описание ошибки, возникшей при подготовке сообщения JSON к отправке в абстрактной операции, в протокол элемента очереди.
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений()).
//  ТекстОшибки - Строка, Массив из Строка - Описание ошибки при подготовке сообщения.
//  Статус - ПеречислениеСсылка.СтатусыОбработкиМаркировкиТоваровИСМП - статус обработки.
//
// Возвращаемое значение
//  Строка - описание ошибки.
Функция ДобавитьВПротоколОбменаОписаниеОшибки(ЭлементОчереди, ТекстОшибки, Статус = Неопределено)
	
	Если ЭлементОчереди.ПротоколОбмена = Неопределено Тогда
		
		ЭлементОчереди.ПротоколОбмена = ИнициализироватьТаблицуПротоколОбмена();
		Если ЗначениеЗаполнено(Статус) Тогда
			ТипыСтатуса = Новый Массив;
			ТипыСтатуса.Добавить(ТипЗнч(Статус));
			ЭлементОчереди.ПротоколОбмена.Колонки.Добавить("Статус", Новый ОписаниеТипов(ТипыСтатуса));
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьПротокола = ЭлементОчереди.ПротоколОбмена.Добавить();
	ЗаписьПротокола.ДатаУниверсальная = ТекущаяУниверсальнаяДата();
	ЗаписьПротокола.Операция          = ЭлементОчереди.Операция;
	ЗаписьПротокола.СтатусОбработки   = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
	Если ЗначениеЗаполнено(Статус) Тогда
		ЗаписьПротокола.Статус            = Статус;
	КонецЕсли;
	
	Если ТипЗнч(ТекстОшибки) = Тип("Массив") Тогда
		ОписаниеОшибки = СтрСоединить(ТекстОшибки, Символы.ПС);
	Иначе
		ОписаниеОшибки = ТекстОшибки;
	КонецЕсли;
	
	ЗаписьПротокола.ОтветТело = ОписаниеОшибки;
	
	Возврат ОписаниеОшибки;

КонецФункции

Процедура ПередатьСообщениеИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей, НаборЗаписейОснование)
	
	СтанцияУправленияЗаказами = Неопределено;
	ФорматОбмена              = Неопределено;
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
		
		НастройкаОбменаПоОрганизации = ПараметрыОбмена.НастройкиОбменаСУЗ.ОбменНаСервере.Получить(ЭлементОчереди.Организация);
		Если НастройкаОбменаПоОрганизации <> Неопределено Тогда
			НастройкаОбменаСУЗ        = НастройкаОбменаПоОрганизации;
			СтанцияУправленияЗаказами = НастройкаОбменаСУЗ.СтанцияУправленияЗаказами;
			ФорматОбмена              = НастройкаОбменаСУЗ.ФорматОбмена;
		КонецЕсли;
		
		Если СтанцияУправленияЗаказами = Неопределено Тогда
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'В информационной базе не найдена активная настройка для подключения к СУЗ.'"),
				ЭлементОчереди.Организация);
			ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыИсходящегоСообщения = ЭлементОчереди.РеквизитыИсходящегоСообщения;
	
	ДанныеОбработки = ИнтерфейсИСМП.СоздатьДокументПоСообщению(
		РеквизитыИсходящегоСообщения.Организация,
		РеквизитыИсходящегоСообщения.Операция,
		РеквизитыИсходящегоСообщения.ВидПродукции,
		РеквизитыИсходящегоСообщения.ТекстСообщенияJSON,
		ПодписьИзСвойствПодписи(РеквизитыИсходящегоСообщения.СвойстваПодписи),
		РеквизитыИсходящегоСообщения.ПараметрыЗапроса);
	
	Если ТребуетсяОбновлениеКлючаСессии(ДанныеОбработки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
		ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
		ДанныеОбработки);
	
	Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята
		Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			
			Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
				Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
					РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Сообщение по документу %1 не принято ИС МП:
						           |Текст ошибки: %2'"),
						ЭлементОчереди.Документ,
						ДанныеОбработки.ТекстОшибки);
				Иначе
					РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Сообщение не принято ИС МП:
						           |Текст ошибки: %1'"),
						ДанныеОбработки.ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
			
			ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);

			Если Не (ЭлементОчередиОснование.Операция = Перечисления.ВидыОперацийИСМП.Агрегация
				Или ЭлементОчередиОснование.Операция = Перечисления.ВидыОперацийИСМП.АТК) Тогда
				Реквизиты = Новый Структура;
				Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
				Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
				Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
				Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
				Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
				Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
				Реквизиты.Вставить("СтатусОбработки",      ДанныеОбработки.СтатусОбработки);
				Реквизиты.Вставить("Описание",             ДанныеОбработки.ТекстОшибки);

				ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(
					ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена);
				ДобавитьЗаписьВПротоколОбмена(
					ПротоколаОбменаXML,
					Реквизиты);
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			Если НаборЗаписейОснование = Неопределено Тогда
			
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					ДанныеОбработки.ИдентификаторЗаявки,
					СтанцияУправленияЗаказами,
					Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
				
			Иначе
				
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					ДанныеОбработки.ИдентификаторЗаявки,
					СтанцияУправленияЗаказами,
					Неопределено);
				
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписейОснование,
					Неопределено,
					Неопределено,
					Новый ХранилищеЗначения(
						ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена));
						
			КонецЕсли;
			
			ЭлементОчереди.ИдентификаторЗаявки          = ДанныеОбработки.ИдентификаторЗаявки;
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
			
			ЭлементОчереди.СтанцияУправленияЗаказами = СтанцияУправленияЗаказами;
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			
			Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ФорматОбмена",              ФорматОбмена);
				ДополнительныеПараметры.Вставить("СтанцияУправленияЗаказами", СтанцияУправленияЗаказами);
				ДополнительныеПараметры.Вставить("Назначение",                Перечисления.НазначениеСообщенийИСМП.ИСМП);
				
				НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(
					ЭлементОчереди.Документ, ЭлементОчереди.Операция, ДанныеОбработки.СтатусОбработки,
					ДополнительныеПараметры);
				
			Иначе
				
				НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(
					ЭлементОчереди.Документ, ЭлементОчереди.Операция, ДанныеОбработки.СтатусОбработки);
				
			КонецЕсли;
			
		Иначе
			
			НовыйСтатус = ДанныеОбработки.СтатусОбработки;
			
		КонецЕсли;
		
		Если ЭлементОчереди.Операция <> Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПриОСУАннулирование Тогда
			ЗаписатьИдентификаторЗаявкиВДокумент(ЭлементОчереди, ДанныеОбработки, ПараметрыОбмена, МенеджерОбъекта);
		КонецЕсли;
		
		Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			И ТипЗнч(ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса) = Тип("Структура")
			И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ИспользуетсяПакетнаяПередачаСообщений", Ложь) Тогда
			
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ДанныеСообщения") Тогда
				ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчереди);
			КонецЕсли;
			
		Иначе
			
			РезультатыПередачиСообщения.РезультатОбработкиОтвета.НовыйСтатус = НовыйСтатус;
			ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;
		
	Иначе
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение по документу %1 не принято ИС МП:
					           |Текст ошибки: %2'"),
					ЭлементОчереди.Документ,
					ДанныеОбработки.ТекстОшибки);
			Иначе
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение не принято ИС МП:
					           |Текст ошибки: %1'"),
					ДанныеОбработки.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗаписатьИдентификаторЗаявкиВДокумент(ЭлементОчереди, ДанныеОбработки, ПараметрыОбмена, МенеджерОбъекта)
	
	Если ДанныеОбработки.СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята
		Или Не ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ЭлементОчереди.Документ.Метаданные();
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("ИдентификаторЗаявки", МетаданныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка        = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить(МетаданныеДокумента.ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлементОчереди.Документ);
	Блокировка.Заблокировать();
	
	ДокументОбъект                     = ЭлементОчереди.Документ.ПолучитьОбъект();
	ДокументОбъект.ИдентификаторЗаявки = ДанныеОбработки.ИдентификаторЗаявки;
	ДокументОбъект.Записать();
	
КонецПроцедуры

Процедура ПередатьЗаказНаЭмиссиюКодовМаркировкиСУЗ(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей, НастройкаОбменаСУЗ, НаборЗаписейОснование)
	
	РеквизитыИсходящегоСообщения = ЭлементОчереди.РеквизитыИсходящегоСообщения;
	
	Если НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V1 Тогда
		ДанныеОбработки = ИнтерфейсСУЗ.СоздатьБизнесЗаказНаЭмиссиюКодовМаркировки_V1(
			РеквизитыИсходящегоСообщения.ТекстСообщенияJSON,
			НастройкаОбменаСУЗ);
	ИначеЕсли НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V2 Тогда
		СвойстваПодписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			РеквизитыИсходящегоСообщения, "СвойстваПодписи");
		Подпись = ПодписьИзСвойствПодписи(СвойстваПодписи);
		ДанныеОбработки = ИнтерфейсСУЗ.СоздатьБизнесЗаказНаЭмиссиюКодовМаркировки_V2(
			РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди.ВидПродукции,
			НастройкаОбменаСУЗ, Подпись);
		Если ТребуетсяОбновлениеКлючаСессии(ДанныеОбработки, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Формат обмена %1 не поддерживается'"),
			НастройкаОбменаСУЗ.ФорматОбмена);
	КонецЕсли;
	
	ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
		ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
		ДанныеОбработки);
	
	Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята
		Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			
			Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
				Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
					РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Сообщение по документу %1 не принято ИС МП:
						           |Текст ошибки: %2'"),
						ЭлементОчереди.Документ,
						ДанныеОбработки.ТекстОшибки);
				Иначе
					РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Сообщение не принято ИС МП:
						           |Текст ошибки: %1'"),
						ДанныеОбработки.ТекстОшибки);
				КонецЕсли;
				
				Если ЭтоСообщениеОПревышенииМаксимальногоКоличестваАктивныхЗаказовСУЗ(ДанныеОбработки.ТекстОшибки) Тогда
					ПараметрыКонтроля = ПараметрыКонтроляАктивныхЗаказов(ПараметрыОбмена, ЭлементОчереди, Истина);
					ПараметрыКонтроля.ТекущееКоличествоЗаказов        = МаксимальноеКоличествоЗаказовВОчередиСУЗ();
					ПараметрыКонтроля.ДатаПоследнегоЗапросаПревышения = ТекущаяДатаСеанса();
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      ДанныеОбработки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             ДанныеОбработки.ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(
				ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			ЗагружатьДо = ЭлементОчереди.Сообщение;
			
			// Массив Из Структура - Параметры запроса:
			// * ИдентификаторБизнесЗаказа - Строка - Поле для заполнения идентификатора заказа
			// * ИдентификаторСтрокиЗаказа - Строка - Идентификатор строки заказа
			// * GTIN                      - Строка - GTIN
			Для Каждого ПараметрыЗапроса Из ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса Цикл
				
				ПараметрыЗапроса.ИдентификаторБизнесЗаказа = ДанныеОбработки.ДанныеБизнесЗаказа.ИдентификаторЗаявки;
				
				Если ЭлементОчереди.ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
					НовыйЭлементОчереди = ПодготовитьОчередьЗагрузкиКодовМаркировкиПоЗаказуНаЭмиссию(
						ПараметрыЗапроса,
						ЭлементОчереди, ЗагружатьДо, ПараметрыОбмена, НастройкаОбменаСУЗ);
				КонецЕсли;
				
				Если НовыйЭлементОчереди <> Неопределено Тогда
					// Коды маркировки загружаются строго последовательно.
					ЗагружатьДо = НовыйЭлементОчереди.Сообщение;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НаборЗаписейОснование = Неопределено Тогда
			
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					ДанныеОбработки.ДанныеБизнесЗаказа.ИдентификаторЗаявки,
					НастройкаОбменаСУЗ.СтанцияУправленияЗаказами,
					Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
				
			Иначе
				
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					ДанныеОбработки.ДанныеБизнесЗаказа.ИдентификаторЗаявки,
					НастройкаОбменаСУЗ.СтанцияУправленияЗаказами,
					Неопределено);
				
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписейОснование,
					Неопределено,
					Неопределено,
					Новый ХранилищеЗначения(
						ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена));
				
			КонецЕсли;
			
			ЭлементОчереди.ИдентификаторЗаявки          = ДанныеОбработки.ДанныеБизнесЗаказа.ИдентификаторЗаявки;
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
			
			ЭлементОчереди.СтанцияУправленияЗаказами = НастройкаОбменаСУЗ.СтанцияУправленияЗаказами;
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ФорматОбмена",              НастройкаОбменаСУЗ.ФорматОбмена);
			ДополнительныеПараметры.Вставить("СтанцияУправленияЗаказами", НастройкаОбменаСУЗ.СтанцияУправленияЗаказами);
			ДополнительныеПараметры.Вставить("Назначение",                Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами);
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(
				ЭлементОчереди.Документ, ЭлементОчереди.Операция, ДанныеОбработки.СтатусОбработки,
				ДополнительныеПараметры);
			
		Иначе
			
			НовыйСтатус = ДанныеОбработки.СтатусОбработки;
			
		КонецЕсли;
		
		РезультатыПередачиСообщения.РезультатОбработкиОтвета.НовыйСтатус = НовыйСтатус;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	Иначе
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение по документу %1 не принято СУЗ:
					           |Текст ошибки: %2'"),
					ЭлементОчереди.Документ,
					ДанныеОбработки.ТекстОшибки);
			Иначе
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение не принято СУЗ:
					           |Текст ошибки: %1'"),
					ДанныеОбработки.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоСообщениеОПревышенииМаксимальногоКоличестваАктивныхЗаказовСУЗ(ТекстСообщения)
	Возврат СтрНайти(ТекстСообщения, "Количество заказов в очереди не может превышать") > 0
		Или СтрНайти(ТекстСообщения, "Количество активных заказов не может превышать") > 0;
КонецФункции

Процедура ПередатьОтчетСУЗ(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей, НастройкаОбменаСУЗ, НаборЗаписейОснование)
	
	РеквизитыИсходящегоСообщения = ЭлементОчереди.РеквизитыИсходящегоСообщения;
	
	Если НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V1 Тогда
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПроизводственнуюЛинию
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПринтер
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПечатиКМ
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПотереРаспечатанныхКМ
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление Тогда
			ДанныеОбработки = ИнтерфейсСУЗ.ПередатьОтчетОбИспользованииКодовМаркировкиБизнесЗаказа_V1(
				РеквизитыИсходящегоСообщения.ТекстСообщенияJSON,
				НастройкаОбменаСУЗ);
		Иначе
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Неизвестная операция СУЗ %1'"),
				НастройкаОбменаСУЗ.Операция);
		КонецЕсли;
	ИначеЕсли НастройкаОбменаСУЗ.ФорматОбмена = Перечисления.ВерсииФорматаОбменаСУЗ.V2 Тогда
		
		Подпись = Неопределено;
		Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ТребуетсяПодписание Тогда
			СвойстваПодписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				РеквизитыИсходящегоСообщения, "СвойстваПодписи");
			Подпись = ПодписьИзСвойствПодписи(СвойстваПодписи);
		КонецЕсли;
		
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПроизводственнуюЛинию
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПринтер
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПечатиКМ
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПотереРаспечатанныхКМ
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ Тогда
			
			ДанныеОбработки = ИнтерфейсСУЗ.ПередатьОтчетОбИспользованииКодовМаркировки_V2(
				РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди,
				НастройкаОбменаСУЗ, Подпись);
				
		ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиПриПоступлении Тогда
			ДанныеОбработки = ИнтерфейсСУЗ.ПередатьОтчетОСписанииКодовМаркировки_V2(
				РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди.ВидПродукции,
				НастройкаОбменаСУЗ, Подпись);
		ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Агрегация
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение
			Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление Тогда
			ДанныеОбработки = ИнтерфейсСУЗ.ПередатьОтчетОбАгрегацииКодовМаркировки_V2(
				РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди,
				НастройкаОбменаСУЗ, Подпись);
		ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗапросИдентификатораСоединенияСУЗ Тогда
			ДанныеОбработки = ИнтерфейсСУЗ.ЗапроситьИдентификаторСоединения_V2(
				РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди,
				НастройкаОбменаСУЗ, Подпись);
		ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ Тогда
			ДанныеОбработки = ИнтерфейсСУЗ.ПодтвердитьПоступлениеКИЗ_V3(
				РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди.ВидПродукции,
				НастройкаОбменаСУЗ, Подпись);
		ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗакрытиеЗаказаНаЭмиссиюСУЗ Тогда
			ДанныеОбработки = ИнтерфейсСУЗ.ЗакрытьЗаказНаЭмиссию_V3(
				РеквизитыИсходящегоСообщения.ПараметрыЗапроса,
				ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ, РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		Иначе
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Неизвестная операция СУЗ: %1'"),
				ЭлементОчереди.Операция);
		КонецЕсли;
		
		Если ТребуетсяОбновлениеКлючаСессии(ДанныеОбработки, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Формат обмена %1 не поддерживается'"),
			НастройкаОбменаСУЗ.ФорматОбмена);
	КонецЕсли;
	
	ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
		ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
		ДанныеОбработки);
	
	ТекстОшибки =  ДанныеОбработки.ТекстОшибки;
	Если ЗначениеЗаполнено(ТекстОшибки) И НайтиНедопустимыеСимволыXML(ДанныеОбработки.ТекстОшибки) Тогда
		ТекстОшибки = СтрЗаменить(ТекстОшибки, Символ(29), "<GS>");
	КонецЕсли;
	
	Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята
		Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
		Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
			
			Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
				И ЗначениеЗаполнено(ТекстОшибки) Тогда
				Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
					РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Сообщение по документу %1 не принято ИС МП:
						           |Текст ошибки: %2'"),
						ЭлементОчереди.Документ,
						ТекстОшибки);
				Иначе
					РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Сообщение не принято ИС МП:
						           |Текст ошибки: %1'"),
						ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      ДанныеОбработки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(
				ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			ИдентификаторЗаявки = ДанныеОбработки.ИдентификаторЗаявки;

			Если НаборЗаписейОснование = Неопределено Тогда
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					ИдентификаторЗаявки,,
					Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
			Иначе
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					ИдентификаторЗаявки,,
					Неопределено);
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписейОснование,
					Неопределено,
					Неопределено,
					Новый ХранилищеЗначения(
						ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена));
			КонецЕсли;
			
			ЭлементОчереди.ИдентификаторЗаявки          = ИдентификаторЗаявки;
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
			
			ЭлементОчереди.СтанцияУправленияЗаказами = НастройкаОбменаСУЗ.СтанцияУправленияЗаказами;
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(ЭлементОчереди.Документ, ЭлементОчереди.Операция, ДанныеОбработки.СтатусОбработки);
		Иначе
			НовыйСтатус = ДанныеОбработки.СтатусОбработки;
		КонецЕсли;
		
		Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса <> Неопределено
			И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ИспользуетсяПакетнаяПередачаСообщений", Ложь) Тогда
			
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ДанныеСообщения") Тогда
				ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчереди,, ЭлементОчереди.ИдентификаторЗаявки);
			КонецЕсли;
			
		Иначе
			
			РезультатыПередачиСообщения.РезультатОбработкиОтвета.НовыйСтатус = НовыйСтатус;
			ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;
		
	Иначе
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение по документу %1 не принято СУЗ:
					           |Текст ошибки: %2'"),
					ЭлементОчереди.Документ,
					ТекстОшибки);
			Иначе
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение не принято СУЗ:
					           |Текст ошибки: %1'"),
					ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередатьЗапросНаПолучениеИдентификатораСоединения(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей, НастройкаОбменаСУЗ, НаборЗаписейОснование)
	
	РеквизитыИсходящегоСообщения = ЭлементОчереди.РеквизитыИсходящегоСообщения;
	
	Подпись = Неопределено;
	Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ТребуетсяПодписание Тогда
		СвойстваПодписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			РеквизитыИсходящегоСообщения, "СвойстваПодписи");
		Подпись = ПодписьИзСвойствПодписи(СвойстваПодписи);
	КонецЕсли;
	
	ДанныеОбработки = ИнтерфейсСУЗ.ЗапроситьИдентификаторСоединения_V2(
		РеквизитыИсходящегоСообщения.ТекстСообщенияJSON, ЭлементОчереди,
		НастройкаОбменаСУЗ, Подпись);
	
	ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
		ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена),
		ДанныеОбработки);
	
	УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
	УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	
	Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
	
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект      = ДанныеОбработки.ИдентификаторСоединения;
	
		СтрокаРезультата.ТекстОшибки           = ДанныеОбработки.ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Истина;
		СтрокаРезультата.Передано              = Истина;
		СтрокаРезультата.Принято               = Ложь;
		СтрокаРезультата.НовыйСтатус           = Неопределено;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = РеквизитыИсходящегоСообщения.ТекстСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
	Иначе
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
			РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Идентификатор соединения не получен:
				           |Текст ошибки: %1'"),
				ДанныеОбработки.ТекстОшибки);
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередатьЗапросНаПолучениеМестОсуществленияДеятельности(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей, НастройкаОбменаСУЗ, НаборЗаписейОснование)
	
	РеквизитыИсходящегоСообщения = ЭлементОчереди.РеквизитыИсходящегоСообщения;
	
	ДанныеОбработки = ИнтерфейсСУЗ.ЗапроситьМестаОсуществленияДеятельности(
		ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ, РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
	
	ПредставлениеПротоколаОбмена = "";
	
	УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
	УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	
	Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		Или ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
	
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект      = ДанныеОбработки.РезультатОтправкиЗапроса.Объект;
	
		СтрокаРезультата.ТекстОшибки           = ДанныеОбработки.ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Истина;
		СтрокаРезультата.Передано              = Истина;
		СтрокаРезультата.Принято               = Ложь;
		СтрокаРезультата.НовыйСтатус           = Неопределено;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = РеквизитыИсходящегоСообщения.ТекстСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
	Иначе
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     ДанныеОбработки.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
			РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Места осуществления деятельности не получены:
				           |Текст ошибки: %1'"),
				ДанныеОбработки.ТекстОшибки);
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередатьСообщениеОЗакрытииПодзаказаНаЭмиссиюКодовМаркировкиСУЗ(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	ЭлементОчередиЗаказНаЭмиссию = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	Если ЭлементОчередиЗаказНаЭмиссию = Неопределено Тогда
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчередиЗаказНаЭмиссию.Сообщение;
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчередиЗаказНаЭмиссию.Сообщение);
		НаборЗаписейОснования.Прочитать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		РезультатОбработкиЗаявки = ИнтерфейсСУЗ.ЗакрытьПодзаказПоGTIN_V2(
			ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса,
			ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиЗаказНаЭмиссию,
			РезультатОбработкиЗаявки);
		
		ЭлементОчереди.ТекущийСтатусОбработки = РезультатОбработкиЗаявки.СтатусОбработки;
		
		ЭлементОчереди.ТекущийСтатус                = Неопределено;
		ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		
		ОбновитьИдентификаторЗаявкиСообщенияОчереди(
			НаборЗаписейОснования,,,
			Новый ХранилищеЗначения(ЭлементОчередиЗаказНаЭмиссию.ПротоколОбмена));
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка Тогда
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;
		
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = Неопределено;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		ТранзакцияЗафиксирована = Истина;
		
		ПараметрыКонтроля = ПараметрыКонтроляАктивныхЗаказов(ПараметрыОбмена, ЭлементОчереди);
		
		Если ПараметрыКонтроля <> Неопределено Тогда
			ПараметрыКонтроля.ТекущееКоличествоЗаказов = ПараметрыКонтроля.ТекущееКоличествоЗаказов - 1;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При передаче закрытия подзаказа по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При передаче закрытия подзаказа по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст XML:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка)
		И ТранзакцияЗафиксирована Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПроверкиРезультатаПередачиОтчетаОНанесенииСУЗ

Процедура ЗагрузитьРезультатОбработкиОтчетОбИспользованииКМРасчетСтатусаКодовМаркировки(ЭлементОчереди, ПараметрыОбмена)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	МассивСтрок = Новый Массив();
	Для Каждого ЗначениеШтрихкода Из ПараметрыЗапроса.КодыМаркировкиДляКонтроляСтатусов Цикл
		СтруктураЗначения = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
			ЗначениеШтрихкода, ЭлементОчереди.ВидПродукции);
		МассивСтрок.Добавить(СтруктураЗначения);
	КонецЦикла;
	
	ЛогированиеЗапросовИСМП.ВключитьЛогированиеЗапросовДляПротоколаОбмена();
	
	РезультатПолученияДанных = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
		МассивСтрок,
		ЭлементОчереди.Организация);
	
	ПараметрыЛогирования = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	ПротоколОбмена       = ЛогированиеЗапросовИСМП.ЗавершитьЛогированиеЗапросовПоИдентификаторуПротоколаОбмена(ПараметрыЛогирования.ТекущийИдентификаторПротоколОБмена);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПовторныйЗапросКвитанции = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ПовторныйЗапросКвитанции")
		И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ПовторныйЗапросКвитанции;
	
	Если Не ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки)
		И РезультатПолученияДанных.СтатусыКодовМаркировки <> Неопределено Тогда
		Для Каждого КлючИЗначение Из РезультатПолученияДанных.СтатусыКодовМаркировки Цикл
			СтатусКодов = КлючИЗначение.Значение.Статус;
			Если ПараметрыЗапроса.ОжидаемыеСтатусыКодовПослеПередачиОтчетаОНанесении.Найти(СтатусКодов) <> Неопределено Тогда
				СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
			ИначеЕсли ПараметрыЗапроса.ДопустимыеНачальныеСтатусыКодовОтчетОНанесении.Найти(СтатусКодов) <> Неопределено Тогда
				// Статус запрашивается после запроса квитанции, через 40 минут. Если статус кодов не изменился - то отчет обработан с ошибкой.
				СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			ИначеЕсли ЭтоПовторныйЗапросКвитанции
				И (СтатусКодов = Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен
				Или СтатусКодов = Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен) Тогда
				СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен;
			Иначе
				// Если статус кода изменился на несколько действий, например, вместо "наненсен" статус стал "введен в оборот" или "списан"
				СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
			КонецЕсли;
			Прервать;
		КонецЦикла;
	Иначе
		Если ЭтоПовторныйЗапросКвитанции Тогда
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен;
		Иначе
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
		КонецЕсли;
	КонецЕсли;
	
	Статус = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетОбрабатывается;
	
	Если ЭлементОчереди.ТекущийСтатусОбработки = СтатусОбработки Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	
	Операция = Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.СообщениеОснование;
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
			НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
			НаборЗаписейОснования.Прочитать();
		Иначе
			НаборЗаписейОснования = Неопределено;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или НаборЗаписейОснования <> Неопределено
				И Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования <> Неопределено И НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПредставлениеПротокола = ДополнитьПротоколОбмена(ЭлементОчередиОснование, ПротоколОбмена, СтатусОбработки, Операция);
		
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Статус;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;   //основания?
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		Если СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ИспользуетсяПакетнаяПередачаСообщений", Ложь) Тогда
			ПараметрыОбновленияСтатуса.Вставить("ЕстьЗависимыеСообщения", Истина);
		КонецЕсли;
		
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен Тогда
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчередиОснование.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчередиОснование.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчередиОснование.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчередиОснование.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчередиОснование.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
			Реквизиты.Вставить("Описание",             РезультатПолученияДанных.ТекстОшибки);
			
			Если Не ЗначениеЗаполнено(Реквизиты.Описание)
				И (СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
				   Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен) Тогда
				Реквизиты.Описание = НСтр("ru = 'Ошибка при получении результата обработки документа.
				                                |Не удалось получить квитанцию для отчета о нанесении, статус кодов не изменился.
				                                |Запросите квитанцию повторно или обратитесь в техническую поддержку оператора ГИС МТ
				                                |для получения дополнительной информации о состоянии обработки отчета.'");
			КонецЕсли;
			
			ПротоколОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчередиОснование.ПротоколОбмена);
			
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколОбменаXML,
				Реквизиты);
			
			Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
				СтрокаРезультата = СтруктураИзменения();
				СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
				СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
				
				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
				СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
				
				СтрокаРезультата.ТекстОшибки           = РезультатПолученияДанных.ТекстОшибки;
				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
				СтрокаРезультата.ОбъектИзменен         = Ложь;
				
				СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ТекстСообщения               = ПредставлениеПротокола;
				СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротокола;
				
				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
				
				Если ЭтоПовторныйЗапросКвитанции Тогда
					РегистрыСведений.ПакетыКодовМаркировкиИСМП.УдалитьЗаписиПоИдентификаторуЗаявки(
						ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ИдентификаторЗаявки,
						ЭлементОчереди.Документ);
				КонецЕсли;
				
			ИначеЕсли Не ЭтоПовторныйЗапросКвитанции Тогда
				
				ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчередиОснование,, ЭлементОчередиОснование.ИдентификаторЗаявки);
				
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			КонецЕсли;
			
		Иначе // ЗаявкаОбрабатывается
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				?(НаборЗаписейОснования = Неопределено, НаборЗаписей, НаборЗаписейОснования),
				Неопределено,
				Неопределено,
				Новый ХранилищеЗначения(
					ЭлементОчередиОснование.ПротоколОбмена));
			
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			"");
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована Тогда
		
		Если СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается Тогда
			
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
				УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
				Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчередиОснование) <> -1 Тогда
					ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчередиОснование);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		Возврат;
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

Процедура ЗагрузитьРезультатПроверкаСтатусаОбработкиДокумента(ЭлементОчереди, ПараметрыОбмена)
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента Тогда
	ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияПроверкаСтатусаОбработкиДокумента Тогда
	КонецЕсли;
	
	РезультатОбработкиЗаявки = ИнтерфейсИСМП.СтатусОбработкиДокументаПоИдентификатору(
		ЭлементОчереди.ИдентификаторЗаявки,
		ЭлементОчереди.Организация, ЭлементОчереди.ВидПродукции, ЭлементОчереди.Операция);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		Если ЭлементОчереди <> ЭлементОчередиОснование Тогда
			ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.СообщениеОснование;
		КонецЕсли;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		Если ЭлементОчереди <> ЭлементОчередиОснование Тогда
			НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
			НаборЗаписейОснования.Прочитать();
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или Не (НаборЗаписейОснования = Неопределено Или НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если ЭлементОчереди <> ЭлементОчередиОснование И НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента Тогда
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			
			ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
			ПараметрыОбновленияСтатуса.Статус            = Неопределено;
			ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
			ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
			ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
			ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
			
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
				ЭлементОчереди.Документ,
				РезультатОбработкиЗаявки.Операция,
				ПараметрыОбновленияСтатуса);
			
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиОснование,
			РезультатОбработкиЗаявки);
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка Тогда
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчередиОснование.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             РезультатОбработкиЗаявки.ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчередиОснование.ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколаОбменаXML,
				Реквизиты);
			
			Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента Тогда
				СтрокаРезультата = СтруктураИзменения();
				
				СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
				СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
				
				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
				СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
				
				СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
				СтрокаРезультата.ОбъектИзменен         = Ложь;
				
				СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
				СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
				
				ОбработкаЗагрузкиПереданногоДокумента(
					ЭлементОчереди,
					ПараметрыОбмена,
					РезультатОбработкиЗаявки,
					ПараметрыОбновленияСтатуса);
				
				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
				
			ИначеЕсли (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
				Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка)
				И ЭлементОчередиОснование.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ДанныеСообщения")
				И ЭлементОчереди.Операция <> Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента Тогда
				
				ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчередиОснование);
				
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			Если ЭлементОчереди <> ЭлементОчередиОснование Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			КонецЕсли;
			
		Иначе
			
			Если ЭлементОчереди <> ЭлементОчередиОснование Тогда
				
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписейОснования,
					Неопределено,
					Неопределено,
					Новый ХранилищеЗначения(
						ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена));
			
			Иначе
				
				ОбновитьИдентификаторЗаявкиСообщенияОчереди(
					НаборЗаписей,
					Неопределено,
					Неопределено,
					Новый ХранилищеЗначения(ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена));
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки документа %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
		   Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		Если ЭлементОчереди <> ЭлементОчередиОснование Тогда
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчередиОснование) <> -1 Тогда
				ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчередиОснование);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗагрузитьРезультатОбработкиАбстрактнойАгрегацииИзменениеРасчетСтатуса(ЭлементОчереди, ПараметрыОбмена)
	
	ЭлементОчередиАбстрактнаяАгрегация = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	
	Если ЭлементОчередиАбстрактнаяАгрегация.ПротоколОбмена = Неопределено Тогда
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		Возврат;
	КонецЕсли;
	
	МассивОшибок    = Новый Массив;
	ОписаниеОшибки  = "";
	СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	
	Для Каждого СтрокаТЧ Из ЭлементОчередиАбстрактнаяАгрегация.ПротоколОбмена Цикл

		Если СтрокаТЧ.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Или СтрокаТЧ.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда

			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			ДанныеОтвета = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(СтрокаТЧ.ОтветТело);

			Если ДанныеОтвета <> Неопределено Тогда
				Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
					ТелоОтвета = ДанныеОтвета[0];
				Иначе
					ТелоОтвета = ДанныеОтвета;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТелоОтвета, "errors") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОшибок, ТелоОтвета["errors"], Истина);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;
	
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
		ОписаниеОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = НСтр("ru = '<Описание ошибки отсутствует>'");
		КонецЕсли;
	КонецЕсли;
	
	МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
	
	ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
	ПараметрыОбновленияСтатуса.Статус            = Неопределено;
	ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
	ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
	ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
	ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
		ЭлементОчереди.Документ,
		Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
		ПараметрыОбновленияСтатуса);
	
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчередиАбстрактнаяАгрегация.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчередиАбстрактнаяАгрегация.ИдентификаторЗаявки);
		Реквизиты.Вставить("Операция",             ЭлементОчередиАбстрактнаяАгрегация.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчередиАбстрактнаяАгрегация.СообщениеОснование);
		Реквизиты.Вставить("Версия",               ЭлементОчередиАбстрактнаяАгрегация.РеквизитыИсходящегоСообщения.Версия);
		Реквизиты.Вставить("ТипСообщения",         ЭлементОчередиАбстрактнаяАгрегация.РеквизитыИсходящегоСообщения.ТипСообщения);
		Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
		Реквизиты.Вставить("Описание",             ОписаниеОшибки);
		
		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчередиАбстрактнаяАгрегация.ПротоколОбмена);
		ДобавитьЗаписьВПротоколОбмена(
			ПротоколаОбменаXML,
			Реквизиты);
		
		СтрокаРезультата = СтруктураИзменения();
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = ОписаниеОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = СтрокаТЧ.ОтветТело; 
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПротоколаОбменаXML;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		Для Каждого ЭлементОчередиКУдалению Из ПараметрыОбмена.ОчередьСообщений Цикл
			Если ЭлементОчередиКУдалению.СообщениеОснование = ЭлементОчереди.СообщениеОснование Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчередиКУдалению, ПараметрыОбмена);
				Если ЭлементОчередиКУдалению.Сообщение <> ЭлементОчереди.Сообщение Тогда
					УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиКУдалению, ПараметрыОбмена);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		УдалитьСообщениеИзОчереди(ЭлементОчередиАбстрактнаяАгрегация, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиАбстрактнаяАгрегация, ПараметрыОбмена);
		
		Для Каждого ЭлементОчередиКУдалению Из ПараметрыОбмена.ОбработанныеЭлементыОчереди Цикл
			
			Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчередиКУдалению) <> -1 
				И ЭлементОчередиКУдалению.Сообщение <> ЭлементОчереди.Сообщение Тогда
				ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчередиКУдалению);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОбмена.ОбработанныеЭлементыОчереди.Очистить();
	КонецЕсли;
	
	УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
	УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	
КонецПроцедуры

Процедура ЗагрузитьРезультатОбработкиАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена)
	
	Если ЭлементОчереди.ПротоколОбмена = Неопределено Тогда

		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);

		// Обновить статус у документа.
		ИнтеграцияИСМП.РассчитатьСтатусДокументаПоДаннымПротоколаОбмена(ЭлементОчереди.Документ);
		СтрокаРезультата = СтруктураИзменения();
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

		СтрокаРезультата.ТекстОшибки           = "";
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = Неопределено;
		СтрокаРезультата.ОбъектИзменен         = Ложь;

		СтрокаРезультата.Сообщение = ЭлементОчереди.Сообщение;

		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);

		Возврат;

	КонецЕсли;
	
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Агрегация
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТК
		Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозливаРасчетСтатуса Тогда
		СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	Иначе
		СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
	КонецЕсли;

	МассивОшибок    = Новый Массив;
	ОписаниеОшибки  = "";
	
	Для Каждого СтрокаТЧ Из ЭлементОчереди.ПротоколОбмена Цикл

		Если СтрокаТЧ.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Или СтрокаТЧ.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда

			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			ДанныеОтвета = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(СтрокаТЧ.ОтветТело);

			Если ДанныеОтвета <> Неопределено Тогда
				Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
					ТелоОтвета = ДанныеОтвета[0];
				Иначе
					ТелоОтвета = ДанныеОтвета;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТелоОтвета, "errors") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОшибок, ТелоОтвета["errors"], Истина);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;
	
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
		ОписаниеОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = НСтр("ru = '<Описание ошибки отсутствует>'");
		КонецЕсли;
	КонецЕсли;
	
	СтрокаРезультата = СтруктураИзменения();
	СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
	СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
	СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

	СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
	СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
	СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

	СтрокаРезультата.ТекстОшибки           = ОписаниеОшибки;
	СтрокаРезультата.ПодготовленоКПередаче = Ложь;
	СтрокаРезультата.Передано              = Ложь;
	СтрокаРезультата.Принято               = Истина;
	СтрокаРезультата.НовыйСтатус           = СтатусОбработки;
	СтрокаРезультата.ОбъектИзменен         = Ложь;
	СтрокаРезультата.Сообщение             = ЭлементОчереди.Сообщение;
	СтрокаРезультата.ТекстСообщения        = ОписаниеОшибки;

	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
	ПараметрыОбновленияСтатуса.Статус            = Неопределено;
	ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
	ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
	ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
	ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ПараметрыЗапроса;
	
	РезультатОбработкиЗаявки = Новый Структура;
	РезультатОбработкиЗаявки.Вставить("СтатусОбработки", СтатусОбработки);

	СоздаватьШтрихкодыУпаковок = Ложь;
	Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
		И ПараметрыЗапроса.Свойство("СоздаватьШтрихкодыУпаковок")
		И ПараметрыЗапроса.СоздаватьШтрихкодыУпаковок Тогда

		ДанныеДереваУпаковок = ПодготовитьДеревоУпаковокВерхнегоУровняПоДокументу(ЭлементОчереди.Документ);

		Если ЗначениеЗаполнено(ДанныеДереваУпаковок.ТекстОшибки) Тогда
			СтрокаРезультата.ТекстОшибки = ДанныеДереваУпаковок.ТекстОшибки;
			ПараметрыОбновленияСтатуса.Вставить("ОшибкаПриСозданииШтрихкодовУпаковок", Истина);
		Иначе
			СоздаватьШтрихкодыУпаковок = Истина;
		КонецЕсли;

	КонецЕсли;

	НачатьТранзакцию();

	Попытка

		ОбработкаЗагрузкиПереданногоДокумента(
			ЭлементОчереди,
			ПараметрыОбмена,
			РезультатОбработкиЗаявки,
			ПараметрыОбновленияСтатуса);

		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);

		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
		Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
		Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
		Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
		Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
		Реквизиты.Вставить("Описание",             ОписаниеОшибки);

		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
		ДобавитьЗаписьВПротоколОбмена(
			ПротоколаОбменаXML,
			Реквизиты);

		СтрокаРезультата.ОбъектИзменен = Истина;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПротоколаОбменаXML;
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);

		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулировать
			И ЗначениеЗаполнено(ЭлементОчереди.Документ)
			И СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята Тогда
			ОчиститьОчередьЗапросаСтатусаОтгрузкаТоваровИСМП(ЭлементОчереди, СтатусОбработки);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

		ТранзакцияЗафиксирована = Истина;

	Исключение

		ОтменитьТранзакцию();

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);

		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;

		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных, ЭлементОчереди.Документ);

		ТранзакцияЗафиксирована = Ложь;

	КонецПопытки;

	ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);

	Если ТранзакцияЗафиксирована Тогда

		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);

		Если СоздаватьШтрихкодыУпаковок Тогда
			НачатьТранзакцию();
			Попытка
				Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодыУпаковокПоДаннымДерева(
					ДанныеДереваУпаковок.ДеревоУпаковок,
					ДанныеДереваУпаковок.ПараметрыСканирования);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИмяСобытияЖурналРегистрации = НСтр(
					"ru = 'ГосИС: Запись штрихкодов упаковок верхнего уровня при обработке очереди сообщений'",
					ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
				ВызватьИсключение ПодробноеПредставлениеОшибки;
			КонецПопытки;

		КонецЕсли;

	Иначе

		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьСообщенияПоАбстрактнойОперацииВводВОборотИмпортСФТС(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСМППрисоединенныеФайлы.Документ КАК Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(ИСМППрисоединенныеФайлы.Версия, 0)) КАК ПоследнийНомерВерсии
	|ПОМЕСТИТЬ Версии
	|ИЗ
	|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК Шапка
	|		ПО Шапка.Ссылка = &Ссылка
	|		И Шапка.Операция = ИСМППрисоединенныеФайлы.Операция
	|		И Шапка.Ссылка = ИСМППрисоединенныеФайлы.Документ
	|ГДЕ
	|	ИСМППрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Исходящий)
	|СГРУППИРОВАТЬ ПО
	|	ИСМППрисоединенныеФайлы.Документ");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Версии.ПоследнийНомерВерсии, 0) КАК ПоследнийНомерВерсии,
	|	Шапка.Номер                          КАК Номер,
	|	Шапка.Дата                           КАК Дата,
	|	Шапка.ДокументОснование              КАК ДокументОснование,
	|	
	|	Шапка.Организация                    КАК Организация,
	|	Представление(Шапка.Организация)     КАК ОрганизацияПредставление,
	|	
	|	Шапка.Контрагент                     КАК Контрагент,
	|	Представление(Шапка.Контрагент)      КАК КонтрагентПредставление,
	|	
	|	Шапка.Ответственный                  КАК Ответственный,
	|	Представление(Шапка.Ответственный)   КАК ОтветственныйПредставление,
	|	
	|	Шапка.ВидПродукции                   КАК ВидПродукции,
	|	Шапка.Операция                       КАК Операция,
	|	Шапка.ОперацияНанесения              КАК ОперацияНанесения,
	|	Шапка.ОтчетПроизводственнойЛинии     КАК ОтчетПроизводственнойЛинии,
	|	Шапка.ДатаПроизводства               КАК ДатаПроизводства,
	|	Шапка.ВариантЗаполненияДекларации    КАК ВариантЗаполненияДекларации,
	|	Шапка.ДатаДекларации                 КАК ДатаДекларации,
	|	Шапка.РегистрационныйНомерДекларации КАК РегистрационныйНомерДекларации,
	|
	|	Шапка.ВариантВыполненияАгрегации        КАК ВариантВыполненияАгрегации,
	|	Шапка.ОперацияНанесенияТолькоДляНаборов КАК ОперацияНанесенияТолькоДляНаборов,
	|	
	|	Шапка.Ссылка                         КАК Ссылка,
	|	
	|	Шапка.ИдентификаторПроисхожденияВЕТИССтрокой КАК ИдентификаторПроисхожденияВЕТИССтрокой,
	|	Шапка.Номенклатура                           КАК Номенклатура,
	|	Шапка.Характеристика                         КАК Характеристика,
	|	Шапка.Серия                                  КАК Серия
	|	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Версии КАК Версии
	|		ПО Шапка.Ссылка = Версии.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка",
	"Шапка");
	
	ТекстЗапросаТовары = 
	"ВЫБРАТЬ
	|	// Универсальные реквизиты
	|	Товары.Номенклатура       КАК Номенклатура,
	|	Товары.Характеристика     КАК Характеристика,
	|	Товары.Серия              КАК Серия,
	|	Товары.Упаковка           КАК Упаковка,
	|	Товары.GTIN               КАК GTIN,
	|	Товары.Количество         КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|
	|	// Дополнительные реквизиты
	|	Товары.ИдентификаторПроисхожденияВЕТИС        КАК ИдентификаторПроисхожденияВЕТИС,
	|	&ИдентификаторПроисхожденияВЕТИССтрокой       КАК ИдентификаторПроисхожденияВЕТИССтрокой
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.Товары КАК Товары
	|
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	ИнтеграцияИСМПВЕТИС.ДоработатьЗапросЗаполненияМаркируемойПродукцииДокументаМаркировка(ТекстЗапросаТовары);
	СписокЗапросов.Добавить(ТекстЗапросаТовары, "Товары");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковок.ШтрихкодУпаковки                КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковок.ИдентификаторПроисхожденияВЕТИС КАК ИдентификаторПроисхожденияВЕТИС,
	|	ШтрихкодыУпаковок.СрокГодности                    КАК СрокГодности
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|ГДЕ
	|	ШтрихкодыУпаковок.Ссылка = &Ссылка
	|",
	"ШтрихкодыУпаковок");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ВложенныеШтрихкодыАТКИСМП.ДокументОснование КАК ДокументОснование,
	|	МАКСИМУМ(ВложенныеШтрихкодыАТКИСМП.Версия)  КАК Версия
	|ПОМЕСТИТЬ ВерсииСообщений
	|ИЗ
	|	РегистрСведений.ВложенныеШтрихкодыАТКИСМП КАК ВложенныеШтрихкодыАТКИСМП
	|ГДЕ
	|	ВложенныеШтрихкодыАТКИСМП.ДокументОснование = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВложенныеШтрихкодыАТКИСМП.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныеШтрихкодыАТКИСМП.АТК       КАК ШтрихкодУпаковки,
	|	ВложенныеШтрихкодыАТКИСМП.ДанныеАТК КАК ДанныеАТК
	|ИЗ
	|	ВерсииСообщений КАК ВерсииСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВложенныеШтрихкодыАТКИСМП КАК ВложенныеШтрихкодыАТКИСМП
	|		ПО ВложенныеШтрихкодыАТКИСМП.ДокументОснование = ВерсииСообщений.ДокументОснование
	|		И ВложенныеШтрихкодыАТКИСМП.Версия = ВерсииСообщений.Версия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШтрихкодыАТК.ШтрихкодУпаковки,
	|	Неопределено
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыАТК КАК ШтрихкодыАТК
	|ГДЕ
	|	ШтрихкодыАТК.Ссылка = &Ссылка
	|",
	"ШтрихкодыУпаковокАТК");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ДанныеОтчета.ЗначениеШтрихкода                        КАК ЗначениеШтрихкода,
	|	ДанныеОтчета.ЗначениеШтрихкодаУпаковки                КАК ЗначениеШтрихкодаУпаковки,
	|	ДанныеОтчета.НормализованноеЗначениеШтрихкода         КАК НормализованноеЗначениеШтрихкода,
	|	ДанныеОтчета.НормализованноеЗначениеШтрихкодаУпаковки КАК НормализованноеЗначениеШтрихкодаУпаковки,
	|	ДанныеОтчета.ФорматBase64 КАК ФорматBase64,
	|	ДанныеОтчета.НомерСтроки  КАК КлючЗаписи,
	|	ВЫБОР
	|		КОГДА НЕ &Повторно
	|			Или ПОДСТРОКА(ДанныеОтчета.ТекстОшибкиЗначениеШтрихкода, 1, 1) <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗначениеШтрихкодаКПередаче,
	|
	|	ВЫБОР
	|		КОГДА НЕ &Повторно
	|			Или ПОДСТРОКА(ДанныеОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки, 1, 1) <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗначениеШтрихкодаУпаковкиКПередаче,
	|	ДанныеОтчета.Ссылка КАК Документ
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ДанныеОтчетаПроизводственнойЛинии КАК ДанныеОтчета
	|ГДЕ
	|	ДанныеОтчета.Ссылка = &Ссылка
	|	И ВЫБОР
	|		КОГДА НЕ &Повторно
	|			Или ПОДСТРОКА(ДанныеОтчета.ТекстОшибкиЗначениеШтрихкода, 1, 1) <> """"
	|			Или ПОДСТРОКА(ДанныеОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки, 1, 1) <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.ЗначениеШтрихкода,
	|	ДанныеРегистра.ЗначениеШтрихкодаУпаковки,
	|	ДанныеРегистра.НормализованноеЗначениеШтрихкода,
	|	ДанныеРегистра.НормализованноеЗначениеШтрихкодаУпаковки,
	|	ДанныеРегистра.ФорматBase64,
	|	ДанныеРегистра.КлючЗаписи,
	|	ВЫБОР
	|		КОГДА НЕ &Повторно
	|			Или ПОДСТРОКА(ДанныеРегистра.ТекстОшибкиЗначениеШтрихкода, 1, 1) <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|
	|	ВЫБОР
	|		КОГДА НЕ &Повторно
	|			Или ПОДСТРОКА(ДанныеРегистра.ТекстОшибкиЗначениеШтрихкодаУпаковки, 1, 1) <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДанныеРегистра.Документ
	|ИЗ
	|	РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Документ = &Ссылка
	|	И ВЫБОР
	|		КОГДА НЕ &Повторно
	|			Или ПОДСТРОКА(ДанныеРегистра.ТекстОшибкиЗначениеШтрихкода, 1, 1) <> """"
	|			Или ПОДСТРОКА(ДанныеРегистра.ТекстОшибкиЗначениеШтрихкодаУпаковки, 1, 1) <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючЗаписи",
	"ДанныеОтчетаПроизводственнойЛинии");

	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭлементОчереди.Документ);
	Запрос.УстановитьПараметр("ИдентификаторПроисхожденияВЕТИССтрокой", "");
	Запрос.УстановитьПараметр("Повторно", ПараметрыЗапроса.ПовторнаяОтправка);

	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	ДанныеШапки = РезультатЗапроса["Шапка"].Выбрать();
	//@skip-warning
	Товары = РезультатЗапроса["Товары"].Выгрузить();
	//@skip-warning
	ШтрихкодыУпаковок = РезультатЗапроса["ШтрихкодыУпаковок"].Выгрузить();
	//@skip-warning
	ШтрихкодыУпаковокАТК = РезультатЗапроса["ШтрихкодыУпаковокАТК"].Выгрузить();
	//@skip-warning
	ДанныеОтчета = РезультатЗапроса["ДанныеОтчетаПроизводственнойЛинии"].Выгрузить();

	Если Не ДанныеШапки.Следующий()
		Или (ШтрихкодыУпаковок.Количество() = 0 И ДанныеОтчета.Количество() = 0) Тогда
		
		ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	НомерВерсии = ДанныеШапки.ПоследнийНомерВерсии + 1;

	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(
		ДанныеШапки, Неопределено, ЭлементОчереди.ВидПродукции);
	Настройки = Новый Структура(
		"СоздаватьШтрихкодУпаковки, СсылкаНаОбъект",
		Ложь, ЭлементОчереди.Документ);
	ЗаполнитьЗначенияСвойств(ПараметрыСканирования, Настройки);
	ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Истина);
	
	Фильтр = Неопределено;
	
	Если ДанныеШапки.ОтчетПроизводственнойЛинии Тогда

		КодыМаркировкиНормализованы = Истина;

		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			Если ЗначениеЗаполнено(СтрокаОтчета.ЗначениеШтрихкода) Тогда
				КодыМаркировкиНормализованы = Ложь;
			КонецЕсли;
			Прервать;
		КонецЦикла;

		ПараметрыРазбора = Новый Структура;
		ПараметрыРазбора.Вставить("ВосстанавливатьСтруктуруКодаМаркировки", Не ПараметрыСканирования.ПроверятьСтруктуруКодовМаркировки);
		ПараметрыРазбора.Вставить("ПроверятьАлфавитКодовМаркировки",        ПараметрыСканирования.ПроверятьАлфавитКодовМаркировки);
		ПараметрыРазбора.Вставить("КодыМаркировкиНормализованы",            КодыМаркировкиНормализованы);

		ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкода", Новый ОписаниеТипов("Строка"));
		ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкодаУпаковки", Новый ОписаниеТипов("Строка"));

		// С учетом возможных пустых колонок ЗначениеШтрихкода, если ввод в оборот после нанесения.
		РезультатОбработкиДанныхОтчета = РазборКодаМаркировкиИССлужебный.НормализоватьДанныеОтчетаПроизводственнойЛинии(
			ДанныеОтчета, ЭлементОчереди.ВидПродукции, ПараметрыРазбора);

		ИсточникДанных = Новый Массив;
		КешДанныхРазбора = Новый Соответствие;

		Для Каждого СтрокаДанных Из РезультатОбработкиДанныхОтчета.ОбработанныеДанныеОтчета Цикл

			ИсходнаяСтрока = СтрокаДанных.ИсходнаяСтрока;

			ИсточникДанных.Добавить(
				Новый Структура(
					"Штрихкод, ШтрихкодУпаковки",
					ИсходнаяСтрока.НормализованноеЗначениеШтрихкода, ИсходнаяСтрока.НормализованноеЗначениеШтрихкодаУпаковки));

			Для Каждого ИменаКолонок Из РезультатОбработкиДанныхОтчета.ГруппыКолонок Цикл

				Если Не ЗначениеЗаполнено(ИсходнаяСтрока[ИменаКолонок.КодМаркировки]) Тогда
					Продолжить;
				КонецЕсли;

				Если КешДанныхРазбора[ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки]] = Неопределено Тогда
					
					СтруктураДанныхРазбора = ИнициализироватьСтруктуруДанныхРазбора();
					СтруктураДанныхРазбора.ВидУпаковки               = СтрокаДанных[ИменаКолонок.ВидУпаковки];
					СтруктураДанныхРазбора.ТипШтрихкода              = СтрокаДанных[ИменаКолонок.ТипШтрихкода];
					СтруктураДанныхРазбора.EAN                       = СтрокаДанных[ИменаКолонок.EAN];
					СтруктураДанныхРазбора.GTIN                      = СтрокаДанных[ИменаКолонок.GTIN];
					СтруктураДанныхРазбора.КоличествоВложенныхЕдиниц = СтрокаДанных[ИменаКолонок.КоличествоВложенныхЕдиниц];
					СтруктураДанныхРазбора.ДанныеРазбора             = СтрокаДанных[ИменаКолонок.ДанныеРазбора];
					СтруктураДанныхРазбора.КодДляПередачиИСМП        = СтрокаДанных[ИменаКолонок.КодДляПередачиИСМП];
					КешДанныхРазбора.Вставить(
						ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки],
						СтруктураДанныхРазбора);

				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

		Результат = ДеревоУпаковокПоДаннымОтчетаПроизводственнойЛинии(ДанныеШапки, ИсточникДанных, КешДанныхРазбора);
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ВызватьИсключение Результат.ТекстОшибки;
		КонецЕсли;

		ДеревоУпаковок = Результат.ДеревоУпаковок;

		ДанныеПоШтрихкодам = ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам(Ложь);
		ДанныеПоШтрихкодам.ВложенныеШтрихкоды = ШтрихкодированиеИС.ИнициализацияВложенныхШтрихкодов(ДеревоУпаковок);
		ДанныеПоШтрихкодам.ИерархическаяЗагрузкаИзТСД = Истина;

		// Сохранение параметров сканирования.
		// При подготовке дерева упаковок в сценарии работы с ТСД не следует выполнять обращения к ГИС МТ.
		// Все необходимые обращения выполнит механизм штрихкодирования.
		ШтрихкодированиеИСМПСлужебный.НормализоватьДанныеВложенныхШтрихкодов(
			ДанныеПоШтрихкодам.ВложенныеШтрихкоды, ПараметрыСканирования);
		ШтрихкодированиеИСМПСлужебный.ДобавитьКолонкиТаблицыДанныеКодовМаркировки(
			ДанныеПоШтрихкодам, ПараметрыСканирования);

		ПараметрыСканирования.ЭтоОтчетПроизводственнойЛинии = Истина;
		ПараметрыСканирования.ПроверятьДублиКодовМаркировки = "НеПроверять";
		ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок = Истина;
		ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);

		РезультатОбработкиШтрихкодов = ШтрихкодированиеИС.ОбработатьШтрихкоды(
			Неопределено, ПараметрыСканирования,
			Неопределено, Новый УникальныйИдентификатор, Неопределено, ДанныеПоШтрихкодам);

		РезультатПолученияДанных = Новый Структура;
		РезультатПолученияДанных.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
		Для Каждого КлючИЗначение Из РезультатОбработкиШтрихкодов.РезультатыОбработки Цикл
			РезультатОбработки = КлючИЗначение.Значение;
			Если РезультатОбработки.Свойство("ТребуетсяАвторизацияИСМП")
					И РезультатОбработки.ТребуетсяАвторизацияИСМП Тогда
				РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессии = Истина;
				Прервать;
			КонецЕсли;
			Если РезультатОбработки.Свойство("ЕстьОшибки") И РезультатОбработки.ЕстьОшибки Тогда
				ВызватьИсключение РезультатОбработки.ТекстОшибки;
			КонецЕсли;
		КонецЦикла;

		Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;

		ВложенныеШтрихкоды = ДанныеПоШтрихкодам.ВложенныеШтрихкоды;

	Иначе

		Если ПараметрыЗапроса.ПовторнаяОтправка Тогда
			Фильтр = ПараметрыЗапроса.ШтрихкодыУпаковокКПовторнойПередаче;
		КонецЕсли;

		РезультатПолученияДанных = ШтрихкодированиеИСМП.ВложенныеШтрихкодыУпаковокПоДокументу(ЭлементОчереди.Документ, ПараметрыСканирования, Истина);

		Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;

		Если РезультатПолученияДанных.ЕстьОшибки Тогда
			ВызватьИсключение РезультатПолученияДанных.ТекстОшибки;
		КонецЕсли;

		ВложенныеШтрихкоды = РезультатПолученияДанных.ВложенныеШтрихкоды;

	КонецЕсли;
	
	СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(Новый Структура, ДанныеШапки.Операция, ЭлементОчереди);
	
	СообщенияJSON = Новый Массив;
	
	ЕстьОшибки = Ложь;
	
	КодыАгрегированы    = ПараметрыЗапроса.КодыАгрегированы;
	КодыАТКСформированы = ПараметрыЗапроса.КодыАТКСформированы;
	Если Не КодыАгрегированы Тогда // При вводе в оборот в разрезе кодов или АТК.
		Для Каждого СтрокаДерева Из ВложенныеШтрихкоды.ДеревоУпаковок.Строки Цикл
			Результат = НайтиСформированныеАгрегатыПоДаннымИСМП(СтрокаДерева);
			Если Результат.ЕстьОшибки Тогда
				ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(СообщениеJSON, Результат.ТекстОшибки);
				СообщенияJSON.Добавить(СообщениеJSON);
				ЕстьОшибки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЕстьОшибки Тогда

		ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
		ПараметрыНормализацииПрочее.НачинаетсяСоСкобки = Ложь;

		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("trade_participant_inn", ПараметрыЗапроса.ОрганизацияИНН);
		Если ДанныеШапки.ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво Тогда
			ТелоЗапроса.Вставить("trade_participant_kpp", ПараметрыЗапроса.ОрганизацияКПП);
		КонецЕсли;
		ТелоЗапроса.Вставить("declaration_date",      Формат(ДанныеШапки.ДатаДекларации,"ДФ=yyyy-MM-dd")); // Смена формата?
		ТелоЗапроса.Вставить("declaration_number",    ДанныеШапки.РегистрационныйНомерДекларации);

		ТелоЗапроса.Вставить("products_list",        Новый Массив);

		Настройки = Новый Структура;

		Настройки.Вставить("ИмяРеквизитаТовары",         "products_list");
		// Для всех товарных групп, кроме молочной продукции, использовать cis
		Настройки.Вставить("ИмяРеквизитаКодМаркировки",  "cis");
		Настройки.Вставить("УказыватьТипУпаковки",       Ложь);
		Настройки.Вставить("УровеньВложенностиУпаковок", 1);
		Настройки.Вставить("ЗаполнятьВложенныеКоды",     Ложь);

		Настройки.Вставить("УказыватьИдентификаторПроисхожденияВЕТИС", Ложь);
		Настройки.Вставить("УказыватьДатуПроизводства",                Ложь);
		
		ЭтоМолочнаяПродукцияИСМП = ИнтеграцияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ДанныеШапки.ВидПродукции);
		Если ЭтоМолочнаяПродукцияИСМП Тогда
			ДатаПроизводства = Формат(ДанныеШапки.ДатаПроизводства,"ДФ=yyyy-MM-dd");
			ТелоЗапроса.Вставить("production_date",       ДатаПроизводства);

			Настройки.УказыватьДатуПроизводства = Истина;
			Настройки.Вставить("ДатаПроизводства", ДатаПроизводства);
			Если ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС Тогда
				Настройки.УказыватьИдентификаторПроисхожденияВЕТИС = Истина;
				Настройки.ЗаполнятьВложенныеКоды = Истина;
			КонецЕсли;
			Настройки.Вставить("ИмяРеквизитаКодМаркировкиДополнительное", "ki");
		КонецЕсли;

		Настройки.Вставить("КоличествоКодовВСообщении",  КоличествоКодовВСообщенииВводВОборот());
		Настройки.Вставить("ОтчетПроизводственнойЛинии", ДанныеШапки.ОтчетПроизводственнойЛинии);
		Настройки.Вставить("Фильтр",                     Фильтр);

		ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
		ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;

		НастройкиРазбораКодаМаркировки = Новый Структура;
		НастройкиРазбораКодаМаркировки.Вставить("Кеш",              РазборКодаМаркировкиИССлужебныйКлиентСервер.ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
		НастройкиРазбораКодаМаркировки.Вставить("Общие",            РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(, Ложь));
		НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);

		Настройки.Вставить("НастройкиРазбораКодаМаркировки",         НастройкиРазбораКодаМаркировки);
		Настройки.Вставить("ПараметрыНормализацииПрочее",            ПараметрыНормализацииПрочее);

		Настройки.Вставить("ДоступенРежимИсправленияОшибок",
			ДанныеШапки.ВариантЗаполненияДекларации <> Перечисления.ВариантыЗаполненияДекларацииИСМП.АТК);

		ГруппыКодов = Новый Массив;

		Если ДанныеШапки.ОтчетПроизводственнойЛинии Тогда

			Если ДанныеШапки.ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.КодыМаркировки Тогда

				ЗаполнитьСведенияОТоварахИмпортСФТСПоШтрихкодамУпаковок(СообщениеJSON, ЭлементОчереди, ГруппыКодов,
					ВложенныеШтрихкоды.МаркированныеТовары, ДанныеШапки, Настройки);

			ИначеЕсли ДанныеШапки.ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.АТК Тогда

				ЗаполнитьСведенияИмпортСФТСПоДаннымАТКОтчетаПроизводственнойЛинии(ЭлементОчереди, ГруппыКодов,
					ДанныеШапки, ШтрихкодыУпаковокАТК, Настройки);

			Иначе // Агрегаты

				ЗаполнитьСведенияИмпортФТСПоДеревуУпаковок(СообщениеJSON, ЭлементОчереди, ГруппыКодов,
					ВложенныеШтрихкоды.ДеревоУпаковок, ДанныеШапки, Настройки);

			КонецЕсли;

		Иначе

			Если ДанныеШапки.ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.КодыМаркировки Тогда
				ЗаполнитьСведенияОТоварахИмпортСФТСПоШтрихкодамУпаковок(СообщениеJSON, ЭлементОчереди, ГруппыКодов,
					ВложенныеШтрихкоды.МаркированныеТовары, Товары, Настройки);

			ИначеЕсли ДанныеШапки.ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.АТК Тогда

				РезультатПоискаАТК = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
					ШтрихкодыУпаковокАТК.ВыгрузитьКолонку("ШтрихкодУпаковки"),
					ПараметрыСканирования);

				Если Настройки.УказыватьИдентификаторПроисхожденияВЕТИС Тогда
					ДополнитьДеревоУпаковокАТКСпецификой(РезультатПоискаАТК.МаркированныеТовары, ВложенныеШтрихкоды);
				КонецЕсли;

				ЗаполнитьСведенияИмпортФТСПоДеревуУпаковок(СообщениеJSON, ЭлементОчереди, ГруппыКодов,
					РезультатПоискаАТК.ДеревоУпаковок, Товары, Настройки);

			Иначе // Агрегаты

				ЗаполнитьСведенияИмпортФТСПоДеревуУпаковок(СообщениеJSON, ЭлементОчереди, ГруппыКодов,
					ВложенныеШтрихкоды.ДеревоУпаковок, Товары, Настройки);

			КонецЕсли;

		КонецЕсли;

		Для Каждого ДанныеСообщения Из ГруппыКодов Цикл

			ТелоЗапросаСообщения = ОбщегоНазначения.СкопироватьРекурсивно(ТелоЗапроса);
			ТелоЗапросаСообщения.products_list = ДанныеСообщения.ГруппаКодов;

			СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапросаСообщения, ДанныеШапки.Операция, ЭлементОчереди);

			ПараметрыЗапроса = ОбщегоНазначения.СкопироватьРекурсивно(ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса);
			Если Настройки.ДоступенРежимИсправленияОшибок Тогда
				ПараметрыЗапроса.Вставить("ДанныеСообщения", ДанныеСообщения.ГруппаНормализованныхКодов);
			КонецЕсли;

			СообщениеJSON.Идентификатор      = Строка(Новый УникальныйИдентификатор());
			СообщениеJSON.ЗагружатьДо        = ЭлементОчереди.Сообщение;
			СообщениеJSON.Версия             = НомерВерсии;
			СообщениеJSON.ПараметрыЗапроса   = ПараметрыЗапроса;
			СообщениеJSON.СообщениеОснование = "";
			СообщениеJSON.Описание           = ОписаниеОперацииПередачиДанных(
				ДанныеШапки.Операция, ЭлементОчереди.Документ, НомерВерсии);

			СообщениеОснованиеДляСлужебногоПротоколаОбмена = СообщениеJSON.Идентификатор;

			СообщенияJSON.Добавить(СообщениеJSON);

		КонецЦикла;
		
		СообщенияJSONТрансформация = Новый Массив;
		
		Если Не КодыАгрегированы Тогда
			
			ПараметрыОбработки = Новый Структура;
			// Если ввод в оборот осуществляется по кодам АТК, то исключить подготовку операции "расформирование АТК"
			ПараметрыОбработки.Вставить("ОбрабатыватьКодыАТК", Не КодыАТКСформированы);
			
			ПодготовитьКПередачеСообщенияДляТрансформацииАгрегатовИСМП(
				ВложенныеШтрихкоды.МаркированныеТовары,
				ЭлементОчереди,
				СообщениеОснованиеДляСлужебногоПротоколаОбмена,
				СообщенияJSONТрансформация,
				ПараметрыОбмена,
				ПараметрыОбработки);

			Для Каждого СообщениеТрансформация Из СообщенияJSONТрансформация Цикл
				СообщениеТрансформация.СообщениеОснование = СообщениеОснованиеДляСлужебногоПротоколаОбмена;
			КонецЦикла;

		КонецЕсли;
		
		Если СообщенияJSONТрансформация.Количество() Тогда
			ПакетСообщений = Новый Соответствие;
			ПакетСообщений.Вставить(1, СообщенияJSONТрансформация);
			ПодготовитьКПередачеСообщениеАбстрактнаяАгрегацияИзменениеРасчетСтатуса(СообщенияJSON, ЭлементОчереди, ПакетСообщений);
		КонецЕсли;
		
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	ОбновитьИдентификаторЗаявкиСообщенияОчереди(
		НаборЗаписей,
		ИдентификаторЗаявки,
		Неопределено,
		Неопределено);
	
	ЭлементОчереди.ИдентификаторЗаявки = ИдентификаторЗаявки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияИмпортФТСПоДеревуУпаковок(СообщениеJSON, ОбщийЭлементОчереди, ГруппыКодов, ИсточникДанных, ИсточникДанныхТовары, Настройки)
	
	Фильтр = Неопределено;
	Если Настройки.УровеньВложенностиУпаковок = 1 Тогда

		КоличествоКодовВПакете = 0;

		ТекущаяГруппа = Новый Массив;

		ОписаниеПакета = Новый Структура;
		ОписаниеПакета.Вставить("ГруппаКодов", ТекущаяГруппа);
		Если Настройки.ДоступенРежимИсправленияОшибок Тогда
			ГруппаНормализованныхКодов = Новый Массив;
			ОписаниеПакета.Вставить("ГруппаНормализованныхКодов", ГруппаНормализованныхКодов);
		КонецЕсли;

		Настройки.Вставить("КоличествоВТекущейГруппе", 0);
		Настройки.Вставить("ТекущаяГруппаНормализованныхКодов", Новый Массив);

		Фильтр = Настройки.Фильтр;
	Иначе
		ТекущаяГруппа = ГруппыКодов;
	КонецЕсли;
	
	Для Каждого СтрокаШтрихкодаУпаковки Из ИсточникДанных.Строки Цикл
		
		Если Фильтр <> Неопределено
			И Фильтр[СтрокаШтрихкодаУпаковки.ШтрихкодУпаковки] = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТЧ = ЗаполнитьДанныеСтрокиВводВОборотИмпортФТС(
			СообщениеJSON,
			ОбщийЭлементОчереди,
			СтрокаШтрихкодаУпаковки,
			ИсточникДанныхТовары,
			Настройки);

		Настройки.КоличествоВТекущейГруппе = Настройки.КоличествоВТекущейГруппе + 1;
		Если Настройки.ДоступенРежимИсправленияОшибок
			И СтрокаШтрихкодаУпаковки.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
			Настройки.ТекущаяГруппаНормализованныхКодов.Добавить(СтрокаШтрихкодаУпаковки.Штрихкод);
		КонецЕсли;
		
		Если Настройки.ЗаполнятьВложенныеКоды И СтрокаШтрихкодаУпаковки.Строки.Количество() Тогда
			
			НастройкиВложенныхУпаковок = ОбщегоНазначения.СкопироватьРекурсивно(Настройки);
			НастройкиВложенныхУпаковок.УровеньВложенностиУпаковок = Настройки.УровеньВложенностиУпаковок + 1;
			НастройкиВложенныхУпаковок.КоличествоВТекущейГруппе   = 0;
			НастройкиВложенныхУпаковок.ТекущаяГруппаНормализованныхКодов = Новый Массив;

			ВложенныеКоды = Новый Массив;
			
			ЗаполнитьСведенияИмпортФТСПоДеревуУпаковок(СообщениеJSON, ОбщийЭлементОчереди, ВложенныеКоды, СтрокаШтрихкодаУпаковки,
				ИсточникДанныхТовары, НастройкиВложенныхУпаковок);

			СтрокаТЧ.Вставить("children", ВложенныеКоды);

			Если Настройки.ДоступенРежимИсправленияОшибок Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Настройки.ТекущаяГруппаНормализованныхКодов, НастройкиВложенныхУпаковок.ТекущаяГруппаНормализованныхКодов);
			КонецЕсли;

			Настройки.КоличествоВТекущейГруппе = Настройки.КоличествоВТекущейГруппе + НастройкиВложенныхУпаковок.КоличествоВТекущейГруппе;

		КонецЕсли;

		Если Настройки.УровеньВложенностиУпаковок = 1 Тогда

			Если КоличествоКодовВПакете > 0
				И КоличествоКодовВПакете + Настройки.КоличествоВТекущейГруппе > Настройки.КоличествоКодовВСообщении Тогда

				ГруппыКодов.Добавить(ОписаниеПакета);

				ТекущаяГруппа = Новый Массив;

				ОписаниеПакета = Новый Структура;
				ОписаниеПакета.Вставить("ГруппаКодов", ТекущаяГруппа);
				Если Настройки.ДоступенРежимИсправленияОшибок Тогда
					ГруппаНормализованныхКодов = Новый Массив;
					ОписаниеПакета.Вставить("ГруппаНормализованныхКодов", ГруппаНормализованныхКодов);
				КонецЕсли;

				КоличествоКодовВПакете = 0;

			КонецЕсли;

			Если Настройки.ДоступенРежимИсправленияОшибок Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ГруппаНормализованныхКодов, Настройки.ТекущаяГруппаНормализованныхКодов);
				Настройки.ТекущаяГруппаНормализованныхКодов = Новый Массив;
			КонецЕсли;

			КоличествоКодовВПакете = КоличествоКодовВПакете + Настройки.КоличествоВТекущейГруппе;
			Настройки.КоличествоВТекущейГруппе = 0;

		КонецЕсли;

		ТекущаяГруппа.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	Если Настройки.УровеньВложенностиУпаковок = 1 И ТекущаяГруппа.Количество() Тогда
		ГруппыКодов.Добавить(ОписаниеПакета);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСведенияОТоварахИмпортСФТСПоШтрихкодамУпаковок(
	СообщениеJSON, ОбщийЭлементОчереди, ГруппыКодов, МаркированныеТовары, Товары, Настройки)
	
	КоличествоВТекущейГруппе = 0;
	Фильтр = Настройки.Фильтр;
	
	ТекущаяГруппа                     = Неопределено;
	ТекущаяГруппаНормализованныхКодов = Неопределено;

	Для Каждого СтрокаТЧМаркированныеТовары Из МаркированныеТовары Цикл
		
		Если Фильтр <> Неопределено
			И Фильтр[СтрокаТЧМаркированныеТовары.ШтрихкодУпаковки] = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если КоличествоВТекущейГруппе = Настройки.КоличествоКодовВСообщении Или ТекущаяГруппа = Неопределено Тогда

			ТекущаяГруппа = Новый Массив;
			ТекущаяГруппаНормализованныхКодов = Новый Массив;

			ОписаниеПакета = Новый Структура;
			ОписаниеПакета.Вставить("ГруппаКодов",                ТекущаяГруппа);
			ОписаниеПакета.Вставить("ГруппаНормализованныхКодов", ТекущаяГруппаНормализованныхКодов);

			ГруппыКодов.Добавить(ОписаниеПакета);
			КоличествоВТекущейГруппе = 0;

		КонецЕсли;

		СтрокаТЧ = ЗаполнитьДанныеСтрокиВводВОборотИмпортФТС(
			СообщениеJSON,
			ОбщийЭлементОчереди,
			СтрокаТЧМаркированныеТовары,
			Товары,
			Настройки);

		ТекущаяГруппа.Добавить(СтрокаТЧ);
		ТекущаяГруппаНормализованныхКодов.Добавить(СтрокаТЧМаркированныеТовары.Штрихкод);
		
		КоличествоВТекущейГруппе = КоличествоВТекущейГруппе + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьДанныеСтрокиВводВОборотИмпортФТС(СообщениеJSON, ОбщийЭлементОчереди, СтрокаИсточникаДанных, ИсточникДанныхТовары, Настройки)

	ПараметрыНормализацииПрочее = Настройки.ПараметрыНормализацииПрочее;
	
	Если Настройки.УказыватьИдентификаторПроисхожденияВЕТИС
		И СтрокаИсточникаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
		
		Если Настройки.ОтчетПроизводственнойЛинии Тогда

			СтрокаТЧТовары = ИсточникДанныхТовары;

		Иначе

			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",                    СтрокаИсточникаДанных.Номенклатура);
			Отбор.Вставить("Характеристика",                  СтрокаИсточникаДанных.Характеристика);
			Отбор.Вставить("Серия",                           СтрокаИсточникаДанных.Серия);
			Отбор.Вставить("ИдентификаторПроисхожденияВЕТИС", СтрокаИсточникаДанных.ИдентификаторПроисхожденияВЕТИС);

			НайденныеСтроки = ИсточникДанныхТовары.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
					СообщениеJSON,
					СтрШаблон(
						НСтр("ru = 'В табличной части ""Товары"" не найдена номенклатура %1.'"),
						ИнтеграцияИС.ПредставлениеНоменклатуры(
							Отбор.Номенклатура,
							Отбор.Характеристика,,
							Отбор.Серия)));
				Возврат Неопределено;
			ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
				ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
					СообщениеJSON,
					СтрШаблон(
						НСтр("ru = 'В табличной части ""Товары"" дублируется номенклатура %1.'"),
							ИнтеграцияИС.ПредставлениеНоменклатуры(
								Отбор.Номенклатура,
								Отбор.Характеристика,,
								Отбор.Серия)));
				Возврат Неопределено;
			КонецЕсли;

			СтрокаТЧТовары = НайденныеСтроки[0];

		КонецЕсли;

	КонецЕсли;
	
	РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкодаПоДаннымРазбора(
		СтрокаИсточникаДанных.Штрихкод, ОбщийЭлементОчереди.ВидПродукции, СтрокаИсточникаДанных.ДанныеРазбора);
	НормализованныйКодМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
		РезультатРазбора.ДанныеРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
	
	СтрокаТЧ = Новый Структура;
	СтрокаТЧ.Вставить(Настройки.ИмяРеквизитаКодМаркировки, НормализованныйКодМаркировки);
	
	Если Настройки.УказыватьИдентификаторПроисхожденияВЕТИС
		И СтрокаИсточникаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
		И СтрокаТЧТовары <> Неопределено Тогда
		СтрокаТЧ.Вставить("vsd_number", СтрокаТЧТовары.ИдентификаторПроисхожденияВЕТИССтрокой);
	КонецЕсли;
	
	Если Настройки.УказыватьДатуПроизводства Тогда
		СтрокаТЧ.Вставить("production_date", Настройки.ДатаПроизводства);
		СтрокаТЧ.Вставить(Настройки.ИмяРеквизитаКодМаркировкиДополнительное, НормализованныйКодМаркировки);
	КонецЕсли;
	
	Возврат СтрокаТЧ;
	
КонецФункции

Процедура ПодготовитьСообщенияПоАбстрактнойОперацииАТК(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗапросов = Новый СписокЗначений;
	// Заполнение данных по маркируемым товарам
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковок.ШтрихкодУпаковки                КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|ГДЕ
	|	ШтрихкодыУпаковок.Ссылка = &Ссылка
	|",
	"ШтрихкодыУпаковок");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ДанныеОтчета.ЗначениеШтрихкода                        КАК ЗначениеШтрихкода,
	|	ДанныеОтчета.ЗначениеШтрихкодаУпаковки                КАК ЗначениеШтрихкодаУпаковки,
	|	ДанныеОтчета.НормализованноеЗначениеШтрихкода         КАК НормализованноеЗначениеШтрихкода,
	|	ДанныеОтчета.НормализованноеЗначениеШтрихкодаУпаковки КАК НормализованноеЗначениеШтрихкодаУпаковки,
	|	ДанныеОтчета.ФорматBase64 КАК ФорматBase64,
	|	ДанныеОтчета.НомерСтроки  КАК КлючЗаписи
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ДанныеОтчетаПроизводственнойЛинии КАК ДанныеОтчета
	|ГДЕ
	|	ДанныеОтчета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.ЗначениеШтрихкода,
	|	ДанныеРегистра.ЗначениеШтрихкодаУпаковки,
	|	ДанныеРегистра.НормализованноеЗначениеШтрихкода,
	|	ДанныеРегистра.НормализованноеЗначениеШтрихкодаУпаковки,
	|	ДанныеРегистра.ФорматBase64,
	|	ДанныеРегистра.КлючЗаписи
	|ИЗ
	|	РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Документ = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	КлючЗаписи",
	"ДанныеОтчетаПроизводственнойЛинии");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭлементОчереди.Документ);
	
	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	ШтрихкодыУпаковок = РезультатЗапроса["ШтрихкодыУпаковок"].Выгрузить();
	//@skip-warning
	ДанныеОтчета = РезультатЗапроса["ДанныеОтчетаПроизводственнойЛинии"].Выгрузить();
	ДанныеШапки = ШтрихкодированиеИС.ПолучитьСтруктуруРеквизитовДокумента(ЭлементОчереди.Документ);
	СообщенияJSON = Новый Массив;
	
	Если ШтрихкодыУпаковок.Количество() = 0 И ДанныеОтчета.Количество() = 0 Тогда

		ТекстОшибки = НСтр("ru = 'Нет данных для выгрузки.'");

		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();

		ПараметрыОбновленияСтатуса.СтатусОбработки   = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;

		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);

		СтрокаРезультата = СтруктураИзменения();

		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

		СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = Ложь;

		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = ТекстОшибки;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = Неопределено;

		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);

		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(
		ДанныеШапки, Неопределено, ЭлементОчереди.ВидПродукции);
	Настройки = Новый Структура(
		"СоздаватьШтрихкодУпаковки, СсылкаНаОбъект",
		Ложь, ЭлементОчереди.Документ);
	ЗаполнитьЗначенияСвойств(ПараметрыСканирования, Настройки);
	ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Истина);
	
	ЕстьОшибки = Ложь;
	
	Если ДанныеШапки.ОтчетПроизводственнойЛинии Тогда

		КодыМаркировкиНормализованы = Истина;
		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			Если ЗначениеЗаполнено(СтрокаОтчета.ЗначениеШтрихкода) Тогда
				КодыМаркировкиНормализованы = Ложь;
			КонецЕсли;
			Прервать;
		КонецЦикла;

		ПакетКодовАТК    = Новый Массив;
		МассивСтрок      = Новый Массив;

		КоличествоКодовВСообщенииАТК = КоличествоКодовВСообщенииАТК();

		ПараметрыРазбора = Новый Структура;
		ПараметрыРазбора.Вставить("ВосстанавливатьСтруктуруКодаМаркировки", Не ПараметрыСканирования.ПроверятьСтруктуруКодовМаркировки);
		ПараметрыРазбора.Вставить("ПроверятьАлфавитКодовМаркировки",        ПараметрыСканирования.ПроверятьАлфавитКодовМаркировки);
		// Коды нормализуются при проверке вида упаковок перед формированием сообщения.
		ПараметрыРазбора.Вставить("КодыМаркировкиНормализованы",            КодыМаркировкиНормализованы);

		ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкода", Новый ОписаниеТипов("Строка"));
		ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкодаУпаковки", Новый ОписаниеТипов("Строка"));

		// 1. Разбор кодов, подготовка данных для построения дерева упаковок.

		РезультатОбработкиДанныхОтчета = РазборКодаМаркировкиИССлужебный.НормализоватьДанныеОтчетаПроизводственнойЛинии(
			ДанныеОтчета, ДанныеШапки.ВидПродукции, ПараметрыРазбора);

		КоличествоКодовВТекущейГруппе = 0;

		ГруппаКодов                = Неопределено;
		ГруппаНормализованныхКодов = Неопределено;

		Для Каждого СтрокаДанных Из РезультатОбработкиДанныхОтчета.ОбработанныеДанныеОтчета Цикл

			ИсходнаяСтрока = СтрокаДанных.ИсходнаяСтрока;

			Для Каждого ИменаКолонок Из РезультатОбработкиДанныхОтчета.ГруппыКолонок Цикл

				Если Не ЗначениеЗаполнено(ИсходнаяСтрока[ИменаКолонок.КодМаркировки]) Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаДанных[ИменаКолонок.ВидУпаковки] = Перечисления.ВидыУпаковокИС.Набор
					Или СтрокаДанных[ИменаКолонок.ВидУпаковки] = Перечисления.ВидыУпаковокИС.Групповая Тогда
					ЕстьОшибки = Истина;
					Прервать;
				КонецЕсли;
				
				Если СтрокаДанных[ИменаКолонок.ВидУпаковки] <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
					Продолжить;
				КонецЕсли;

				Если КоличествоКодовВТекущейГруппе = КоличествоКодовВСообщенииАТК Или ГруппаКодов = Неопределено Тогда

					ГруппаКодов = Новый Массив;
					ГруппаНормализованныхКодов = Новый Массив;

					ОписаниеПакета = Новый Структура;
					ОписаниеПакета.Вставить("ГруппаКодов",                ГруппаКодов);
					ОписаниеПакета.Вставить("ГруппаНормализованныхКодов", ГруппаНормализованныхКодов);

					ПакетКодовАТК.Добавить(ОписаниеПакета);
					КоличествоКодовВТекущейГруппе = 0;

				КонецЕсли;

				СтрокаТЧ = Новый Структура;
				СтрокаТЧ.Вставить("ki", СтрокаДанных[ИменаКолонок.КодДляПередачиИСМП]);

				ГруппаКодов.Добавить(СтрокаТЧ);
				ГруппаНормализованныхКодов.Добавить(СтрокаДанных[ИменаКолонок.КодДляПередачиИСМП]);

				СтруктураЗначения = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкодаПоДаннымРазбора(
					ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки], ЭлементОчереди.ВидПродукции, СтрокаДанных[ИменаКолонок.ДанныеРазбора]);
				МассивСтрок.Добавить(СтруктураЗначения);

				КоличествоКодовВТекущейГруппе = КоличествоКодовВТекущейГруппе + 1;

			КонецЦикла;
			
			Если ЕстьОшибки Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьОшибки Тогда
			
			РезультатПоиска = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
				МассивСтрок,
				ЭлементОчереди.Организация);
			
			Если ТребуетсяОбновлениеКлючаСессии(РезультатПоиска, ЭлементОчереди, ПараметрыОбмена) Тогда
				Возврат;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РезультатПоиска.ТекстОшибки) Тогда
				ВызватьИсключение РезультатПоиска.ТекстОшибки;
			КонецЕсли;
			
			ИсточникДанных = ШтрихкодированиеИС.ИнициализироватьТаблицуМаркированныеТовары();
			Если ИсточникДанных.Колонки.Найти("РодительскаяУпаковка") = Неопределено Тогда
				ИсточникДанных.Колонки.Добавить("РодительскаяУпаковка");
			КонецЕсли;
			
			Для Каждого КлючИЗначение Из РезультатПоиска.СтатусыКодовМаркировки Цикл
				
				СтрокаТаблицы = ИсточникДанных.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КлючИЗначение.Ключ);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КлючИЗначение.Значение);
				
			КонецЦикла;
			
			ИсточникДанных.Сортировать("Штрихкод");

		КонецЕсли;
		
	Иначе
		
		РезультатПоиска = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
			ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"),
			ПараметрыСканирования,,
			Истина);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатПоиска, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатПоиска.ЕстьОшибки Тогда
			ВызватьИсключение РезультатПоиска.ТекстОшибки;
		КонецЕсли;
		
		Для Каждого СтрокаДерева Из РезультатПоиска.ДеревоУпаковок.Строки Цикл
			Результат = НайтиСформированныеАгрегатыПоДаннымИСМП(СтрокаДерева);
			Если Результат.ЕстьОшибки Тогда
				ЕстьОшибки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьОшибки Тогда
			ИсточникДанных = РезультатПоиска.МаркированныеТовары;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(Новый Структура, ДанныеШапки.Операция, ЭлементОчереди);
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			ТекстОшибкиНайденыКодыНаборовГрупповыхУпаковокПриИмпортеСФТС());
		СообщенияJSON.Добавить(СообщениеJSON);  
		
	Иначе
		
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("ОбрабатыватьКодыАТК", Истина);
		
		СообщенияJSONТрансформация = Новый Массив;
		ПодготовитьКПередачеСообщенияДляТрансформацииАгрегатовИСМП(
			ИсточникДанных,
			ЭлементОчереди,
			ЭлементОчереди.Сообщение,
			СообщенияJSONТрансформация,
			ПараметрыОбмена,
			ПараметрыОбработки);
		
		Если ДанныеШапки.ОтчетПроизводственнойЛинии Тогда
			
			РеквизитыОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ДанныеШапки.Организация);
			
			Для Каждого ДанныеСообщения Из ПакетКодовАТК Цикл
				
				ТелоЗапроса = Новый Структура;
				ТелоЗапроса.Вставить("trade_participant_inn", РеквизитыОрганизации.ИНН);
				ТелоЗапроса.Вставить("products_list",         ДанныеСообщения.ГруппаКодов);
				
				Операция = Перечисления.ВидыОперацийИСМП.АТКСоздание;
				
				СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(ТелоЗапроса, Операция, ЭлементОчереди);
				
				ПараметрыЗапроса = ОбщегоНазначения.СкопироватьРекурсивно(ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса);
				ПараметрыЗапроса.Вставить("ДанныеСообщения", ДанныеСообщения.ГруппаНормализованныхКодов);
				
				СообщениеJSON.ПараметрыЗапроса =  ПараметрыЗапроса;
				СообщениеJSON.ЗагружатьДо      = ЭлементОчереди.Сообщение;
				СообщениеJSON.Версия           = ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия;
				СообщенияJSON.Добавить(СообщениеJSON);
				
			КонецЦикла;
			
		Иначе
			
			МаркированныеТовары = Новый ТаблицаЗначений;
			МаркированныеТовары.Колонки.Добавить("Номенклатура", ОпределяемыеТипы().Номенклатура.Тип);
			МаркированныеТовары.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
			МаркированныеТовары.Колонки.Добавить("Штрихкод", ОбщегоНазначения.ОписаниеТипаСтрока(200));
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатПоиска.МаркированныеТовары, МаркированныеТовары);
			
			ПодготовитьКПередачеСообщенияДляФормированияКодовАТКИСМП(
				МаркированныеТовары, ДанныеШапки,
				ЭлементОчереди, ЭлементОчереди.Сообщение, СообщенияJSON, ПараметрыОбмена);
		КонецЕсли;
		
		// Выполнять удаление кодов из агрегатов и разагрегацию АТК в первую очередь
		Если СообщенияJSONТрансформация.Количество() Тогда
			ПакетСообщений = Новый Соответствие;
			ПакетСообщений.Вставить(1, СообщенияJSONТрансформация);
			ПодготовитьКПередачеСообщениеАбстрактнаяАгрегацияИзменениеРасчетСтатуса(СообщенияJSON, ЭлементОчереди, ПакетСообщений);
		КонецЕсли;
		
		// Если формирование АТК не требуется - завершить операцию
		Если СообщенияJSON.Количество() = 0 Тогда
			
			ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	ОбновитьИдентификаторЗаявкиСообщенияОчереди(
		НаборЗаписей,
		ИдентификаторЗаявки,
		Неопределено,
		Неопределено);
	
	ЭлементОчереди.ИдентификаторЗаявки = ИдентификаторЗаявки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

Процедура ПодготовитьСообщенияКПередачеПовторно(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)

	СообщенияJSON = Новый Массив;

	ПараметрыОбработкиДокумента = Новый Структура;

	ПараметрыОбработкиДокумента = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыОбмена",             ПараметрыОбмена);
	ДополнительныеПараметры.Вставить("ПараметрыОбработкиДокумента", ПараметрыОбработкиДокумента);

	СообщенияДокументаJSON = СообщениеКПередачеJSON(
		ПараметрыОбработкиДокумента.Ссылка,
		ПараметрыОбработкиДокумента.ДальнейшееДействие,
		ДополнительныеПараметры);

	Для Каждого СообщениеJSON Из СообщенияДокументаJSON Цикл
		СообщенияJSON.Добавить(СообщениеJSON);
	КонецЦикла;

	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);

	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);

	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);

	// Исходное виртуальное сообщение более не актуально. В регистр сведений сообщение не записывалось.
	УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);

КонецПроцедуры

Процедура ПодготовитьСообщенияПоАбстрактнойАгрегации(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	// Заполнение данных по маркируемым товарам
	ДанныеШапки = ШтрихкодированиеИС.ПолучитьСтруктуруРеквизитовДокумента(ЭлементОчереди.Документ);
	
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(
		ДанныеШапки, Неопределено, ЭлементОчереди.ВидПродукции);
	ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева = Ложь;
	ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Истина);
	
	СообщенияJSON = Новый Массив;
	
	СтатусОшибкаПередачи = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияОшибкаПередачи;
	Если Не ДанныеШапки.ОтчетПроизводственнойЛинии Тогда
		
		Если ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ЭлементОчереди.ВидПродукции) Тогда
			РезультатПолученияДанных = ШтрихкодированиеМОТП.ВложенныеШтрихкодыУпаковокПоДокументу(ЭлементОчереди.Документ, ПараметрыСканирования, Истина);
		Иначе
			РезультатПолученияДанных = ШтрихкодированиеИСМП.ВложенныеШтрихкодыУпаковокПоДокументу(ЭлементОчереди.Документ, ПараметрыСканирования, Истина);
		КонецЕсли;
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатПолученияДанных.ЕстьОшибки Тогда
			ВызватьИсключение РезультатПолученияДанных.ТекстОшибки;
		КонецЕсли;
		
		ВложенныеШтрихкоды = РезультатПолученияДанных.ВложенныеШтрихкоды;
		
	Иначе
		
		СписокЗапросов = Новый СписокЗначений;
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ДанныеОтчета.ЗначениеШтрихкода         КАК ЗначениеШтрихкода,
		|	ДанныеОтчета.ЗначениеШтрихкодаУпаковки КАК ЗначениеШтрихкодаУпаковки,
		|	ДанныеОтчета.ФорматBase64              КАК ФорматBase64,
		|
		|	ДанныеОтчета.НормализованноеЗначениеШтрихкода         КАК НормализованноеЗначениеШтрихкода,
		|	ДанныеОтчета.НормализованноеЗначениеШтрихкодаУпаковки КАК НормализованноеЗначениеШтрихкодаУпаковки,
		|	ДанныеОтчета.НомерСтроки КАК КлючЗаписи,
		|	ДанныеОтчета.Ссылка КАК Документ
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ДанныеОтчетаПроизводственнойЛинии КАК ДанныеОтчета
		|ГДЕ
		|	ДанныеОтчета.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеРегистра.ЗначениеШтрихкода,
		|	ДанныеРегистра.ЗначениеШтрихкодаУпаковки,
		|	ДанныеРегистра.ФорматBase64,
		|	ДанныеРегистра.НормализованноеЗначениеШтрихкода,
		|	ДанныеРегистра.НормализованноеЗначениеШтрихкодаУпаковки,
		|	ДанныеРегистра.КлючЗаписи,
		|	ДанныеРегистра.Документ
		|ИЗ
		|	РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП КАК ДанныеРегистра
		|ГДЕ
		|	ДанныеРегистра.Документ = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлючЗаписи
		|",
		"ДанныеОтчетаПроизводственнойЛинии");
		
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП КАК ДанныеРегистра
		|ГДЕ
		|	ДанныеРегистра.Документ = &Ссылка
		|",
		"ДанныеРегистра");

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЭлементОчереди.Документ);
		
		РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
		
		//@skip-warning
		ДанныеОтчета = РезультатЗапроса["ДанныеОтчетаПроизводственнойЛинии"].Выгрузить();
		//@skip-warning
		ИспользуетсяРегистрДляХраненияДанныхОтчета = Не РезультатЗапроса["ДанныеРегистра"].Пустой();

		КодыМаркировкиНормализованы = Истина;
		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			Если ЗначениеЗаполнено(СтрокаОтчета.ЗначениеШтрихкода) Тогда
				КодыМаркировкиНормализованы = Ложь;
			КонецЕсли;
			Прервать;
		КонецЦикла;

		ПараметрыРазбора = Новый Структура;
		ПараметрыРазбора.Вставить("ВосстанавливатьСтруктуруКодаМаркировки", Не ПараметрыСканирования.ПроверятьСтруктуруКодовМаркировки);
		ПараметрыРазбора.Вставить("ПроверятьАлфавитКодовМаркировки",        ПараметрыСканирования.ПроверятьАлфавитКодовМаркировки);
		ПараметрыРазбора.Вставить("КодыМаркировкиНормализованы",            КодыМаркировкиНормализованы);
		
		ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкода", Новый ОписаниеТипов("Строка"));
		ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкодаУпаковки", Новый ОписаниеТипов("Строка"));
		
		РезультатОбработкиДанныхОтчета = РазборКодаМаркировкиИССлужебный.НормализоватьДанныеОтчетаПроизводственнойЛинии(
			ДанныеОтчета, ЭлементОчереди.ВидПродукции, ПараметрыРазбора);
		
		Если РезультатОбработкиДанныхОтчета.ЕстьОшибки Или Не КодыМаркировкиНормализованы Тогда
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			
			РезультатСохраненияДанныхОтчета = МенеджерОбъекта.СохранитьОбработанныеДанныеОтчета(
				ЭлементОчереди.Документ,
				ДанныеОтчета,
				Истина,
				ИспользуетсяРегистрДляХраненияДанныхОтчета,
				ЭлементОчереди.Организация);
			
			МассивОшибок = Новый Массив;
			
			Если РезультатСохраненияДанныхОтчета.ЕстьОшибки Тогда
				МассивОшибок.Добавить(РезультатСохраненияДанныхОтчета.ТекстОшибки);
			КонецЕсли;
			
			Если РезультатОбработкиДанныхОтчета.ЕстьОшибки Тогда
				МассивОшибок.Добавить(НСтр("ru = 'Некорректный формат данных отчета производственной линии'"));
			КонецЕсли;

			Если МассивОшибок.Количество() Тогда

				ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена, СтатусОшибкаПередачи, СтрСоединить(МассивОшибок, Символы.ПС));
				Возврат;

			КонецЕсли;

		КонецЕсли;
		
		ИсточникДанных = Новый Массив;
		КешДанныхРазбора = Новый Соответствие;
		
		Для Каждого СтрокаДанных Из РезультатОбработкиДанныхОтчета.ОбработанныеДанныеОтчета Цикл
		
			ИсходнаяСтрока = СтрокаДанных.ИсходнаяСтрока;
			
			ИсточникДанных.Добавить(
				Новый Структура(
					"Штрихкод, ШтрихкодУпаковки",
					ИсходнаяСтрока.НормализованноеЗначениеШтрихкода, ИсходнаяСтрока.НормализованноеЗначениеШтрихкодаУпаковки));
			
			Для Каждого ИменаКолонок Из РезультатОбработкиДанныхОтчета.ГруппыКолонок Цикл
				
				Если Не ЗначениеЗаполнено(ИсходнаяСтрока[ИменаКолонок.КодМаркировки]) Тогда
					Продолжить;
				КонецЕсли;
				
				Если КешДанныхРазбора[ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки]] = Неопределено Тогда
					
					СтруктураДанныхРазбора = ИнициализироватьСтруктуруДанныхРазбора();
					СтруктураДанныхРазбора.ВидУпаковки               = СтрокаДанных[ИменаКолонок.ВидУпаковки];
					СтруктураДанныхРазбора.ТипШтрихкода              = СтрокаДанных[ИменаКолонок.ТипШтрихкода];
					СтруктураДанныхРазбора.EAN                       = СтрокаДанных[ИменаКолонок.EAN];
					СтруктураДанныхРазбора.GTIN                      = СтрокаДанных[ИменаКолонок.GTIN];
					СтруктураДанныхРазбора.КоличествоВложенныхЕдиниц = СтрокаДанных[ИменаКолонок.КоличествоВложенныхЕдиниц];
					СтруктураДанныхРазбора.ДанныеРазбора             = СтрокаДанных[ИменаКолонок.ДанныеРазбора];
					СтруктураДанныхРазбора.КодДляПередачиИСМП        = СтрокаДанных[ИменаКолонок.КодДляПередачиИСМП];
					КешДанныхРазбора.Вставить(
						ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки],
						СтруктураДанныхРазбора);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Результат = ДеревоУпаковокПоДаннымОтчетаПроизводственнойЛинии(ДанныеШапки, ИсточникДанных, КешДанныхРазбора);
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ВызватьИсключение Результат.ТекстОшибки;
		КонецЕсли;
		
		ДеревоУпаковок = Результат.ДеревоУпаковок;
		
		ДанныеПоШтрихкодам = ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам(Ложь);
		ДанныеПоШтрихкодам.ВложенныеШтрихкоды = ШтрихкодированиеИС.ИнициализацияВложенныхШтрихкодов(ДеревоУпаковок);
		ДанныеПоШтрихкодам.ИерархическаяЗагрузкаИзТСД = Истина;
		
		// Сохранение параметров сканирования.
		// При подготовке дерева упаковок в сценарии работы с ТСД не следует выполнять обращения к ГИС МТ.
		// Все необходимые обращения выполнит механизм штрихкодирования.
		ШтрихкодированиеИСМПСлужебный.НормализоватьДанныеВложенныхШтрихкодов(
			ДанныеПоШтрихкодам.ВложенныеШтрихкоды, ПараметрыСканирования);
		ШтрихкодированиеИСМПСлужебный.ДобавитьКолонкиТаблицыДанныеКодовМаркировки(
			ДанныеПоШтрихкодам, ПараметрыСканирования);
		
		ПараметрыСканирования.ЭтоОтчетПроизводственнойЛинии = Истина;
		ПараметрыСканирования.ПроверятьДублиКодовМаркировки = "НеПроверять";
		ПараметрыСканирования.СоздаватьШтрихкодУпаковки = Ложь;
		ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок = Истина;
		ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);
		
		РезультатОбработкиШтрихкодов = ШтрихкодированиеИС.ОбработатьШтрихкоды(
			Неопределено, ПараметрыСканирования,
			Неопределено, Новый УникальныйИдентификатор, Неопределено, ДанныеПоШтрихкодам);
		
		РезультатПолученияДанных = Новый Структура;
		РезультатПолученияДанных.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
		Для Каждого КлючИЗначение Из РезультатОбработкиШтрихкодов.РезультатыОбработки Цикл
			РезультатОбработки = КлючИЗначение.Значение;
			Если РезультатОбработки.Свойство("ТребуетсяАвторизацияИСМП")
					И РезультатОбработки.ТребуетсяАвторизацияИСМП Тогда
				РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессии = Истина;
				Прервать;
			КонецЕсли;
			Если РезультатОбработки.Свойство("ЕстьОшибки") И РезультатОбработки.ЕстьОшибки Тогда
				ВызватьИсключение РезультатОбработки.ТекстОшибки;
			КонецЕсли;
		КонецЦикла;
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		ВложенныеШтрихкоды = ДанныеПоШтрихкодам.ВложенныеШтрихкоды;
		
	КонецЕсли;
	
	Если ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ЭлементОчереди.ВидПродукции) Тогда
		
		ПараметрыОбработки = Новый Структура();
		ПараметрыОбработки.Вставить("СообщениеАгрегации", Неопределено);
		ПараметрыОбработки.Вставить("ЭлементОчереди",     ЭлементОчереди);
		ПараметрыОбработки.Вставить("ПараметрыОбмена",    ПараметрыОбмена);
		ПараметрыОбработки.Вставить("ДанныеСообщений",    Новый Соответствие());
		ПараметрыОбработки.Вставить("МетаданныеXDTO",     Новый Структура());
		ПараметрыОбработки.Вставить("ДанныеШапки",        ДанныеШапки);
		ПараметрыОбработки.МетаданныеXDTO.Вставить("АгрегацияМОТП", Метаданные.ПакетыXDTO.АгрегацияМОТП);
		ПараметрыОбработки.МетаданныеXDTO.Вставить("ВыбытиеМОТП",   Метаданные.ПакетыXDTO.ВыбытиеМОТП);
		ПараметрыОбработки.ДанныеШапки.Вставить("ИНН", ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОрганизацияИНН);
		
		ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
		ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
		ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
		ПараметрыОбработки.Вставить("ПараметрыНормализации", ПараметрыНормализацииПрочее);
		
		ПараметрыПроверки = ИнициализироватьПараметрыПроверкиАгрегатов();
		
		ДопустимыеВложенияАгрегатовПоВидамПродукции = ПроверкаИПодборПродукцииМОТПКлиентСервер.ДопустимыеВложенияАгрегатовПоВидамПродукции();
		ПараметрыПроверки.ПараметрыПроверкиИерархииАгрегатов       = ДопустимыеВложенияАгрегатовПоВидамПродукции.Получить(ЭлементОчереди.ВидПродукции);
		ПараметрыПроверки.КонтролироватьДопустимуюИерархиюУпаковок = Истина;
		ПараметрыПроверки.ПараметрыНормализации                    = ПараметрыНормализацииПрочее;
		
		Если ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.АльтернативныйТабак
			Или ЭлементОчереди.ВидПродукции = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
			ПараметрыПроверки.КонтролироватьСоставГрупповойУпаковки = Истина;
		КонецЕсли;
		
		Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса <> Неопределено
			И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ПроверятьСоставУпаковокПоДаннымИСМП") Тогда
			ПараметрыПроверки.КонтролироватьСоставАгрегатаПоДаннымИСМП = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ПроверятьСоставУпаковокПоДаннымИСМП;
		КонецЕсли;
		
		РезультатПроверки = ПроверитьСоставДопустимуюИерерхиюДереваУпаковок(ВложенныеШтрихкоды.ДеревоУпаковок, ЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатПроверки, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатПроверки.ЕстьОшибки Тогда
			ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена, СтатусОшибкаПередачи, РезультатПроверки.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Результат = ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиМОТП(
			ПараметрыОбработки,
			ВложенныеШтрихкоды.ДеревоУпаковок);
		
		Если Результат.ЕстьОшибки Тогда
			ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена, СтатусОшибкаПередачи, Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ПараметрыОбработки.ДанныеСообщений Цикл
			ТекстСообщенияXML = ИнтеграцияИСМП.ОбъектXDTOВXML(КлючИЗначение.Значение);
			КлючИЗначение.Ключ.ТекстСообщенияJSON = ТекстСообщенияXML;
			СообщенияJSON.Добавить(КлючИЗначение.Ключ);
		КонецЦикла;
		
	Иначе
		
		Если ИнтеграцияИСКлиентСервер.ВидПродукцииПоддерживаетАгрегациюКодовМаркировкиЧерезСУЗ(ЭлементОчереди.ВидПродукции) Тогда

			ДопустимыеВложенияАгрегатовПоВидамПродукции = ПроверкаИПодборПродукцииИСМПКлиентСервер.ДопустимыеВложенияАгрегатовПоВидамПродукции();

			ПараметрыПроверки = ИнициализироватьПараметрыПроверкиАгрегатов();
			ПараметрыПроверки.ПараметрыПроверкиИерархииАгрегатов       = ДопустимыеВложенияАгрегатовПоВидамПродукции.Получить(ЭлементОчереди.ВидПродукции);
			ПараметрыПроверки.КонтролироватьДопустимуюИерархиюУпаковок = Истина;
			
			РезультатПроверки = ПроверитьСоставДопустимуюИерерхиюДереваУпаковок(
				ВложенныеШтрихкоды.ДеревоУпаковок, ЭлементОчереди, ПараметрыОбмена, ПараметрыПроверки);
			
			Если ТребуетсяОбновлениеКлючаСессии(РезультатПроверки, ЭлементОчереди, ПараметрыОбмена) Тогда
				Возврат;
			КонецЕсли;
			
			Если РезультатПроверки.ЕстьОшибки Тогда
				ЗавершитьПодготовкуСообщенийАбстрактнойОперации(
					ЭлементОчереди, ПараметрыОбмена, СтатусОшибкаПередачи, РезультатПроверки.ТекстОшибки);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатЗапросаСтатусов = ПолучитьСтатусыНаборовГрупповыхУпаковок(ВложенныеШтрихкоды.МаркированныеТовары, ЭлементОчереди, ПараметрыОбмена);
		Если РезультатЗапросаСтатусов.ТребуетсяОбновлениеКлючаСессии Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатЗапросаСтатусов.ЕстьОшибки Тогда
			ВызватьИсключение РезультатЗапросаСтатусов.ТекстОшибки;
		КонецЕсли;
		
		УпаковкиДокумента = Новый Соответствие;
		
		Результат = ПодготовитьКПередачеСообщенияДляАгрегацииКодовМаркировкиИСМППоДеревуУпаковок(
			ВложенныеШтрихкоды.ДеревоУпаковок, ЭлементОчереди, ЭлементОчереди.Сообщение, СообщенияJSON,
			ПараметрыОбмена, УпаковкиДокумента, РезультатЗапросаСтатусов.КешСтатусовКодовМаркировки);
		
		Если Результат.ЕстьОшибки Тогда
			ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена, СтатусОшибкаПередачи, Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Если ТребуетсяОбновлениеКлючаСессии(Результат, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		ПакетСообщений = Результат.СообщенияАгрегации;
		
		СообщенияJSONОперацияРазагрегация = Новый Массив;
		Результат = ПодготовитьКПередачеСообщенияДляРазагрегацииКодовМаркировкиИСМП(
			ВложенныеШтрихкоды.МаркированныеТовары,
			ЭлементОчереди, ЭлементОчереди.Сообщение,
			ПараметрыОбмена, УпаковкиДокумента, СообщенияJSONОперацияРазагрегация);
		
		Если Результат.ЕстьОшибки Тогда
			ВызватьИсключение Результат.ТекстОшибки;
		КонецЕсли;
		
		Если ТребуетсяОбновлениеКлючаСессии(Результат, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		Если СообщенияJSONОперацияРазагрегация.Количество() Тогда
			ПакетСообщений.Вставить(ПакетСообщений.Количество() + 1, СообщенияJSONОперацияРазагрегация);
		КонецЕсли;
		
		Если ПакетСообщений.Количество() Тогда
			ПодготовитьКПередачеСообщениеАбстрактнаяАгрегацияИзменениеРасчетСтатуса(
				СообщенияJSON,
				ЭлементОчереди,
				ПакетСообщений);
		КонецЕсли;
		
	КонецЕсли;
	
	// Если агрегация не требуется - завершить операцию
	Если СообщенияJSON.Количество() = 0 Тогда
		
		ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	ОбновитьИдентификаторЗаявкиСообщенияОчереди(
		НаборЗаписей,
		ИдентификаторЗаявки,
		Неопределено,
		Неопределено);
	
	ЭлементОчереди.ИдентификаторЗаявки = ИдентификаторЗаявки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

Процедура ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена, Статус = Неопределено, ТекстОшибки = "") Экспорт
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		НаборСтатусовПоДокументу = ИнтеграцияИСМП.РассчитатьСтатусДокументаПоДаннымПротоколаОбмена(ЭлементОчереди.Документ,, ЭлементОчереди.Сообщение);
		НовыйСтатус = НаборСтатусовПоДокументу[0].Статус;
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = Ложь;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = ТекстОшибки;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = Неопределено;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);

	Иначе

		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();

		ПараметрыОбновленияСтатуса.Статус            = Статус;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;

		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ,
			Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);

		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);

	КонецЕсли;
	
КонецПроцедуры

// Подготавливает сообщения по операции "аннулирование" документа Отгрузка товаров к передаче в сервис ИС МП.
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений()).
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//  НаборЗаписей - РегистрСведенийНаборЗаписей.ОчередьСообщенийИСМП - набор записей по сообщению
Процедура ПодготовитьСообщенияПоАбстрактнойОперацииОтгрузкаИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ИСМППрисоединенныеФайлы.Документ           КАК Ссылка,
	|	КОЛИЧЕСТВО(ИСМППрисоединенныеФайлы.Ссылка) КАК ПоследнийНомерВерсии
	|ПОМЕСТИТЬ Версии
	|ИЗ
	|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровИСМП КАК Шапка
	|		ПО Шапка.Ссылка   = &Ссылка
	|		 И Шапка.Операция = ИСМППрисоединенныеФайлы.Операция
	|		 И Шапка.Ссылка   = ИСМППрисоединенныеФайлы.Документ
	|ГДЕ
	|	ИСМППрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Исходящий)
	|СГРУППИРОВАТЬ ПО
	|	ИСМППрисоединенныеФайлы.Документ
	|");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Шапка.Номер                              КАК Номер,
	|	Шапка.Дата                               КАК Дата,
	|	ЕСТЬNULL(Версии.ПоследнийНомерВерсии, 0) КАК ПоследнийНомерВерсии,
	|
	|	Шапка.Организация                        КАК Организация,
	|	Представление(Шапка.Организация)         КАК ОрганизацияПредставление,
	|
	|	Шапка.Ответственный                      КАК Ответственный,
	|	Представление(Шапка.Ответственный)       КАК ОтветственныйПредставление,
	|	Шапка.ИдентификаторЗаявкиНаОтгрузку      КАК ИдентификаторЗаявкиНаОтгрузку,
	|	Шапка.Операция                           КАК Операция,
	|	Шапка.ВидПродукции                       КАК ВидПродукции,
	|	Шапка.Ссылка                             КАК Ссылка
	|ИЗ
	|	Документ.ОтгрузкаТоваровИСМП КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Версии КАК Версии
	|		ПО Шапка.Ссылка = Версии.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка",
	"Шапка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",   ЭлементОчереди.Документ);
	
	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	Шапка = РезультатЗапроса["Шапка"].Выбрать();
	
	Если Не Шапка.Следующий()
		Или Не ЗначениеЗаполнено(Шапка.ИдентификаторЗаявкиНаОтгрузку) Тогда
		
		ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	СообщенияJSON = Новый Массив;
	ЕстьОшибки    = Ложь;
	
	РезультатОбработкиЗаявки = ИнтерфейсИСМП.СтатусОбработкиДокументаПоИдентификатору(
		Шапка.ИдентификаторЗаявкиНаОтгрузку,
		ЭлементОчереди.Организация, ЭлементОчереди.ВидПродукции);
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);

	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();

	Если ЗначениеЗаполнено(РезультатОбработкиЗаявки.ТекстОшибки) Тогда
		
		ДобавитьВПротоколОбмена(ЭлементОчереди, РезультатОбработкиЗаявки);
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", Неопределено);
		Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.Сообщение);
		Реквизиты.Вставить("Версия",               "1.0");
		Реквизиты.Вставить("ТипСообщения",         Перечисления.ТипыЗапросовИС.Исходящий);
		Реквизиты.Вставить("СтатусОбработки",      Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка);
		Реквизиты.Вставить("Описание",             РезультатОбработкиЗаявки.ТекстОшибки);
		
		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
		ИнтеграцияИСМПСлужебный.ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	Если РезультатОбработкиЗаявки.Статус <> Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления 
		И РезультатОбработкиЗаявки.Статус <> Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ Тогда
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		
		ПараметрыОбновленияСтатуса.Статус            = Неопределено;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		ПараметрыОбновленияСтатуса.Вставить("ВидПродукции",               ЭлементОчереди.ВидПродукции);
		ПараметрыОбновленияСтатуса.Вставить("ОбновлениеСтатусаДокумента", Истина);
		
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ, Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);
		
		ДобавитьВПротоколОбмена(ЭлементОчереди, РезультатОбработкиЗаявки);
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", Неопределено);
		Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.Сообщение);
		Реквизиты.Вставить("Версия",               "1.0");
		Реквизиты.Вставить("ТипСообщения",         Перечисления.ТипыЗапросовИС.Исходящий);
		Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
		Реквизиты.Вставить("Описание",             "");
		
		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
		ИнтеграцияИСМПСлужебный.ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
	КонецЕсли;
	
	НомерВерсии   = Шапка.ПоследнийНомерВерсии + 1;
	
	СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
	
	СообщениеJSON.Идентификатор = Строка(Новый УникальныйИдентификатор());
	СообщениеJSON.ЗагружатьДо   = ЭлементОчереди.Сообщение;
	
	СообщениеJSON.Организация       = ЭлементОчереди.Организация;
	СообщениеJSON.Документ          = ЭлементОчереди.Документ;
	СообщениеJSON.ДокументОснование = ЭлементОчереди.ДокументОснование;
	
	СообщениеJSON.Описание = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(
		ЭлементОчереди.Операция, ЭлементОчереди.Документ, НомерВерсии);
	
	СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	СообщениеJSON.Версия              = Неопределено;
	СообщениеJSON.ТребуетсяПодписание = Истина;
	СообщениеJSON.СообщениеОснование  = ЭлементОчереди.Сообщение;
	СообщениеJSON.Назначение          = Перечисления.НазначениеСообщенийИСМП.ИСМП;
	СообщениеJSON.ВидПродукции        = ЭлементОчереди.ВидПродукции;
	
	СообщениеJSON.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулирование;
	РеквизитыОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ЭлементОчереди.Организация);
	
	Если Не ЗначениеЗаполнено(РеквизитыОрганизации.ИНН) Тогда
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			СтрШаблон(
				НСтр("ru = 'Не заполнено поле ""ИНН"" для организации %1'"), ЭлементОчереди.Организация));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		СообщенияJSON.Добавить(СообщениеJSON);
	Иначе
		ТелоЗапроса = Новый Структура;
		
		ТелоЗапроса.Вставить("participant_inn", РеквизитыОрганизации.ИНН);
		ТелоЗапроса.Вставить("shipment_number", Шапка.ИдентификаторЗаявкиНаОтгрузку);
		
		ТекстСообщенияJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса, Истина);
		
		СообщениеJSON.ТекстСообщенияJSON = ТекстСообщенияJSON;
		
		СообщенияJSON.Добавить(СообщениеJSON);
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	ОбновитьИдентификаторЗаявкиСообщенияОчереди(
		НаборЗаписей,
		ИдентификаторЗаявки,
		Неопределено,
		Неопределено);
	
	ЭлементОчереди.ИдентификаторЗаявки          = ИдентификаторЗаявки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

// Подготавливает сообщения документа Приемка товаров к передаче в сервис ИС МП.
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений()).
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//  НаборЗаписей - РегистрСведенийНаборЗаписей.ОчередьСообщенийИСМП - набор записей по сообщению
Процедура ПодготовитьСообщенияПоАбстрактнойОперацииПриемкаИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗапросов = Новый СписокЗначений;
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ИСМППрисоединенныеФайлы.Документ           КАК Ссылка,
	|	КОЛИЧЕСТВО(ИСМППрисоединенныеФайлы.Ссылка) КАК ПоследнийНомерВерсии
	|ПОМЕСТИТЬ Версии
	|ИЗ
	|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемкаТоваровИСМП КАК Шапка
	|		ПО Шапка.Ссылка   = &Ссылка
	|		 И Шапка.Операция = ИСМППрисоединенныеФайлы.Операция
	|		 И Шапка.Ссылка   = ИСМППрисоединенныеФайлы.Документ
	|ГДЕ
	|	ИСМППрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Исходящий)
	|СГРУППИРОВАТЬ ПО
	|	ИСМППрисоединенныеФайлы.Документ
	|");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Шапка.Номер                              КАК Номер,
	|	Шапка.Дата                               КАК Дата,
	|	ЕСТЬNULL(Версии.ПоследнийНомерВерсии, 0) КАК ПоследнийНомерВерсии,
	|
	|	Шапка.Организация                КАК Организация,
	|	Представление(Шапка.Организация) КАК ОрганизацияПредставление,
	|
	|	Шапка.Ответственный                КАК Ответственный,
	|	Представление(Шапка.Ответственный) КАК ОтветственныйПредставление,
	|
	|	Шапка.ДокументОснование               КАК ДокументОснование,
	|
	|	Шапка.Операция                        КАК Операция,
	|	Шапка.НомерПервичногоДокумента        КАК НомерПервичногоДокумента,
	|	Шапка.ДатаПервичногоДокумента         КАК ДатаПервичногоДокумента,
	|	Шапка.ВидПродукции                    КАК ВидПродукции,
	|	Шапка.Контрагент                      КАК Контрагент,
	|	Представление(Шапка.Контрагент)       КАК КонтрагентПредставление,
	|
	|	Шапка.ИННОтправителя                  КАК ИННОтправителя,
	|	Шапка.ДатаПриемки                     КАК ДатаПриемки,
	|	Шапка.ДатаОтгрузки                    КАК ДатаОтгрузки,
	|	Шапка.НомерЗаявкиНаОтгрузку           КАК НомерЗаявкиНаОтгрузку,
	|	Шапка.ИННОператора                    КАК ИННОператора,
	|	Шапка.Ссылка                          КАК Ссылка
	|ИЗ
	|	Документ.ПриемкаТоваровИСМП КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Версии КАК Версии
	|		ПО Шапка.Ссылка = Версии.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка",
	"Шапка");
	
	ТекстЗапросаТовары = "ВЫБРАТЬ
	|	Товары.Номенклатура   КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия          КАК Серия,
	|	Товары.КодТНВЭД       КАК КодТНВЭД,
	|	Товары.GTIN           КАК GTIN,
	|	Товары.Цена           КАК Цена,
	|	Товары.СуммаНДС       КАК СуммаНДС,
	|	Товары.КоличествоУпаковок                КАК КоличествоУпаковок,
	|	Товары.КоличествоПотребительскихУпаковок КАК КоличествоПотребительскихУпаковок,
	|	&ИдентификаторПроисхожденияВЕТИССтрокой  КАК ИдентификаторПроисхожденияВЕТИССтрокой,
	|
	|	Товары.ВидДокументаСертификации   КАК ВидДокументаСертификации,
	|	Товары.НомерДокументаСертификации КАК НомерДокументаСертификации,
	|	Товары.ДатаДокументаСертификации  КАК ДатаДокументаСертификации
	|
	|ИЗ
	|	Документ.ПриемкаТоваровИСМП.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|";

	ИнтеграцияИСМПВЕТИС.ДоработатьЗапросЗаполненияМаркируемойПродукцииДокументаМаркировка(ТекстЗапросаТовары, Истина);
	СписокЗапросов.Добавить(ТекстЗапросаТовары, "Товары");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ЕстьNull(ШтрихкодыУпаковок.ШтрихкодУпаковки, Неопределено)  КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковок.ЗначениеШтрихкода                         КАК ЗначениеШтрихкода,
	|	ШтрихкодыУпаковок.GTIN                                      КАК GTIN,
	|	ШтрихкодыУпаковок.КоличествоУпаковок                        КАК КоличествоУпаковок,
	|	ШтрихкодыУпаковок.Цена                                      КАК Цена,
	|	ШтрихкодыУпаковок.СуммаНДС                                  КАК СуммаНДС
	|ИЗ
	|	Документ.ПриемкаТоваровИСМП.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|ГДЕ
	|	ШтрихкодыУпаковок.Ссылка = &Ссылка
	|",
	"ШтрихкодыУпаковок");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",                                 ЭлементОчереди.Документ);
	Запрос.УстановитьПараметр("ИдентификаторПроисхожденияВЕТИССтрокой", "");
	
	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	Шапка             = РезультатЗапроса["Шапка"].Выбрать();
	//@skip-warning
	Товары            = РезультатЗапроса["Товары"].Выгрузить();
	//@skip-warning
	ШтрихкодыУпаковок = РезультатЗапроса["ШтрихкодыУпаковок"].Выгрузить();
	
	Если Не Шапка.Следующий()
		Или ШтрихкодыУпаковок.Количество() = 0 Тогда
		
		ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	СообщенияJSON = Новый Массив;
	ЕстьОшибки    = Ложь;
	
	РезультатОбработкиЗаявки = ИнтерфейсИСМП.СтатусОбработкиДокументаПоИдентификатору(
		Шапка.НомерЗаявкиНаОтгрузку,
		ЭлементОчереди.Организация, ЭлементОчереди.ВидПродукции);
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатус                = РезультатОбработкиЗаявки.Статус;
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();

	Если ЗначениеЗаполнено(РезультатОбработкиЗаявки.ТекстОшибки) Тогда
		
		СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
		СообщениеJSON.Идентификатор = Строка(Новый УникальныйИдентификатор());
		СообщениеJSON.ЗагружатьДо   = ЭлементОчереди.Сообщение;
		
		ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			РезультатОбработкиЗаявки.ТекстОшибки);
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
	Если РезультатОбработкиЗаявки.Статус <> Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления Тогда
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		
		ПараметрыОбновленияСтатуса.Статус            = Неопределено;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		ПараметрыОбновленияСтатуса.Вставить("ВидПродукции",               ЭлементОчереди.ВидПродукции);
		ПараметрыОбновленияСтатуса.Вставить("ОбновлениеСтатусаДокумента", Истина);
		
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
			ЭлементОчереди.Документ, Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);
		
		ДобавитьВПротоколОбмена(ЭлементОчереди, РезультатОбработкиЗаявки);
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", Неопределено);
		Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.Сообщение);
		Реквизиты.Вставить("Версия",               "1.0");
		Реквизиты.Вставить("ТипСообщения",         Перечисления.ТипыЗапросовИС.Исходящий);
		Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
		Реквизиты.Вставить("Описание",             "");
		
		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
		ИнтеграцияИСМПСлужебный.ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
	КонецЕсли;
	
	// Заполнение данных по маркируемым товарам
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(Шапка, Неопределено, Шапка.ВидПродукции);
	ПараметрыСканирования.СопоставлятьНоменклатуру     = Ложь;
	ИнтеграцияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Ложь);
	
	ОперацияПодтверждениеПриемки = Ложь;
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Приемка Тогда
		ОперацияПодтверждениеПриемки = Истина;
	КонецЕсли;
	
	НомерВерсии   = Шапка.ПоследнийНомерВерсии + 1;

	СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(Новый Структура, ЭлементОчереди.Операция, ЭлементОчереди);
	СообщениеJSON.ЗагружатьДо = ЭлементОчереди.Сообщение;
	СообщениеJSON.Описание    = ИнтеграцияИСМПСлужебный.ОписаниеОперацииПередачиДанных(
		ЭлементОчереди.Операция, ЭлементОчереди.Документ, НомерВерсии);

	ЭтоПриемкаИзЕАЭССПризнаниемКМ = (Шапка.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ);
	ЭтоПриемкаИзЕАЭСПриОСУ        = (Шапка.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ);

	Если ОперацияПодтверждениеПриемки Тогда
		
		СообщениеJSON.Операция = Шапка.Операция;

		РезультатПроверки = НовыйРезультатОбработкиВложенийПриемкиТоваровИСМП();

		Для Каждого СтрокаТаблицы Из Товары Цикл
			КоличествоУпаковок = СтрокаТаблицы.КоличествоУпаковок;
			Если ЗначениеЗаполнено(СтрокаТаблицы.КоличествоПотребительскихУпаковок) Тогда
				КоличествоУпаковок = СтрокаТаблицы.КоличествоПотребительскихУпаковок;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(КоличествоУпаковок) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТаблицы.СуммаНДС = Окр(СтрокаТаблицы.СуммаНДС / КоличествоУпаковок, 2);
		КонецЦикла;

		Если ЭтоПриемкаИзЕАЭСПриОСУ Тогда

			ЗаполнитьРезультатПроверкиПриемкиТоваровИСМППриОСУ(РезультатПроверки, Товары, ШтрихкодыУпаковок);

		Иначе

			ДанныеШтрихкодовСписок = Новый Массив;
			Для Каждого СтрокаШтрихкода Из ШтрихкодыУпаковок Цикл
				Если ЗначениеЗаполнено(СтрокаШтрихкода.ЗначениеШтрихкода) Тогда
					ЭлементСписка = Новый Структура();
					ЭлементСписка.Вставить("Штрихкод",   СтрокаШтрихкода.ЗначениеШтрихкода);
					ЭлементСписка.Вставить("Количество", 1);
					ДанныеШтрихкодовСписок.Добавить(ЭлементСписка);
				КонецЕсли;
			КонецЦикла;

			ДанныеПоШтрихкодам = ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам(Ложь);
			ШтрихкодированиеИС.ПодготовитьДанныеКодовМаркировкиДляОбработки(
				ДанныеПоШтрихкодам, ДанныеШтрихкодовСписок, ПараметрыСканирования);
			ШтрихкодированиеИС.ИндексироватьКолонкиТаблицыДанныхКодовМаркировки(ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
		
			РезультатПоискаПоДаннымДокумента = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
				ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"),
				ПараметрыСканирования,, Истина);
			ДеревоУпаковокПоДаннымДокумента = РезультатПоискаПоДаннымДокумента.ДеревоУпаковок;

			РезультатПолученияДереваИСМП = ИнтерфейсИСМП.ДеревоУпаковок(
				ДанныеПоШтрихкодам.ДанныеКодовМаркировки, Неопределено,
				ПараметрыСканирования);

			Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДереваИСМП, ЭлементОчереди, ПараметрыОбмена) Тогда
				Возврат;
			КонецЕсли;

			Если ЗначениеЗаполнено(РезультатПолученияДереваИСМП.ТекстОшибки) Тогда
				РезультатПроверки.ТекстОшибки = РезультатПолученияДереваИСМП.ТекстОшибки;
				РезультатПроверки.ЕстьОшибки  = Истина;
			ИначеЕсли РезультатПолученияДереваИСМП.ДеревоУпаковок = Неопределено Тогда
				РезультатПроверки.ТекстОшибки = НСтр("ru = 'Дерево упаковок по данным сервиса неопределено'");
				РезультатПроверки.ЕстьОшибки  = Истина;
			КонецЕсли;

			ДеревоУпаковокПоДаннымИСМП = РезультатПолученияДереваИСМП.ДеревоУпаковок;
		
			ДополнитьКолонкиДереваДаннымиОперацииЕАЭС(ДеревоУпаковокПоДаннымДокумента);
			ДополнитьКолонкиДереваДаннымиОперацииЕАЭС(ДеревоУпаковокПоДаннымИСМП);

			Если Не ЕстьОшибки
				И Не РезультатПроверки.ЕстьОшибки
				И ИнтеграцияИСМПСлужебныйКлиентСервер.ЭтоПриемкаИзСтранЕАЭС(Шапка.Операция) Тогда

				ИменаКолонокДляЗаполнения = "КодТНВЭД, Цена, СуммаНДС, ВидДокументаСертификации, НомерДокументаСертификации, ДатаДокументаСертификации";
				Товары.Индексы.Добавить("Номенклатура, Характеристика, Серия");
				Товары.Индексы.Добавить("GTIN");
				ЕстьОшибки = ДополнитьДеревоУпаковокДаннымиТоваров(ДеревоУпаковокПоДаннымДокумента, Товары, ИменаКолонокДляЗаполнения, СообщениеJSON);

			КонецЕсли;

			Если Не ЕстьОшибки
				И Не РезультатПроверки.ЕстьОшибки Тогда
				РезультатПроверки = ВыявитьРасхожденияВСоставахДеревьев(
					ДеревоУпаковокПоДаннымДокумента,
					ДеревоУпаковокПоДаннымИСМП,
					ОперацияПодтверждениеПриемки);
			КонецЕсли;

		КонецЕсли;

		Если Не ЕстьОшибки Тогда
			
			Если РезультатПроверки.ЕстьОшибки Тогда
				ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
					СообщениеJSON,
					РезультатПроверки.ТекстОшибки);
				ЕстьОшибки = Истина;
			ИначеЕсли Не РезультатПроверки.Свойство("СоставУпаковок")
				Или РезультатПроверки.СоставУпаковок.Количество() = 0 Тогда
				ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(
						СообщениеJSON,
						НСтр("ru = 'Нет данных для выгрузки.'"));
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;

	Иначе
		СообщениеJSON.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		
		Статус = Перечисления.СтатусыОбработкиПриемкиТоваровИСМП.ПодтверждениеПриемкиОшибка;
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Статус;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		ПараметрыОбновленияСтатуса.Вставить("ВидПродукции",      ЭлементОчереди.ВидПродукции);
		ПараметрыОбновленияСтатуса.Вставить("ОперацияКвитанции", ЭлементОчереди.Операция);
		
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
		МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
		ЭлементОчереди.Документ, Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
			ПараметрыОбновленияСтатуса);
		
		ДобавитьВПротоколОбменаОписаниеОшибки(ЭлементОчереди, СообщениеJSON.ТекстОшибки, Статус);
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", Неопределено);
		Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.Сообщение);
		Реквизиты.Вставить("Версия",               "1.0");
		Реквизиты.Вставить("ТипСообщения",         Перечисления.ТипыЗапросовИС.Исходящий);
		Реквизиты.Вставить("СтатусОбработки",      Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка);
		Реквизиты.Вставить("Описание",             СообщениеJSON.ТекстОшибки);
		
		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
		ИнтеграцияИСМПСлужебный.ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);

		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Возврат;
		
	Иначе
		
		РеквизитыОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ЭлементОчереди.Организация);
		ВидОперации = ВидОперацииДокументаИСМП(Шапка.Операция, СообщениеJSON);
		
		ТелоЗапроса = Новый Структура;
		
		ТелоЗапроса.Вставить("document_number",          Шапка.НомерПервичногоДокумента);
		ТелоЗапроса.Вставить("document_date",            ИнтеграцияИС.ДатаUTC(Шапка.ДатаПервичногоДокумента));
		ТелоЗапроса.Вставить("transfer_date",            ИнтеграцияИС.ДатаUTC(Шапка.ДатаОтгрузки));
		ТелоЗапроса.Вставить("request_type",             "ACCEPTANCE");
		ТелоЗапроса.Вставить("release_order_number",     Шапка.НомерЗаявкиНаОтгрузку);
		ТелоЗапроса.Вставить("trade_sender_inn",         Шапка.ИННОтправителя);
		ТелоЗапроса.Вставить("trade_recipient_inn",      РеквизитыОрганизации.ИНН);
		ТелоЗапроса.Вставить("trade_owner_inn",          "");
		
		Если Не ЭтоПриемкаИзЕАЭСПриОСУ Тогда
			ТелоЗапроса.Вставить("turnover_type", ВидОперации);
		КонецЕсли;

		Если ИнтеграцияИСМПСлужебныйКлиентСервер.ЭтоПриемкаИзСтранЕАЭС(Шапка.Операция) Тогда
			Если Не ЭтоПриемкаИзЕАЭСПриОСУ Тогда
				ТелоЗапроса.Вставить("release_method", "CROSSBORDER");
			КонецЕсли;
			ТелоЗапроса.Вставить("exporter_taxpayer_id", Шапка.ИННОтправителя); // Идентификатор экспортёра в ЕАЭС, соответствует значению "exporter_taxpayer_id"
			ТелоЗапроса.Вставить("exporter_name",        Шапка.КонтрагентПредставление);
			ТелоЗапроса.Вставить("trade_sender_inn",     Шапка.ИННОператора); // Идентификатор Оператора ЕАЭС,  соответствует значению "sender_inn"
		КонецЕсли;
		
		Если ОперацияПодтверждениеПриемки Тогда
			ТелоЗапроса.Вставить("acceptance_date", ИнтеграцияИС.ДатаUTC(Шапка.ДатаПриемки));
			ТелоЗапроса.Вставить("products",        Новый Массив);
			ТелоЗапроса.products = РезультатПроверки.СоставУпаковок;
		Иначе
			ДатаПриемки = Шапка.ДатаПриемки;
			Если Не ЗначениеЗаполнено(Шапка.ДатаПриемки) Тогда
				ДатаПриемки = ТекущаяДатаСеанса();
			КонецЕсли;
			ТелоЗапроса.Вставить("acceptance_date", ИнтеграцияИС.ДатаUTC(ДатаПриемки));
			ТелоЗапроса.Вставить("reject_all",      Истина);
		КонецЕсли;
		
		ТекстСообщенияJSON = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ТелоЗапроса, Истина);
		
		СообщениеJSON.ТекстСообщенияJSON  = ТекстСообщенияJSON;
		
		СообщенияJSON.Добавить(СообщениеJSON);
		
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	ОбновитьИдентификаторЗаявкиСообщенияОчереди(
		НаборЗаписей,
		ИдентификаторЗаявки,
		Неопределено,
		Неопределено);
	
	ЭлементОчереди.ИдентификаторЗаявки          = ИдентификаторЗаявки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

Процедура ПодготовитьСообщенияПоАбстрактнойОперацииПодключениеКОборудованиюРозлива(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
	
	ДанныеЗапросаСтатусов = Новый Массив;
	
	СтрокаКодаМаркировки = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
		ПараметрыЗапроса.КодМаркировкиСтрокой,
		ЭлементОчереди.ВидПродукции,
		ПользовательскиеПараметрыРазбораКодаМаркировки);
	ДанныеЗапросаСтатусов.Добавить(СтрокаКодаМаркировки);
	
	Результат = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
		ДанныеЗапросаСтатусов,
		ЭлементОчереди.Организация);
	
	Если ТребуетсяОбновлениеКлючаСессии(Результат, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	СообщенияJSON = Новый Массив;
	
	ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений();
	ТаблицыБлокируемыхСсылок.Колонки.Добавить("КодМаркировки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	ТаблицыБлокируемыхСсылок.Колонки.Добавить("ДанныеПодключения");
	ТаблицыБлокируемыхСсылок.Колонки.Добавить("УдалитьКодМаркировки",  Новый ОписаниеТипов("Булево"));
	
	ДанныеСтатуса = Результат.СтатусыКодовМаркировки[СтрокаКодаМаркировки];
	
	Если ДанныеСтатуса.ОсобоеСостояние = Перечисления.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива Тогда
		
		НоваяСтрока = ТаблицыБлокируемыхСсылок.Добавить();
		НоваяСтрока.КодМаркировки = ПараметрыЗапроса.КодМаркировки;
	
		НоваяСтрока.ДанныеПодключения = РегистрыСведений.КегиНаОборудованииРозливаИСМП.ИнициализироватьДанныеПодключенияКОборудованию();
		НоваяСтрока.ДанныеПодключения.ДатаПодключения = ДанныеСтатуса.ДатаПодключения;
		НоваяСтрока.ДанныеПодключения.СрокРеализации  = ДанныеСтатуса.ГоденДо;
		НоваяСтрока.ДанныеПодключения.КодМаркировки   = ПараметрыЗапроса.КодМаркировки;
		
	Иначе
		
		ПараметрыНормализации = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
		ПараметрыНормализации.ИмяСвойстваКодМаркировки = "Штрихкод";
		ПараметрыНормализации.НачинаетсяСоСкобки       = Ложь;
		
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("participantInn", ПараметрыЗапроса.ИНН);
		Если СтрДлина(ПараметрыЗапроса.ИНН) < 12 Тогда
			ТелоЗапроса.Вставить("participantKpp", ПараметрыЗапроса.КПП);
		Иначе
			Если ЗначениеЗаполнено(ПараметрыЗапроса.КодФИАС) Тогда
				ТелоЗапроса.Вставить("fiasId", ПараметрыЗапроса.КодФИАС);
			КонецЕсли;
		КонецЕсли;
	
		ТелоЗапроса.Вставить("codes", Новый Массив);
		
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить(
			"cis",
			ШтрихкодированиеИСМП.КодМаркировкиДляПередачиИСМП(СтрокаКодаМаркировки, ПараметрыНормализации));
		СтрокаДанных.Вставить("connectDate",    Формат(ПараметрыЗапроса.ДатаПодключения, "ДФ=yyyy-MM-dd;"));
		СтрокаДанных.Вставить("expirationDate", Формат(ПараметрыЗапроса.СрокРеализации,  "ДФ=yyyy-MM-dd;"));
		
		ТелоЗапроса.codes.Добавить(СтрокаДанных);
		
		СообщениеJSON = ЗаполнитьСообщениеJSONКПередаче(
			ТелоЗапроса,
			Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозлива,
			ЭлементОчереди);
		
		СообщениеJSON.ПараметрыЗапроса = Новый Структура;
		СообщениеJSON.ПараметрыЗапроса.Вставить("КодМаркировки", ПараметрыЗапроса.КодМаркировки);
		
		СообщениеJSON.Версия             = ПараметрыЗапроса.НомерВерсии;
		СообщениеJSON.СообщениеОснование = ЭлементОчереди.Сообщение;
		СообщениеJSON.ЗагружатьДо        = ЭлементОчереди.Сообщение;
		
		СообщенияJSON.Добавить(СообщениеJSON);
		
		СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
		ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
		
		ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
		
		// Добавить подписанные сообщения в очередь сообщений
		ПодготовитьПодписанныеСообщенияКПередаче(
			ПодписанныеСообщенияПоОрганизациям,
			ПараметрыОбмена);
		
		ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
		ОбновитьИдентификаторЗаявкиСообщенияОчереди(
			НаборЗаписей,
			ИдентификаторЗаявки,
			Неопределено,
			Неопределено);
		
		ЭлементОчереди.ИдентификаторЗаявки = ИдентификаторЗаявки;
		ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
		
	КонецЕсли;
	
	Если ТаблицыБлокируемыхСсылок.Количество() Тогда
		
		БлокировкаДанных = Новый БлокировкаДанных();
	
		ЭлементБлокировки = БлокировкаДанных.Добавить(Метаданные.РегистрыСведений.КегиНаОборудованииРозливаИСМП.ПолноеИмя());
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("КодМаркировки", "КодМаркировки");
		
		//@skip-check lock-out-of-try
		БлокировкаДанных.Заблокировать();
		
		Для Каждого СтрокаТаблицы Из ТаблицыБлокируемыхСсылок Цикл
			
			Если СтрокаТаблицы.ДанныеПодключения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПодключения = РегистрыСведений.КегиНаОборудованииРозливаИСМП.ПолучитьПодключениеКОборудованию(
				СтрокаТаблицы.КодМаркировки)[СтрокаТаблицы.КодМаркировки];
				
			Если ДанныеПодключения = Неопределено Тогда
				Продолжить; // КМ был удален ранее (до обработки документа)
			КонецЕсли;
			
			Если ДанныеПодключения.Статус = Перечисления.СтатусыПодключенияКОборудованиюРозливаИСМП.Подключено Тогда
				РегистрыСведений.КегиНаОборудованииРозливаИСМП.УстановитьПодключениеКОборудованию(
					СтрокаТаблицы.ДанныеПодключения,
					ДанныеПодключения);
			Иначе
				РегистрыСведений.КегиНаОборудованииРозливаИСМП.УдалитьПодключениеКОборудованию(СтрокаТаблицы.КодМаркировки);
			КонецЕсли;
			
		КонецЦикла;
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     Результат.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               Результат.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", Результат.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение по документу %1 не принято ИС МП:
					           |Текст ошибки: %2'"),
					ЭлементОчереди.Документ,
					Результат.ТекстОшибки);
			Иначе
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение не принято ИС МП:
					           |Текст ошибки: %1'"),
					Результат.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
	Если СообщенияJSON.Количество() = 0 Тогда
		ЗавершитьПодготовкуСообщенийАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
	КонецЕсли;
	
КонецПроцедуры

// Заполнить результат проверки приемки товаров ИСМППри ОСУ.
//
// Параметры:
//  РезультатПроверки - см. НовыйРезультатОбработкиВложенийПриемкиТоваровИСМП.
//  Товары            - ТаблицаЗначений - Таблица товаров.
//  ШтрихкодыУпаковок - ТаблицаЗначений - Таблица штрихкодов.
Процедура ЗаполнитьРезультатПроверкиПриемкиТоваровИСМППриОСУ(РезультатПроверки, Товары, ШтрихкодыУпаковок)

	ШтрихкодыУпаковокКонтроль = ШтрихкодыУпаковок.Скопировать();
	ТоварыКонтроль            = Товары.Скопировать();
	ТоварыКонтроль.Свернуть("GTIN", "КоличествоУпаковок, КоличествоПотребительскихУпаковок");
	ШтрихкодыУпаковокКонтроль.Свернуть("GTIN", "КоличествоУпаковок");

	ТекстыОшибок = Новый Массив();
	Для Каждого СтрокаТовары Из ТоварыКонтроль Цикл

		КоличествоВШтрихкодах = 0;
		КоличествоВТоварах    = СтрокаТовары.КоличествоУпаковок;
		Если ЗначениеЗаполнено(СтрокаТовары.КоличествоПотребительскихУпаковок) Тогда
			КоличествоВТоварах = СтрокаТовары.КоличествоПотребительскихУпаковок;
		КонецЕсли;

		СтруктураПоискаШтрихкоды = Новый Структура();
		СтруктураПоискаШтрихкоды.Вставить("GTIN", СтрокаТовары.GTIN);
		НайденныеСтроки = ШтрихкодыУпаковокКонтроль.НайтиСтроки(СтруктураПоискаШтрихкоды);
		Если НайденныеСтроки.Количество() Тогда
			КоличествоВШтрихкодах = НайденныеСтроки[0].КоличествоУпаковок;
		КонецЕсли;

		Если КоличествоВТоварах > КоличествоВШтрихкодах Тогда
			ТекстыОшибок.Добавить(
				СтрШаблон(
					НСтр("ru = 'GTIN: %1, в исходном документе: %2, принимается: %3'"),
					СтрокаТовары.GTIN,
					КоличествоВШтрихкодах,
					КоличествоВТоварах));
		КонецЕсли;

	КонецЦикла;

	Если ТекстыОшибок.Количество() Тогда
		РезультатПроверки.ЕстьОшибки = Истина;
		ТекстыОшибок.Вставить(0,
			СтрШаблон(
				НСтр("ru='Невозможно принять документ, выявлены расхождения:'"),
				));
		РезультатПроверки.ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из Товары Цикл

		Если Не ЗначениеЗаполнено(СтрокаТаблицы.КоличествоУпаковок) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаJSON = Новый Структура();
		СтрокаJSON.Вставить("gtin",         СтрокаТаблицы.GTIN);
		СтрокаJSON.Вставить("cis_quantity", СтрокаТаблицы.КоличествоУпаковок);
		Если ЗначениеЗаполнено(СтрокаТаблицы.КоличествоПотребительскихУпаковок) Тогда
			СтрокаJSON.cis_quantity = СтрокаТаблицы.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторПроисхожденияВЕТИССтрокой) Тогда
			СтрокаJSON.Вставить("vsd_number", СокрЛП(СтрокаТаблицы.ИдентификаторПроисхожденияВЕТИССтрокой));
		КонецЕсли;

		ДополнитьДанныеJSONДляОперацийЕАЭС(СтрокаТаблицы, СтрокаJSON);

		РезультатПроверки.СоставУпаковок.Добавить(СтрокаJSON);

	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьИдентификаторЗаявкиСообщенияОчереди(
	НаборЗаписей, ИдентификаторЗаявки = Неопределено, СтанцияУправленияЗаказами = Неопределено,
	ПротоколОбменаВХранилищеЗначения = Неопределено, ИдентификаторПоследнегоБлокаКодов = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		
		ИзменитьДатуМодификации = Ложь;
		
		Если ИдентификаторЗаявки <> Неопределено
			И ЗаписьНабора.ИдентификаторЗаявки <> ИдентификаторЗаявки Тогда
			ЗаписьНабора.ИдентификаторЗаявки = ИдентификаторЗаявки;
			ИзменитьДатуМодификации = Истина;
		КонецЕсли;
		
		Если ПротоколОбменаВХранилищеЗначения <> Неопределено Тогда
			ЗаписьНабора.ПротоколОбмена = ПротоколОбменаВХранилищеЗначения;
			ИзменитьДатуМодификации = Истина;
		КонецЕсли;
		
		Если СтанцияУправленияЗаказами <> Неопределено
			И ЗаписьНабора.СтанцияУправленияЗаказами <> СтанцияУправленияЗаказами Тогда
			ЗаписьНабора.СтанцияУправленияЗаказами = СтанцияУправленияЗаказами;
			ИзменитьДатуМодификации = Истина;
		КонецЕсли;
		
		Если ИдентификаторПоследнегоБлокаКодов <> Неопределено
			И ЗаписьНабора.ИдентификаторПоследнегоБлокаКодов <> ИдентификаторПоследнегоБлокаКодов Тогда
			ЗаписьНабора.ИдентификаторПоследнегоБлокаКодов = ИдентификаторПоследнегоБлокаКодов;
			ИзменитьДатуМодификации = Истина;
		КонецЕсли;
		
		Если ИзменитьДатуМодификации
			Или Не ЗначениеЗаполнено(ЗаписьНабора.ДатаМодификацииУниверсальная) Тогда
			ЗаписьНабора.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена)
	
	НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение, Истина);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиДокумент, ПараметрыОбмена)
	
	ЭлементОчереди = Неопределено;
	
	Если ТипЗнч(ЭлементОчередиДокумент) <> Тип("СтрокаТаблицыЗначений") Тогда
		Для Каждого СтрокаТЧ Из ПараметрыОбмена.ОчередьСообщений Цикл
			Если СтрокаТЧ.Документ = ЭлементОчередиДокумент Тогда
				ЭлементОчереди = СтрокаТЧ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭлементОчереди = ЭлементОчередиДокумент;
	КонецЕсли;
	
	Если ЭлементОчереди = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение);
	НайденныеСтроки = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		ПараметрыОбмена.ЗависимостиСообщений.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение2", ЭлементОчереди.Сообщение);
	НайденныеСтроки = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		ПараметрыОбмена.ЗависимостиСообщений.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
	
КонецПроцедуры

Процедура ОчиститьОчередьЗапросаСтатусаОтгрузкаТоваровИСМП(ЭлементОчередиАбстрактнойОперации, СтатусОбработки)
	
	ПараметрыОбменаОтгрузка = ИнтеграцияИСМП.ПараметрыОбмена(ЭлементОчередиАбстрактнойОперации.Организация);
	
	ИнтеграцияИСМПСлужебный.ПостроитьОчередьСообщений(ПараметрыОбменаОтгрузка, ЭлементОчередиАбстрактнойОперации.Документ);
	
	Для Каждого ЭлементОчереди Из ПараметрыОбменаОтгрузка.ОчередьСообщений Цикл
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
		Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
		Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
		Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
		Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
		Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
		Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
		Реквизиты.Вставить("Описание",             "");
		
		ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
		ДобавитьЗаписьВПротоколОбмена(
			ПротоколаОбменаXML,
			Реквизиты);
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбменаОтгрузка);
		
	КонецЦикла;
	
КонецПроцедуры

// Подготавливает сообщение к передаче в сервис ВетИС.
//
// Параметры:
//  ТекстСообщенияXML - Строка - Текст исходящего сообщения.
//  РеквизитыОчереди - Неопределено, Структура - Параметры очереди сообщений ВетИС
//
// Возвращаемое значение:
//  Структура - результат подготовки сообщения к отправке с полями:
//    * НовыйСтатус - Неопределено, ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - новый статус,
//    * ИсходящееСообщение - Строка - идентификатор сообщения,
//    * ТекстОшибки - Строка - текст ошибки,
//    * ТребуетсяРасчетОчереди - Булево - необходимость пересчета очереди сообщений.
//
Функция ПодготовитьСообщениеКПередаче(Сообщение, РеквизитыОчереди)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НовыйСтатус",        Неопределено);
	ВозвращаемоеЗначение.Вставить("ИсходящееСообщение", Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",        "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не ЗначениеЗаполнено(Сообщение.Идентификатор) Тогда
			ИсходящееСообщение = Строка(Новый УникальныйИдентификатор);
		Иначе
			ИсходящееСообщение = Сообщение.Идентификатор;
		КонецЕсли;
		
		ВозвращаемоеЗначение.ИсходящееСообщение = ИсходящееСообщение;
		
		Если РеквизитыОчереди <> Неопределено И Сообщение.Операция <> Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений Тогда
			
			ДобавитьСообщениеВОчередьНаПередачуДанных(ИсходящееСообщение, РеквизитыОчереди);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сообщение.Документ) И Сообщение.Операция <> Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений Тогда
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(Сообщение.Документ);
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПодготовкиКПередачеДанных(
				Сообщение.Документ, Сообщение.Операция, Сообщение.ПараметрыЗапроса);
			
		Иначе
			НовыйСтатус = Неопределено;
		КонецЕсли;
		
		ВозвращаемоеЗначение.НовыйСтатус = НовыйСтатус;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При подготовке к передаче сообщения по документу %1 возникла ошибка:
			           |Текст ошибки: %2'"),
			Сообщение.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Добавить сообщение в регистра сведений ОчередьСообщенийИСМП.
//
// Параметры:
//  Сообщение - СправочникСсылка.ИСМППрисоединенныеФайлы - сообщение, которое добавляется в очередь.
//  Реквизиты - Структура                          - реквизиты очереди сообщений ИС МП.
//
Процедура ДобавитьСообщениеВОчередьНаПередачуДанных(Сообщение, Реквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьМенеджерЗаписи();
	НоваяЗапись.ДатаСоздания       = ТекущаяУниверсальнаяДата();
	НоваяЗапись.Сообщение          = Сообщение;
	НоваяЗапись.СообщениеОснование = Реквизиты.СообщениеОснование;
	
	// Назначение сообщений: ИСМП, МОТП или СУЗ
	НоваяЗапись.ВидПродукции              = Реквизиты.ВидПродукции;
	НоваяЗапись.Операция                  = Реквизиты.Операция;
	НоваяЗапись.Назначение                = Реквизиты.Назначение;
	НоваяЗапись.СтанцияУправленияЗаказами = Реквизиты.СтанцияУправленияЗаказами;
	
	// Источник
	НоваяЗапись.Организация       = Реквизиты.Организация;
	НоваяЗапись.Документ          = Реквизиты.Документ;
	НоваяЗапись.ДокументОснование = Реквизиты.ДокументОснование;
	
	// Описание, протокол и очередь
	НоваяЗапись.РеквизитыИсходящегоСообщения = Новый ХранилищеЗначения(Реквизиты.РеквизитыИсходящегоСообщения);
	НоваяЗапись.ПротоколОбмена               = Новый ХранилищеЗначения(Неопределено);
	НоваяЗапись.ЗагружатьПосле               = Реквизиты.ЗагружатьПосле;
	НоваяЗапись.ЗагружатьДо                  = Реквизиты.ЗагружатьДо;
	НоваяЗапись.ИдентификаторЗаявки          = Реквизиты.ИдентификаторЗаявки;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

Функция ТребуетсяОбновлениеКлючаСессии(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена)
	
	ТребуетсяОбновлениеКлючаСессии = РезультатыПередачиСообщения.ТребуетсяОбновлениеКлючаСессии;
	Если Не ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено Тогда
		ПараметрыОбмена.КОбновлениюКлючейСессии = Новый Соответствие;
	КонецЕсли;
	
	Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами Тогда
		
		РезультатПолученияНастройки = НастройкаОбменаСУЗ(
			ПараметрыОбмена,
			ЭлементОчереди);
		
		Если Не РезультатПолученияНастройки.Успешно Тогда
			Если РезультатПолученияНастройки.ТребуетсяОбновлениеКлючаСессии Тогда
				Возврат Истина;
			Иначе
				ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыЗапросаКлючаСессии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессииСУЗ(
			РезультатПолученияНастройки.НастройкаОбмена);
		
	Иначе
		ПараметрыЗапросаКлючаСессии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация);
	КонецЕсли;
	
	Если Не ПараметрыЗапросаДобавленыКОбновлению(ПараметрыОбмена, ПараметрыЗапросаКлючаСессии, ЭлементОчереди) Тогда
	
		РезультатЗапроса = ИнтерфейсАвторизацииИСМПВызовСервера.ЗапроситьПараметрыАвторизации(ПараметрыЗапросаКлючаСессии);
		
		ПараметрыАвторизации = РезультатЗапроса.ПараметрыАвторизации;
		Если ПараметрыАвторизации = Неопределено Тогда
			
			ПриОтменеТранзакции(
				ЭлементОчереди, РезультатЗапроса.ТекстОшибки, ПараметрыОбмена);
			
		Иначе
			
			ДобавитьКОбновлениюКлючейСесии(
				ПараметрыОбмена,
				ЭлементОчереди,
				ПараметрыЗапросаКлючаСессии,
				ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьКОбновлениюКлючейСесии(ПараметрыОбмена, ЭлементОчереди, ПараметрыЗапросаКлючаСессии, ПараметрыАвторизации)
	
	ДобавляемоеЗначение = Новый Структура();
	ДобавляемоеЗначение.Вставить("ПараметрыЗапроса",     ПараметрыЗапросаКлючаСессии);
	ДобавляемоеЗначение.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	ДобавляемоеЗначение.Вставить("Назначение",           ЭлементОчереди.Назначение);
	
	КоллекцияПоОрганизации = ПараметрыОбмена.КОбновлениюКлючейСессии.Получить(ЭлементОчереди.Организация);
	
	Если КоллекцияПоОрганизации = Неопределено Тогда
		КоллекцияПоОрганизации = Новый Соответствие();
		ПараметрыОбмена.КОбновлениюКлючейСессии.Вставить(ЭлементОчереди.Организация, КоллекцияПоОрганизации);
	КонецЕсли;
	
	КоллекцияПоНазначению = КоллекцияПоОрганизации[ЭлементОчереди.Назначение];
	Если КоллекцияПоНазначению = Неопределено Тогда
		КоллекцияПоНазначению = Новый Соответствие();
		КоллекцияПоОрганизации.Вставить(ЭлементОчереди.Назначение, КоллекцияПоНазначению);
	КонецЕсли;
	
	Если ИнтерфейсАвторизацииИСМПСлужебный.ЭтоПараметрыЗапросаСУЗ(ПараметрыЗапросаКлючаСессии) Тогда
		КоллекцияПоНазначению.Вставить(ПараметрыЗапросаКлючаСессии.ПроизводственныйОбъект, ДобавляемоеЗначение);
	Иначе
		КоллекцияПоНазначению.Вставить(ЭлементОчереди.Назначение, ДобавляемоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыЗапросаДобавленыКОбновлению(ПараметрыОбмена, ПараметрыЗапросаКлючаСессии, ЭлементОчереди)
	
	КоллекцияПоОрганизации = ПараметрыОбмена.КОбновлениюКлючейСессии[ЭлементОчереди.Организация];
	
	Если КоллекцияПоОрганизации = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоллекцияПоНазначению = КоллекцияПоОрганизации[ЭлементОчереди.Назначение];
	Если КоллекцияПоНазначению = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИнтерфейсАвторизацииИСМПСлужебный.ЭтоПараметрыЗапросаСУЗ(ПараметрыЗапросаКлючаСессии) Тогда
		Возврат КоллекцияПоНазначению[ПараметрыЗапросаКлючаСессии.ПроизводственныйОбъект] <> Неопределено;
	Иначе
		Возврат КоллекцияПоНазначению[ЭлементОчереди.Назначение] <> Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена)
	
	ТекстОшибки = "";
	Если ЗначениеЗаполнено(РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки) Тогда
		ТекстОшибки = РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки;
	ИначеЕсли РезультатыПередачиСообщения.РезультатОтправкиЗапроса <> Неопределено
		И ЗначениеЗаполнено(РезультатыПередачиСообщения.РезультатОтправкиЗапроса.ТекстОшибки) Тогда
		ТекстОшибки = РезультатыПередачиСообщения.РезультатОтправкиЗапроса.ТекстОшибки;
	КонецЕсли;
	
	Передано = Не ЗначениеЗаполнено(ТекстОшибки);
	
	ЭлементОчереди.ТекстОшибки = ТекстОшибки;
	
	СтрокаРезультата = СтруктураИзменения();
	
	СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
	СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
	СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
	
	СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
	СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
	СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

	СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
	СтрокаРезультата.ПодготовленоКПередаче = Истина;
	СтрокаРезультата.Передано              = Передано;
	СтрокаРезультата.Принято               = Ложь;
	СтрокаРезультата.НовыйСтатус           = РезультатыПередачиСообщения.РезультатОбработкиОтвета.НовыйСтатус;
	СтрокаРезультата.ОбъектИзменен         = Ложь;
	
	СтрокаРезультата.Сообщение                    = РезультатыПередачиСообщения.Сообщение;
	СтрокаРезультата.ТекстСообщения               = РезультатыПередачиСообщения.ТекстСообщения;
	СтрокаРезультата.ПредставлениеПротоколаОбмена = РезультатыПередачиСообщения.ПредставлениеПротоколаОбмена;
	
	ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
	
	Если Не Передано Тогда
		ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатПолученияСообщения(РезультатыПолученияСообщения, ЭлементОчереди, ПараметрыОбмена)

	ТекстОшибки = "";
	Если ЗначениеЗаполнено(РезультатыПолученияСообщения.ТекстОшибки) Тогда
		ТекстОшибки = РезультатыПолученияСообщения.ТекстОшибки;
	КонецЕсли;

	ЭлементОчереди.ТекстОшибки = ТекстОшибки;

	СтрокаРезультата = СтруктураИзменения();

	СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
	СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
	СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

	СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
	СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
	СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

	СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
	СтрокаРезультата.ПодготовленоКПередаче = Ложь;
	СтрокаРезультата.Передано              = Ложь;
	СтрокаРезультата.Принято               = Ложь;
	СтрокаРезультата.ОбъектИзменен         = Ложь;

	ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);

	ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);

КонецПроцедуры

Процедура ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена)
	
	СтрокаРезультата = СтруктураИзменения();
	
	СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
	СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
	СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
	
	СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
	СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
	СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
	
	СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
	СтрокаРезультата.ПодготовленоКПередаче = Ложь;
	СтрокаРезультата.Передано              = Ложь;
	СтрокаРезультата.Принято               = Истина;
	СтрокаРезультата.НовыйСтатус           = Неопределено;
	СтрокаРезультата.ОбъектИзменен         = Ложь;
	
	СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
	СтрокаРезультата.ТекстСообщения               = Неопределено;
	СтрокаРезультата.ПредставлениеПротоколаОбмена = Неопределено;
	
	ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
	
	ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
	
	СтрокаСтопЛист = ПараметрыОбмена.СтопЛист.Добавить();
	СтрокаСтопЛист.Организация = ЭлементОчереди.Организация;
	
КонецПроцедуры

Процедура ПроверитьКлючиСессии(СообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена)
	
	Если СообщенияПоОрганизациям = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СертификатыДляПодписанияНаСервере = Неопределено Тогда
		СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СообщенияПоОрганизациям Цикл
		
		Организация = КлючИЗначение.Ключ;
		Сообщения   = КлючИЗначение.Значение;
		
		Для Каждого Сообщение Из Сообщения Цикл
			
			Организация = Сообщение.Организация;
			Если Сообщение.Назначение = Перечисления.НазначениеСообщенийИСМП.ИСМП
				И ЗначениеЗаполнено(Сообщение.ТекстСообщенияJSON)
				Или Сообщение.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений Тогда
				
				ПараметрыЗапросаКлючаСессии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация);
				
			ИначеЕсли Сообщение.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами
				И Сообщение.Операция <> Перечисления.ВидыОперацийИСМП.ЗапросИдентификатораСоединенияСУЗ Тогда
				
				РезультатПолученияНастройки = НастройкаОбменаСУЗ(
					ПараметрыОбмена,
					Сообщение);
					
				Если Не РезультатПолученияНастройки.Успешно Тогда
					ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
				КонецЕсли;
				
				НастройкаОбмена = РезультатПолученияНастройки.НастройкаОбмена;
				
				Если Не ЗначениеЗаполнено(НастройкаОбмена.ИдентификаторСоединения) Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыЗапросаКлючаСессии = ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессииСУЗ(НастройкаОбмена);
				
			Иначе
				Продолжить;
			КонецЕсли;
			
			КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
				ПараметрыЗапросаКлючаСессии, Неопределено, Ложь);
	
			ТребуетсяОбновлениеКлючаСессии = (КлючСессии = Неопределено);
			Если ТребуетсяОбновлениеКлючаСессии Тогда
				
				Если ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено Тогда
					ПараметрыОбмена.КОбновлениюКлючейСессии = Новый Соответствие;
				КонецЕсли;
				
				Если Не ПараметрыЗапросаДобавленыКОбновлению(ПараметрыОбмена, ПараметрыЗапросаКлючаСессии, Сообщение) Тогда
					
					РезультатЗапроса = ИнтерфейсАвторизацииИСМПВызовСервера.ЗапроситьПараметрыАвторизации(ПараметрыЗапросаКлючаСессии);
					
					ПараметрыАвторизации = РезультатЗапроса.ПараметрыАвторизации;
					Если ПараметрыАвторизации = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю(РезультатЗапроса.ТекстОшибки);
						Продолжить;
					КонецЕсли;
					
					СтрокаСертификата = Неопределено;
					Если СертификатыДляПодписанияНаСервере <> Неопределено Тогда
						
						МенеджерКриптографии = СертификатыДляПодписанияНаСервере.МенеджерКриптографии;
						
						СтрокаСертификата = СертификатыДляПодписанияНаСервере.Сертификаты.Найти(
							Организация, "Организация");
						
					КонецЕсли;
					
					КлючСессииЗапрошенИУстановлен = Ложь;
					Если СтрокаСертификата <> Неопределено Тогда
						
						// Для авторизации требуется прикрепленная подпись
						ПараметрыCMS = ЭлектроннаяПодпись.ПараметрыCMS();
						ПараметрыCMS.Открепленная = Ложь;
						
						Если МенеджерКриптографии <> Неопределено Тогда
							МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = СтрокаСертификата.Пароль;
						КонецЕсли;
						
						РезультатПодписания = ИнтерфейсАвторизацииИСМПСлужебный.Подписать(
							ПараметрыАвторизации.Данные,
							ПараметрыCMS,
							СтрокаСертификата.СертификатКриптографии,
							МенеджерКриптографии);
						
						Если РезультатПодписания.Успех Тогда
							
							РезультатЗапросаИУстановкиКлючаСессии = ИнтерфейсАвторизацииИСМПСлужебный.ЗапроситьУстановитьКлючСессии(
								ПараметрыЗапросаКлючаСессии,
								ПараметрыАвторизации,
								РезультатПодписания.Подпись);
							
							КлючСессииЗапрошенИУстановлен = РезультатЗапросаИУстановкиКлючаСессии.КлючСессииУстановлен;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если Не КлючСессииЗапрошенИУстановлен Тогда
						
						ДобавитьКОбновлениюКлючейСесии(
							ПараметрыОбмена,
							Сообщение,
							ПараметрыЗапросаКлючаСессии,
							ПараметрыАвторизации)
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьОчередьСообщений(ПараметрыОбмена)
	
	СтруктураПоискаСтопЛист = Новый Структура("Организация");
	
	ПовторитьЦиклОбработкиСообщений  = Истина;
	
	МинимальноеКоличествоИтераций    = 0;
	МинимальнаяДатаСледующейОперации = Неопределено;
	
	Пока ПовторитьЦиклОбработкиСообщений Цикл
		
		ПовторитьЦиклОбработкиСообщений = Ложь;
		
		МинимальноеКоличествоИтераций    = 0;
		МинимальнаяДатаСледующейОперации = Неопределено;
		
		Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
			
			СтруктураПоискаСтопЛист.Организация = ЭлементОчереди.Организация;
			
			Если ПараметрыОбмена.СтопЛист.НайтиСтроки(СтруктураПоискаСтопЛист).Количество() > 0 Тогда
				// При выполнении обмена по организации были ошибки. Пропустим сообщения.
				Продолжить;
			КонецЕсли;
			
			ДатаСледующейИтерации = Неопределено;
			
			УстановитьПривилегированныйРежим(Истина);
			
			Если Не ЗначениеЗаполнено(ЭлементОчереди.ИдентификаторЗаявки) Тогда
				
				НайденныеЗависимости = Неопределено;
				Если СообщениеМожноПередавать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости, ДатаСледующейИтерации) Тогда
					
					ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена);
					
				ИначеЕсли НайденныеЗависимости <> Неопределено Тогда
					
					// Если зависимых сообщений нет в очереди - сообщение удаляется из очереди (Защита от зацикливания).
					Для Каждого НайденныеЗависимостиЭлементДанных Из НайденныеЗависимости Цикл
						Если ПараметрыОбмена.ОчередьСообщений.Найти(НайденныеЗависимостиЭлементДанных.Сообщение2, "Сообщение") = Неопределено Тогда
							ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				НайденныеЗависимости = Неопределено;
				Если СообщениеМожноЗагружать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости, ДатаСледующейИтерации) Тогда
					
					Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.ИСМП Тогда
						
						Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
							
							РезультатПолученияНастройки = НастройкаОбменаСУЗ(
								ПараметрыОбмена,
								ЭлементОчереди,
								Истина);
								
							Если Не РезультатПолученияНастройки.Успешно Тогда
								Если РезультатПолученияНастройки.ТребуетсяОбновлениеКлючаСессии Тогда
									Продолжить;
								Иначе
									ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
								КонецЕсли;
							КонецЕсли;
							
							ЗагрузитьРезультатОбработкиЗаказаНаЭмиссиюКодовМаркировкиИСМП(
								ЭлементОчереди, ПараметрыОбмена, РезультатПолученияНастройки.НастройкаОбмена);
							
						ИначеЕсли ЭтоЗапросСуществующихGTINНаОстатки(ЭлементОчереди, ПараметрыОбмена) Тогда
							ЗапроситьСуществующиеGTINНаОстатки(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Агрегация
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.Приемка
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонить
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулировать
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТК
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозливаРасчетСтатуса Тогда
							// Фиктивная операция по изменению статуса и записи протокола обмена
							ЗагрузитьРезультатОбработкиАбстрактнойОперации(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменениеРасчетСтатуса Тогда
							// Фиктивная операция по изменению статуса для трансформации агрегатов
							ЗагрузитьРезультатОбработкиАбстрактнойАгрегацииИзменениеРасчетСтатуса(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаАгент
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаБезвозмезднаяПередача
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаДляСобственныхНуждПокупателя 
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаКомиссия
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаПриобретениеГосПредприятием 
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаПродажа
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулирование
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКСоздание
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКИзменение
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АТКУдаление
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодключениеКОборудованиюРозлива Тогда
							ЗагрузитьРезультатОбработкиАгрегацииПриемкиОтгрузкиТоваров(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗагрузкаВходящихДокументов Тогда
							ЗагрузитьВходящиеДокументы(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки Тогда
							ЗагрузитьСодержаниеРезультатаОбработкиДокумента(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииПроверкаСтатусаКодовМаркировки Тогда
							ЗагрузитьРезультатОбработкиОтчетОбИспользованииКМРасчетСтатусаКодовМаркировки(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияПроверкаСтатусаОбработкиДокумента
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеПроверкаСтатусаОбработкиДокумента
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех Тогда
							ЗагрузитьРезультатПроверкаСтатусаОбработкиДокумента(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотРасчетСтатуса
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот Тогда
							//Фиктивная операция для расчета статуса по нескольким сообщениями.
							ЗагрузитьРезультатОбработкиАбстрактнойОперацииРасчетСтатуса(
								ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписаниеАннулирования
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписание Тогда
							ЗагрузитьРезультатПодписанияСогласия(ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетИСМПСведенияОбОтклонениях
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетИСМПСписокКИНаБалансе Тогда
							ЗагрузитьРезультатПолученияВыгрузки(ЭлементОчереди, ПараметрыОбмена);
						Иначе
							ЗагрузитьРезультатОбработкиДокумента(ЭлементОчереди, ПараметрыОбмена);
						КонецЕсли;
						
					ИначеЕсли ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами Тогда
						
						РезультатПолученияНастройки = НастройкаОбменаСУЗ(ПараметрыОбмена, ЭлементОчереди, Истина);
						Если Не РезультатПолученияНастройки.Успешно Тогда
							Если РезультатПолученияНастройки.ТребуетсяОбновлениеКлючаСессии Тогда
								Продолжить;
							Иначе
								ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
							КонецЕсли;
						КонецЕсли;
						НастройкаОбменаСУЗ = РезультатПолученияНастройки.НастройкаОбмена;
						
						Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
							// Фиктивная операция по изменению статуса и записи протокола обмена
							ЗагрузитьРезультатОбработкиЗаказаНаЭмиссиюКодовМаркировкиСУЗ(
								ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиРасчетСтатуса Тогда
							// Фиктивная операция для расчета статуса по нескольким сообщениями.
							ЗагрузитьРезультатОбработкиЗапросаЗаказНаЭмиссиюСУЗАбстрактнаяОперация(
								ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗ Тогда
							ЗагрузитьКодыМаркировки(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПолучениеКодовМаркировкиИзСУЗНезависимо Тогда
							ЗагрузитьКодыМаркировкиНезависимо(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеПолучениеКодовМаркировкиИзСУЗ Тогда
							ЗагрузитьКодыМаркировкиПовторно(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗакрытиеПодзаказаНаЭмиссиюКодовМаркировкиСУЗ Тогда
							ПередатьСообщениеОЗакрытииПодзаказаНаЭмиссиюКодовМаркировкиСУЗ(
								ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОбИспользованииРасчетСтатуса
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.АгрегацияРасчетСтатуса
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗРасчетСтатуса
							Или ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиРасчетСтатуса Тогда
							//Фиктивная операция для расчета статуса по нескольким сообщениями.
							ЗагрузитьРезультатОбработкиАбстрактнойОперацииРасчетСтатуса(
								ЭлементОчереди, ПараметрыОбмена);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборот Тогда
							ЗагрузитьРезультатОбработкиВводаВОборот(
								ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						ИначеЕсли ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.КвитанцияДокумента Тогда
							ЗагрузитьРезультатПолученияКвитанцииДокументаСУЗ(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						Иначе
							ЗагрузитьРезультатОбработкиОтчетаСУЗ(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ);
						КонецЕсли;
						
					Иначе
						ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
					КонецЕсли;
					
				ИначеЕсли НайденныеЗависимости <> Неопределено Тогда
					
					// Если зависимых сообщений нет в очереди - сообщение удаляется из очереди (Защита от зацикливания).
					Для Каждого НайденныеЗависимостиЭлементДанных Из НайденныеЗависимости Цикл
						Если ПараметрыОбмена.ОчередьСообщений.Найти(НайденныеЗависимостиЭлементДанных.Сообщение2, "Сообщение") = Неопределено Тогда
							ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДатаСледующейИтерации <> Неопределено
				И (МинимальнаяДатаСледующейОперации = Неопределено Или МинимальнаяДатаСледующейОперации > ДатаСледующейИтерации) Тогда
				МинимальнаяДатаСледующейОперации = ДатаСледующейИтерации;
			КонецЕсли;
			
			Если ЭлементОчереди.КоличествоИтераций < МинимальноеКоличествоИтераций Тогда
				МинимальноеКоличествоИтераций = ЭлементОчереди.КоличествоИтераций;
			КонецЕсли;
			
		КонецЦикла;
		
		// Действия после основного цикла очереди.
		Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОбработанныеЭлементыОчереди Цикл
			Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчереди) <> -1 Тогда
				ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчереди);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОбмена.ОбработанныеЭлементыОчереди.Очистить();
		
		Если МинимальнаяДатаСледующейОперации <> Неопределено
			И МинимальнаяДатаСледующейОперации < ТекущаяДатаСеанса() Тогда
			ПовторитьЦиклОбработкиСообщений = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МинимальнаяДатаСледующейОперации;
	
КонецФункции

Функция СообщениеМожноЗагружать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости = Неопределено, ДатаСледующейИтерации = Неопределено)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение); // Есть ли сообщения
	ПараметрыОтбора.Вставить("Загрузка",   Ложь);
	
	НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	ЕстьЗависимости = (НайденныеЗависимости.Количество() > 0);
	
	Если ЕстьЗависимости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяОбновлениеКлючаСессии = Ложь;
	Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.ИСМП
		Или ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами Тогда
		ТребуетсяОбновлениеКлючаСессии = ДанныеКОбновлениюКлючейСессииПрисутствуют(ПараметрыОбмена, ЭлементОчереди);
	Иначе
		ТребуетсяОбновлениеКлючаСессии = Ложь;
	КонецЕсли;
	
	Если ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяПодписание = Ложь;
	Если ПараметрыОбмена.СообщенияКПодписанию = Неопределено Тогда
		ТребуетсяПодписание = Ложь;
	Иначе
		ТребуетсяПодписание = (ПараметрыОбмена.СообщенияКПодписанию[ЭлементОчереди.Организация] <> Неопределено);
	КонецЕсли;

	Если ТребуетсяПодписание Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяОжидание = Не (ЭлементОчереди.ДатаСледующейИтерации = Неопределено
	                    Или ЭлементОчереди.ДатаСледующейИтерации < ТекущаяДатаСеанса());
	Если ТребуетсяОжидание Тогда
		
		ДатаСледующейИтерации = ЭлементОчереди.ДатаСледующейИтерации;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами Тогда
		
		РезультатПолученияНастройки = НастройкаОбменаСУЗ(
			ПараметрыОбмена,
			ЭлементОчереди);
		Если Не РезультатПолученияНастройки.Успешно Тогда
			Если РезультатПолученияНастройки.ТребуетсяОбновлениеКлючаСессии Тогда
				Возврат Ложь;
			Иначе
				ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		
		НастройкаОбменаСУЗ = РезультатПолученияНастройки.НастройкаОбмена;
		
		Если НастройкаОбменаСУЗ <> Неопределено Тогда
			
			ВремяОжидания = ИнтерфейсСУЗ.ВремяОжиданияСледующегоЗапросаСУЗ(НастройкаОбменаСУЗ);
			Если ВремяОжидания > 0 Тогда
				ДатаСледующейИтерации = ТекущаяДатаСеанса() + ВремяОжидания;
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПараметрыКонтроляАктивныхЗаказов(ПараметрыОбмена, ЭлементОчереди, Инициализация = Ложь)
	
	СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
	ПараметрыКонтроля         = ПараметрыОбмена.КонтрольКоличестваЗаказовСУЗ.Получить(СтанцияУправленияЗаказами);
	
	Если Инициализация И ПараметрыКонтроля = Неопределено Тогда
		
		ПараметрыКонтроля = НоваяСтруктураАктивныхЗаказовПоСУЗ();
		ПараметрыОбмена.КонтрольКоличестваЗаказовСУЗ.Вставить(СтанцияУправленияЗаказами, ПараметрыКонтроля);
		
	КонецЕсли;
	
	Возврат ПараметрыКонтроля;
	
КонецФункции

Функция ДанныеКОбновлениюКлючейСессииПрисутствуют(ПараметрыОбмена, ЭлементОчереди)
	
	Если ПараметрыОбмена.КОбновлениюКлючейСессии = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоллекцияПоОрганизации = ПараметрыОбмена.КОбновлениюКлючейСессии[ЭлементОчереди.Организация];
	Если КоллекцияПоОрганизации = Неопределено
		Или КоллекцияПоОрганизации.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СообщениеМожноПередавать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости = Неопределено, ДатаСледующейИтерации = Неопределено)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение);
	ПараметрыОтбора.Вставить("Передача",   Ложь);
	
	НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	ЕстьЗависимости = (НайденныеЗависимости.Количество() > 0);
	
	Если ЕстьЗависимости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений
		И ПараметрыОбмена.КОпределениюВидаУпаковки <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ТребуетсяОбновлениеКлючаСессии = Ложь;
	Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.ИСМП
		Или ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами Тогда
		ТребуетсяОбновлениеКлючаСессии = ДанныеКОбновлениюКлючейСессииПрисутствуют(ПараметрыОбмена, ЭлементОчереди);
	Иначе
		ТребуетсяОбновлениеКлючаСессии = Ложь;
	КонецЕсли;
	
	Если ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ТребуетсяПодписание
		И Не ЭлементОчереди.РеквизитыИсходящегоСообщения.Свойство("СвойстваПодписи") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяОжидание = Не (ЭлементОчереди.ДатаСледующейИтерации = Неопределено
	                    Или ЭлементОчереди.ДатаСледующейИтерации < ТекущаяДатаСеанса());
	Если ТребуетсяОжидание Тогда
		
		ДатаСледующейИтерации = ЭлементОчереди.ДатаСледующейИтерации;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЭлементОчереди.Назначение = Перечисления.НазначениеСообщенийИСМП.СтанцияУправленияЗаказами
		И ЭлементОчереди.Операция <> Перечисления.ВидыОперацийИСМП.ЗапросИдентификатораСоединенияСУЗ Тогда
		
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки
			И ЭлементОчереди.ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			
			ПараметрыКонтроля = ПараметрыКонтроляАктивныхЗаказов(ПараметрыОбмена, ЭлементОчереди);
			
			Если ПараметрыКонтроля <> Неопределено Тогда
				
				ВремяСледующегоЗапроса = ПараметрыКонтроля.ДатаПоследнегоЗапросаПревышения + ПериодичностьОтправкиЗаказовПослеПревышения();
				
				НаступилоВремяОбмена = (ВремяСледующегоЗапроса <= ТекущаяДатаСеанса());
				СУЗПолный = (ПараметрыКонтроля.ТекущееКоличествоЗаказов >= МаксимальноеКоличествоЗаказовВОчередиСУЗ());
				
				Если Не НаступилоВремяОбмена И СУЗПолный Тогда
					ДатаСледующейИтерации = ВремяСледующегоЗапроса;
					Возврат Ложь;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		РезультатПолученияНастройки = НастройкаОбменаСУЗ(
			ПараметрыОбмена,
			ЭлементОчереди);
		
		Если Не РезультатПолученияНастройки.Успешно Тогда
			Если РезультатПолученияНастройки.ТребуетсяОбновлениеКлючаСессии Тогда
				Возврат Ложь;
			Иначе
				ВызватьИсключение РезультатПолученияНастройки.ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		
		НастройкаОбменаСУЗ = РезультатПолученияНастройки.НастройкаОбмена;
		
		Если НастройкаОбменаСУЗ <> Неопределено Тогда
			
			ВремяОжидания = ИнтерфейсСУЗ.ВремяОжиданияСледующегоЗапросаСУЗ(НастройкаОбменаСУЗ);
			Если ВремяОжидания > 0 Тогда
				ДатаСледующейИтерации = ТекущаяДатаСеанса() + ВремяОжидания;
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДоступныеСертификаты(СообщенияПоОрганизациям, ДоступныеСертификаты = Неопределено)
	
	Если СообщенияПоОрганизациям = Неопределено Тогда
		Возврат ДоступныеСертификаты;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СообщенияПоОрганизациям Цикл
		
		Организация = КлючИЗначение.Ключ;
		
		Если ДоступныеСертификаты = Неопределено Тогда
			ДоступныеСертификаты = Новый Соответствие;
		КонецЕсли;
		
		СертификатыПользователяДляПодписиПоОрганизации = ДоступныеСертификаты[Организация];
		Если СертификатыПользователяДляПодписиПоОрганизации = Неопределено Тогда
			ДоступныеСертификаты.Вставить(
				Организация,
				ИнтеграцияИС.СертификатыПользователяДляПодписиПоОрганизации(Организация, Истина));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныеСертификаты;
	
КонецФункции

Функция СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена)
	
	ПодписанныеСообщенияПоОрганизациям = Неопределено;
	
	Для Каждого СообщениеJSON Из СообщенияJSON Цикл
		
		ТребуетсяПодписание = СообщениеJSON.ТребуетсяПодписание И Не ЗначениеЗаполнено(СообщениеJSON.ТекстОшибки);
		
		СтрокаСертификата = Неопределено;
		Если СертификатыДляПодписанияНаСервере <> Неопределено И ТребуетсяПодписание Тогда
			
			МенеджерКриптографии = СертификатыДляПодписанияНаСервере.МенеджерКриптографии;
			
			СтрокаСертификата = СертификатыДляПодписанияНаСервере.Сертификаты.Найти(
				СообщениеJSON.Организация,
				"Организация");
			
		КонецЕсли;
		
		Если (ТребуетсяПодписание
			И СтрокаСертификата <> Неопределено) Или Не ТребуетсяПодписание Тогда
			
			Если ТребуетсяПодписание Тогда
				
				// Для подписания документов требуется открепленная подпись
				ПараметрыCMS = ЭлектроннаяПодпись.ПараметрыCMS();
				ПараметрыCMS.Открепленная = Истина;
				
				Если МенеджерКриптографии <> Неопределено Тогда
					МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = СтрокаСертификата.Пароль;
				КонецЕсли;
				
				РезультатПодписания = ИнтерфейсАвторизацииИСМПСлужебный.Подписать(
					СообщениеJSON.ТекстСообщенияJSON,
					ПараметрыCMS,
					СтрокаСертификата.СертификатКриптографии,
					МенеджерКриптографии);
				
				Если РезультатПодписания.Успех Тогда
					
					ТребуетсяПодписание = Ложь;
					
					СвойстваПодписи = Новый Структура;
					СвойстваПодписи.Вставить("Подпись", РезультатПодписания.Подпись);
					СообщениеJSON.Вставить("СвойстваПодписи", СвойстваПодписи);
					
					Если ПодписанныеСообщенияПоОрганизациям = Неопределено Тогда
						ПодписанныеСообщенияПоОрганизациям = Новый Соответствие;
					КонецЕсли;
					
					ПодписанныеСообщения = ПодписанныеСообщенияПоОрганизациям[СообщениеJSON.Организация];
					Если ПодписанныеСообщения = Неопределено Тогда
						ПодписанныеСообщенияПоОрганизациям.Вставить(СообщениеJSON.Организация, Новый Массив);
					КонецЕсли;
					
					ПодписанныеСообщенияПоОрганизациям[СообщениеJSON.Организация].Добавить(СообщениеJSON);
					
				КонецЕсли;
				
			Иначе
				
				Если ПодписанныеСообщенияПоОрганизациям = Неопределено Тогда
					ПодписанныеСообщенияПоОрганизациям = Новый Соответствие;
				КонецЕсли;
				
				ПодписанныеСообщения = ПодписанныеСообщенияПоОрганизациям[СообщениеJSON.Организация];
				Если ПодписанныеСообщения = Неопределено Тогда
					ПодписанныеСообщенияПоОрганизациям.Вставить(СообщениеJSON.Организация, Новый Массив);
				КонецЕсли;
				
				ПодписанныеСообщенияПоОрганизациям[СообщениеJSON.Организация].Добавить(СообщениеJSON);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТребуетсяПодписание Тогда
			
			Если ПараметрыОбмена.СообщенияКПодписанию = Неопределено Тогда
				ПараметрыОбмена.СообщенияКПодписанию = Новый Соответствие;
			КонецЕсли;
			
			СообщенияКПодписанию = ПараметрыОбмена.СообщенияКПодписанию[СообщениеJSON.Организация];
			Если СообщенияКПодписанию = Неопределено Тогда
				ПараметрыОбмена.СообщенияКПодписанию.Вставить(СообщениеJSON.Организация, Новый Массив);
			КонецЕсли;
			
			ПараметрыОбмена.СообщенияКПодписанию[СообщениеJSON.Организация].Добавить(СообщениеJSON);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПодписанныеСообщенияПоОрганизациям;
	
КонецФункции

Функция СообщенияКОпределениюВидаУпаковок(ПараметрыОбмена)

	СообщенияКОпределениюВидаУпаковки = Новый Соответствие;

	Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.ПовторноеФормированиеСообщений Тогда
			СообщенияПоОрганизации = СообщенияКОпределениюВидаУпаковки[ЭлементОчереди.Организация];
			Если СообщенияПоОрганизации = Неопределено Тогда
				СообщенияПоОрганизации = Новый Массив;
				СообщенияКОпределениюВидаУпаковки.Вставить(ЭлементОчереди.Организация, СообщенияПоОрганизации);
			КонецЕсли;
			СообщенияПоОрганизации.Добавить(ЭлементОчереди.РеквизитыИсходящегоСообщения);
		КонецЕсли;
	КонецЦикла;

	Возврат СообщенияКОпределениюВидаУпаковки;

КонецФункции

Функция НастройкаОбменаСУЗ(ПараметрыОбмена, ЭлементОчереди, ПроверятьДоступность = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Успешно",                        Истина);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("НастройкаОбмена",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	НастройкиПоОрганизации = ПараметрыОбмена.НастройкиОбменаСУЗ.ОбменНаСервере.Получить(ЭлементОчереди.Организация);
	
	Если НастройкиПоОрганизации <> Неопределено Тогда
		
		НастройкаБезПроизводственногоОбъекта = Неопределено;
		
		Для Каждого НастройкаОбмена Из НастройкиПоОрганизации Цикл
			
			Если ЗначениеЗаполнено(ЭлементОчереди.СтанцияУправленияЗаказами)
				И ЭлементОчереди.СтанцияУправленияЗаказами <> НастройкаОбмена.СтанцияУправленияЗаказами Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НастройкаОбмена.ПроизводственныйОбъект) Тогда
				НастройкаБезПроизводственногоОбъекта = НастройкаОбмена;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЭлементОчереди.ПроизводственныйОбъект)
				Или НастройкаОбмена.ПроизводственныйОбъект = ЭлементОчереди.ПроизводственныйОбъект Тогда
				ВозвращаемоеЗначение.НастройкаОбмена = НастройкаОбмена;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВозвращаемоеЗначение.НастройкаОбмена = Неопределено
			И НастройкаБезПроизводственногоОбъекта <> Неопределено Тогда
			ВозвращаемоеЗначение.НастройкаОбмена = НастройкаБезПроизводственногоОбъекта;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВозвращаемоеЗначение.НастройкаОбмена = Неопределено Тогда
		
		ВозвращаемоеЗначение.Успешно     = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось определить активную настройку СУЗ для документа: %1
			           |Проверьте производственный объект, идентификатор соединения в настройках подключения к СУЗ.'"),
			ЭлементОчереди.Документ);
		
	ИначеЕсли ПроверятьДоступность Тогда
		
		РезультатПроверкиСУЗ = ИнтерфейсСУЗ.ПроверитьДоступностьСУЗ_V2(
			ЭлементОчереди.ВидПродукции,
			ВозвращаемоеЗначение.НастройкаОбмена);
			
		Если ТребуетсяОбновлениеКлючаСессии(РезультатПроверкиСУЗ, ЭлементОчереди, ПараметрыОбмена) Тогда
			ВозвращаемоеЗначение.Успешно                        = Ложь;
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Требуется обновление ключа сессии СУЗ: %1
				           |для документа: %2'"),
				ВозвращаемоеЗначение.НастройкаОбмена.СтанцияУправленияЗаказами,
				ЭлементОчереди.Документ);
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Если Не РезультатПроверкиСУЗ.Доступен
			Или ЗначениеЗаполнено(РезультатПроверкиСУЗ.ТекстОшибки) Тогда
			
			ВозвращаемоеЗначение.Успешно = Ложь;
			
			Если ЗначениеЗаполнено(РезультатПроверкиСУЗ.ТекстОшибки) Тогда
				ВозвращаемоеЗначение.ТекстОшибки = РезультатПроверкиСУЗ.ТекстОшибки;
			Иначе
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось определить доступность СУЗ: %1 (%2)
					           |для документа: %3'"),
					ВозвращаемоеЗначение.НастройкаОбмена.СтанцияУправленияЗаказами,
					ЭлементОчереди.ПроизводственныйОбъект,
					ЭлементОчереди.Документ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗаголовкиИзHTTPОтвета(HTTPОтвет) Экспорт
	
	ОтветЗаголовки = Новый Массив;
	
	ИгноруемыеЗаголовки = Новый Соответствие;
	ИгноруемыеЗаголовки.Вставить(ВРег("Set-Cookie"),             Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Expires"),                Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Via"),                    Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Connection"),             Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Proxy-Connection"),       Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Server"),                 Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Vary"),                   Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("X-Frame-Options"),        Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Transfer-Encoding"),      Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Pragma"),                 Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("X-Content-Type-Options"), Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("X-XSS-Protection"),       Истина);
	ИгноруемыеЗаголовки.Вставить(ВРег("Cache-Control"),          Истина);
	
	Для Каждого КлючИЗначение Из HTTPОтвет.Заголовки Цикл
		Заголовок = КлючИЗначение.Ключ;
		Если ИгноруемыеЗаголовки[ВРег(Заголовок)] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОтветЗаголовки.Добавить(
			СтрШаблон("%1: %2", Заголовок, КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(ОтветЗаголовки, Символы.ПС);
	
КонецФункции

Функция ПодписьИзСвойствПодписи(ВходящиеДанные) Экспорт

	Если ТипЗнч(ВходящиеДанные) = Тип("Строка") Тогда
		СвойстваПодписи = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	Иначе
		СвойстваПодписи = ВходящиеДанные;
	КонецЕсли;

	Если ТипЗнч(СвойстваПодписи) = Тип("Структура") Тогда
		Подпись = СвойстваПодписи.Подпись;
	Иначе
		Подпись = "";
	КонецЕсли;

	Возврат Подпись;

КонецФункции

Функция КонвертированныйОбщийСтатусДокумента(ИсходныйСтатус, Документ)

	МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(Документ);
	Возврат МенеджерОбъекта.КонвертированныйОбщийСтатус(ИсходныйСтатус);

КонецФункции

Функция РазобратьТекстОшибки(Знач ТекстОшибки, ЗаголовокОшибки) Экспорт
	
	НомерНачальногоСимвола = СтрНайти(ТекстОшибки, "{");
	Если НомерНачальногоСимвола = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерКонечногоСимвола = СтрНайти(ТекстОшибки, "}");
	Если НомерКонечногоСимвола = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаголовокОшибки = Лев(ТекстОшибки, НомерНачальногоСимвола -1);
	
	ТекстОшибкиJSON = Сред(ТекстОшибки, НомерНачальногоСимвола, НомерКонечногоСимвола - НомерНачальногоСимвола + 1);
	Возврат ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(ТекстОшибкиJSON, Ложь);
	
КонецФункции

// Выполняет разбор кода маркировки для бизнес заказа.
//
// Параметры:
//   КодМаркировки            - Строка                - код маркировки.
//   СтрокаЗаказаНаЭмиссию    - СтрокаТаблицыЗначений - Строка таблицы Товары заказа на эмиссию.
//   КэшРазбораКодаМаркировки - Неопределено          - Заполняется служебными данными при первом вызове.
// Возвращаемое значение:
//    Структура:
//     * НормализованныйКодМаркировки - Строка.
//     * ТипШтрихкода - ПеречислениеСсылка.ТипыШтрихкодов.
//     * СрокГодности - Дата - Актуально только для молочной продукции.
//
Функция РазобратьКодМаркировкиДляБизнесЗаказа(КодМаркировки, СтрокаЗаказаНаЭмиссию, КэшРазбораКодаМаркировки)
	
	ВидПродукции = СтрокаЗаказаНаЭмиссию.ВидПродукции;
	// Предполагаем, что:
	// 1. В коде маркировки, до "Серийного номера", отсутствуют недопустимые символы (СУЗ передает качественные коды).
	// 2. Коды маркировки однотипные и разбираются по одному шаблону.
	// Полный разбор кода маркировки выполняем один раз, при первом вызове. При последующих вызовах,
	// из кода маркировки получаем только "Серийный номер" по позиции в шаблоне.
	
	Если КэшРазбораКодаМаркировки = Неопределено Тогда
		
		Настройки = РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(ВидПродукции);
		
		ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
		ПользовательскиеПараметрыРазбораКодаМаркировки.РасширеннаяДетализация = Истина;
		
		ПримечаниеКРезультатуРазбора = Неопределено;
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(
			КодМаркировки, ВидПродукции, ПримечаниеКРезультатуРазбора, Настройки, ПользовательскиеПараметрыРазбораКодаМаркировки);
		
		Если ДанныеРазбора = Неопределено Тогда
			
			ВызватьИсключение СтрШаблон(
				НСтр("ru ='Не удалось разобрать код маркировки: %1
				          |%2'"),
				СтрЗаменить(КодМаркировки, Символ(29), "<GS>"),
				ПримечаниеКРезультатуРазбора.ТекстОшибки);
			
		ИначеЕсли Не ЗначениеЗаполнено(ДанныеРазбора.Детализация.ШаблонРазбораКодаМаркировки) Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru ='Не удалось определить шаблон кода маркировки: %1'"),
				КодМаркировки);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеРазбора.ВидУпаковки) Тогда
			ВидУпаковкиШаблона = ИнтеграцияИСМПСлужебныйКлиентСервер.ВидУпаковкиПоШаблонуКодаМаркировки(СтрокаЗаказаНаЭмиссию.Шаблон);
			Если Не РазборКодаМаркировкиИССлужебныйКлиентСервер.ВидУпаковкиСоответствуетРазбору(ВидПродукции, ВидУпаковкиШаблона, ДанныеРазбора) Тогда
				
				ВызватьИсключение СтрШаблон(
					НСтр("ru ='Не удалось определить вид упаковки в код маркировки: %1
				              |%2'"),
				СтрЗаменить(КодМаркировки, Символ(29), "<GS>"),
				ПримечаниеКРезультатуРазбора.ТекстОшибки);
				
			КонецЕсли;
			ДанныеРазбора.ВидУпаковки = ВидУпаковкиШаблона;
		КонецЕсли;
		
		СрокГодности = '00010101';
		Если ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС Тогда
			Если ДанныеРазбора.СоставКодаМаркировки.Свойство("ГоденДо")
				И ЗначениеЗаполнено(ДанныеРазбора.СоставКодаМаркировки.ГоденДо) Тогда
				СрокГодности = ДанныеРазбора.СоставКодаМаркировки.ГоденДо;
			КонецЕсли;
		КонецЕсли;
		
		ПозицииЭлементовКодаМаркировки = Настройки.ШаблоныИОписанияВидовПродукции[ДанныеРазбора.Детализация.ШаблонРазбораКодаМаркировки].ПозицииЭлементовКодаМаркировки;
		
		НормализованныйКодМаркировки = ДанныеРазбора.НормализованныйКодМаркировки;
		Если ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
			ПараметрыНормализации        = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляСохраненияВПул();
			НормализованныйКодМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				ДанныеРазбора,
				ВидПродукции,
				ПараметрыНормализации);
		КонецЕсли;
		
		КодМаркировкиДляНормализации = СтрЗаменить(НормализованныйКодМаркировки, ДанныеРазбора.СоставКодаМаркировки.СерийныйНомер, "СерийныйНомер");
		
		ИмяСвойстваПозиции = "ПозицияЗначения";
		Если СтрНачинаетсяС(КодМаркировки, "(") Тогда
			ИмяСвойстваПозиции = "ПозицияЗначенияСоСкобкой";
		КонецЕсли;
		
		КэшРазбораКодаМаркировки = Новый Структура;
		КэшРазбораКодаМаркировки.Вставить("ТипШтрихкода",                 ДанныеРазбора.ТипШтрихкода);
		КэшРазбораКодаМаркировки.Вставить("СерийныйНомерДлинаЗначения",   ПозицииЭлементовКодаМаркировки["СерийныйНомер"].ДлинаЗначения);
		КэшРазбораКодаМаркировки.Вставить("СерийныйНомерПозицияЗначения", ПозицииЭлементовКодаМаркировки["СерийныйНомер"][ИмяСвойстваПозиции]);
		КэшРазбораКодаМаркировки.Вставить("КодМаркировкиДляНормализации", КодМаркировкиДляНормализации);
		КэшРазбораКодаМаркировки.Вставить("СрокГодности",                 СрокГодности);
		РезультатРазбора = Новый Структура;
		РезультатРазбора.Вставить("ТипШтрихкода",                 ДанныеРазбора.ТипШтрихкода);
		РезультатРазбора.Вставить("НормализованныйКодМаркировки", НормализованныйКодМаркировки);
		РезультатРазбора.Вставить("СрокГодности",                 СрокГодности);
		
		Возврат РезультатРазбора;
		
	КонецЕсли;
	
	СерийныйНомер = Сред(КодМаркировки, КэшРазбораКодаМаркировки.СерийныйНомерПозицияЗначения, КэшРазбораКодаМаркировки.СерийныйНомерДлинаЗначения);
	НормализованныйКодМаркировки = СтрЗаменить(КэшРазбораКодаМаркировки.КодМаркировкиДляНормализации, "СерийныйНомер", СерийныйНомер);
	
	РезультатРазбора = Новый Структура;
	РезультатРазбора.Вставить("ТипШтрихкода",                 КэшРазбораКодаМаркировки.ТипШтрихкода);
	РезультатРазбора.Вставить("НормализованныйКодМаркировки", НормализованныйКодМаркировки);
	РезультатРазбора.Вставить("СрокГодности",                 КэшРазбораКодаМаркировки.СрокГодности);
	
	Возврат РезультатРазбора;
	
КонецФункции

Процедура ЗаписатьЛогЗапросовВоВременноеХранилищеВозвращаемогоЗначения(ПараметрыОбмена, Приемник) Экспорт
	
	Если ИнтеграцияИСКлиентСерверПовтИсп.ЭтоФоновоеЗаданиеНаСервере() Тогда
		ПараметрыЛогирования = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
		Если ПараметрыЛогирования.Включено Тогда
			ДанныеЛогаЗапросов = ЛогированиеЗапросовИС.СодержаниеЛогаЗапросов(ПараметрыЛогирования);
			Если ДанныеЛогаЗапросов <> Неопределено Тогда
				ПараметрыОбмена.АдресДанныхЛогаЗапроса = ПоместитьВоВременноеХранилище(ДанныеЛогаЗапросов, ПараметрыОбмена.АдресДанныхЛогаЗапроса);
				Приемник.АдресДанныхЛогаЗапроса = ПараметрыОбмена.АдресДанныхЛогаЗапроса;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СообщениеКПередачеJSONСогласиеОПредоставлениеИнформации(ПараметрыОбработкиДокумента, ДополнительныеПараметры)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ХешСумма", ПараметрыОбработкиДокумента.ХешСумма);
	
	СообщенияJSON = Новый Массив;
	
	НомерВерсии = Неопределено;
	Операция    = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформации;

	СообщениеJSON = ИнтеграцияИСМПСлужебный.СтруктураСообщенияJSON();
	СообщениеJSON.Организация       = ПараметрыОбработкиДокумента.Организация;
	СообщениеJSON.Документ          = ПараметрыОбработкиДокумента.Ссылка;
	СообщениеJSON.ДокументОснование = Неопределено;
	
	СообщениеJSON.Описание = НСтр("ru = 'Обновление документа согласия о предоставлении информации в ГИС МТ (абстрактная операция)'");
	
	СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	СообщениеJSON.Версия              = НомерВерсии;
	СообщениеJSON.ТребуетсяПодписание = Ложь;
	
	СообщениеJSON.Операция                  = Операция;
	СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.ИСМП;
	СообщениеJSON.СтанцияУправленияЗаказами = Неопределено;
	СообщениеJSON.ПараметрыЗапроса          = ПараметрыЗапроса;
	СообщенияJSON.Добавить(СообщениеJSON);
	
	Возврат СообщенияJSON;
	
КонецФункции

Процедура ПодготовитьСообщенияПоАбстрактнойОперацииСогласиеОПредоставлениеИнформации(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	Результат = СогласиеОПредоставленииИнформацииГИСМТ.ПодготовитьСообщенияПоАбстрактнойОперацииСогласиеОПредоставлениеИнформации(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей);
	
	Если ТребуетсяОбновлениеКлючаСессии(Результат, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	СообщенияJSON = Результат.СообщенияJSON;
	
	Если СообщенияJSON.Количество() = 0 Тогда
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		Возврат;
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
	
	// Добавить подписанные сообщения в очередь сообщений
	ПодготовитьПодписанныеСообщенияКПередаче(
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	ИдентификаторЗаявки = СтроковоеПредставлениеПустогоУникальногоИдентификатора();
	ОбновитьИдентификаторЗаявкиСообщенияОчереди(
		НаборЗаписей,
		ИдентификаторЗаявки,
		Неопределено,
		Неопределено);
	
	ЭлементОчереди.ИдентификаторЗаявки = ИдентификаторЗаявки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	
КонецПроцедуры

Процедура ЗагрузитьРезультатПодписанияСогласия(ЭлементОчереди, ПараметрыОбмена)
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	
	РезультатПодписанияСогласия = СогласиеОПредоставленииИнформацииГИСМТ.РезультатПодписанияСогласия(
		ЭлементОчереди.Организация, ЭлементОчереди.Операция, ЭлементОчереди.ИдентификаторЗаявки);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатПодписанияСогласия, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	НовыйСтатус = СогласиеОПредоставленииИнформацииГИСМТ.ОбновитьСтатусПослеПодписанияСогласия(
		ЭлементОчереди,
		РезультатПодписанияСогласия,
		ПараметрыОбмена);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
		НаборЗаписейОснования.Прочитать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(ЭлементОчередиОснование, РезультатПодписанияСогласия);
		
		Если РезультатПодписанияСогласия.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатПодписанияСогласия.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			
			СтрокаРезультата = СтруктураИзменения();
			
			СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
			СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
			СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
			
			СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
			СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
			СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
			
			СтрокаРезультата.ТекстОшибки           = РезультатПодписанияСогласия.ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Ложь;
			СтрокаРезультата.Передано              = Ложь;
			СтрокаРезультата.Принято               = Истина;
			СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
			СтрокаРезультата.ОбъектИзменен         = Ложь;
			
			СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
			СтрокаРезультата.ТекстСообщения               = РезультатПодписанияСогласия.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
			СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
			
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписание Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			КонецЕсли;
			
		Иначе
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
		КонецЕсли;
		
		Если РезультатПодписанияСогласия.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			И ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписаниеАннулирования Тогда
			
			Результат = СогласиеОПредоставленииИнформацииГИСМТ.ПодготовитьСообщенияПоАбстрактнойОперацииСогласиеОПредоставлениеИнформации(ЭлементОчереди, ПараметрыОбмена, Неопределено);
			
			Если ТребуетсяОбновлениеКлючаСессии(Результат, ЭлементОчереди, ПараметрыОбмена) Тогда
				Возврат;
			КонецЕсли;
			
			СообщенияJSON = Результат.СообщенияJSON;
			
			Если СообщенияJSON.Количество() > 0 Тогда
				
				СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
				ПодписанныеСообщенияПоОрганизациям = СообщенияКПередаче(СообщенияJSON, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
				
				ПроверитьКлючиСессии(ПодписанныеСообщенияПоОрганизациям, СертификатыДляПодписанияНаСервере, ПараметрыОбмена);
				
				// Добавить подписанные сообщения в очередь сообщений
				ПодготовитьПодписанныеСообщенияКПередаче(
					ПодписанныеСообщенияПоОрганизациям,
					ПараметрыОбмена);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибкиЖурналРегистрации = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатПодписанияСогласия.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатПодписанияСогласия.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		Если ЭлементОчереди.Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписание Тогда
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
		КонецЕсли;
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

#Область ЧастичноеВыбытие

Функция ПредставлениеНастройкиВариантаУчетаПоВидуПродукции(ВидПродукции, ВариантУчета) Экспорт
	
	Если ВариантУчета = Перечисления.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура Тогда
		Возврат НСтр("ru = 'Применяется разупаковка с передачей в торговый зал'");
	Иначе
		Если ВидПродукции = Перечисления.ВидыПродукцииИС.Духи Тогда
			Возврат НСтр("ru = 'Поддерживается продажа духов (туалетной воды) на разлив'");
		ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Возврат НСтр("ru = 'Поддерживается поштучная продажа сигар (сигарилл, ...) из упаковки'");
		ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво Тогда
			Возврат НСтр("ru = 'Поддерживается продажа пива на разлив'");
		Иначе
			Возврат НСтр("ru = 'Поддерживается частичное выбытие'");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Заменяет Неопределено на пустую строку для работы с соответствием
Функция КлючСоответствия(КлючИлиНеопределено)
	Если КлючИлиНеопределено = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат КлючИлиНеопределено;
КонецФункции

// Проверяет на соответствие табличной части "Товары" списку штрихкодов упаковок.
// 
// Параметры:
//  Товары - ТабличнаяЧасть - Табличная часть, где хранится список товаров маркируемой продукции.
//  СписокУпаковок - Массив из СправочникСсылка.ШтрихкодыУпаковокТоваров - список связанных штрихкодов упаковок.
//  ПараметрыСканирования - Структура - См. ПараметрыСканирования.
// Возвращаемое значение:
//  Структура - 
Функция ТаблицаТоварыСоответствуетСпискуУпаковокМаркируемойПродукции(Товары, СписокУпаковок, ПараметрыСканирования) Экспорт
	
	РезультатПроверки = Новый Структура("ДанныеСоответствуют, СтрокиСРасхождением", Истина, Новый Массив);
	
	ЕстьКолонкаКоличестваКодов = Товары.ВыгрузитьКолонки().Колонки.Найти("КоличествоПотребительскихУпаковок") <> Неопределено;
	ДанныеПоШтрихкодам = ЭлектронноеВзаимодействиеИСМП.Содержимое(СписокУпаковок,,ПараметрыСканирования.СозданиеНаборов);
	
	ДанныеДляПроверки = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Ключ = КлючСоответствия(СтрокаТЧ.Номенклатура);
		СоответствиеНоменклатура = ДанныеДляПроверки.Получить(Ключ);
		Если СоответствиеНоменклатура = Неопределено Тогда
			СоответствиеНоменклатура = Новый Соответствие;
			ДанныеДляПроверки.Вставить(Ключ, СоответствиеНоменклатура);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Характеристика);
		СоответствиеХарактеристика = СоответствиеНоменклатура.Получить(Ключ);
		Если СоответствиеХарактеристика = Неопределено Тогда
			СоответствиеХарактеристика = Новый Соответствие;
			СоответствиеНоменклатура.Вставить(Ключ, СоответствиеХарактеристика);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Серия);
		ДанныеСерия = СоответствиеХарактеристика.Получить(Ключ);
		Если ДанныеСерия = Неопределено Тогда
			ДанныеСерия = Новый Структура("НомераСтрок,Количество,Факт,Кодов,КодовФакт", Новый Массив, 0, 0, 0, 0);
		КонецЕсли;
		
		ДанныеСерия.НомераСтрок.Добавить(СтрокаТЧ.НомерСтроки);
		ДанныеСерия.Количество = ДанныеСерия.Количество + СтрокаТЧ.Количество;
		Если ЕстьКолонкаКоличестваКодов Тогда
			ДанныеСерия.Кодов = ДанныеСерия.Кодов + СтрокаТЧ.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		СоответствиеХарактеристика.Вставить(Ключ, ДанныеСерия);
		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ДанныеПоШтрихкодам Цикл
		
		Ключ = КлючСоответствия(СтрокаТЧ.Номенклатура);
		СоответствиеНоменклатура = ДанныеДляПроверки.Получить(Ключ);
		Если СоответствиеНоменклатура = Неопределено Тогда
			СоответствиеНоменклатура = Новый Соответствие;
			ДанныеДляПроверки.Вставить(Ключ, СоответствиеНоменклатура);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Характеристика);
		СоответствиеХарактеристика = СоответствиеНоменклатура.Получить(Ключ);
		Если СоответствиеХарактеристика = Неопределено Тогда
			СоответствиеХарактеристика = Новый Соответствие;
			СоответствиеНоменклатура.Вставить(Ключ, СоответствиеХарактеристика);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Серия);
		ДанныеСерия = СоответствиеХарактеристика.Получить(Ключ);
		Если ДанныеСерия = Неопределено Тогда
			ДанныеСерия = Новый Структура("НомераСтрок,Количество,Факт,Кодов,КодовФакт", Новый Массив, 0, 0, 0, 0);
		КонецЕсли;
		
		ДанныеСерия.Факт = ДанныеСерия.Факт + СтрокаТЧ.Количество;
		Если ЕстьКолонкаКоличестваКодов Тогда
			ДанныеСерия.КодовФакт = ДанныеСерия.КодовФакт + СтрокаТЧ.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		СоответствиеХарактеристика.Вставить(Ключ, ДанныеСерия);
		
	КонецЦикла;
	
	ШаблонРасхождение = Новый Структура("НомерСтроки, Номенклатура, Необходимо, Указано, Поле, Представление", -1);
	Для Каждого КлючиНоменклатура Из ДанныеДляПроверки Цикл
		Для Каждого КлючиХарактеристика Из КлючиНоменклатура.Значение Цикл
			Для Каждого КлючиСерия Из КлючиХарактеристика.Значение Цикл
				ДанныеСерии = КлючиСерия.Значение;
				Если (ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара Или ДанныеСерии.Кодов = 0)
						И ДанныеСерии.Количество <> ДанныеСерии.Факт Тогда
					РезультатПроверки.ДанныеСоответствуют = Ложь;
					СтрокаСРасхождением = ОбщегоНазначения.СкопироватьРекурсивно(ШаблонРасхождение);
					СтрокаСРасхождением.Поле = "КоличествоУпаковок";
					СтрокаСРасхождением.Представление = НСтр("ru = 'количество'");
					СтрокаСРасхождением.Номенклатура = КлючиНоменклатура.Ключ;
					СтрокаСРасхождением.Необходимо = ДанныеСерии.Количество;
					СтрокаСРасхождением.Указано = ДанныеСерии.Факт;
					Если ДанныеСерии.НомераСтрок.Количество() Тогда
						СтрокаСРасхождением.НомерСтроки = ДанныеСерии.НомераСтрок[0];
					КонецЕсли;
					РезультатПроверки.СтрокиСРасхождением.Добавить(СтрокаСРасхождением);
				КонецЕсли;
				Если (ЕстьКолонкаКоличестваКодов И ДанныеСерии.Кодов > 0)
						И ДанныеСерии.Кодов <> ДанныеСерии.КодовФакт Тогда
					РезультатПроверки.ДанныеСоответствуют = Ложь;
					СтрокаСРасхождением = ОбщегоНазначения.СкопироватьРекурсивно(ШаблонРасхождение);
					СтрокаСРасхождением.Поле = "КоличествоПотребительскихУпаковок";
					СтрокаСРасхождением.Представление = НСтр("ru = 'количество кодов'");
					СтрокаСРасхождением.Номенклатура = КлючиНоменклатура.Ключ;
					СтрокаСРасхождением.Необходимо = ДанныеСерии.Кодов;
					СтрокаСРасхождением.Указано = ДанныеСерии.КодовФакт;
					Если ДанныеСерии.НомераСтрок.Количество() Тогда
						СтрокаСРасхождением.НомерСтроки = ДанныеСерии.НомераСтрок[0];
					КонецЕсли;
					РезультатПроверки.СтрокиСРасхождением.Добавить(СтрокаСРасхождением);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

Процедура ОтложитьОбработкуЭлементаОчереди(ЭлементОчереди, ПараметрыОбмена, КоличествоМинут = 5)

	Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
		ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	// Если с момента последнего изменения статуса прошло более КоличествоМинут минут,
	// то отложим обработку элемента очереди до следующей попытки обмена.
	Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
		И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= КоличествоМинут * 60 Тогда
		ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
	Иначе
		УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
	КонецЕсли;

КонецПроцедуры

Функция ТребуетсяОжиданиеОбработкиКвитанции(ЭлементОчереди, ПовторныйЗапросКвитанции) Экспорт
	
	Если ПовторныйЗапросКвитанции Тогда
		// Обычное время ожидания ответа сервиса.
		МаксимальнаяДатаСледующегоЗапроса = ЭлементОчереди.ДатаСоздания + 60*5;
	Иначе
		МаксимальнаяДатаСледующегоЗапроса = ЭлементОчереди.ДатаСоздания + ВремяОжиданияОбработкиКвитанции();
	КонецЕсли;
	ТребуетсяОжидание = (МаксимальнаяДатаСледующегоЗапроса - ТекущаяУниверсальнаяДата()) > 0;
	
	Возврат ТребуетсяОжидание;
	
КонецФункции

Функция ТребуетсяОжиданиеОбработкиВыгрузки(ЭлементОчереди) Экспорт
	
	// Выгрузка доступна в течение 30 дней
	МаксимальнаяДатаСледующегоЗапроса = ЭлементОчереди.ДатаСоздания + 60 * 60 *24 * 30;
	ТребуетсяОжидание = (МаксимальнаяДатаСледующегоЗапроса - ТекущаяУниверсальнаяДата()) > 0;
	
	Возврат ТребуетсяОжидание;
	
КонецФункции

#Область ДеревоУпаковокПоДаннымОтчетаПроизводственнойЛинии

Функция ПодготовитьДеревоУпаковокВерхнегоУровняПоДокументу(Документ) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДеревоУпаковок",        Неопределено);
	Результат.Вставить("ПараметрыСканирования", Неопределено);
	Результат.Вставить("ТекстОшибки",           "");
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Шапка.Номер                          КАК Номер,
	|	Шапка.Дата                           КАК Дата,
	|	Шапка.ДокументОснование              КАК ДокументОснование,
	|	Шапка.Ссылка                         КАК Документ,
	|	
	|	Шапка.Организация                    КАК Организация,
	|	Представление(Шапка.Организация)     КАК ОрганизацияПредставление,
	|
	|	Шапка.Контрагент                     КАК Контрагент,
	|	Представление(Шапка.Контрагент)      КАК КонтрагентПредставление,
	|
	|	Шапка.Ответственный                  КАК Ответственный,
	|	Представление(Шапка.Ответственный)   КАК ОтветственныйПредставление,
	|	
	|	Шапка.ВидПродукции                   КАК ВидПродукции,
	|	Шапка.Операция                       КАК Операция,
	|	Шапка.ОперацияНанесения              КАК ОперацияНанесения,
	|	// Для отчетов производственной линии
	|	Шапка.СоздаватьШтрихкодыУпаковок             КАК СоздаватьШтрихкодыУпаковок,
	|	Шапка.Номенклатура                           КАК Номенклатура,
	|	Шапка.Характеристика                         КАК Характеристика,
	|	Шапка.Серия                                  КАК Серия,
	|	Шапка.ОтчетПроизводственнойЛинии             КАК ОтчетПроизводственнойЛинии,
	|	Шапка.Ссылка                                 КАК Ссылка,
	|
	|	Шапка.ВариантВыполненияАгрегации        КАК ВариантВыполненияАгрегации,
	|	Шапка.ОперацияНанесенияТолькоДляНаборов КАК ОперацияНанесенияТолькоДляНаборов
	|
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка",
	"Шапка");

	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ДанныеОтчета.НормализованноеЗначениеШтрихкода         КАК ЗначениеШтрихкода,
	|	ДанныеОтчета.НормализованноеЗначениеШтрихкодаУпаковки КАК ЗначениеШтрихкодаУпаковки,
	|	
	|	Ложь КАК ФорматBase64,
	|	ДанныеОтчета.НомерСтроки КАК НомерСтроки
	|	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ДанныеОтчетаПроизводственнойЛинии КАК ДанныеОтчета
	|ГДЕ
	|	ДанныеОтчета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.НормализованноеЗначениеШтрихкода,
	|	ДанныеРегистра.НормализованноеЗначениеШтрихкодаУпаковки,
	|	Ложь,
	|	ДанныеРегистра.КлючЗаписи
	|ИЗ
	|	РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Документ = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|",
	"ДанныеОтчетаПроизводственнойЛинии");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	Шапка             = РезультатЗапроса["Шапка"].Выбрать();
	Шапка.Следующий();
	//@skip-warning
	ДанныеОтчета      = РезультатЗапроса["ДанныеОтчетаПроизводственнойЛинии"].Выгрузить();
	
	ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(Шапка, Неопределено, Шапка.ВидПродукции);
	
	КешДанныхРазбора = Новый Соответствие;
	ШтрихкодыEAN     = Новый Соответствие;
	
	GTINПотребительскихУпаковок = Новый Соответствие;
	
	ПараметрыРазбора = Новый Структура;
	ПараметрыРазбора.Вставить("ВосстанавливатьСтруктуруКодаМаркировки", Не ПараметрыСканирования.ПроверятьСтруктуруКодовМаркировки);
	ПараметрыРазбора.Вставить("ПроверятьАлфавитКодовМаркировки",        ПараметрыСканирования.ПроверятьАлфавитКодовМаркировки);
	ПараметрыРазбора.Вставить("КодыМаркировкиНормализованы",            Ложь);
	
	ДанныеОтчета.Колонки.Добавить("НормализованноеЗначениеШтрихкода", Новый ОписаниеТипов("Строка"));
	ДанныеОтчета.Колонки.Добавить("НормализованноеЗначениеШтрихкодаУпаковки", Новый ОписаниеТипов("Строка"));
	
	ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкода", Новый ОписаниеТипов("Строка"));
	ДанныеОтчета.Колонки.Добавить("ТекстОшибкиЗначениеШтрихкодаУпаковки", Новый ОписаниеТипов("Строка"));
	
	РезультатОбработкиДанныхОтчета = РазборКодаМаркировкиИССлужебный.НормализоватьДанныеОтчетаПроизводственнойЛинии(
		ДанныеОтчета, Шапка.ВидПродукции, ПараметрыРазбора);
	
	ИсточникДанных = Новый Массив;
	
	Для Каждого СтрокаДанных Из РезультатОбработкиДанныхОтчета.ОбработанныеДанныеОтчета Цикл
		
		ИсходнаяСтрока = СтрокаДанных.ИсходнаяСтрока;
		
		ИсточникДанных.Добавить(
			Новый Структура(
				"Штрихкод, ШтрихкодУпаковки",
				ИсходнаяСтрока.НормализованноеЗначениеШтрихкода, ИсходнаяСтрока.НормализованноеЗначениеШтрихкодаУпаковки));
		
		Для Каждого ИменаКолонок Из РезультатОбработкиДанныхОтчета.ГруппыКолонок Цикл
			
			Если Не ЗначениеЗаполнено(ИсходнаяСтрока[ИменаКолонок.КодМаркировки]) Тогда
				Продолжить;
			КонецЕсли;
			
			Если КешДанныхРазбора[ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки]] = Неопределено Тогда
				
				СтруктураДанныхРазбора = ИнициализироватьСтруктуруДанныхРазбора();
				СтруктураДанныхРазбора.ВидУпаковки               = СтрокаДанных[ИменаКолонок.ВидУпаковки];
				СтруктураДанныхРазбора.ТипШтрихкода              = СтрокаДанных[ИменаКолонок.ТипШтрихкода];
				СтруктураДанныхРазбора.EAN                       = СтрокаДанных[ИменаКолонок.EAN];
				СтруктураДанныхРазбора.GTIN                      = СтрокаДанных[ИменаКолонок.GTIN];
				СтруктураДанныхРазбора.КоличествоВложенныхЕдиниц = СтрокаДанных[ИменаКолонок.КоличествоВложенныхЕдиниц];
				СтруктураДанныхРазбора.ДанныеРазбора             = СтрокаДанных[ИменаКолонок.ДанныеРазбора];
				СтруктураДанныхРазбора.КодДляПередачиИСМП        = СтрокаДанных[ИменаКолонок.КодДляПередачиИСМП];
				КешДанныхРазбора.Вставить(
					ИсходнаяСтрока[ИменаКолонок.НормализованныйКодМаркировки],
					СтруктураДанныхРазбора);
				
				Если ШтрихкодыEAN[СтрокаДанных[ИменаКолонок.EAN]] = Неопределено 
					И ЗначениеЗаполнено(СтрокаДанных[ИменаКолонок.EAN]) Тогда
					ШтрихкодыEAN.Вставить(СтрокаДанных[ИменаКолонок.EAN], Истина);
				КонецЕсли;
				
				Если СтрокаДанных[ИменаКолонок.ВидУпаковки] = Перечисления.ВидыУпаковокИС.Потребительская Тогда
					GTINПотребительскихУпаковок.Вставить(СтрокаДанных[ИменаКолонок.GTIN], Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыЗаполненияДерева = Новый Структура;
	ПараметрыЗаполненияДерева.Вставить("ШтрихкодыEAN", ШтрихкодыEAN);
	ПараметрыЗаполненияДерева.Вставить("GTINПотребительскихУпаковок", GTINПотребительскихУпаковок);

	ДанныеДерева = ДеревоУпаковокПоДаннымОтчетаПроизводственнойЛинии(Шапка, ИсточникДанных, КешДанныхРазбора, ПараметрыЗаполненияДерева, ПараметрыСканирования);

	ЗаполнитьЗначенияСвойств(Результат, ДанныеДерева);
	Результат.ПараметрыСканирования = ПараметрыСканирования;
	
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		
		Результат.ТекстОшибки = ДанныеДерева.ТекстОшибки;
		Возврат Результат;
		
	ИначеЕсли Результат.ДеревоУпаковок.Строки.Количество() Тогда
		
		МассивОшибок = Новый Массив;
		Если Не РассчитатьКоличествоВложенныхШтрихкодовПоДаннымДерева(Результат.ДеревоУпаковок, МассивОшибок) Тогда
			Результат.ТекстОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДеревоУпаковокПоДаннымОтчетаПроизводственнойЛинии(ДанныеШапки, ИсточникДанных, КешДанныхРазбора, ПараметрыЗаполнения = Неопределено,
	ПараметрыСканирования = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ДеревоУпаковок", Неопределено);
	Результат.Вставить("ТекстОшибки",    "");

	Если ПараметрыЗаполнения = Неопределено Тогда
		ДополнитьСтрокуПоДаннымGTIN = Ложь;
	Иначе
		ДополнитьСтрокуПоДаннымGTIN = Истина;
		КешКоэффициентовПоEANGTIN   = Новый Соответствие;
		ДанныеEAN                   = Новый Массив;
		Для Каждого КлючИЗначение Из ПараметрыЗаполнения.ШтрихкодыEAN Цикл
			ДанныеEAN.Добавить(КлючИЗначение.Ключ);
		КонецЦикла;
		ИнформацияПоШтрихкодамEAN = ШтрихкодированиеИС.ДанныеПоШтрихкодамEAN(ДанныеEAN, ПараметрыСканирования, ПараметрыЗаполнения.GTINПотребительскихУпаковок);
	КонецЕсли;

	ЭтоПродукцияМОТП = ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(ДанныеШапки.ВидПродукции);

	ДеревоУпаковок = ШтрихкодированиеИС.ИнициализироватьДеревоУпаковок();
	ДеревоУпаковок.Колонки.Добавить("КоличествоПотребительскихУпаковок", Новый ОписаниеТипов("Число"));
	ДеревоУпаковок.Колонки.Добавить("КодДляПередачиИСМП", Новый ОписаниеТипов("Строка"));

	СоответствиеСтрокДереваУпаковок = Новый Соответствие;

	ГрупповаяОбработкаШтрихкодовИС.ДополнитьУпорядочитьДанныеТСД(ИсточникДанных);

	Для Каждого СтрокаДанныхОтчета Из ИсточникДанных Цикл

		СтрокаДанных = КешДанныхРазбора[СтрокаДанныхОтчета.Штрихкод];
		Если СтрокаДанных = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Внутренняя ошибка разбора кодов маркировки'");
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаДанныхОтчета.ШтрихкодУпаковки) Тогда
			СтрокаДереваВерхнегоУровня = СоответствиеСтрокДереваУпаковок[СтрокаДанныхОтчета.ШтрихкодУпаковки];
			Если СтрокаДереваВерхнегоУровня = Неопределено Тогда
				СтрокаДереваВерхнегоУровня = ДеревоУпаковок;
			КонецЕсли;
		Иначе
			СтрокаДереваВерхнегоУровня = ДеревоУпаковок;
		КонецЕсли;

		СтрокаДерева = СтрокаДереваВерхнегоУровня.Строки.Добавить();

		СтрокаДерева.Штрихкод       = СтрокаДанныхОтчета.Штрихкод;
		СтрокаДерева.ТипШтрихкода   = СтрокаДанных.ТипШтрихкода;
		СтрокаДерева.ВидУпаковки    = СтрокаДанных.ВидУпаковки;
		СтрокаДерева.GTIN           = СтрокаДанных.GTIN;
		СтрокаДерева.EAN            = СтрокаДанных.EAN;
		СтрокаДерева.ВидПродукции   = ДанныеШапки.ВидПродукции;
		СтрокаДерева.Номенклатура   = ДанныеШапки.Номенклатура;
		СтрокаДерева.Характеристика = ДанныеШапки.Характеристика;
		СтрокаДерева.Серия          = ДанныеШапки.Серия;

		Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
		ИначеЕсли СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ИначеЕсли СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
			И ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
			СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		Иначе
			СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
		КонецЕсли;

		СтрокаДерева.Количество               = 0;
		СтрокаДерева.ПроизвольнаяЕдиницаУчета = Ложь;
		СтрокаДерева.НормализованныйШтрихкод  = СтрокаДанныхОтчета.Штрихкод;
		СтрокаДерева.КодДляПередачиИСМП       = СтрокаДанных.КодДляПередачиИСМП;

		Если СтрокаДанных.ДанныеРазбора <> Неопределено Тогда
			СтрокаДерева.ДанныеРазбора = СтрокаДанных.ДанныеРазбора;
			СтрокаДанных.ДанныеРазбора.Свойство("СоставКодаМаркировки", СтрокаДерева.СоставКодаМаркировки);
			
			ШтрихкодированиеМОТП.РассчитатьХэшСуммуНормализации(
				СтрокаДерева,
				СтрокаДерева.ДанныеРазбора);
			
		КонецЕсли;

		Если ДополнитьСтрокуПоДаннымGTIN Тогда
			ДополнитьДанныеСтрокиДереваПоGTINEAN(СтрокаДерева, СтрокаДанных, КешКоэффициентовПоEANGTIN, ИнформацияПоШтрихкодамEAN, Результат.ТекстОшибки);
			Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;

		СоответствиеСтрокДереваУпаковок.Вставить(СтрокаДанныхОтчета.Штрихкод, СтрокаДерева);

	КонецЦикла;

	Результат.ДеревоУпаковок = ДеревоУпаковок;

	Возврат Результат;

КонецФункции

Процедура ДополнитьДанныеСтрокиДереваПоGTINEAN(СтрокаДерева, СтрокаДанных, КешКоэффициентовПоEANGTIN, ИнформацияПоШтрихкодамEAN, ТекстОшибки)

	ВидыУпаковокДляПередачиОтчетаОНанесении = ШтрихкодированиеИСКлиентСервер.ВидыУпаковокДляПередачиОтчетаОНанесении();
	КешПлановогоКоличестваПотребительскихУпаковокПоGTIN = КешКоэффициентовПоEANGTIN[СтрокаДанных.EAN];
	Если КешПлановогоКоличестваПотребительскихУпаковокПоGTIN <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаДерева, КешПлановогоКоличестваПотребительскихУпаковокПоGTIN);
	Иначе
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ШтрихкодEAN", СтрокаДанных.EAN);

		НайденныеСтроки = ИнформацияПоШтрихкодамEAN.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 1 Тогда

			СтрокаИнформации = НайденныеСтроки[0];
			СтрокаДерева.ПлановоеКоличествоПотребительскихУпаковок = СтрокаИнформации.ПлановоеКоличествоПотребительскихУпаковок;
			СтрокаДерева.ПроизвольнаяЕдиницаУчета                  = СтрокаИнформации.ПроизвольнаяЕдиницаУчета;
			СтрокаДерева.ТребуетВзвешивания                        = СтрокаИнформации.ТребуетВзвешивания;

			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
				СтрокаДерева.ПлановоеКоличествоПотребительскихУпаковок = 1;
				Если СтрокаИнформации.ПроизвольнаяЕдиницаУчета Тогда
					СтрокаДерева.Коэффициент = СтрокаИнформации.Коэффициент;
				ИначеЕсли Не СтрокаИнформации.ПроизвольнаяЕдиницаУчета Тогда
					СтрокаДерева.Коэффициент = 1;
				КонецЕсли;
			КонецЕсли;

			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И ЗначениеЗаполнено(СтрокаДерева.GTIN)
				И СтрокаДанных.КоличествоВложенныхЕдиниц > 0 Тогда
				КоличествоПотребительскихУпаковокGTIN02 = СтрокаДанных.КоличествоВложенныхЕдиниц;
				Если КоличествоПотребительскихУпаковокGTIN02 > 0 Тогда
					СтрокаДерева.ПлановоеКоличествоПотребительскихУпаковок = СтрокаИнформации.ПлановоеКоличествоПотребительскихУпаковок * КоличествоПотребительскихУпаковокGTIN02;
					СтрокаДерева.Коэффициент                               = СтрокаИнформации.Коэффициент                               * КоличествоПотребительскихУпаковокGTIN02;
				КонецЕсли;
			КонецЕсли;

			Если Не СтрокаДерева.ТребуетВзвешивания
				И ЗначениеЗаполнено(СтрокаДерева.Коэффициент) Тогда
				СтрокаДерева.Количество = СтрокаДерева.Коэффициент;
			КонецЕсли;

			СтрокаДерева.КоличествоПотребительскихУпаковок = СтрокаДерева.ПлановоеКоличествоПотребительскихУпаковок;

			Если СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Логистическая Тогда
				ДанныеПоEANGTIN = ИнициализироватьСтруктуруЗаполненияПлановогоКоличестваПотребительскихУпаковокПоGTIN();
				ЗаполнитьЗначенияСвойств(ДанныеПоEANGTIN, СтрокаДерева);
				КешКоэффициентовПоEANGTIN[СтрокаДанных.EAN] = ДанныеПоEANGTIN;
			КонецЕсли;

		ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.GTIN)
			И ВидыУпаковокДляПередачиОтчетаОНанесении.Получить(СтрокаДерева.ВидУпаковки) <> Неопределено Тогда

			СтруктураЗаполненияСпецифики = ИнициализироватьСтруктуруЗаполненияКоэффициентовПоОписаниюGTIN();
			СтруктураЗаполненияСпецифики.СтрокаДерева = СтрокаДерева;
			СтруктураЗаполненияСпецифики.GTIN         = СтрокаДанных.GTIN;

			ЗаполнитьЗначенияСвойств(СтруктураЗаполненияСпецифики, СтрокаДерева);

			ДанныеПоШтрихкодам = Новый Массив;
			ДанныеПоШтрихкодам.Добавить(СтруктураЗаполненияСпецифики);

			ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(ДанныеПоШтрихкодам, Неопределено, Истина);
			// Коэффициент должен быть заполнен в базе для Потребительской или Групповой упаковки
			Если СтруктураЗаполненияСпецифики.ПлановоеКоличествоПотребительскихУпаковок = 0 Тогда
				ТекстОшибки =
					СтрШаблон(
						НСтр("ru = 'Не удалось определить плановое количество упаковок для %1'"),
						СтрокаДанных.EAN);
			КонецЕсли;

			СтрокаДерева.ТребуетВзвешивания       = СтруктураЗаполненияСпецифики.ТребуетВзвешивания;
			СтрокаДерева.ПроизвольнаяЕдиницаУчета = СтруктураЗаполненияСпецифики.ПроизвольнаяЕдиницаУчета;

			Если Не СтрокаДерева.ТребуетВзвешивания
				И ЗначениеЗаполнено(СтрокаДерева.Коэффициент) Тогда
				СтрокаДерева.Количество = СтрокаДерева.Коэффициент;
			КонецЕсли;

			ДанныеПоEANGTIN = ИнициализироватьСтруктуруЗаполненияПлановогоКоличестваПотребительскихУпаковокПоGTIN();
			ЗаполнитьЗначенияСвойств(ДанныеПоEANGTIN, СтрокаДерева);
			КешКоэффициентовПоEANGTIN[СтрокаДанных.EAN] = ДанныеПоEANGTIN;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Функция ИнициализироватьСтруктуруЗаполненияКоэффициентовПоОписаниюGTIN()
	
	Результат  = Новый Структура;
	
	Результат.Вставить("ОбработанСОшибками", Ложь);
	Результат.Вставить("GTIN",                      "");
	Результат.Вставить("ВидУпаковки",               Неопределено);
	Результат.Вставить("Коэффициент",               0);
	Результат.Вставить("КоличествоПотребительскихУпаковок",         0);
	Результат.Вставить("ПлановоеКоличествоПотребительскихУпаковок", Неопределено);
	Результат.Вставить("Количество",                0);
	Результат.Вставить("СоставКодаМаркировки",      Неопределено);
	Результат.Вставить("ДанныеРазбора",             Неопределено);
	Результат.Вставить("СтрокаДерева",              Неопределено);
	Результат.Вставить("Номенклатура",              Неопределено);
	Результат.Вставить("ТребуетВзвешивания",        Неопределено);
	Результат.Вставить("ПроизвольнаяЕдиницаУчета",  Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьКоличествоВложенныхШтрихкодовПоДаннымДерева(ДеревоУпаковок, МассивОшибок)
	
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Итоги = Новый Структура("УчетноеКоличество, ПроизвольнаяЕдиницаУчета, КоличествоПотребительскихУпаковок", 0, Истина, 0);
		ЕстьОшибки = ЕстьОшибки Или РассчитатьКоличествоВложенныхШтрихкодовСтрокиДерева(СтрокаДерева, МассивОшибок, Итоги);
		
		СтрокаДерева.ПроизвольнаяЕдиницаУчета = Итоги.ПроизвольнаяЕдиницаУчета;
		Если Не Итоги.ПроизвольнаяЕдиницаУчета Тогда
			СтрокаДерева.Количество                        = Итоги.КоличествоПотребительскихУпаковок;
			СтрокаДерева.КоличествоПотребительскихУпаковок = 0;
		Иначе
			СтрокаДерева.Количество                        = Итоги.УчетноеКоличество;
			СтрокаДерева.КоличествоПотребительскихУпаковок = Итоги.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		
		СтрокаДерева.Строки.Очистить();
		
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

Функция РассчитатьКоличествоВложенныхШтрихкодовСтрокиДерева(СтрокаДерева, МассивОшибок, Итоги)
	
	ЕстьОшибки = Ложь;
	
	Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
		// Расчет по количеству вложенных упаковок
		
		Для Каждого ВложеннаяСтрока Из СтрокаДерева.Строки Цикл
			
			ЕстьОшибки = ЕстьОшибки Или РассчитатьКоличествоВложенныхШтрихкодовСтрокиДерева(ВложеннаяСтрока, МассивОшибок, Итоги);
		
			ПроизвольнаяЕдиницаУчета = ВложеннаяСтрока.ПроизвольнаяЕдиницаУчета;
			
			Итоги.ПроизвольнаяЕдиницаУчета = Итоги.ПроизвольнаяЕдиницаУчета И ВложеннаяСтрока.ПроизвольнаяЕдиницаУчета;
			
			Если ВложеннаяСтрока.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
				Если ПроизвольнаяЕдиницаУчета Тогда
					Итоги.УчетноеКоличество = Итоги.УчетноеКоличество + ВложеннаяСтрока.Количество;
					Итоги.КоличествоПотребительскихУпаковок = Итоги.КоличествоПотребительскихУпаковок + 1;
				Иначе
					Итоги.УчетноеКоличество                 = Итоги.УчетноеКоличество                 + 1;
					Итоги.КоличествоПотребительскихУпаковок = Итоги.КоличествоПотребительскихУпаковок + 1;
				КонецЕсли;
			Иначе
				// Если не найдено подчиненных потребительских упаковок, тогда использовать количество из групповой или логистической упаковки.
				Если Итоги.КоличествоПотребительскихУпаковок = 0 Тогда
					Если ПроизвольнаяЕдиницаУчета Тогда
						Итоги.УчетноеКоличество = ВложеннаяСтрока.Количество;
						Итоги.КоличествоПотребительскихУпаковок = ВложеннаяСтрока.КоличествоПотребительскихУпаковок;
					Иначе
						Итоги.УчетноеКоличество = ВложеннаяСтрока.КоличествоПотребительскихУпаковок;
						Итоги.КоличествоПотребительскихУпаковок = ВложеннаяСтрока.КоличествоПотребительскихУпаковок;
					КонецЕсли;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли  СтрокаДерева.КоличествоПотребительскихУпаковок = 0 И СтрокаДерева.Количество = 0 Тогда
		
		МассивОшибок.Добавить(СтрШаблон(
			НСтр("ru = 'Не удалось определить плановое количество потребительских упаковок для %1.'"),
			СтрокаДерева.НормализованныйШтрихкод));
		ЕстьОшибки = Истина;
		
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

Функция ИнициализироватьСтруктуруЗаполненияПлановогоКоличестваПотребительскихУпаковокПоGTIN()
	
	Результат = Новый Структура;
	Результат.Вставить("Количество");
	Результат.Вставить("Коэффициент");
	Результат.Вставить("КоличествоПотребительскихУпаковок");
	Результат.Вставить("ПроизвольнаяЕдиницаУчета");
	Результат.Вставить("ТребуетВзвешивания");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчереди, ДанныеСообщения = Неопределено, ИдентификаторЗаявки = "")
	
	Если ДанныеСообщения = Неопределено
		И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса <> Неопределено
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ДанныеСообщения", Неопределено) <> Неопределено
		Тогда
		ДанныеСообщения = Новый ХранилищеЗначения(ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ДанныеСообщения);
	КонецЕсли;

	Если ДанныеСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеЗаписи = Новый Структура;
	ДанныеЗаписи.Вставить("ДокументОснование",   ЭлементОчереди.Документ);
	ДанныеЗаписи.Вставить("Сообщение",           ЭлементОчереди.Сообщение);
	ДанныеЗаписи.Вставить("ДанныеСообщения",     ДанныеСообщения);
	ДанныеЗаписи.Вставить("Версия",              ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
	ДанныеЗаписи.Вставить("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	РегистрыСведений.ПакетыКодовМаркировкиИСМП.ВыполнитьЗаписьВРегистр(ДанныеЗаписи);
	
КонецПроцедуры

// Проверяет статусы кодов по данным ИС МП перед отправкой пакетов сообщений отчета о нанесении.
// В контрольную выборку кодов включены по одному коду из каждого сообщения.
// Если после отправки отчета о нанесении данные коды сменили статус, то отчет обработан успешно.
//
// Параметры:
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений()).
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//  НаборЗаписей - РегистрСведенийНаборЗаписей.ОчередьСообщенийИСМП - набор записей по сообщению
Процедура ПодготовитьСообщенияПоАбстрактнойОперацииОтчетОбИспользовании(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	МассивСтрок = Новый Массив();
	СоответствиеШтрихкодовСообщений = Новый Соответствие;
	СоответствиеОбработанныхКодов   = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ПараметрыЗапроса.КодыМаркировкиДляКонтроляСтатусов Цикл
		Для Каждого ЗначениеШтрихкода Из КлючИЗначение.Значение Цикл
			СтруктураЗначения = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
				ЗначениеШтрихкода, ЭлементОчереди.ВидПродукции);
			МассивСтрок.Добавить(СтруктураЗначения);
			СоответствиеШтрихкодовСообщений.Вставить(ЗначениеШтрихкода, КлючИЗначение.Ключ);
		КонецЦикла;
		СоответствиеОбработанныхКодов.Вставить(КлючИЗначение.Ключ, "");
	КонецЦикла;
	
	РезультатПолученияДанных = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
		МассивСтрок,
		ЭлементОчереди.Организация);
	
	Если МассивСтрок.Количество() Тогда

		Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;

		ТребуетсяПовторОперации = Ложь;
		Если РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния    = 408       // Таймаут
			Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 500       // Ошибки сервера
			Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 502       // Bad Gateway
			Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 503       // Сервер недоступен
			Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 504       // Gateway Timeout
			Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 403       // Ошибка авторизации
			Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 429 Тогда // Слишком много запросов
			ТребуетсяПовторОперации = Истина;
		КонецЕсли;

		Если Не РезультатПолученияДанных.РезультатОтправкиЗапроса.ЗапросОтправлен
			Или Не РезультатПолученияДанных.РезультатОтправкиЗапроса.ОтветПолучен Тогда
			ТребуетсяПовторОперации = Истина;
		КонецЕсли;

		Если ТребуетсяПовторОперации Тогда
			// Если с момента последнего изменения статуса прошло более 5 минут,
			// то отложим обработку элемента очереди до следующей попытки обмена.
			ОтложитьОбработкуЭлементаОчереди(ЭлементОчереди, ПараметрыОбмена);
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
		ВызватьИсключение РезультатПолученияДанных.ТекстОшибки;
	ИначеЕсли РезультатПолученияДанных.СтатусыКодовМаркировки <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из РезультатПолученияДанных.СтатусыКодовМаркировки Цикл
			
			ИдентификаторСообщения = СоответствиеШтрихкодовСообщений[КлючИЗначение.Ключ.ИсходныйШтрихкод];
			КодМаркировкиДляКонтроляСтатусов = СоответствиеОбработанныхКодов[ИдентификаторСообщения];
			Если ЗначениеЗаполнено(КодМаркировкиДляКонтроляСтатусов) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПараметрыЗапроса.ДопустимыеНачальныеСтатусыКодовОтчетОНанесении.Найти(КлючИЗначение.Значение.Статус) <> Неопределено Тогда
				КодМаркировкиДляКонтроляСтатусов = КлючИЗначение.Ключ.ИсходныйШтрихкод;
			Иначе
				КодМаркировкиДляКонтроляСтатусов = "";
			КонецЕсли;
			СоответствиеОбработанныхКодов.Вставить(ИдентификаторСообщения, КодМаркировкиДляКонтроляСтатусов);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	
	ЭлементОчереди.ТекущийСтатус                = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетОбрабатывается;
	ЭлементОчереди.ТекущийСтатусОбработки       = СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.СообщениеОснование;
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		// Для обновления параметров сообщения для контроля статусов.
		Для Каждого КлючИЗначение Из СоответствиеОбработанныхКодов Цикл
			ТаблицыБлокируемыхСсылок.Добавить().Сообщение = КлючИЗначение.Ключ;
		КонецЦикла;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		Для Каждого ЭлементОчередиКОбработке Из ПараметрыОбмена.ОчередьСообщений Цикл
			
			КодМаркировки = СоответствиеОбработанныхКодов[ЭлементОчередиКОбработке.Сообщение];
			Если КодМаркировки <> Неопределено Тогда
				
				ПараметрыЗапроса = Новый Структура;
				Если ЗначениеЗаполнено(КодМаркировки) Тогда
					ПараметрыЗапроса.Вставить(
						"КодыМаркировкиДляКонтроляСтатусов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КодМаркировки));
					ПараметрыЗапроса.Вставить("ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции", Истина);
				Иначе
					ПараметрыЗапроса.Вставить("ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции", Ложь);
				КонецЕсли;
				
				ОбновитьПараметрыЗапросаИсходящегоСообщенияВОчереди(ЭлементОчередиКОбработке, ПараметрыЗапроса);
				Для Каждого ЗначениеСтруктуры Из ПараметрыЗапроса Цикл
					ЭлементОчередиКОбработке.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Вставить(ЗначениеСтруктуры.Ключ, ЗначениеСтруктуры.Значение);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			"");
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована Тогда
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
	Иначе
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		Возврат;
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

Процедура ЗагрузитьРезультатПолученияКвитанцииДокументаСУЗ(ЭлементОчереди, ПараметрыОбмена, НастройкаОбменаСУЗ)
	
	РезультатОбработкиЗаявки = ИнтерфейсСУЗ.СтатусКвитанцииДокумента_V2(
		ЭлементОчереди.ИдентификаторЗаявки, ЭлементОчереди.ВидПродукции, НастройкаОбменаСУЗ);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	// Ошибка "6070: Документ с указанным идентификатором не найден или еще не сформирован. Проверьте корректность ввода идентификатора и повторите попытку позднее".
	// Способ обхода: повтор запроса.
	Если РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 400
		И РезультатОбработкиЗаявки.КодОшибки = 6070 Тогда
		ТребуетсяПовторОперации = Истина;
	КонецЕсли;
	
	ЭтоПовторныйЗапросКвитанции = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ПовторныйЗапросКвитанции")
		И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ПовторныйЗапросКвитанции;
	
	Если Не ТребуетсяПовторОперации
		И (ЗначениеЗаполнено(РезультатОбработкиЗаявки.ИдентификаторСобытия)
			И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично)) Тогда
		
		РезультатОбработкиОтчета = ИнтерфейсСУЗ.РезультатОбработкиОтчетаПоДаннымКвитанции(
			ЭлементОчереди.ИдентификаторЗаявки, ЭлементОчереди.ВидПродукции, РезультатОбработкиЗаявки.ИдентификаторСобытия, НастройкаОбменаСУЗ);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиОтчета, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиОтчета);
		
		Если РезультатОбработкиОтчета.РезультатОтправкиЗапроса.КодСостояния = 400
			И РезультатОбработкиОтчета.КодОшибки = 6070 Тогда
			ТребуетсяПовторОперации = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяПовторОперации Тогда
		
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.			
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если Не ТребуетсяОжиданиеОбработкиКвитанции(ЭлементОчереди, ЭтоПовторныйЗапросКвитанции) Тогда
			ЗавершитьОбработкуКвитанцииСтатусНеопределен(ЭлементОчереди, ПараметрыОбмена, РезультатОбработкиЗаявки, Неопределено);
		ИначеЕсли ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерацииЗапросаКСУЗ(ЭлементОчереди);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	ЭлементОчереди.ТекущийСтатусОбработки       = РезультатОбработкиЗаявки.СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
			НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
			НаборЗаписейОснования.Прочитать();
		Иначе
			НаборЗаписейОснования = Неопределено;
		КонецЕсли;
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или НаборЗаписейОснования <> Неопределено
				И Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования <> Неопределено И НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчередиОснование,
			РезультатОбработкиЗаявки);
		
		Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично Тогда
			
			ТекстОшибки = РезультатОбработкиЗаявки.ТекстОшибки;
			
			// Расширенный текст ошибки по данным связанного с квитанцией документа.
			Если РезультатОбработкиОтчета <> Неопределено Тогда
				
				ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
					ЭлементОчередиОснование,
					РезультатОбработкиОтчета);
				
				ТекстОшибки = ТекстОшибки + Символы.ПС + РезультатОбработкиОтчета.ТекстОшибки;
				
			КонецЕсли;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчередиОснование.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчередиОснование.ИдентификаторЗаявки);
			Реквизиты.Вставить("Операция",             ЭлементОчередиОснование.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчередиОснование.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчередиОснование.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             ТекстОшибки);
			
			Если Не ЗначениеЗаполнено(Реквизиты.Описание)
				И РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
				Реквизиты.Описание = НСтр("ru = 'Ошибка обработки сообщения. Заявка отклонена.'");
			КонецЕсли;
			
			Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
				Или (ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ОперацияДокумента")
					И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОперацияДокумента =
						Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки) Тогда

				НовыйСтатус = Неопределено;

				Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ОперацияДокумента")
					И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ОперацияДокумента =
						Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки Тогда

					МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);

					ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
					ПараметрыОбновленияСтатуса.Статус            = Неопределено;
					ПараметрыОбновленияСтатуса.СтатусОбработки   = РезультатОбработкиЗаявки.СтатусОбработки;
					ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
					ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
					ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;

					ОбработкаЗагрузкиПереданногоДокумента(
						ЭлементОчереди,
						ПараметрыОбмена,
						РезультатОбработкиЗаявки,
						ПараметрыОбновленияСтатуса);
					
					Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
						ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ИспользуетсяПакетнаяПередачаСообщений", Ложь) Тогда
						ПараметрыОбновленияСтатуса.Вставить("ЕстьЗависимыеСообщения", Истина);
					КонецЕсли;
					
					НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
						ЭлементОчереди.Документ,
						РезультатОбработкиЗаявки.Операция,
						ПараметрыОбновленияСтатуса);

				КонецЕсли;

				СтрокаРезультата = СтруктураИзменения();
				
				СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
				СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
				
				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
				СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
				
				СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
				СтрокаРезультата.ОбъектИзменен         = Ложь;
				
				СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
				СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
				
				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
				
				Если ЭтоПовторныйЗапросКвитанции Тогда
					РегистрыСведений.ПакетыКодовМаркировкиИСМП.УдалитьЗаписиПоИдентификаторуЗаявки(
						ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ИдентификаторЗаявки,
						ЭлементОчереди.Документ);
				КонецЕсли;
				
			ИначеЕсли ЭтоПовторныйЗапросКвитанции Тогда
				
				Если РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично
					И РезультатОбработкиОтчета <> Неопределено
					И РезультатОбработкиОтчета.КодыСОшибками.Количество() Тогда
					ДанныеСообщения = Новый ХранилищеЗначения(РезультатОбработкиОтчета.КодыСОшибками);
					ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчередиОснование, ДанныеСообщения);
				КонецЕсли;
				
			Иначе // Для повторного запроса квитанции не требуется записывать ошибку, данные о кодах уже есть в регистре.
				
				Если РезультатОбработкиОтчета <> Неопределено
					И РезультатОбработкиОтчета.КодыСОшибками.Количество() Тогда
					ДанныеСообщения = Новый ХранилищеЗначения(РезультатОбработкиОтчета.КодыСОшибками);
				Иначе
					ДанныеСообщения = Неопределено;
				КонецЕсли;
				
				ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчередиОснование, ДанныеСообщения, ЭлементОчередиОснование.ИдентификаторЗаявки);
				
			КонецЕсли;
			
			ПротоколОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчередиОснование.ПротоколОбмена);
			
			ДобавитьЗаписьВПротоколОбмена(
				ПротоколОбменаXML,
				Реквизиты);
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			КонецЕсли;
			
		Иначе
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				?(НаборЗаписейОснования = Неопределено, НаборЗаписей, НаборЗаписейОснования),
				Неопределено,
				Неопределено,
				Новый ХранилищеЗначения(
					ЭлементОчередиОснование.ПротоколОбмена));
			
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки квитанции отчета об использовании кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки квитанции отчета об использовании кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Или РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчередиОснование) <> -1 Тогда
				ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчередиОснование);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
	
КонецПроцедуры

Процедура ЗавершитьОбработкуКвитанцииСтатусНеопределен(ЭлементОчереди, ПараметрыОбмена, РезультатОбработкиЗаявки, ОписаниеЗамера = Неопределено)
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	
	ЭлементОчередиОснование = ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена);
	ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса,"ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции", Ложь);
	
	ЭтоПовторныйЗапросКвитанции = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Свойство("ПовторныйЗапросКвитанции")
		И ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ПовторныйЗапросКвитанции;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
			НаборЗаписейОснования = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписейОснования.Отбор.Сообщение.Установить(ЭлементОчереди.СообщениеОснование);
			НаборЗаписейОснования.Прочитать();
		Иначе
			НаборЗаписейОснования = Неопределено;
		КонецЕсли;
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0)
			Или НаборЗаписейОснования <> Неопределено
				И Не (НаборЗаписейОснования.Выбран() И НаборЗаписейОснования.Количество() > 0) Тогда
			
			Если НаборЗаписейОснования <> Неопределено И НаборЗаписейОснования.Количество() = 0 Тогда
				
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
				ЗафиксироватьТранзакцию();
				
			Иначе
				
				ОтменитьТранзакцию();
				
			КонецЕсли;
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		Если ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции Тогда
			
			ПодготовитьКПередачеСообщениеЗапросаСтатусаКодов(ЭлементОчередиОснование, ПараметрыОбмена);
			ДобавитьВПротоколОбмена(ЭлементОчередиОснование, РезультатОбработкиЗаявки);
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				?(НаборЗаписейОснования = Неопределено, НаборЗаписей, НаборЗаписейОснования),,,
				Новый ХранилищеЗначения(ЭлементОчередиОснование.ПротоколОбмена));
			
			Если Не ЭтоПовторныйЗапросКвитанции Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			КонецЕсли;
			
		Иначе
			
			РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен;
			
			ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(ЭлементОчередиОснование, РезультатОбработкиЗаявки);
			
			Если ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса <> Неопределено
				И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ИспользуетсяПакетнаяПередачаСообщений", Ложь) Тогда
				
				Если Не ЭтоПовторныйЗапросКвитанции Тогда
					ВыполнитьЗаписьВРегистрПакетКодов(ЭлементОчередиОснование,,ЭлементОчередиОснование.ИдентификаторЗаявки);
				КонецЕсли;
				
				ТекстыОшибок = Новый Массив;
				ТекстыОшибок.Добавить(НСтр("ru = 'Не удалось получить квитанцию по отчету о нанесении.
				                     |Запросите квитанцию повторно или обратитесь в техническую поддержку оператора ГИС МТ
				                     |для получения дополнительной информации о состоянии обработки отчета.'"));
				Если ЗначениеЗаполнено(РезультатОбработкиЗаявки.ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(РезультатОбработкиЗаявки.ТекстОшибки);
				КонецЕсли;
				ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
				
			Иначе // обновить статус документа списание
				
				ТекстыОшибок = Новый Массив;
				ТекстыОшибок.Добавить(НСтр("ru = 'Не удалось получить квитанцию.'"));
				Если ЗначениеЗаполнено(РезультатОбработкиЗаявки.ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(РезультатОбработкиЗаявки.ТекстОшибки);
				КонецЕсли;
				ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
				
				МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);

				ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
				ПараметрыОбновленияСтатуса.Статус            = Неопределено;
				ПараметрыОбновленияСтатуса.СтатусОбработки   = Перечисления.СтатусыОбработкиСообщенийИСМП.СтатусНеопределен;
				ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
				ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
				ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;

				НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
					ЭлементОчереди.Документ,
					РезультатОбработкиЗаявки.Операция,
					ПараметрыОбновленияСтатуса);

				СтрокаРезультата = СтруктураИзменения();

				СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
				СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
				СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;

				СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
				СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
				СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;

				СтрокаРезультата.ТекстОшибки           = РезультатОбработкиЗаявки.ТекстОшибки;
				СтрокаРезультата.ПодготовленоКПередаче = Ложь;
				СтрокаРезультата.Передано              = Ложь;
				СтрокаРезультата.Принято               = Истина;
				СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
				СтрокаРезультата.ОбъектИзменен         = Ложь;

				СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
				СтрокаРезультата.ТекстСообщения               = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
				СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;

				ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
				
			КонецЕсли;
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Документ",             ЭлементОчередиОснование.Документ);
			Реквизиты.Вставить("ИдентификаторЗапроса", Неопределено);
			Реквизиты.Вставить("Операция",             ЭлементОчередиОснование.Операция);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчередиОснование.Сообщение);
			Реквизиты.Вставить("Версия",               ЭлементОчередиОснование.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         Перечисления.ТипыЗапросовИС.Исходящий);
			Реквизиты.Вставить("СтатусОбработки",      РезультатОбработкиЗаявки.СтатусОбработки);
			Реквизиты.Вставить("Описание",             ТекстОшибки);
			
			ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчередиОснование.ПротоколОбмена);
			ДобавитьЗаписьВПротоколОбмена(ПротоколаОбменаXML, Реквизиты);
			
			Если ЭлементОчередиОснование <> ЭлементОчереди Тогда
				УдалитьСообщениеИзОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки квитанции отчета об использовании кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки квитанции отчета об использовании кодов маркировки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована Тогда
		
		Если Не ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции Или Не ЭтоПовторныйЗапросКвитанции Тогда
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		КонецЕсли;
		Если Не ЗапрашиватьСтатусыКодовПослеОжиданияКвитанции И ЭлементОчередиОснование <> ЭлементОчереди Тогда
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиОснование, ПараметрыОбмена);
		КонецЕсли;
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПараметрыЗапросаИсходящегоСообщенияВОчереди(ЭлементОчереди, ПараметрыЗапроса)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение, Истина);
	НаборЗаписей.Прочитать();
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		РеквизитыИсходящегоСообщения = ЗаписьНабора.РеквизитыИсходящегоСообщения.Получить();
		Для Каждого ЗначениеСтруктуры Из ПараметрыЗапроса Цикл
			РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Вставить(ЗначениеСтруктуры.Ключ, ЗначениеСтруктуры.Значение);
		КонецЦикла;
		ЗаписьНабора.РеквизитыИсходящегоСообщения = Новый ХранилищеЗначения(РеквизитыИсходящегоСообщения);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьКодыМаркировкиДляПоискаВПулеПоШтрихкодамУпаковок(ЭлементОчереди, КодыМаркировки, ЭтоМолочнаяПродукция)
	
	РезультатПоиска = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковокПоДокументу(
		ЭлементОчереди.Документ, ЭлементОчереди.ВидПродукции,,Истина);

	СоответствиеГрупповыхУпаковок= Новый Соответствие;
	
	Для Каждого СтрокаТЧМаркированныеТовары Из РезультатПоиска.ВложенныеШтрихкоды.МаркированныеТовары Цикл
		
		Если СтрокаТЧМаркированныеТовары.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			ШтрихкодированиеИСМП.ДобавитьКодМаркировкиВТаблицуДляПоискаВПуле(
				СтрокаТЧМаркированныеТовары, КодыМаркировки, ЭтоМолочнаяПродукция);
			
		КонецЕсли;
		
		СтрокаРодитель = СтрокаТЧМаркированныеТовары.СтрокаДерева.Родитель;
		Если СтрокаРодитель <> Неопределено Тогда
			Если СоответствиеГрупповыхУпаковок[СтрокаРодитель.Штрихкод] = Неопределено Тогда
				СоответствиеГрупповыхУпаковок.Вставить(СтрокаРодитель.Штрихкод, Истина);
				Если СтрокаРодитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
					Или СтрокаРодитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
					
					ШтрихкодированиеИСМП.ДобавитьКодМаркировкиВТаблицуДляПоискаВПуле(
						СтрокаРодитель, КодыМаркировки, ЭтоМолочнаяПродукция);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьОшибкиПриОбработкеВГИСМТ(ДанныеОтчета, КодыОбработанныеСОшибками, ИспользуетсяРегистрДляХраненияДанныхОтчета)

	ОписаниеОшибки = НСтр("ru = 'Ошибка при обработке в ГИС МТ: %1'");

	Если ИспользуетсяРегистрДляХраненияДанныхОтчета Тогда

		ДанныеОтчета.ЗаполнитьЗначения("", "ТекстОшибкиЗначениеШтрихкода");
		ДанныеОтчета.ЗаполнитьЗначения("", "ТекстОшибкиЗначениеШтрихкодаУпаковки");

		ДанныеОтчета.Индексы.Добавить("НормализованноеЗначениеШтрихкода");
		ДанныеОтчета.Индексы.Добавить("НормализованноеЗначениеШтрихкодаУпаковки");

		СтруктураОтбораЗначениеШтрихкода         = Новый Структура("НормализованноеЗначениеШтрихкода");
		СтруктураОтбораЗначениеШтрихкодаУпаковки = Новый Структура("НормализованноеЗначениеШтрихкодаУпаковки");
		Для Каждого НормализованныйКод Из КодыОбработанныеСОшибками Цикл

			ТекстОшибки = СтрШаблон(ОписаниеОшибки, НормализованныйКод);

			СтруктураОтбораЗначениеШтрихкода.НормализованноеЗначениеШтрихкода = НормализованныйКод;
			НайденныеСтроки = ДанныеОтчета.НайтиСтроки(СтруктураОтбораЗначениеШтрихкода);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ТекстОшибкиЗначениеШтрихкода = ТекстОшибки;
			КонецЦикла;

			СтруктураОтбораЗначениеШтрихкодаУпаковки.НормализованноеЗначениеШтрихкодаУпаковки = НормализованныйКод;
			НайденныеСтроки = ДанныеОтчета.НайтиСтроки(СтруктураОтбораЗначениеШтрихкодаУпаковки);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ТекстОшибкиЗначениеШтрихкодаУпаковки = ТекстОшибки;
			КонецЦикла;

		КонецЦикла;

	Иначе

		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл

			СтрокаОтчета.ТекстОшибкиЗначениеШтрихкода = "";
			СтрокаОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки = "";

			Если КодыОбработанныеСОшибками.Найти(СтрокаОтчета.НормализованноеЗначениеШтрихкода) <> Неопределено Тогда
				СтрокаОтчета.ТекстОшибкиЗначениеШтрихкода = СтрШаблон(ОписаниеОшибки, СтрокаОтчета.НормализованноеЗначениеШтрихкода);
			КонецЕсли;
			Если КодыОбработанныеСОшибками.Найти(СтрокаОтчета.НормализованноеЗначениеШтрихкодаУпаковки) <> Неопределено Тогда
				СтрокаОтчета.ТекстОшибкиЗначениеШтрихкодаУпаковки = СтрШаблон(ОписаниеОшибки, СтрокаОтчета.НормализованноеЗначениеШтрихкодаУпаковки);
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСведенияИмпортСФТСПоДаннымАТКОтчетаПроизводственнойЛинии(ОбщийЭлементОчереди, ГруппыКодов, ДанныеШапки, ДанныеАТК, Настройки)

	НастройкиРазбораКодаМаркировки = Настройки.НастройкиРазбораКодаМаркировки;
	ПараметрыНормализацииПрочее    = Настройки.ПараметрыНормализацииПрочее;

	КоличествоВТекущейГруппе = 0;
	ТекущаяГруппа = Неопределено;

	Для Каждого СтрокаАТК Из ДанныеАТК Цикл

		Если КоличествоВТекущейГруппе >= Настройки.КоличествоКодовВСообщении Или ТекущаяГруппа = Неопределено Тогда

			ТекущаяГруппа = Новый Массив;

			ОписаниеПакета = Новый Структура;
			ОписаниеПакета.Вставить("ГруппаКодов",                ТекущаяГруппа);

			ГруппыКодов.Добавить(ОписаниеПакета);
			КоличествоВТекущейГруппе = 0;

		КонецЕсли;

		РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкодаУпрощенныйРазбор(
			СтрокаАТК.ШтрихкодУпаковки, ОбщийЭлементОчереди.ВидПродукции, НастройкиРазбораКодаМаркировки);

		СтрокаТЧ = Новый Структура;
		СтрокаТЧ.Вставить(
			Настройки.ИмяРеквизитаКодМаркировки,
			РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				РезультатРазбора.ДанныеРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее));
		СтрокаТЧ.Вставить("packType", "ATK");

		Если Настройки.ЗаполнятьВложенныеКоды Тогда
			СтрокаТЧ.Вставить("children", Новый Массив);

			ВложенныеКоды = СтрокаАТК.ДанныеАТК.Получить();
			Для Каждого КодМаркировки Из ВложенныеКоды Цикл

				РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкодаУпрощенныйРазбор(
					КодМаркировки, ОбщийЭлементОчереди.ВидПродукции, НастройкиРазбораКодаМаркировки);

				ВложеннаяСтрокаТЧ = Новый Структура;
				ВложеннаяСтрокаТЧ.Вставить(
					Настройки.ИмяРеквизитаКодМаркировки,
					РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
						РезультатРазбора.ДанныеРазбора, ОбщийЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее));
				ВложеннаяСтрокаТЧ.Вставить("packType", "UNIT");

				Если Настройки.УказыватьИдентификаторПроисхожденияВЕТИС Тогда
					ВложеннаяСтрокаТЧ.Вставить("vsd_number", ДанныеШапки.ИдентификаторПроисхожденияВЕТИССтрокой);
				КонецЕсли;
				Если Настройки.УказыватьДатуПроизводства Тогда
					ВложеннаяСтрокаТЧ.Вставить("production_date", Настройки.ДатаПроизводства);
				КонецЕсли;

				СтрокаТЧ.children.Добавить(ВложеннаяСтрокаТЧ);

				КоличествоВТекущейГруппе = КоличествоВТекущейГруппе + 1;

			КонецЦикла;

		КонецЕсли;

		ТекущаяГруппа.Добавить(СтрокаТЧ);

		КоличествоВТекущейГруппе = КоличествоВТекущейГруппе + 1;

	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьДеревоУпаковокАТКСпецификой(МаркированныеТовары, ВложенныеШтрихкоды)

	ПараметрыОтбора = Новый Структура("ШтрихкодУпаковки");
	Для Каждого СтрокаТовары Из МаркированныеТовары Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТовары);
		НайденныеСтроки = ВложенныеШтрихкоды.МаркированныеТовары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() Тогда
			СтрокаТовары.СтрокаДерева.ИдентификаторПроисхожденияВЕТИС = НайденныеСтроки[0].ИдентификаторПроисхожденияВЕТИС;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКодыМаркировкиСтрокиОтчетаВТаблицуДляПоискаВПуле(СтрокаОтчета, КодыМаркировки, КешДанных, ГруппаКолонокДляПоискаВПулеКодовМаркировки)

	Для Каждого ИмяКолонкиЗначениеШтрихкода Из ГруппаКолонокДляПоискаВПулеКодовМаркировки Цикл

		НормализованныйКодМаркировки = СтрокаОтчета[ИмяКолонкиЗначениеШтрихкода];
		Если ЗначениеЗаполнено(НормализованныйКодМаркировки)
			И КешДанных[НормализованныйКодМаркировки] = Неопределено Тогда
			ШтрихкодированиеИСМП.ДобавитьКодМаркировкиВТаблицуДляПоискаВПуле(
				НормализованныйКодМаркировки, КодыМаркировки);
			КешДанных.Вставить(НормализованныйКодМаркировки, Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьДанныеКОпределениюВидаУпаковки(КодМаркировки, GTIN, ДополнительныеПараметры) Экспорт

	КОпределениюВидаУпаковки = ДополнительныеПараметры.ПараметрыОбмена.КОпределениюВидаУпаковки;
	Если КОпределениюВидаУпаковки = Неопределено Тогда

		ФормаПроверки = Новый Структура;
		ФормаПроверки.Вставить("ИмяФормы", "Обработка.ПроверкаКодовМаркировкиИСМП");
		ФормаПроверки.Вставить("Организация", ДополнительныеПараметры.ПараметрыОбработкиДокумента.Организация);
		ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(ФормаПроверки);

		// По аналогии с формой
		ПараметрыСканирования.ТолькоМаркируемаяПродукция          = Истина;
		ПараметрыСканирования.ОпределениеВидаПродукцииИСМП        = Истина;
		ПараметрыСканирования.КонтрольУникальностиКодовМаркировки = Ложь;
		ПараметрыСканирования.ДопустимыеВидыПродукции = ИнтеграцияИСКлиентСервер.ВидыПродукцииИСМП(Истина);

		// Не требуются лишние запросы данных
		ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП                                     = Ложь;
		ПараметрыСканирования.ВариантПолученияМРЦ                                                = "Вычисление";
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП                                     = Ложь;
		ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП          = Ложь;
		ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП = Ложь;
		ПараметрыСканирования.ТребуетсяЧастичноеВыбытие                                          = Ложь;

		КОпределениюВидаУпаковки = Новый Структура;
		КОпределениюВидаУпаковки.Вставить("GTIN",                  Новый Соответствие);
		КОпределениюВидаУпаковки.Вставить("ПараметрыСканирования", ПараметрыСканирования);

		ДополнительныеПараметры.ПараметрыОбмена.КОпределениюВидаУпаковки = КОпределениюВидаУпаковки;

	КонецЕсли;

	КОпределениюВидаУпаковки.GTIN.Вставить(GTIN, КодМаркировки);

КонецПроцедуры

Функция ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки)

	Если РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния    = 408       // Таймаут
		Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 500       // Ошибки сервера
		Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 502       // Bad Gateway
		Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 503       // Сервер недоступен
		Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 504       // Gateway Timeout
		Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 403       // Ошибка авторизации
		Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 429 Тогда // Слишком много запросов
		Возврат Истина;
	КонецЕсли;

	Если Не РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ЗапросОтправлен
		Или Не РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ОтветПолучен Тогда
		Возврат Истина;
	КонецЕсли;

	// Ошибка валидации. Один или несколько запрошенных ID заказов не найдены.
	// Способ обхода: повтор запроса.
	Если РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 404 Тогда
		Возврат Истина;
	КонецЕсли;

	Если РезультатОбработкиЗаявки.Свойство("СтатусОбработки") И ЭлементОчереди.ТекущийСтатусОбработки = РезультатОбработкиЗаявки.СтатусОбработки
		И (Не РезультатОбработкиЗаявки.Свойство("Статус") Или ЭлементОчереди.ТекущийСтатус = РезультатОбработкиЗаявки.Статус) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Процедура УдалитьПолныеКодовМаркировкиИзПулаПослеУспешнойОбработкиСообщения(ЭлементОчереди, КодыМаркировки, ЭтоМолочнаяПродукция)
	
	Если КодыМаркировки.Количество() = 0 Тогда
		ЗаполнитьКодыМаркировкиДляПоискаВПулеПоШтрихкодамУпаковок(ЭлементОчереди, КодыМаркировки, ЭтоМолочнаяПродукция);
	КонецЕсли;
	
	РезультатПоискаВПуле = ШтрихкодированиеИСМП.РезультатПоискаВПулеКодовМаркировки(
		КодыМаркировки, "ХешСуммаКодаМаркировки");
	РегистрыСведений.ПулКодовМаркировкиСУЗ.ОчисткаПулаКодовМаркировкиПоОтчетуОНанесении(РезультатПоискаВПуле);
	
КонецПроцедуры

Функция ТекстОшибкиНайденыКодыНаборовГрупповыхУпаковокПриИмпортеСФТС()
	
	Результат = НСтр("ru = 'В документе найдены коды наборов или групповых упаковок.
	                       |Для ввода в оборот необходимо использовать режим ""Подготовить для декларации: Упаковки"".'");
	
	Возврат Результат;
	
КонецФункции

Функция ТекстОшибкиНайденыСформированныеАгрегатыИСМППриИмпортеСФТС()
	
	Результат = НСтр("ru = 'В документе найдены упаковки, агрегированные по данным ИС МП.
	                       |Для ввода в оборот необходимо использовать режим ""Подготовить для декларации: Упаковки"".'");
	
	Возврат Результат;
	
КонецФункции

// Проверяет таблицу Маркированные товары:
// если у потребительской упаковки есть владелец набор или групповая упаковка, то запрашивает в сервисе статусы и состав
// наборов и групповых упаковок.
//
// Параметры:
//  МаркированныеТовары - См. ШтрихкодированиеИС.ИнициализироватьТаблицуМаркированныеТовары.
//  ЭлементОчереди - СтрокаТаблицыЗначений - (См. ИнтеграцияИСМП.ИнициализиоватьОчередьСообщений).
//  ПараметрыОбмена - См. ИнтеграцияИСМП.ПараметрыОбмена.
//
// ВозвращаемоеЗначение:
//  Структура - Структура со свойствами:
//    ЕстьОшибки - Булево - есть ошибки при выполнении запроса.
//    ТекстОшибки - Строка - описание ошибки.
//    ТребуетсяОбновлениеКлючаСессии - Булево - требуется обновление ключа сессии.
//    КешСтатусовКодовМаркировки - Соответствие - соотвествие упаковок обрабатываемого документа:
//      Ключ - Строка - нормализованный код упаковки.
//      Значение - См. ИнтерфейсМОТПСлужебный.ПараметрыКодаМаркировки.
Функция ПолучитьСтатусыНаборовГрупповыхУпаковок(МаркированныеТовары, ЭлементОчереди, ПараметрыОбмена)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	Результат.Вставить("КешСтатусовКодовМаркировки",     Новый Соответствие);
	
	МассивСтрок                      = Новый Массив();
	СоответствиеСтрокКодовМаркировки = Новый Соответствие;
	КешСтатусовКодовМаркировки       = Новый Соответствие;
	КешНаборовГрупповыхУпаковок      = Новый Соответствие;
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
	
	Для Каждого СтрокаТЧМаркированныеТовары Из МаркированныеТовары Цикл
		
		Если СтрокаТЧМаркированныеТовары.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧМаркированныеТовары.РодительскаяУпаковка) Тогда
			// Если есть владелец по данным ИСМП, то получить вложения набора для проверки состава. 
			СтрокаРодитель = СтрокаТЧМаркированныеТовары.СтрокаДерева.Родитель;
			Если СтрокаРодитель <> Неопределено
				И (СтрокаРодитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
					Или СтрокаРодитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор)
				И КешНаборовГрупповыхУпаковок[СтрокаРодитель.НормализованныйШтрихкод] = Неопределено Тогда
				
				РезультатРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(
					СтрокаРодитель.НормализованныйШтрихкод, ЭлементОчереди.ВидПродукции);
				
				НормализованныйКодУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
					РезультатРазбора, ЭлементОчереди.ВидПродукции, ПараметрыНормализацииПрочее);
				
				МассивСтрок.Добавить(РезультатРазбора);
				СоответствиеСтрокКодовМаркировки.Вставить(РезультатРазбора, НормализованныйКодУпаковки);
				КешНаборовГрупповыхУпаковок[СтрокаРодитель.НормализованныйШтрихкод] = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрок.Количество() Тогда
		
		РезультатЗапросаДанных = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
			МассивСтрок,
			ЭлементОчереди.Организация);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
			Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат Результат;
		ИначеЕсли ЗначениеЗаполнено(РезультатЗапросаДанных.ТекстОшибки) Тогда
			Результат.ТекстОшибки = РезультатЗапросаДанных.ТекстОшибки;
			Результат.ЕстьОшибки = Истина;
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из СоответствиеСтрокКодовМаркировки Цикл
			
			КешСтатусовКодовМаркировки.Вставить(
				КлючИЗначение.Значение, 
				РезультатЗапросаДанных.СтатусыКодовМаркировки.Получить(КлючИЗначение.Ключ));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.КешСтатусовКодовМаркировки = КешСтатусовКодовМаркировки;
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьСтруктуруДанныхРазбора()
	
	Результат = Новый Структура;
	Результат.Вставить("ВидУпаковки");
	Результат.Вставить("ТипШтрихкода");
	Результат.Вставить("EAN");
	Результат.Вставить("GTIN");
	Результат.Вставить("КоличествоВложенныхЕдиниц");
	Результат.Вставить("ДанныеРазбора");
	Результат.Вставить("КодДляПередачиИСМП");
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьСообщенияПоЗапросуВыгрузкиИСМП(ЭлементОчереди, ПараметрыОбмена, НаборЗаписей)
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(ЭлементОчереди.Организация));
	
	РезультатЗапросаАбстрактный = Новый Структура();
	РезультатЗапросаАбстрактный.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатЗапросаАбстрактный, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
	
	РезультатПолученияДанных = ВыгрузкиДанныхИСМП.СоздатьЗаданиеНаВыгрузку(
		ЭлементОчереди.Организация,
		ЭлементОчереди.Операция,
		ЭлементОчереди.ВидПродукции,
		ПараметрыЗапроса);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияДанных, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = Ложь;
	Если РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния    = 408       // Таймаут
		Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 500       // Ошибки сервера
		Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 502       // Bad Gateway
		Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 503       // Сервер недоступен
		Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 504       // Gateway Timeout
		Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 403       // Ошибка авторизации
		Или РезультатПолученияДанных.РезультатОтправкиЗапроса.КодСостояния = 429 Тогда // Слишком много запросов
		ТребуетсяПовторОперации = Истина;
	КонецЕсли;
	
	Если Не РезультатПолученияДанных.РезультатОтправкиЗапроса.ЗапросОтправлен
		Или Не РезультатПолученияДанных.РезультатОтправкиЗапроса.ОтветПолучен Тогда
		ТребуетсяПовторОперации = Истина;
	КонецЕсли;
	
	Если ТребуетсяПовторОперации Тогда
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.
		ОтложитьОбработкуЭлементаОчереди(ЭлементОчереди, ПараметрыОбмена);
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
		ВызватьИсключение РезультатПолученияДанных.ТекстОшибки;
	КонецЕсли;
	
	ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(ЭлементОчереди, РезультатПолученияДанных);
	
	Если РезультатПолученияДанных.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята
		Или РезультатПолученияДанных.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
		
		РеквизитыИсходящегоСообщения = ЭлементОчереди.РеквизитыИсходящегоСообщения;
		
		ИдентификаторЗадания = Неопределено;
		Если РезультатПолученияДанных.Данные <> Неопределено Тогда
			ИдентификаторЗадания = РезультатПолученияДанных.Данные.ИдентификаторЗадания;
		КонецЕсли;
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     РезультатПолученияДанных.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если РезультатПолученияДанных.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена Тогда
			
			Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
				РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = '%1 не принят ИС МП:
					           |Текст ошибки: %2'"),
					ОписаниеОперацииПередачиДанных(
						ЭлементОчереди.Операция,
						ЭлементОчереди.Документ),
					РезультатПолученияДанных.ТекстОшибки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				// При загрузке рег.заданием документ будет создан при получени результатов выгрузки.
				Реквизиты = Новый Структура;
				Реквизиты.Вставить("Документ",             ЭлементОчереди.Документ);
				Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
				Реквизиты.Вставить("Операция",             ЭлементОчереди.Операция);
				Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
				Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
				Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
				Реквизиты.Вставить("СтатусОбработки",      РезультатПолученияДанных.СтатусОбработки);
				Реквизиты.Вставить("Описание",             РезультатПолученияДанных.ТекстОшибки);
				
				ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(
					ЭлементОчередиСообщенияОснования(ЭлементОчереди, ПараметрыОбмена).ПротоколОбмена);
				ДобавитьЗаписьВПротоколОбмена(
					ПротоколаОбменаXML,
					Реквизиты);
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			ЭлементОчереди.ТекущийСтатус                = Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетОбрабатывается;
			ЭлементОчереди.ТекущийСтатусОбработки       = РезультатПолученияДанных.СтатусОбработки;
			ЭлементОчереди.ИдентификаторЗаявки          = ИдентификаторЗадания;
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,
				ИдентификаторЗадания,
				Неопределено,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена));
			
			УстановитьДатуСледующейИтерации(ЭлементОчереди, 1);
			
			НовыйСтатус = Неопределено;
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
				НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(
					ЭлементОчереди.Документ, ЭлементОчереди.Операция, РезультатПолученияДанных.СтатусОбработки);
			КонецЕсли;
			РезультатыПередачиСообщения.РезультатОбработкиОтвета.НовыйСтатус = НовыйСтатус;
			ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
			
		КонецЕсли;
		
	Иначе
		
		РезультатОбработкиОтвета = Новый Структура;
		РезультатОбработкиОтвета.Вставить("НовыйСтатус");
		РезультатОбработкиОтвета.Вставить("ТекстОшибки");
		
		РезультатыПередачиСообщения = Новый Структура;
		РезультатыПередачиСообщения.Вставить("РезультатОтправкиЗапроса",     РезультатПолученияДанных.РезультатОтправкиЗапроса);
		РезультатыПередачиСообщения.Вставить("РезультатОбработкиОтвета",     РезультатОбработкиОтвета);
		
		РезультатыПередачиСообщения.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		РезультатыПередачиСообщения.Вставить("ТекстСообщения",               РеквизитыИсходящегоСообщения.ТекстСообщенияJSON);
		РезультатыПередачиСообщения.Вставить("ПредставлениеПротоколаОбмена", ПредставлениеПротоколаОбмена);
		
		Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
			РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
				НСтр("ru = '%1 не принят ИС МП:
					       |Текст ошибки: %2'"),
					ОписаниеОперацииПередачиДанных(
						ЭлементОчереди.Операция,
						ЭлементОчереди.Документ),
				РезультатПолученияДанных.ТекстОшибки);
		КонецЕсли;
		
		ОбработатьРезультатПередачиСообщения(РезультатыПередачиСообщения, ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатПолученияВыгрузки(ЭлементОчереди, ПараметрыОбмена)
	
	РезультатОбработкиЗаявки = ВыгрузкиДанныхИСМП.СтатусЗаданияНаВыгрузку(
		ЭлементОчереди.Организация, ЭлементОчереди.ИдентификаторЗаявки, ЭлементОчереди.ВидПродукции);
	
	Если ТребуетсяОбновлениеКлючаСессии(РезультатОбработкиЗаявки, ЭлементОчереди, ПараметрыОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатОбработкиЗаявки);
	
	ТипИСМП = ЭлементОчереди.Документ.Метаданные().Имя;
	СтатусОбработки = РезультатОбработкиЗаявки.СтатусОбработки;
	ТекстВходящегоСообщенияJSON = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
	
	Если Не ТребуетсяПовторОперации
		И РезультатОбработкиЗаявки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
		
		РезультатПолученияИдентификаторов = ВыгрузкиДанныхИСМП.РезультирующиеИдентификаторыВыгрузок(
			ЭлементОчереди.Организация,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлементОчереди.ИдентификаторЗаявки),
			ЭлементОчереди.ВидПродукции);
		
		Если ТребуетсяОбновлениеКлючаСессии(РезультатПолученияИдентификаторов, ЭлементОчереди, ПараметрыОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		ТребуетсяПовторОперации = ТребуетсяПовторОперации(ЭлементОчереди, РезультатПолученияИдентификаторов);
		
		СтатусОбработки = РезультатПолученияИдентификаторов.СтатусОбработки;
		ТекстВходящегоСообщенияJSON = РезультатПолученияИдентификаторов.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
		
		Если Не ТребуетсяПовторОперации
			И РезультатПолученияИдентификаторов.Данные <> Неопределено Тогда
			
			Если РезультатПолученияИдентификаторов.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена Тогда
				ИдентификаторВыгрузки = Неопределено;
				Для Каждого Строка Из РезультатПолученияИдентификаторов.Данные Цикл
					Если Строка.ИдентификаторЗадания = ЭлементОчереди.ИдентификаторЗаявки Тогда
						Если Строка.Доступен Тогда
							ИдентификаторВыгрузки = Строка.ИдентификаторВыгрузки;
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ИдентификаторВыгрузки <> Неопределено Тогда
					
					РезультатПолученияВыгрузки = ВыгрузкиДанныхИСМП.ПолучитьРезультатыВыгрузкиИзZIP(
						ЭлементОчереди.Организация,
						ИдентификаторВыгрузки,
						ЭлементОчереди.ВидПродукции,
						ЭлементОчереди.Операция);
					
					Если РезультатПолученияВыгрузки.ОшибкаСервиса Тогда
						ТребуетсяПовторОперации = Истина;
					ИначеЕсли РезультатПолученияВыгрузки.ДанныеВыгрузки <> Неопределено Тогда
						ДанныеВыгрузки = РезультатПолученияВыгрузки.ДанныеВыгрузки;
					КонецЕсли;
					СтатусОбработки = РезультатПолученияВыгрузки.СтатусОбработки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяПовторОперации И ТребуетсяОжиданиеОбработкиВыгрузки(ЭлементОчереди) Тогда
		
		// Если с момента последнего изменения статуса прошло более 5 минут,
		// то отложим обработку элемента очереди до следующей попытки обмена.			
		Если Не ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная) Тогда
			ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементОчереди.ДатаМодификацииУниверсальная)
			И ТекущаяУниверсальнаяДата() - ЭлементОчереди.ДатаМодификацииУниверсальная >= 5 * 60 Тогда
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
		Иначе
			УстановитьДатуСледующейИтерации(ЭлементОчереди);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементОчереди.ТекущийСтатусОбработки       = СтатусОбработки;
	ЭлементОчереди.ДатаМодификацииУниверсальная = ТекущаяУниверсальнаяДата();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ОчередьСообщенийИСМП.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьСообщенийИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
		НаборЗаписей.Прочитать();
		
		Если Не (НаборЗаписей.Выбран() И НаборЗаписей.Количество() > 0) Тогда
			
			ОтменитьТранзакцию();
			
			// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			
			Возврат;
			
		КонецЕсли;
		
		ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
			ЭлементОчереди,
			РезультатОбработкиЗаявки);
		
		МассивОшибок = Новый Массив;
		Если ЗначениеЗаполнено(РезультатОбработкиЗаявки.ТекстОшибки) Тогда
			МассивОшибок.Добавить(РезультатОбработкиЗаявки.ТекстОшибки);
		КонецЕсли;
		
		ТекстОшибки = "";
		
		ПараметрыЗапроса = ЭлементОчереди.РеквизитыИсходящегоСообщения.ПараметрыЗапроса;
		
		ПараметрыОбновленияСтатуса = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбновленияСтатуса();
		ПараметрыОбновленияСтатуса.Статус            = Неопределено;
		ПараметрыОбновленияСтатуса.СтатусОбработки   = СтатусОбработки;
		ПараметрыОбновленияСтатуса.ОперацияКвитанции = ЭлементОчереди.Операция;
		ПараметрыОбновленияСтатуса.ПротоколОбмена    = ЭлементОчереди.ПротоколОбмена;
		ПараметрыОбновленияСтатуса.ПараметрыЗапроса  = ПараметрыЗапроса;
		ОбъектИзменен = Ложь;
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка
			Тогда
			
			Если РезультатПолученияИдентификаторов <> Неопределено Тогда
				
				ПредставлениеПротоколаОбмена = ДобавитьВПротоколОбмена(
					ЭлементОчереди,
					РезультатПолученияИдентификаторов);
				
				Если ЗначениеЗаполнено(РезультатПолученияИдентификаторов.ТекстОшибки) Тогда
					МассивОшибок.Добавить(РезультатПолученияИдентификаторов.ТекстОшибки);
				КонецЕсли;
				
				Если РезультатПолученияВыгрузки <> Неопределено
					И ЗначениеЗаполнено(РезультатПолученияВыгрузки.ТекстОшибки) Тогда
					МассивОшибок.Добавить(РезультатПолученияВыгрузки.ТекстОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка Тогда
				Если МассивОшибок.Количество() = 0 Тогда
					МассивОшибок.Добавить(СтрШаблон(
						Нстр("ru = 'Ошибка получения выгрузки %1 из сервиса, описание ошибки отсутствует.'"),
						ЭлементОчереди.ИдентификаторЗаявки));
				КонецЕсли;
			КонецЕсли;
			
			ТекстОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("ИдентификаторЗапроса", ЭлементОчереди.ИдентификаторЗаявки);
			Реквизиты.Вставить("СообщениеОснование",   ЭлементОчереди.СообщениеОснование);
			Реквизиты.Вставить("Версия",               ЭлементОчереди.РеквизитыИсходящегоСообщения.Версия);
			Реквизиты.Вставить("ТипСообщения",         ЭлементОчереди.РеквизитыИсходящегоСообщения.ТипСообщения);
			Реквизиты.Вставить("СтатусОбработки",      СтатусОбработки);
			
			Если ДанныеВыгрузки <> Неопределено Тогда
				
				ЭтоЗагрузкаОтклонений = Ложь;
				Если ПараметрыЗапроса.Свойство("ЭтоЗагрузкаОтклонений", ЭтоЗагрузкаОтклонений)
					И ЭтоЗагрузкаОтклонений
					И ДанныеВыгрузки.Количество() = 0 Тогда
					// Не записывать пустой файл выгрузки, обновить дату синхронизации
					
					РегистрыСведений.СинхронизацияДанныхИСМП.УстановитьДатуВыполненияСинхронизации(
						ЭлементОчереди.Организация,
						ЭлементОчереди.ВидПродукции,
						ЭлементОчереди.Операция,
						ПараметрыЗапроса.ДатаВыгрузкиКонецПериода);
					
				Иначе
					
					ПараметрыОбновленияСтатуса.Вставить("ДанныеВыгрузки", ДанныеВыгрузки);
					ОбработкаЗагрузкиПереданногоДокумента(
						ЭлементОчереди,
						ПараметрыОбмена,
						РезультатОбработкиЗаявки,
						ПараметрыОбновленияСтатуса);
					ОбъектИзменен = Истина;
				
					Реквизиты.Вставить("Операция", Перечисления.ВидыОперацийИСМП.ОтчетИСМППолучениеРезультатаВыгрузки);
					Реквизиты.Вставить("Описание", СтрШаблон(НСтр("ru = 'Результаты выгрузки %1'"), ЭлементОчереди.Операция));
					Реквизиты.Вставить("Документ", ЭлементОчереди.Документ);
					
					ХешированиеДанныхОбъект = Новый ХешированиеДанных(ХешФункция.SHA256);
					ХешированиеДанныхОбъект.Добавить(ОбщегоНазначения.ЗначениеВСтрокуXML(ИдентификаторВыгрузки));
					ХешСуммаBase64 = Base64Строка(ХешированиеДанныхОбъект.ХешСумма);
					
					ПараметрыФайла = Новый Структура();
					ПараметрыФайла.Вставить("Автор",              Пользователи.АвторизованныйПользователь());
					ПараметрыФайла.Вставить("ВладелецФайлов",     ЭлементОчереди.Документ);
					ПараметрыФайла.Вставить("ИмяБезРасширения",   Строка(Новый УникальныйИдентификатор));
					ПараметрыФайла.Вставить("РасширениеБезТочки", "zip");
					ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
					
					ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(
						ПараметрыФайла,
						РезультатПолученияВыгрузки.АдресФайлаВоВременномХранилище,,,
						Справочники.ИСМППрисоединенныеФайлы.ПолучитьСсылку());
					
					ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
					ПрисоединенныйФайлОбъект.ХешСумма = ХешСуммаBase64;
					
					ЗаполнитьЗначенияСвойств(ПрисоединенныйФайлОбъект, Реквизиты);
					
					ПрисоединенныйФайлОбъект.Записать();
				
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
				
				// Если рег.задание получило пустую выгрузку, то документ не создается, протокол не записываем.
				Реквизиты.Вставить("Документ", ЭлементОчереди.Документ);
				Реквизиты.Вставить("Операция", ЭлементОчереди.Операция);
				Реквизиты.Вставить("Описание", ТекстОшибки);
				
				ПротоколаОбменаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ЭлементОчереди.ПротоколОбмена);
				ДобавитьЗаписьВПротоколОбмена(
					ПротоколаОбменаXML,
					Реквизиты);
				
			КонецЕсли;
			
			УдалитьСообщениеИзОчереди(ЭлементОчереди, ПараметрыОбмена);
			
		Иначе
			
			ОбновитьИдентификаторЗаявкиСообщенияОчереди(
				НаборЗаписей,,,
				Новый ХранилищеЗначения(ЭлементОчереди.ПротоколОбмена))
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			
			МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЭлементОчереди.Документ);
			
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПолученияДанных(
				ЭлементОчереди.Документ,
				Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента,
				ПараметрыОбновленияСтатуса);
		Иначе
			
			НовыйСтатус = Неопределено;
			
		КонецЕсли;
		
		СтрокаРезультата = СтруктураИзменения();
		
		СтрокаРезультата.Операция                  = ЭлементОчереди.Операция;
		СтрокаРезультата.Назначение                = ЭлементОчереди.Назначение;
		СтрокаРезультата.СтанцияУправленияЗаказами = ЭлементОчереди.СтанцияУправленияЗаказами;
		
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Объект            = ЭлементОчереди.Документ;
		СтрокаРезультата.ДокументОснование = ЭлементОчереди.ДокументОснование;
		
		СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
		СтрокаРезультата.ПодготовленоКПередаче = Ложь;
		СтрокаРезультата.Передано              = Ложь;
		СтрокаРезультата.Принято               = Истина;
		СтрокаРезультата.НовыйСтатус           = НовыйСтатус;
		СтрокаРезультата.ОбъектИзменен         = ОбъектИзменен;
		
		СтрокаРезультата.Сообщение                    = ЭлементОчереди.Сообщение;
		СтрокаРезультата.ТекстСообщения               = ТекстВходящегоСообщенияJSON;
		СтрокаРезультата.ПредставлениеПротоколаОбмена = ПредставлениеПротоколаОбмена;
		
		ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
		
		ТранзакцияЗафиксирована = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТранзакцияЗафиксирована = Ложь;
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки выгрузки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON см. в журнале регистрации.'"),
			ЭлементОчереди.Документ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация);
		
		ТекстОшибкиЖурналРегистрации = СтрШаблон(
			НСтр("ru = 'При загрузке статуса обработки выгрузки по документу %1 возникла ошибка:
			           |Текст ошибки: %2
			           |Организация: %3
			           |Текст JSON:
			           |%4'"),
			ЭлементОчереди.Документ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			ЭлементОчереди.Организация,
			РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
		
		ОбъектМетаданных = Неопределено;
		Если ЗначениеЗаполнено(ЭлементОчереди.Документ) Тогда
			ОбъектМетаданных = ЭлементОчереди.Документ.Метаданные();
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ЭлементОчереди.Документ);
		
	КонецПопытки;
	
	Если ТранзакцияЗафиксирована
		И (СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка) Тогда
		
		УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
		
	ИначеЕсли Не ТранзакцияЗафиксирована Тогда
		
		ПриОтменеТранзакции(ЭлементОчереди, ТекстОшибки, ПараметрыОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьДатуСледующейИтерации(ЭлементОчереди, 0);
		
КонецПроцедуры

#КонецОбласти


