Функция ТекстЗапросаПрослеживаемыеТовары(НомераТаблиц, ПараметрыПроведения) Экспорт
	
	НомераТаблиц.Вставить("ВТ_Прослеживаемость",    НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_СуммыБезНДС",         НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрослеживаемыеОперации", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрослеживаемыеТовары",   НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ОтчетОРозничныхПродажахСведенияПрослеживаемости.Количество) КАК Количество,
	|	СУММА(ОтчетОРозничныхПродажахСведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	ОтчетОРозничныхПродажахТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ОтчетОРозничныхПродажахСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.ОтчетОбОперациях) КАК ОтражениеВОтчетности,
	|	ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.РеализацияРозничная) КАК КодОперации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОперации,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НАЧАЛОПЕРИОДА(ОтчетОРозничныхПродажахТовары.Ссылка.Дата, КВАРТАЛ) КАК ПериодОперации,
	|	ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Ссылка.Номер, """") КАК НомерДокумента,
	|	ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.ТипыДокументов.ОтчетОРозничныхПродажах) КАК ТипДокументаВПрослеживаемости,
	|	ОтчетОРозничныхПродажахТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтчетОРозничныхПродажахСведенияПрослеживаемости.Сумма КАК СуммаБезНДС
	|ПОМЕСТИТЬ ВТ_Прослеживаемость
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.СведенияПрослеживаемости КАК ОтчетОРозничныхПродажахСведенияПрослеживаемости
	|		ПО ОтчетОРозничныхПродажахТовары.Ссылка = ОтчетОРозничныхПродажахСведенияПрослеживаемости.Ссылка
	|			И ОтчетОРозничныхПродажахТовары.ИдентификаторСтроки = ОтчетОРозничныхПродажахСведенияПрослеживаемости.ИдентификаторСтроки
	|ГДЕ
	|	ОтчетОРозничныхПродажахТовары.ПрослеживаемыйТовар
	|	И ОтчетОРозничныхПродажахТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажахТовары.Номенклатура,
	|	ОтчетОРозничныхПродажахСведенияПрослеживаемости.РНПТ,
	|	НАЧАЛОПЕРИОДА(ОтчетОРозничныхПродажахТовары.Ссылка.Дата, КВАРТАЛ),
	|	ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Ссылка.Номер, """"),
	|	ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	ОтчетОРозничныхПродажахТовары.ИдентификаторСтроки,
	|	ОтчетОРозничныхПродажахСведенияПрослеживаемости.Сумма,
	|	ОтчетОРозничныхПродажахТовары.СтранаПроисхождения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетОРозничныхПродажахТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА ОтчетОРозничныхПродажахТовары.Сумма - ОтчетОРозничныхПродажахТовары.СуммаНДС
	|			ИНАЧЕ ОтчетОРозничныхПродажахТовары.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ОтчетОРозничныхПродажахТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_СуммыБезНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
	|ГДЕ
	|	ОтчетОРозничныхПродажахТовары.Ссылка = &Ссылка
	|	И ОтчетОРозничныхПродажахТовары.ПрослеживаемыйТовар
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажахТовары.Номенклатура,
	|	ОтчетОРозничныхПродажахТовары.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Прослеживаемость.Номенклатура КАК Номенклатура,
	|	ВТ_Прослеживаемость.Количество КАК Количество,
	|	ВТ_Прослеживаемость.РНПТ КАК РНПТ,
	|	ВТ_Прослеживаемость.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ВТ_Прослеживаемость.ОтражениеВОтчетности КАК ОтражениеВОтчетности,
	|	ВТ_Прослеживаемость.КодОперации КАК КодОперации,
	|	ВТ_Прослеживаемость.ДокументОперации КАК ДокументОперации,
	|	ВТ_Прослеживаемость.Контрагент КАК Контрагент,
	|	ВТ_Прослеживаемость.ПериодОперации КАК ПериодОперации,
	|	ВТ_Прослеживаемость.НомерДокумента КАК НомерДокумента,
	|	ВТ_Прослеживаемость.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_Прослеживаемость.ТипДокументаВПрослеживаемости КАК ТипДокументаВПрослеживаемости,
	|	ЕСТЬNULL(ВТ_СуммыБезНДС.СуммаБезНДС, 0) КАК СуммаБезНДС,
	|	ВТ_Прослеживаемость.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_Прослеживаемость КАК ВТ_Прослеживаемость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыБезНДС КАК ВТ_СуммыБезНДС
	|		ПО ВТ_Прослеживаемость.ИдентификаторСтроки = ВТ_СуммыБезНДС.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Прослеживаемость.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_Прослеживаемость.Количество) КАК Количество,
	|	ВТ_Прослеживаемость.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СУММА(ВТ_Прослеживаемость.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комитент,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ВТ_Прослеживаемость.РНПТ КАК РНПТ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ОснованиеДляВозврата
	|ИЗ
	|	ВТ_Прослеживаемость КАК ВТ_Прослеживаемость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Прослеживаемость.Номенклатура,
	|	ВТ_Прослеживаемость.СтранаПроисхождения,
	|	ВТ_Прослеживаемость.РНПТ";
	
	Возврат ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
	
КонецФункции