
#Область ПрограммныйИнтерфейс

// Заполняет структуру данных запроса проверки кода для разрешительной системы.
// Возвращаемое значение:
//  Структура.
//
Функция ПараметрыЗапросПроверкиКода() Экспорт  
	
	Параметры = Новый Структура();   
	Параметры.Вставить("ИдентификаторЗапроса"); // Строка,Обязательно - Уникальный идентификатор запроса.
	Параметры.Вставить("ВременнаяМетка");  // Строка,Обязательно - Дата и время с точностью до миллисекунд формирования запроса в текстовом виде.  
	Возврат Параметры; 
	
КонецФункции             

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Истина если используется ККТ без подключения оборудования
//
// Параметры:
//  ПараметрыОперации - Структура - параметры выполнения операции.
//
// Возвращаемое значение:
//  Булево
Функция ЭтоККТБезПодключения(ПараметрыОперации) Экспорт
	
	Возврат ЗначениеЗаполнено(ПараметрыОперации) 
		И ПараметрыОперации.Свойство("КассаККМ") 
		И ЗначениеЗаполнено(ПараметрыОперации.КассаККМ);
	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Заполняет структуру данных дробное количество для товарной номенклатуры.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПараметрыДробноеКоличество() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("Числитель"   , Неопределено); // Число,Обязательно - Числитель дробного количества - количество  реализуемых  товаров из упаковке.
	Параметры.Вставить("Знаменатель" , Неопределено); // Число,Обязательно - Знаменатель дробного количества - общее количество товаров в потребительской упаковке. 
	Возврат Параметры; 
	
КонецФункции

// Заполняет структуру параметров запрос КМ.
// 
// Возвращаемое значение:
//  Структура -Параметры запрос КМ:
//   * ИдентификаторЗапроса - Строка - Уникальный идентификатор запроса
//   * Количество - Число - Количество
//   * ДробноеКоличество - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДробноеКоличество.
//   * КонтрольнаяМарка - Строка - Код контрольной марки. Кодируется текстом в кодировке Base64.
//   * КодЕдиницыИзмерения - Строка -  Код единицы измерения в соответствии с общероссийским классификатором единиц измерения.
//   * ПланируемыйСтатусТовара - ПеречислениеСсылка.ПланируемыйСтатусМаркируемогоТовара.
//
Функция ПараметрыЗапросКМ() Экспорт;
		
	Параметры = Новый Структура();
	Параметры.Вставить("ИдентификаторЗапроса"); // Строка,Обязательно - Уникальный идентификатор запроса
	Параметры.Вставить("ОжидатьПолучениеОтветаОИСМ", Истина); // Булево,Обязательно - Будет ли ожидаться получение ответа от ОИСМ. 
	Параметры.Вставить("ОтправлятьНаСерверОИСМ"    , Истина); // Булево,Обязательно - Запрос КМ формируется локально или отправляется на сервер ОИСМ.
	Параметры.Вставить("Количество", 0);  // Число,Обязательно - Количество 
	Параметры.Вставить("ДробноеКоличество", ПараметрыДробноеКоличество());     
	Параметры.Вставить("КонтрольнаяМарка"); // Строка,Необязательно - Код контрольной марки. Кодируется текстом в кодировке Base64.
	// КодЕдиницыИзмерения - Если значение реквизита заполнено, используется он, иначе МераКоличестваПредметаРасчета
	Параметры.Вставить("КодЕдиницыИзмерения"); // Строка,Необязательно - Код единицы измерения в соответствии с общероссийским классификатором единиц измерения.
	Параметры.Вставить("МераКоличестваПредметаРасчета"); // Перечисление.МераКоличестваПредметаРасчетаККТ,Необязательно - Мера количества предмета расчета. Тэг 2108. Значение из таблицы 114 (ФФД).
	Параметры.Вставить("ПланируемыйСтатусТовара"); // Перечисление.ПланируемыйСтатусМаркируемогоТовара - Необязательно
	Возврат Параметры; 
	
КонецФункции

#КонецОбласти

