
&НаКлиенте
Процедура Табак(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак"));
КонецПроцедуры

&НаКлиенте
Процедура Обувь(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь"));
КонецПроцедуры

&НаКлиенте
Процедура ЛегкаяПромышленность(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность"));
КонецПроцедуры

&НаКлиенте
Процедура МолочнаяПродукцияВЕТИС(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС"));
КонецПроцедуры

&НаКлиенте
Процедура Шины(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины"));
КонецПроцедуры

&НаКлиенте
Процедура Фотоаппараты(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Фотоаппараты"));
КонецПроцедуры

&НаКлиенте
Процедура Духи(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи"));
КонецПроцедуры

&НаКлиенте
Процедура Велосипеды(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Велосипеды"));
КонецПроцедуры

&НаКлиенте
Процедура КреслаКоляски(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски"));
КонецПроцедуры

&НаКлиенте
Процедура МолочнаяПродукцияБезВЕТИС(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС"));
КонецПроцедуры

&НаКлиенте
Процедура АльтернативнаяТабачнаяПродукция(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак"));
КонецПроцедуры

&НаКлиенте
Процедура УпакованнаяВода(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода"));
КонецПроцедуры

&НаКлиенте
Процедура Алкоголь(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная"));
КонецПроцедуры

&НаКлиенте
Процедура Антисептики(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Антисептики"));
КонецПроцедуры

&НаКлиенте
Процедура БАДы(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы"));
КонецПроцедуры

&НаКлиенте
Процедура НикотиносодержащаяПродукция(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция"));
КонецПроцедуры

&НаКлиенте
Процедура Пиво(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво"));
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияИзНатуральногоМеха(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха"));
КонецПроцедуры

&НаКлиенте
Процедура СоковаяПродукция(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СоковаяПродукция"));
КонецПроцедуры

&НаКлиенте
Процедура БезалкогольноеПиво(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольноеПиво"));
КонецПроцедуры

&НаКлиенте
Процедура МорепродуктыПодконтрольныеВЕТИС(Команда)
	ОповеститьОВыборе(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС"));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяГруппа = Элементы.ЛеваяКолонка;
	ВидимостьКнопки = Параметры.МожноПроверятьАлкогольнуюПродукцию И ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
	Элементы.Алкоголь.Видимость = ВидимостьКнопки;
	ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная;
	ВсегоЭлементов = ?(ВидимостьКнопки, 1, 0);
	Если ВидимостьКнопки Тогда 
		Элементы.Переместить(Элементы.Алкоголь, ТекущаяГруппа);
		ТекущаяГруппа = ?(ТекущаяГруппа = Элементы.ЛеваяКолонка, Элементы.ПраваяКолонка, Элементы.ЛеваяКолонка);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП") Тогда 
		Для Каждого ВидПродукцииУчета Из ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции() Цикл
			Если ВидПродукцииУчета <> Перечисления.ВидыПродукцииИС.УдалитьМолочнаяПродукция Тогда
				Элементы[xmlстрока(ВидПродукцииУчета)].Видимость = Истина;
				Элементы.Переместить(Элементы[xmlстрока(ВидПродукцииУчета)], ТекущаяГруппа);
				ТекущаяГруппа = ?(ТекущаяГруппа = Элементы.ЛеваяКолонка, Элементы.ПраваяКолонка, Элементы.ЛеваяКолонка);
				ВидПродукции = ВидПродукцииУчета;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ВсегоЭлементов = ВсегоЭлементов + ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции().Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВсегоЭлементов = 1 Тогда 
		ОповеститьОВыборе(ВидПродукции);
	КонецЕсли;
	
КонецПроцедуры
