// Возвращает структуру, содержащую различные персональные настройки
// по работе с файлами
Функция ПолучитьПерсональныеНастройкиРаботыСФайлами() Экспорт
	
	Настройки = Новый Структура;
	
	ФайловыеФункции.УстановитьПерсональныеНастройкиФайловыхФункций(Настройки);
	
	Возврат Настройки;
	
КонецФункции

// Возвращает структуру с двоичными данными файла и подписи
Функция ПолучитьДвоичныеДанныеФайлаИПодписи(ДанныеСтроки) Экспорт
	

	// ПрисоединенныеФайлы
	Если ПрисоединенныеФайлыСобытия.ЭтоЭлементПрисоединенныеФайлы(ДанныеСтроки.Объект) Тогда
		Возврат ПрисоединенныеФайлыСлужебный.ПолучитьДвоичныеДанныеФайлаИПодписи(ДанныеСтроки.Объект, ДанныеСтроки.АдресПодписи);
	КонецЕсли;
	// Конец ПрисоединенныеФайлы
	
	Возврат Неопределено;
	
КонецФункции
