/////////////////////////////////////////////////////
//
// Определяемые типы
//
/////////////////////////////////////////////////////

Функция ОпределяемыеТипыГИСЭПДУПП() Экспорт

	Типы = Новый Структура;
	Типы.Вставить("БанковскийСчетЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.БанковскиеСчета
		|,СправочникСсылка.СтроковыеЗначенияЭПД"
)));
	Типы.Вставить("ВалютаЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Валюты
		|,СправочникСсылка.СтроковыеЗначенияЭПД
		|"
)));
	Типы.Вставить("ДокументыЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
	    |ДокументСсылка.ЭлектроннаяТранспортнаяНакладная
		|"
)));
	Типы.Вставить("ЗначенияРеквизитовЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.КлассификаторДОПОГЭПД
		|,СправочникСсылка.ХранимыеДанныеЭПД
		|,СправочникСсылка.Валюты
		|,СправочникСсылка.Контрагенты
		|,СправочникСсылка.БанковскиеСчета
		|,СправочникСсылка.КлассификаторУпаковкиЭПД
		|,СправочникСсылка.СтроковыеЗначенияЭПД
		|,СправочникСсылка.ФизическиеЛица
		|,СправочникСсылка.Организации
		|"
)));
	Типы.Вставить("КонтрагентЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Контрагенты
		|,СправочникСсылка.СтроковыеЗначенияЭПД
		|"
)));
	Типы.Вставить("УчастникЭДО_ЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Контрагенты
		|,СправочникСсылка.СтроковыеЗначенияЭПД
		|,СправочникСсылка.Организации
		|"
)));
	Типы.Вставить("ФизическоеЛицоЭПД",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.СтроковыеЗначенияЭПД
		|,СправочникСсылка.ФизическиеЛица"
)));

	Возврат Новый ФиксированнаяСтруктура(Типы);

КонецФункции
