//Кеширование для байтовых значений

Функция ЗначениеИ16(Знач Параметр1,Знач Параметр2, МассивБит)
	
	Временная = 0;
	Степень = 1;
	Для Счетчик = 0 По 3 Цикл
		
		Временная = Временная + Степень * МассивБит[8*Параметр1+Счетчик] * МассивБит[8*Параметр2+Счетчик];
		Степень = Степень*2;
		
	КонецЦикла;
	
	Возврат Временная;
	
КонецФункции

Функция ЗначениеИ(Знач Параметр1,Знач Параметр2, МассивИ16)
	
	Возврат МассивИ16[16*Параметр1%16 + Параметр2%16] + МассивИ16[16*Цел(Параметр1/16) + Цел(Параметр2/16)] * 16;
	
КонецФункции

Функция ЗначениеХОР(Знач Параметр1, Знач Параметр2, МассивБитовыхОпераций)
	
	Возврат 255-МассивБитовыхОпераций[65535-256*МассивБитовыхОпераций[256*Параметр1+255-Параметр2]-МассивБитовыхОпераций[256*Параметр2+255-Параметр1]];
	
КонецФункции

Функция МассивБит()
	
	Результат = Новый Массив;
	Для Счетчик = 0 По 15 Цикл
		Временная = Счетчик;
		Для Биты = 0 По 7 Цикл
			Результат.Добавить(Временная%2);
			Временная = Цел(Временная/2);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция МассивИ16(МассивБит)
	Результат = Новый Массив;
	Для Счетчик = 0 По 15 Цикл
		Для Счетчик2 = 0 По 15 Цикл
			Результат.Добавить(ЗначениеИ16(Счетчик,Счетчик2,МассивБит));
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция МассивБитовыхОпераций256(Ключ = 0) Экспорт
	
	МассивБитовыхОпераций = Новый Массив;
	МассивБит = МассивБит();
	МассивИ16 = МассивИ16(МассивБит);
	Для Счетчик = 0 По 255 Цикл
		Для Счетчик2 = 0 По Счетчик-1 Цикл
			МассивБитовыхОпераций.Добавить(МассивБитовыхОпераций[256*Счетчик2+Счетчик]);
		КонецЦикла;
		Для Счетчик2 = Счетчик По 255 Цикл
			МассивБитовыхОпераций.Добавить(ЗначениеИ(Счетчик,Счетчик2,МассивИ16));
		КонецЦикла;
	КонецЦикла;
	Для Счетчик = 0 По 255 Цикл
		Для Счетчик2 = 0 По Счетчик-1 Цикл
			МассивБитовыхОпераций.Добавить(МассивБитовыхОпераций[65536+256*Счетчик2+Счетчик]);
		КонецЦикла;
		Для Счетчик2 = Счетчик По 255 Цикл
			МассивБитовыхОпераций.Добавить(ЗначениеХОР(Счетчик,Счетчик2,МассивБитовыхОпераций));
		КонецЦикла;
	КонецЦикла;
	Временная = 1;
	Для Счетчик = 0 По 31 Цикл
		МассивБитовыхОпераций.Добавить(Временная);
		Временная = Временная * 2;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивБитовыхОпераций);
	
КонецФункции

