#Область ПрограммныйИнтерфейс

// Открыть форму проверки и подбора пива ИСМП.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник вызова
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий
Процедура ОткрытьФормуПроверкиИПодбораПиваИСМП(Форма, ПараметрыУказанияСерий) Экспорт
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Возврат;
	КонецЕсли;
	Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроверкаИПодборПродукцииИСМПКлиент");
	Модуль.ОткрытьФормуПроверкиИПодбора(Форма, ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво"), ПараметрыУказанияСерий);
	
КонецПроцедуры

#КонецОбласти
