Перем мВалютаРегламентированногоУчета Экспорт;
Перем СтрокаРеквизитовОписаниеОрганизации Экспорт;

Функция ПечатьТТН()

	Если Документ.Дата < Дата(2012, 03, 13) Тогда
		ОбработкаПечати = ЭтотОбъект.ПолучитьФорму("Форма");
	ИначеЕсли Документ.Дата < Дата(2021, 01, 01) Тогда
		ОбработкаПечати = ЭтотОбъект.ПолучитьФорму("Форма");
	ИначеЕсли Документ.Дата < Дата(2022, 03, 01) Тогда
		ОбработкаПечати = ЭтотОбъект.ПолучитьФорму("Форма2200");
	Иначе
		ОбработкаПечати = ЭтотОбъект.ПолучитьФорму("Форма2116");
	КонецЕсли;
	
	ОбработкаПечати.СсылкаНаОбъект = Документ;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОбработкаПечати.ПунктРазгрузки = Документ.АдресДоставки;
	КонецЕсли;
	
	ОбработкаПечати.Открыть();

	Возврат Неопределено;

КонецФункции // ПечатьТТН()

Функция Печать() Экспорт
	
	ТабДокумент = ПечатьТТН();
	
	Возврат ТабДокумент;
	
Конецфункции

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
СтрокаРеквизитовОписаниеОрганизации = "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны";
