
// Получает доступные пользователю для подписи сертификаты по организации.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организации - организация, чьи сертификаты получаются.
// 
// Возвращаемое значение:
//   Массив - массив доступных сертификатов.
//
Функция СертификатыПользователяДляПодписиПоОрганизации(Организация) Экспорт
	
	Сертификаты = Новый Массив;
	
	ЕстьПравоДоступаЧтение = ПравоДоступа("Чтение", Метаданные.Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования);
	Если Не ЕстьПравоДоступаЧтение Тогда
		Возврат Сертификаты;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сертификаты.Ссылка КАК Сертификат
	|ИЗ
	|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК Сертификаты
	|ГДЕ
	|	Сертификаты.Организация = &Организация
	|	И (Сертификаты.Пользователь = &Пользователь
	|		ИЛИ Сертификаты.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))");
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сертификаты.Добавить(Выборка.Сертификат);
	КонецЦикла;
	
	Возврат Сертификаты;
	
КонецФункции
