&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ОрганизацияЕГАИС, Контрагент");
	
	ФактическийАдресКонтрагента = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, ТекущаяДата()).ФактическийАдрес;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСоответствие(Команда)
	
	Если ЕстьПредупреждения() Тогда
		ТекстВопроса = НСтр("ru = 'Между связываемыми элементами есть расхождения. Продолжить?'");
		РезультатВопроса = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.Отмена);
		ЗаписатьСоответствие_Завершение(КодВозвратаДиалога.ОК, Неопределено);
	Иначе
		ЗаписатьСоответствие_Завершение(КодВозвратаДиалога.ОК, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСоответствие_Завершение(РезультатВопроса, ДополнительныеПараметры)
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСоответствиеНаСервере();
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеНаСервере()
	
	Запись = РегистрыСведений.СоответствиеОрганизацийЕГАИС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма);
	Запись.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.ПредупреждениеИНН.Видимость = НЕ ПустаяСтрока(Контрагент.ИНН) И НЕ ПустаяСтрока(ОрганизацияЕГАИС.ИНН) И СокрЛП(Контрагент.ИНН) <> СокрЛП(ОрганизацияЕГАИС.ИНН);
	Элементы.ПредупреждениеКПП.Видимость = НЕ ПустаяСтрока(Контрагент.КПП) И НЕ ПустаяСтрока(ОрганизацияЕГАИС.КПП) И СокрЛП(Контрагент.КПП) <> СокрЛП(ОрганизацияЕГАИС.КПП);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьПредупреждения()
	
	Возврат Элементы.ПредупреждениеИНН.Видимость ИЛИ Элементы.ПредупреждениеКПП.Видимость;
	
КонецФункции
