#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		ЗначенияЗаполнения = Неопределено;
		Ключ = Неопределено;
		ЗначениеКопирования = Неопределено;
		Если Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения) Тогда
			Тип = Неопределено;
			ИмяОбъекта = Неопределено;
			Если ЗначенияЗаполнения.Свойство("ИмяОбъекта", ИмяОбъекта) И ЗначенияЗаполнения.Свойство("Тип", Тип) Тогда
				ОписаниеГруппыДанных = ОбменСГИСЭПДКлиентСервер.ОписаниеГруппыДанных(Тип, ИмяОбъекта);
				Для Каждого КиЗ Из Параметры.ЗначенияЗаполнения Цикл
					Параметры.Вставить(КиЗ.Ключ, КиЗ.Значение);	
				КонецЦикла;
				Если ЗначениеЗаполнено(ОписаниеГруппыДанных.ИмяФормы) Тогда
					ВыбраннаяФорма = ОписаниеГруппыДанных.ИмяФормы;  
					СтандартнаяОбработка = Ложь;
				КонецЕсли;	
			КонецЕсли;
		ИначеЕсли Параметры.Свойство("Ключ", Ключ) Тогда
			ОписаниеГруппыДанных = ОбменСГИСЭПДКлиентСервер.ОписаниеГруппыДанных(Ключ.Тип, Ключ.ИмяОбъекта);
			Если ЗначениеЗаполнено(ОписаниеГруппыДанных.ИмяФормы) Тогда
				ВыбраннаяФорма = ОписаниеГруппыДанных.ИмяФормы;  
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		ИначеЕсли Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования) Тогда
			ОписаниеГруппыДанных = ОбменСГИСЭПДКлиентСервер.ОписаниеГруппыДанных(ЗначениеКопирования.Тип, ЗначениеКопирования.ИмяОбъекта);
			Если ЗначениеЗаполнено(ОписаниеГруппыДанных.ИмяФормы) Тогда
				ВыбраннаяФорма = ОписаниеГруппыДанных.ИмяФормы;  
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
