
#Область ОбновлениеИнформационнойБазы

Функция ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(Номенклатура.ТабачнаяПродукция
	|			ИЛИ Номенклатура.ОбувнаяПродукция)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(МассивСсылок) Экспорт

	Для Каждого Выборка Из МассивСсылок Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если СправочникОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект.ВидПродукцииИС = ?(СправочникОбъект.ТабачнаяПродукция, Перечисления.ВидыПродукцииИС.Табак, Перечисления.ВидыПродукцииИС.Обувь);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
