
#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура ПередОткрытиемФормыЭлементаДополнительно(Форма, ДополнительныеДействия, НазначаемыеДействия = Неопределено) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействияФормыЭлемента(Элемент, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента, Форма, Ссылка) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнительноеДействиеПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ПередЗаписьюФормыЭлементаДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнитьСтруктуруДляСпискаДополнительныхФайлов(Форма, СтруктураДляСпискаДополнительныхФайлов) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ФАЙЛАМИ РЕЗЮМЕ

Процедура ПередОткрытиемФормыСпискаФайловИзображений(Форма, ВладелецФормы, ДополнительныеДействия) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействия(Кнопка, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнительныеФайлыПриПолученииДанныхДополнительно(Форма, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ОбработчикОжиданияФайлыПриАктивизацииСтрокиДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Функция ДобавитьПрикрепленныеФайлы(ОбъектСсылка, ЗаголовокОкна) Экспорт
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок = ЗаголовокОкна;
	ДиалогОткрытияФайла.Фильтр = РаботаСФайлами.ПолучитьФильтрФайлов();
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	
	ДобавленныеФайлы = Новый Массив;

	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат ДобавленныеФайлы;
	КонецЕсли;  
	
	Для Каждого ВыбранныйФайл Из ДиалогОткрытияФайла.ВыбранныеФайлы Цикл
		
		ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(ВыбранныйФайл);
		
		Если РаботаСФайлами.ФайлИмеетРасширениеИзображения(ИмяФайла) Тогда
			ЗначениеХранилища = Новый Картинка(ВыбранныйФайл);
			ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
		Иначе
			ЗначениеХранилища = Новый ДвоичныеДанные(ВыбранныйФайл);
			ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
		КонецЕсли;
		
		НовыйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
		НовыйФайл.Хранилище		= Новый ХранилищеЗначения(ЗначениеХранилища, Новый СжатиеДанных);
		НовыйФайл.Наименование	= ИмяФайла;
		НовыйФайл.Объект		= ОбъектСсылка;
		НовыйФайл.ИмяФайла		= ИмяФайла;
		НовыйФайл.ВидДанных		= ВидДанных;
		НовыйФайл.Записать();
		
		ДобавленныеФайлы.Добавить(НовыйФайл.Ссылка);
	
	КонецЦикла;

	Возврат ДобавленныеФайлы;
	
КонецФункции

#КонецЕсли
