&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ЭтоОднострочныйВвод = Параметры.Свойство("ОднострочныйВвод");
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулПеревозчикаЗаменыЗаменыВодителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ЭтоОднострочныйВвод
		И ТитулПеревозчикаЗаменыЗаменыВодителей.Количество() = 1 Тогда
		ПоказатьПредупреждение(,"Для выбранного вида операции допускается выбор только одного водителя.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДокументПередачиГрузаНовомуВодителюНаименованиеПриИзменении(Элемент)
	
	Если Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные = Неопределено Тогда
		ИдентификаторСтроки = Неопределено;	
	Иначе	
		ИдентификаторСтроки = Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
	
	ИзменитьОформлениеКнопок(Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки",
		"ЗаполнитьТитулПеревозчикаЗаменыВодительДокументПередачиГрузаРеквизитыСторон", ИдентификаторСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтаФорма);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции




&НаКлиенте
Процедура ТитулПеревозчикаЗаменыЗаменыВодителейПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтаФорма, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулПеревозчикаЗаменыВодительДокументПередачиГрузаРеквизитыСторонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Это второй параметр нажатия гиперссылки
	Если ДанныеВыбора = Истина Тогда
		ДанныеВыбора = Ложь;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные;
	// Однострочный ввод
	Если Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = ТитулПеревозчикаЗаменыЗаменыВодителей[0];
	КонецЕсли;
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулПеревозчикаЗаменыНовыйВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные;
	// Однострочный ввод
	Если Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = ТитулПеревозчикаЗаменыЗаменыВодителей[0];
	КонецЕсли;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулПеревозчикаЗаменыНовыйВодительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные;
	// Однострочный ввод
	Если Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = ТитулПеревозчикаЗаменыЗаменыВодителей[0];
	КонецЕсли;
	
	ЗначениеРеквизита = ТекущиеДанные.ХранимыеДанныеТитулПеревозчикаЗаменыНовыйВодитель;
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", СтрЗаменить(Элемент.Имя, "ХранимыеДанные", ""));
		ВходящийКонтекст.Вставить("ТекущиеДанные", ТекущиеДанные);
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, СтрЗаменить(Элемент.Имя, "ХранимыеДанные", ""));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулПеревозчикаЗаменыНовыйВодительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(ЭтаФорма, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулПеревозчикаЗаменыПутевыеЛистыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Это второй параметр нажатия гиперссылки
	Если ДанныеВыбора = Истина Тогда
		ДанныеВыбора = Ложь;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные;
	// Однострочный ввод
	Если Элементы.ТитулПеревозчикаЗаменыЗаменыВодителей.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = ТитулПеревозчикаЗаменыЗаменыВодителей[0];
	КонецЕсли;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулПеревозчикаЗаменыЗаменыВодителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ЗаполнитьТитулПеревозчикаЗаменыВодительДокументПередачиГрузаРеквизитыСторон" Тогда
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Поле.Имя, Элемент.ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	Если Поле.Имя = "ЗаполнитьТитулПеревозчикаЗаменыПутевыеЛисты" Тогда
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Поле.Имя, Элемент.ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулПеревозчикаЗаменыЗаменыВодителейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтаФорма, НоваяСтрока, Копирование);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	 
	КонецЕсли;
	
КонецПроцедуры

#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтаФорма.НачальноеОформлениеВыполнено Тогда
		ЭтаФорма.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтаФорма.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтаФорма.СтруктураДополнительногоОформленияКнопок = 
				Новый Структура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтаФорма.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДанными = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
	СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтаФорма);
	СтруктураСДаннымиФормыДляОформленияКнопок = ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтаФорма);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДанными,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтаФорма.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтаФорма, СтруктураСТекущимиДанными, МассивОформления);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДанными,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	Результат = Новый Структура("Успешно, НовыйАдресВХранилище, МассивОформления", Ложь, Неопределено, Неопределено);
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДанными, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);
		
	СтруктураДанных = ПолучитьИзВременногоХранилища(НовыйАдресВХранилище);
	Если СтруктураДанных = Неопределено Тогда
		Возврат Результат;	
	Иначе
		Результат.Успешно = Истина;
		Результат.НовыйАдресВХранилище = НовыйАдресВХранилище;
		Результат.МассивОформления = СтруктураДанных.МассивОформления;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(УникальныйИдентификаторОбновляемойФормы)
	
	ЭтаФорма.НачальноеОформлениеВыполнено = Истина;
	
	СтруктураСТекущимиДанными = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДанными);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтаФорма, СтруктураСТекущимиДанными);
	
КонецПроцедуры

#КонецОбласти
