////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ИНТЕРФЕЙСАМИ

Процедура ВключитьИнтерфейсГосИС() Экспорт
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	ИмяИнтерфейса = ?(ПользовательИБ.ОсновнойИнтерфейс = Неопределено, "Полный", ПользовательИБ.ОсновнойИнтерфейс.Имя);
	
	Если ДоступенИнтерфейсГосИС(ИмяИнтерфейса) Тогда
		
		ГлавныйИнтерфейс.ИнтерфейсГосИС.Видимость = Истина;
		
	Иначе
		
		ГлавныйИнтерфейс.ИнтерфейсГосИС.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДоступенИнтерфейсГосИС(ИмяИнтерфейса) Экспорт
	
	Интерфейсы = ИнтерфейсыДляГосИС();
	
	Возврат Интерфейсы.Найти(ИмяИнтерфейса) <> Неопределено;
	
КонецФункции

Функция ИнтерфейсыДляГосИС()
	
	МассивИнтерфейсов = Новый Массив;
	МассивИнтерфейсов.Добавить("Полный");
	МассивИнтерфейсов.Добавить("УправлениеЗакупками");
	МассивИнтерфейсов.Добавить("УправлениеПродажами");
	МассивИнтерфейсов.Добавить("УправлениеРозничнойТорговлей");
	
	Возврат МассивИнтерфейсов;
	
КонецФункции

Процедура ПереключитьИнтерфейсУправлениеЗакупками() Экспорт
	
	ИмяИнтерфейса = "УправлениеЗакупками,ИнтерфейсГосИС";
	
	ГлавныйИнтерфейс.ПереключитьИнтерфейс(ИмяИнтерфейса);
	
КонецПроцедуры

Процедура ПереключитьИнтерфейсУправлениеПродажами() Экспорт
	
	ИмяИнтерфейса = "УправлениеПродажами,ИнтерфейсГосИС";
	
	ГлавныйИнтерфейс.ПереключитьИнтерфейс(ИмяИнтерфейса);
	
КонецПроцедуры

Процедура ПереключитьИнтерфейсУправлениеРозничнойТорговлей() Экспорт
	
	ИмяИнтерфейса = "УправлениеРозничнойТорговлей,ИнтерфейсГосИС";
	
	ГлавныйИнтерфейс.ПереключитьИнтерфейс(ИмяИнтерфейса);
	
КонецПроцедуры

Процедура ПереключитьИнтерфейсПолный() Экспорт
	
	ИмяИнтерфейса = "Полный,ИнтерфейсГосИС";
	
	ГлавныйИнтерфейс.ПереключитьИнтерфейс(ИмяИнтерфейса);
	
КонецПроцедуры

