#Область СлужебныеПроцедурыИФункции

#Область ЭквайринговыеТерминалы

// Процедура выполняет получение параметров карты.
//
Процедура ПараметрыКарты(ОбъектДрайвера, ПараметрыПодключения, ДанныеОперации, РезультатВыполнения)
	
	РезультатВыполнения.Результат = Ложь;
	
	РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса; 
	Если РевизияИнтерфейса > 3004 Тогда
		ОтПоследнейОперации = Ложь;
		НомерКарты = "";
		ХешНомерКарты = "";
		СсылкаНаПлатежныйСчет = "";
		ТипКарты  = "";
		СвояКарта = 0;
		Попытка              
			Если РевизияИнтерфейса >= 4000 Тогда    
				РеквизитыКартыQR = ?(ДанныеОперации.Свойство("РеквизитыКартыQR"), ДанныеОперации.РеквизитыКартыQR, "");   
				Если Не ПустаяСтрока(РеквизитыКартыQR) И НЕ ПараметрыПодключения.ConsumerPresentedQR Тогда
					ОписаниеОшибки = НСтр("ru='Consumer-Presented QR не поддерживается драйвером.'");
					РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
					РезультатВыполнения.Результат = Ложь;
					Возврат;   
				КонецЕсли;
				Результат = ОбъектДрайвера.ПолучитьПараметрыКарты(ПараметрыПодключения.ИДУстройства, РеквизитыКартыQR, ОтПоследнейОперации, НомерКарты, ХешНомерКарты, СсылкаНаПлатежныйСчет, ТипКарты, СвояКарта);
			ИначеЕсли РевизияИнтерфейса >= 3007 Тогда
				Результат = ОбъектДрайвера.ПолучитьПараметрыКарты(ПараметрыПодключения.ИДУстройства, ОтПоследнейОперации, НомерКарты, ХешНомерКарты, СсылкаНаПлатежныйСчет, ТипКарты, СвояКарта);
			Иначе
				Результат = ОбъектДрайвера.ПолучитьПараметрыКарты(ПараметрыПодключения.ИДУстройства, ОтПоследнейОперации, НомерКарты, ХешНомерКарты, ТипКарты, СвояКарта);
			КонецЕсли;
			Если Результат Тогда
				РезультатВыполнения.Вставить("НомерКарты"   , НомерКарты);
				РезультатВыполнения.Вставить("ХешНомерКарты", ХешНомерКарты);
				РезультатВыполнения.Вставить("СсылкаНаПлатежныйСчет", СсылкаНаПлатежныйСчет);
				РезультатВыполнения.Вставить("ТипКарты"     , ТипКарты);
				РезультатВыполнения.Вставить("СвояКарта"    , СвояКарта);
				РезультатВыполнения.Результат = Истина;
			Иначе
				ОписаниеОшибки = "";
				ОбъектДрайвера.ПолучитьОшибку(ОписаниеОшибки);
				РезультатВыполнения.Результат = Ложь;
				РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
			КонецЕсли;
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			РезультатВыполнения.ОписаниеОшибки = СтрШаблон(НСтр("ru='Ошибка вызова метода <%1>.'"), "ОбъектДрайвера.ПолучитьПараметрыКарты") + Символы.ПС + ОписаниеОшибки;
		КонецПопытки;
	Иначе
		ОписаниеОшибки = НСтр("ru='Терминал не поддерживает данную операцию.'");
		РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
		РезультатВыполнения.Результат = Ложь;
	КонецЕсли
	
КонецПроцедуры

// Процедура возвращает операции по картам.
//
Процедура ОперацииПоКартам(ОбъектДрайвера, ПараметрыПодключения, ДанныеОперации, РезультатВыполнения)
	
	Если ПараметрыПодключения.РевизияИнтерфейса < 4000 Тогда    
		ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
		Возврат;
	Иначе               
		Если НЕ ПараметрыПодключения.СписокОперацийПоКартам Тогда
			ОписаниеОшибки = НСтр("ru='Терминал не поддерживает данную операцию.'"); 
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
			Возврат;
		КонецЕсли;
		Попытка                                                                                                                    
			РезультатОперацииXML = "";
			Результат = ОбъектДрайвера.ПолучитьОперацииПоКартам(ПараметрыПодключения.ИДУстройства, РезультатОперацииXML);  
			Если Результат Тогда
				РезультатВыполнения.Вставить("РезультатОперацииXML", РезультатОперацииXML);       
				РезультатВыполнения.Результат = Истина;
			Иначе
				ОписаниеОшибки = "";
				ОбъектДрайвера.ПолучитьОшибку(ОписаниеОшибки);
				РезультатВыполнения.Результат = Ложь;
				РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
			КонецЕсли;
		Исключение     
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОписаниеОшибки = НСтр("ru='Ошибка вызова метода <%1>.'") + Символы.ПС + ОписаниеОшибки;
			ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, "ПолучитьОперацииПоКартам"); 
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Процедура осуществляет операцию преавторизации на ЭТ.
//
Процедура ВыполнитьЭквайринговуюОперациюПреавторизации(ОбъектДрайвера, ПараметрыПодключения, ДанныеОперации, РезультатВыполнения, Команда)
	
	РевизияИнтерфейса = ПараметрыПодключения.РевизияИнтерфейса;
	
	РеквизитыКартыQR = ?(ДанныеОперации.РеквизитыКартыQR <> Неопределено, ДанныеОперации.РеквизитыКартыQR, "");
	НомерМерчанта  = ?(ДанныеОперации.НомерМерчанта <> Неопределено, ДанныеОперации.НомерМерчанта, 0);
	НомерКарты     = ?(ДанныеОперации.НомерКарты <> Неопределено, ДанныеОперации.НомерКарты, "");
	НомерЧека      = ?(ДанныеОперации.НомерЧека <> Неопределено, ДанныеОперации.НомерЧека, "");
	СсылочныйНомер = ?(ДанныеОперации.СсылочныйНомер <> Неопределено, ДанныеОперации.СсылочныйНомер, "");
	КодАвторизации = ?(ДанныеОперации.КодАвторизации <> Неопределено, ДанныеОперации.КодАвторизации, "");
	СуммаОперации  = ?(ДанныеОперации.СуммаОперации <> Неопределено, ДанныеОперации.СуммаОперации, 0);
	ТекстСлипЧека  = "";
	
	Если НЕ (СуммаОперации > 0) Тогда
		ОписаниеОшибки = НСтр("ru='Не корректная сумма операции.'");
		РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
		РезультатВыполнения.Результат = Ложь;
		Возврат;
	КонецЕсли; 
	
	Если Не ПустаяСтрока(РеквизитыКартыQR) И НЕ ПараметрыПодключения.ConsumerPresentedQR Тогда
		ОписаниеОшибки = НСтр("ru='Consumer-Presented QR не поддерживается драйвером.'");
		РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
		РезультатВыполнения.Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	Попытка                         
		Если РевизияИнтерфейса >= 4000 Тогда    
			Если Команда = "AuthorizePreSales" Тогда
				Результат = ОбъектДрайвера.ПреавторизацияПоПлатежнойКарте(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека);
			ИначеЕсли Команда = "AuthorizeVoidPreSales" Тогда
				Результат = ОбъектДрайвера.ОтменитьПреавторизациюПоПлатежнойКарте(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека);
			ИначеЕсли Команда = "AuthorizeCompletion" Тогда
				Результат = ОбъектДрайвера.ЗавершитьПреавторизациюПоПлатежнойКарте(ПараметрыПодключения.ИДУстройства, НомерМерчанта, РеквизитыКартыQR, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека);
			Иначе               
				ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
				РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
				РезультатВыполнения.Результат = Ложь;
				Возврат;
			КонецЕсли;     
		ИначеЕсли РевизияИнтерфейса >= 3005 Тогда
			Если Команда = "AuthorizePreSales" Тогда
				Результат = ОбъектДрайвера.ПреавторизацияПоПлатежнойКарте(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека);
			ИначеЕсли Команда = "AuthorizeVoidPreSales" Тогда
				Результат = ОбъектДрайвера.ОтменитьПреавторизациюПоПлатежнойКарте(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека);
			ИначеЕсли Команда = "AuthorizeCompletion" Тогда
				Результат = ОбъектДрайвера.ЗавершитьПреавторизациюПоПлатежнойКарте(ПараметрыПодключения.ИДУстройства, НомерМерчанта, СуммаОперации, 
					НомерКарты, НомерЧека, СсылочныйНомер, КодАвторизации, ТекстСлипЧека);
			Иначе               
				ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
				РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
				РезультатВыполнения.Результат = Ложь;
				Возврат;
			КонецЕсли;                
		Иначе
			ОписаниеОшибки = НСтр("ru='Команда не поддерживается драйвером.'");
			РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
			РезультатВыполнения.Результат = Ложь;
			Возврат;
		КонецЕсли;
			
		Если Результат Тогда          
			РезультатВыполнения.Вставить("НомерМерчанта" , НомерМерчанта);
			РезультатВыполнения.Вставить("НомерКарты"    , НомерКарты);
			РезультатВыполнения.Вставить("НомерЧекаЭТ"   , НомерЧека);
			РезультатВыполнения.Вставить("СсылочныйНомер", СсылочныйНомер);
			РезультатВыполнения.Вставить("КодАвторизации", КодАвторизации);
			РезультатВыполнения.Вставить("СуммаОперации" , СуммаОперации);
			РезультатВыполнения.Результат = Истина;
		Иначе
			ОписаниеОшибки = "";
			ОбъектДрайвера.ПолучитьОшибку(ОписаниеОшибки);
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
		КонецЕсли;
		РезультатВыполнения.Вставить("ТекстСлипЧека" , ТекстСлипЧека);
		
	Исключение                                       
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = НСтр("ru='Ошибка вызова метода <%1>.'") + Символы.ПС + ОписаниеОшибки;
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, Команда); 
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// Функция читает корневой элемент XML.
//
// Параметры:
//  СтрокаXML - Строка - XML строка.
//
// Возвращаемое значение:
//  Структура:
//   * ЭлементXML - Строка.
//
Функция ПрочитатьКорневойЭлементXML(СтрокаXML) 
	
#Если ВебКлиент Тогда            
	Результат = МенеджерОборудованияВызовСервера.ПрочитатьКорневойЭлементXML(СтрокаXML);
#Иначе
	// ЧтениеXML работает везде, кроме веб
	Результат = МенеджерОборудованияКлиент.ПрочитатьКорневойЭлементXML(СтрокаXML);
#КонецЕсли
	Возврат Результат;  
	
КонецФункции

#КонецОбласти