// Обработчик события УстановкаПараметровСеанса()
//
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ТребуемыеПараметры);
	
	// Выполняем только один раз - при запуске
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Новый Структура);
	
		ПолныеПрава.ОпределитьПараметрыСеансаДляОбменаДанными();
		
		ПолныеПрава.УстановитьПараметрыСеанса();
		
	Иначе
		УстановленныеПараметры = Новый Структура;
		
		Для Каждого ИмяПараметра ИЗ ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
	КонецЕсли;
		
	// ГОСИС 
	ИнтеграцияЕГАИС.УстановитьПараметрыСеанса("ИдентификаторСеансаЕГАИС", УстановленныеПараметры);
	ИнтеграцияИСМП.УстановитьПараметрыСеанса("ПараметрыЛогированияЗапросовИСМП", УстановленныеПараметры);
	ИнтеграцияИСМП.УстановитьПараметрыСеанса("ДанныеКлючаСессииИСМП", УстановленныеПараметры);
	ИнтеграцияЗерно.УстановитьПараметрыСеанса("ПараметрыЛогированияЗапросовЗЕРНО", УстановленныеПараметры);
	ИнтеграцияИСМП.УстановитьПараметрыСеанса("ДанныеКлючаСессииИСМПРозница", УстановленныеПараметры);
	ИнтеграцияИСМП.УстановитьПараметрыСеанса("CDNПлощадкиСОшибкамиОбменаИСМП", УстановленныеПараметры);
	// Конец ГОСИС
	
	ПараметрыСеанса.УдаляемыйДокумент = Неопределено;
	
КонецПроцедуры // УстановкаПараметровСеанса

Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры)
	
	Если УстановленныеПараметры.Свойство(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяПараметра = "ОбщиеЗначения" Тогда
		ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Новый Структура);
		УстановленныеПараметры.Вставить("ОбщиеЗначения");
	КонецЕсли;
	
	//ПодключаемоеОборудование
	МенеджерОборудованияСервер.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	//Конец ПодключаемоеОборудование
	
КонецПроцедуры
