// Область "Поддержка54ФЗ"

// Заполняет данные покупателя. Теги 1227 и 1228
//
// Параметры:
//  ОбщиеПараметры - См. описание МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека
//  РеквизитыДокумента - Структура
//
Процедура ЗаполнитьДанныеПокупателя(ОбщиеПараметры, РеквизитыДокумента) Экспорт
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.Контрагент) Тогда
		
		РеквизитыПокупателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.Контрагент, "НаименованиеПолное, ИНН");
		
		Если ОбщиеПараметры.Свойство("Получатель") Тогда
			ОбщиеПараметры.Получатель    = РеквизитыПокупателя.НаименованиеПолное;
		ИначеЕсли ОбщиеПараметры.Свойство("Покупатель") Тогда
			ОбщиеПараметры.Покупатель    = РеквизитыПокупателя.НаименованиеПолное;
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ПолучательИНН") Тогда
			ОбщиеПараметры.ПолучательИНН    = РеквизитыПокупателя.ИНН;
		ИначеЕсли ОбщиеПараметры.Свойство("ПокупательИНН") Тогда
			ОбщиеПараметры.ПокупательИНН    = РеквизитыПокупателя.ИНН;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Конец области "Поддержка54ФЗ"