// Функция записывает изменения данных пользователя ИБ
// Параметры:
// ИмяИдентификаторПользователя - УникальныйИдентификатор/строка - имя пользователя ИБ
//								либо уникальный идентификатор пользователя ИБ
// ПользовательСтруктура - структура - структура, содержащая новые значения
//									характеристик пользователя ИБ
//
Функция ЗаписатьПользователяИБ(	знач ИмяИдентификаторПользователя,
								знач ПользовательСтруктура,
								СообщениеОбОшибке,
								знач СписокРолей = Неопределено) Экспорт
	
	Если ТипЗнч(ИмяИдентификаторПользователя) = Тип("УникальныйИдентификатор") Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИмяИдентификаторПользователя);
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяИдентификаторПользователя);
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Или ПользовательИБ.Имя = "" Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	ПользовательИБ.Имя						= ПользовательСтруктура["Имя"];
	ПользовательИБ.ПолноеИмя				= ПользовательСтруктура["ПолноеИмя"];
	ПользовательИБ.АутентификацияОС			= ПользовательСтруктура["АутентификацияОС"];
	ПользовательИБ.ПользовательОС			= ПользовательСтруктура["ПользовательОС"];
	ПользовательИБ.АутентификацияСтандартная= ПользовательСтруктура["АутентификацияСтандартная"];
	ПользовательИБ.ПоказыватьВСпискеВыбора	= ПользовательСтруктура["ПоказыватьВСпискеВыбора"];
	ПользовательИБ.ЗапрещеноИзменятьПароль	= ПользовательСтруктура["ЗапрещеноИзменятьПароль"];
	ПользовательИБ.РежимЗапуска				= ПользовательСтруктура["РежимЗапуска"];
	
	Если ПользовательСтруктура.Свойство("Пароль") Тогда
		ПользовательИБ.Пароль = ПользовательСтруктура.Пароль;
	КонецЕсли;
	
	ПользовательИБ.ОсновнойИнтерфейс = Метаданные.Интерфейсы.Найти(ПользовательСтруктура["ОсновнойИнтерфейс"]);
	
	ПользовательИБ.Язык = Метаданные.Языки.Найти(ПользовательСтруктура["Язык"]);

	Если СписокРолей <> Неопределено Тогда
		ПользовательИБ.Роли.Очистить();
		Для Каждого СтрокаТаблицы Из СписокРолей Цикл
			Если НЕ СтрокаТаблицы.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Роль = Метаданные.Роли.Найти(СтрокаТаблицы.ИмяРоли);
			Если Роль = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПользовательИБ.Роли.Добавить(Роль);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		ПользовательИБ.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		СообщениеОбОшибке = ИнформацияОбОшибке.Причина.Описание;
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ПользовательИБ.УникальныйИдентификатор;
	
КонецФункции

// Процедура для удаления пользователя информационной базы
//
Функция УдалитьПользователяИБ(знач ИдентификаторПользователя) Экспорт
	
	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователя);
		ПользовательИБ.Удалить();
	Исключение
		Сообщение = 
			НСтр("ru = 'Ошибка удаления пользователя информационной базы: '") +
			ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке());
		Возврат ОбщегоНазначенияКлиентСервер.ЗаполнитьРезультат(Сообщение, Ложь);
	КонецПопытки;
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗаполнитьРезультат(Неопределено);
	
КонецФункции

// Функция проверяющая право администрирования объекта метаданного у текущего
// пользователя. Если объект метаданных не указан, но проверяется право
// на администрирование конфигурации.
// Параметры
// ОбъектМетаданных - метаданные - метаданные
// Возвращаемое значение
// Истина        - пользователь имеет право на администрирование
// Ложь          - пользователь не имеет права на администрирование
//
Функция ПроверитьПравоАдминистрирования(знач ОбъектМетаданных = Неопределено) Экспорт
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные;
	КонецЕсли;
	
	Возврат ПравоДоступа("Администрирование", ОбъектМетаданных);
	
КонецФункции

// Получает имя  и полное имя пользователя ИБ по идентефикатору пользователя
//
Функция ПолучитьИмяПолноеИмя(УникальныйИдентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УникальныйИдентификатор);
	
	Если Пользователь = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("Имя, ПолноеИмя",Пользователь.Имя, Пользователь.ПолноеИмя);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Функциональность для управления оформлением списков пользователей

Процедура ПроверитьСинхронизациюПользователейИУстановитьОформлениеСписка(УсловноеОформление) Экспорт
	
	ПользователиОтмеченные = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Ссылка, Код, Наименование, ИдентификаторПользователяИБ
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи
					|ГДЕ
					|	НЕ ЭтоГруппа";
					
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если СокрЛП(Выборка.Код) = "<Не указан>" Тогда
			Продолжить;
		ИначеЕсли Не ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Тогда
			ПользователиОтмеченные.Добавить(Выборка.Ссылка);
		ИначеЕсли НЕ ПользователиПолныеПрава.ПользовательСуществует(Выборка.ИдентификаторПользователяИБ) Тогда
			ПользователиОтмеченные.Добавить(Выборка.Ссылка);
		ИначеЕсли ПользователиПолныеПрава.РассинхронизацияИмениПользователя(Выборка.Ссылка) Тогда
			ПользователиОтмеченные.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ПользователиОтмеченные.Количество() > 0 Тогда
		УстановитьУсловноеОформлениеДляЭлементовТребующихВнимания(ПользователиОтмеченные, УсловноеОформление);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеДляВыбранногоЭлемента(знач Ссылка, УсловноеОформление) Экспорт
	
	ЭлементУсловногоОформления = 
			ПолучитьЭлементУсловногоОформления(УсловноеОформление,
												"ЭлементыСправочникаВыбранные",
												Метаданные.ЭлементыСтиля.ПользовательВыбранный.Значение);
	
	ДобавитьЭлементОтбораКУсловномуОформлению(ЭлементУсловногоОформления, Ссылка);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеДляЭлементовТребующихВнимания(знач ПользователиОтмеченные, УсловноеОформление)
	
	ЭлементУсловногоОформления = 
			ПолучитьЭлементУсловногоОформления(УсловноеОформление,
												"ЭлементыСправочникаТребующиеВнимания",
												Метаданные.ЭлементыСтиля.ПользовательБезУчетнойЗаписи.Значение);
	
	ДобавитьЭлементОтбораКУсловномуОформлению(ЭлементУсловногоОформления, ПользователиОтмеченные);
	
КонецПроцедуры

Функция ДобавитьЭлементОтбораКУсловномуОформлению(ЭлементУсловногоОформления, МассивСсылка)
	
	Если ЭлементУсловногоОформления.Отбор.Элементы.Количество() = 0 Тогда
		ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Иначе
		ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы[0];
	КонецЕсли;
	
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Если ЭлементОтбораДанных.ПравоеЗначение = Неопределено Тогда
		ЭлементОтбораДанных.ПравоеЗначение = Новый СписокЗначений;
	КонецЕсли;
	
	Если ТипЗнч(МассивСсылка) = Тип("Массив") Тогда
		ЭлементОтбораДанных.ПравоеЗначение.ЗагрузитьЗначения(МассивСсылка);
	Иначе
		ЭлементОтбораДанных.ПравоеЗначение.Добавить(МассивСсылка);
	КонецЕсли;
	
	ЭлементОтбораДанных.Использование = Истина;
	
КонецФункции

Функция ПолучитьЭлементУсловногоОформления(УсловноеОформление,
											ИдентификаторПользовательскойНастройки,
											ЭлементСтиляЗначение)
	
	Для Каждого ЭлементУО Из УсловноеОформление.Элементы Цикл
		Если ЭлементУО.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки Тогда
			Возврат ЭлементУО;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Использование = Истина;
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Код");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Использование = Истина;
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Наименование");
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЭлементСтиляЗначение);
	
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	
	Возврат ЭлементУсловногоОформления;
	
КонецФункции

Функция ПользователюРазрешенЗапускКонфигурации() Экспорт
	
	Если НЕ РольДоступна("Пользователь")
		И (НЕ РольДоступна("ПолныеПрава")) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // 
// Возвращает доступность хотя бы одной из указанных ролей или полноправность
// пользователя (текущего или указанного).
//
// Параметры:
//  ИменаРолей   - Строка - имена ролей, разделенные запятыми, доступность которых проверяется.
//
//  Пользователь - Неопределено - проверяется текущий пользователь ИБ;
//                 СправочникСсылка.Пользователи - осуществляется поиск
//                    пользователя ИБ по уникальному идентификатору,
//                    заданному в реквизите ИдентификаторПользователяИБ
//                    Прим.: если пользователь ИБ не найден, возвращается Ложь.
//                 ПользовательИнформационнойБазы - проверяется указанный
//                    пользователь ИБ
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы одна из указанных ролей доступна,
//           или функция ЭтоПолноправныйПользователь(Пользователь) возвращает Истина.
//
Функция РолиДоступны(Знач ИменаРолей, Пользователь = Неопределено) Экспорт
	
	Если ЭтоПолноправныйПользователь(Пользователь, , Ложь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
	ИначеЕсли ТипЗнч(Пользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		ПользовательИБ = Пользователь;
		
	Иначе
		// Указан не текущий пользователь.
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ОбщегоНазначения.ПолучитьЗначениеРеквизита(Пользователь, "ИдентификаторПользователяИБ"));
		
		Если ПользовательИБ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УказанТекущийПользовательИБ = ПользовательИБ.УникальныйИдентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	
	МассивИменРолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаРолей);
	Для каждого ИмяРоли Из МассивИменРолей Цикл
		
		Если УказанТекущийПользовательИБ Тогда
			Если РольДоступна(СокрЛП(ИмяРоли)) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.Найти(СокрЛП(ИмяРоли))) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Только для внутреннего использования
Функция ПолноеИмяНеуказанногоПользователя() Экспорт
	
	Возврат НСтр("ru = '<Не указан>'");
	
КонецФункции

// Проверяет, является ли текущий или указанный пользователь полноправным.
// 
// Полноправным считается пользователь, который
// а) при непустом списке пользователей информационной базы:
// - в локальном режиме работы (без разделения данных) имеет роль ПолныеПрава и
//   роль для администрирования системы,
// - в модели сервиса (с разделением данных) имеет роль ПолныеПрава;
// б) при пустом списке пользователей информационной базы
//    основная роль конфигурации не задана или ПолныеПрава.
//
// Параметры:
//  Пользователь - Неопределено - проверяется текущий пользователь ИБ;
//                 СправочникСсылка.Пользователи - осуществляется поиск
//                    пользователя ИБ по уникальному идентификатору,
//                    заданному в реквизите ИдентификаторПользователяИБ.
//                    Прим.: если пользователь ИБ не найден, возвращается Ложь.
//                 ПользовательИнформационнойБазы - проверяется указанный
//                    пользователь ИБ.
//
//  ПроверятьПраваАдминистрированияСистемы - Булево - если задано Истина, тогда
//                 проверяется наличие роли для администрирования системы.
//                 Начальное значение: Ложь.
//
//  УчитыватьПривилегированныйРежим - Булево - если задано Истина, тогда
//                 функция возвращает Истина, когда установлен привилегированный режим.
//                 Начальное значение: Истина.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоПолноправныйПользователь(Пользователь = Неопределено,
                                    ПроверятьПраваАдминистрированияСистемы = Ложь,
                                    УчитыватьПривилегированныйРежим = Истина) Экспорт
	
	Если УчитыватьПривилегированныйРежим И ПривилегированныйРежим() Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Пользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		ПользовательИБ = Пользователь;
		
	ИначеЕсли Пользователь = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
	Иначе
		// Задан не текущий пользователь.
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ОбщегоНазначения.ПолучитьЗначениеРеквизита(Пользователь, "ИдентификаторПользователяИБ"));
		
		Если ПользовательИБ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПользовательИБ.УникальныйИдентификатор <> ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
		
		// Для не текущего пользователя ИБ проверяются роли в записанном пользователе ИБ.
		Если ПроверятьПраваАдминистрированияСистемы Тогда
			Возврат Ложь; //ПользовательИБ.Роли.Содержит(РольАдминистратораСистемы())
		Иначе
			Возврат ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава)
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ПользовательИБ.Имя) Тогда
			
			// Для текущего пользователя ИБ проверяются роли не в записанном пользователе ИБ,
			// а роли в текущем сеансе.
			Если ПроверятьПраваАдминистрированияСистемы Тогда
				Возврат Ложь; //РольДоступна(РольАдминистратораСистемы())
			Иначе
				Возврат РольДоступна(Метаданные.Роли.ПолныеПрава)
			КонецЕсли;
		Иначе
			// Для неуказанного пользователя ИБ проверяется основная роль конфигурации:
			// должна быть роль ПолныеПрава или не указана (привилегированный режим).
			Если Метаданные.ОсновнаяРоль = Неопределено ИЛИ
				 Метаданные.ОсновнаяРоль = Метаданные.Роли.ПолныеПрава Тогда
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции