#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	
	Для Каждого Строка Из Параметры.ОшибокиВКодахМаркировки Цикл
		ЗаполнитьЗначенияСвойств(ОшибокиВКодахМаркировки.Добавить(), Строка);
	КонецЦикла;
	
	СформироватьЗаголовкиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьЗаголовкиФормы()
	
	Заголовок = НСтр("ru = 'Коды маркировки с ошибками'");
	
	НадписьДекорацияОшибкиШтрихкодов = Новый Массив;
	НадписьДекорацияОшибкиШтрихкодов.Добавить(НСтр("ru = 'При обработке документа'"));
	НадписьДекорацияОшибкиШтрихкодов.Добавить(" ");
	НадписьДекорацияОшибкиШтрихкодов.Добавить(
		Новый ФорматированнаяСтрока(
			Строка(Документ),,,,
			ПолучитьНавигационнуюСсылку(Документ)));
	НадписьДекорацияОшибкиШтрихкодов.Добавить(" ");
	НадписьДекорацияОшибкиШтрихкодов.Добавить(НСтр("ru = 'выявлены ошибки:'"));
	Элементы.ДекорацияОшибкиШтрихкодов.Заголовок = Новый ФорматированнаяСтрока(НадписьДекорацияОшибкиШтрихкодов);
	
КонецПроцедуры

#КонецОбласти