#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТаблицаНастроек = Справочники.КлассификаторПолномочийФНСМЧД003.ТаблицаНастроекОтбора(Объект.Ссылка);
		Справочники.ПравилаПроверкиПолномочийМЧД.ЗаполнитьДеревоНастроек(ЭтаФорма, ТаблицаНастроек);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ДекорацияОписаниеСкрипта.Заголовок = МашиночитаемыеДоверенности.ТекстПодсказкиСкриптаПроверкиПолномочий();
	Элементы.ДекорацияИнформацияОДополнительнойПроверкеПолномочий.Заголовок =
		МашиночитаемыеДоверенности.ТекстДекорацииИнформацииОДополнительнойПроверкеПолномочий();
КонецПроцедуры

#КонецОбласти