Функция ОписаниеФорматированнойСтроки() Экспорт
	
	ОписаниеФорматированнойСтроки = Новый("Структура");
	ОписаниеФорматированнойСтроки.Вставить("Заголовок",  "");
	ОписаниеФорматированнойСтроки.Вставить("Шрифт",      Неопределено);
	ОписаниеФорматированнойСтроки.Вставить("ЦветТекста", Неопределено);
	ОписаниеФорматированнойСтроки.Вставить("ЦветФона",   Неопределено);
	ОписаниеФорматированнойСтроки.Вставить("Ссылка",     "");
	
	Возврат ОписаниеФорматированнойСтроки;
	
КонецФункции

Функция ИмяЭлементаФорматированнойСтроки(ИмяРодителя, НомерСтроки) Экспорт
	
	Возврат ИмяРодителя + "ДекорацияНадпись" + НомерСтроки;
	
КонецФункции

Функция НавигационнаяСсылкаСтроки(Элемент, ОписанияСтрок) Экспорт
	
	НавигационнаяСсылкаСтроки = "";
	
	Если Тип(Элемент.Родитель) = Тип("ГруппаФормы") Тогда
		ИмяЭлемента = Элемент.Имя;
		ИмяРодителя = Элемент.Родитель.Имя;
		
		ИндексСтроки = Число(СтрЗаменить(ИмяЭлемента, ИмяРодителя + "ДекорацияНадпись", "")) - 1;
		
		Если НЕ ИндексСтроки < 0 Тогда
			НавигационнаяСсылкаСтроки = ОписанияСтрок[ИндексСтроки].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НавигационнаяСсылкаСтроки;
	
КонецФункции

Процедура НачатьЗагрузкуДанныеИзТСД(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		СерверТО = ДополнительныеПараметры.СерверТО;
		ОписаниеЧисла = Новый ОписаниеТипов("Число");
		Для каждого СтрокаТоваров Из РезультатВыполнения.ТаблицаТоваров Цикл
			Для СчетчикКоличества = 1 По ОписаниеЧисла.ПривестиЗначение(СтрокаТоваров.Количество) Цикл
				СерверТО.ОбработатьВведенныйШтрихкод(СтрокаТоваров.Штрихкод, ДополнительныеПараметры.Клиент);
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		ВызватьИсключение РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры
