
Процедура ОткрытьОтчетРеестрСчетовФактурВыданных() Экспорт
	
	#Если Клиент Тогда
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ВыставленныеСчетаФактуры");
	ОткрытьФорму("Отчет.РеестрСчетовФактурДляСверки.Форма", 
		ПараметрыФормы, ,
		Новый УникальныйИдентификатор);
	#КонецЕсли
	
КонецПроцедуры

Процедура ОткрытьОтчетРеестрСчетовФактурПолученных() Экспорт
	
	#Если Клиент Тогда
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ПолученныеСчетаФактуры");
	ОткрытьФорму("Отчет.РеестрСчетовФактурДляСверки.Форма", 
		ПараметрыФормы, ,
		Новый УникальныйИдентификатор);
	#КонецЕсли
	
КонецПроцедуры
