Функция АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(ПараметрыСканирования, Объект, УникальныйИдентификатор, ВидМаркируемойПродукции) Экспорт
	
	ТаблицаШтрихкодов = Объект.АкцизныеМарки.Выгрузить();
	ШтрихкодыМаркируемойПродукции = ИнтеграцияИСУТ.ШтрихкодыСодержащиеВидыПродукции(
		ТаблицаШтрихкодов.ВыгрузитьКолонку("АкцизнаяМарка"), ВидМаркируемойПродукции);
	
		
	Если ИнтеграцияИСМПКлиентСерверПовтИсп.ПоддерживаетсяЧастичноеВыбытие(
		ВидМаркируемойПродукции,
		ПараметрыСканирования.ВидОперацииИСМП) Тогда
	
		МассивУпаковок    = Новый Массив();
		КэшИсходныхДанных = Новый Соответствие();
		
		Для Каждого ШтрихкодУпаковки Из ШтрихкодыМаркируемойПродукции Цикл
			
			НовыйЭлемент = ШтрихкодированиеИСМП.НовыйЭлементКоллекцииУпаковокДляРаспределенияПоТоварам();
			НовыйЭлемент.ШтрихкодУпаковки = ШтрихкодУпаковки;
			
			МассивУпаковок.Добавить(НовыйЭлемент);
			
			КэшИсходныхДанных.Вставить(ШтрихкодУпаковки, НовыйЭлемент);
			
		КонецЦикла;
	
		Для Каждого СтрокаТаблицы Из ТаблицаШтрихкодов Цикл
			
			ДанныеРезультата = КэшИсходныхДанных.Получить(СтрокаТаблицы.АкцизнаяМарка);
			Если ДанныеРезультата = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеРезультата.ЧастичноеВыбытиеКоличество     = СтрокаТаблицы.ЧастичноеВыбытиеКоличество;
			ДанныеРезультата.ЧастичноеВыбытиеВариантУчета   = СтрокаТаблицы.ЧастичноеВыбытиеВариантУчета;
			ДанныеРезультата.ЧастичноеВыбытиеНоменклатура   = СтрокаТаблицы.ЧастичноеВыбытиеНоменклатура;
			ДанныеРезультата.ЧастичноеВыбытиеХарактеристика = СтрокаТаблицы.ЧастичноеВыбытиеХарактеристика;
			
		КонецЦикла;
		
	Иначе
		
		МассивУпаковок = ШтрихкодыМаркируемойПродукции;
		
	КонецЕсли;
	
	ДанныеПроверяемогоДокумента = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
		ШтрихкодыМаркируемойПродукции, ПараметрыСканирования);
	
	ТаблицаМаркируемойПродукции = ПроверкаИПодборПродукцииИСМП.ТаблицаМаркируемойПродукцииДокумента(Объект, ВидМаркируемойПродукции);
	
	ДанныеХранилища = Новый Структура("ДеревоУпаковок, МаркированныеТовары, ТаблицаМаркируемойПродукции",
		ДанныеПроверяемогоДокумента.ДеревоУпаковок,
		ДанныеПроверяемогоДокумента.МаркированныеТовары,
		ТаблицаМаркируемойПродукции);
		
	ПреобразоватьНесериализуемыеЗначения(ДанныеПроверяемогоДокумента.ДеревоУпаковок, ДанныеПроверяемогоДокумента.МаркированныеТовары);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеХранилища, УникальныйИдентификатор);
	
КонецФункции

Процедура ПреобразоватьНесериализуемыеЗначения(Дерево, Таблица)
	
	ИменаКолонокДерева = Новый Массив;
	
	Для Каждого КолонкаДерева Из Дерево.Колонки Цикл
		ИменаКолонокДерева.Добавить(КолонкаДерева.Имя);
	КонецЦикла;
	
	ИменаКолонокДерева = СтрСоединить(ИменаКолонокДерева, ",");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ЗначенияСтрокиДерева = Новый Структура(ИменаКолонокДерева);
		ЗаполнитьЗначенияСвойств(ЗначенияСтрокиДерева, СтрокаТаблицы.СтрокаДерева);
		СтрокаТаблицы.СтрокаДерева = ЗначенияСтрокиДерева;
		ЗначенияСтрокиДерева = Новый Структура(ИменаКолонокДерева);
		ЗаполнитьЗначенияСвойств(ЗначенияСтрокиДерева, СтрокаТаблицы.УпаковкаВерхнегоУровня);
		СтрокаТаблицы.УпаковкаВерхнегоУровня = ЗначенияСтрокиДерева;
	КонецЦикла;
	
КонецПроцедуры
