#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыЭД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ЭД, "ВидЭД, ДополнительныеРеквизиты");
	ЭтоДополнительныеСведения = ПараметрыЭД.ВидЭД = Перечисления.ВидыЭД.АктОРасхождениях;
	
	Если ЭтоДополнительныеСведения Тогда
		
		Элементы.ГруппаДополнительныеСведения.Видимость = Истина;
		
		ДополнительныеРеквизиты = ПараметрыЭД.ДополнительныеРеквизиты.Получить();
		
		ФормированиеДополнительныхСведений = ДополнительныеРеквизиты.ФормированиеДополнительныхСведений;
		
		ПредставленияВариантов =
			ЭлектронныеДокументыВнутренний.АктОРасхожденияхПредставленияВариантовФормированияДополнительныхСведений();
		ВариантФормированияДополнительныхСведений = ПредставленияВариантов[ФормированиеДополнительныхСведений];
		
		Элементы.СодержаниеДополнительныхСведений.Подсказка = СтрШаблон("%1
		|'%2'",
			Элементы.СодержаниеДополнительныхСведений.Подсказка,
			ВариантФормированияДополнительныхСведений);		
			
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Утвердить(Команда)
	
	Если ЭтоДополнительныеСведения Тогда
		Закрыть(СодержаниеДополнительныхСведений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда) 
	
	Закрыть();

КонецПроцедуры



#КонецОбласти 