
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТестовыйКонтур = ПолучитьФункциональнуюОпцию("РежимРаботыСТестовымКонтуромИСМП");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Пункт1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВЛичныйКабинетГИСМТ" Тогда
			
		Если ТестовыйКонтур Тогда
			
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://markirovka.sandbox.crptech.ru/");
			
		Иначе
			
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://markirovka.crpt.ru/");
			
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВСписокТокенов" Тогда
		
		СтандартнаяОбработка                   = Ложь;
		ИмяОткрываемойФормы = "РегистрСведений.ДанныеКлючаСессииИСМП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации";
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Актуализация", Ложь);
		
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пункт2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВСписокСертификатов" Тогда
		
		СтандартнаяОбработка                   = Ложь;
		ИмяОткрываемойФормы = "ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования";
		
		ОткрытьФорму(ИмяОткрываемойФормы,, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПодписатьТокен" Тогда
		
		ПараметрыАвторизации = ИнтерфейсИСМПКлиент.ПараметрыЗапросаДанных();
		ИнтерфейсИСМПКлиент.АвторизацияГИСМТРозничныйТокен(ПараметрыАвторизации);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
