#Область ИнтеграцияИС

Процедура ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

Функция ЧтениеРазрешено(Ссылка) Экспорт
	
	Изменение = Ложь;
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
	Если ОбъектМетаданных = Неопределено Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2.
			           |Ожидалась ссылка, объект, ключ записи или набор записей.
			           |Передано значение: %3 (тип %4).'"),
			"ОписаниеДанных",
			"УправлениеДоступом.ЧтениеРазрешено",
			Строка(Ссылка),
			Строка(ТипЗнч(Ссылка)));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ИмяПраваДоступа = ?(Изменение, "Изменение", "Чтение");
	
	Если Не ПравоДоступа(ИмяПраваДоступа, ОбъектМетаданных) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти