/////////////////////////////////////////////////////////////////////
//
// Адаптационный модуль. При необходимости здесь можно реализовать 
//  переход на используемую библиотеку.
//
/////////////////////////////////////////////////////////////////////
Функция НайтиНаФормеподменюПечать(Знач Элемент)
	
	Если ТипЗнч(Элемент) <> Тип("ТаблицаФормы")
		И ТипЗнч(Элемент) <> Тип("ФормаКлиентскогоПриложения")
		И ТипЗнч(Элемент) <> Тип("ГруппаФормы") Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ТаблицаФормы")
		Или ТипЗнч(Элемент) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Результат = НайтиНаФормеПодменюПечать(Элемент.КоманднаяПанель);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Подчиненные = Элемент.ПодчиненныеЭлементы;
	Результат = Подчиненные.Найти("ПодменюПечать");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для каждого ПодчиненныйЭлемент Из Подчиненные Цикл
		
		Результат = НайтиНаФормеподменюПечать(ПодчиненныйЭлемент);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // НайтиНаФормеподменюПечать(Форма)

/////////////////////////////////////////////////////////////////////
//
// Адаптационный модуль. При необходимости здесь можно реализовать 
//  переход на используемую библиотеку.
//
/////////////////////////////////////////////////////////////////////
Функция НайтиНаФормеподменюОтчеты(Знач Элемент)
	
	Если ТипЗнч(Элемент) <> Тип("ТаблицаФормы")
		И ТипЗнч(Элемент) <> Тип("ФормаКлиентскогоПриложения")
		И ТипЗнч(Элемент) <> Тип("ГруппаФормы") Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ТаблицаФормы")
		Или ТипЗнч(Элемент) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Результат = НайтиНаФормеподменюОтчеты(Элемент.КоманднаяПанель);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Подчиненные = Элемент.ПодчиненныеЭлементы;
	Результат = Подчиненные.Найти("ПодменюОтчеты");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для каждого ПодчиненныйЭлемент Из Подчиненные Цикл
		
		Результат = НайтиНаФормеподменюОтчеты(ПодчиненныйЭлемент);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // НайтиНаФормеподменюПечать(Форма)


Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Если ТипЗнч(Форма) =Тип("ФормаКлиентскогоПриложения") Тогда
		
		ИмяФормы = Форма.ИмяФормы;
		
		Если (СтрНайти(ИмяФормы, "ЗапросАкцизныхМарокЕГАИС") > 0
			Или СтрНайти(ИмяФормы, "ШтрихкодыУпаковокТоваров") > 0)
			И СтрНайти(ИмяФормы, "Выбора") = 0 Тогда
			
			ПодменюПечать = НайтиНаФормеподменюПечать(Форма);
			
			Если ПодменюПечать <> Неопределено Тогда
				
				КомандаПечати = Форма.Команды.Добавить("ФормаПечатьЭтикетокШтрихкода");
				КомандаПечати.Действие  = "Подключаемый_ВыполнитьКоманду";
				КомандаПечати.Заголовок = "Печать этикеток штрихкода";
				
				КнопкаПечати = Форма.Элементы.Добавить("ПечатьЭтикетокШтрихкода", Тип("КнопкаФормы"), ПодменюПечать);
				КнопкаПечати.ИмяКоманды = "ФормаПечатьЭтикетокШтрихкода";
				
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ИмяФормы, "МаркировкаТоваровИСМП") > 0 Тогда
			
			ПодменюОтчеты = НайтиНаФормеподменюОтчеты(Форма);
			
			Если ПодменюОтчеты <> Неопределено Тогда
				
				КомандаОтчеты = Форма.Команды.Добавить("ФормаОтчетКодыМаркировкиДляДекларацииИСМП");
				КомандаОтчеты.Действие  = "Подключаемый_ВыполнитьКоманду";
				КомандаОтчеты.Заголовок = "Коды маркировки для декларации";
				
				КомандаОтчеты = Форма.Элементы.Добавить("КодыМаркировкиДляДекларацииИСМП", Тип("КнопкаФормы"), ПодменюОтчеты);
				КомандаОтчеты.ИмяКоманды = "ФормаОтчетКодыМаркировкиДляДекларацииИСМП";
				
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ИмяФормы, "ОформлениеСДИЗЗЕРНО") > 0 Тогда
			
			ПодменюОтчеты = НайтиНаФормеподменюОтчеты(Форма);
			
			Если ПодменюОтчеты <> Неопределено Тогда
				
				КомандаОтчеты = Форма.Команды.Добавить("ФормаОтчетСДИЗРасширеннаяЭтикетка");
				КомандаОтчеты.Действие  = "Подключаемый_ВыполнитьКоманду";
				КомандаОтчеты.Заголовок = НСтр("ru = 'СДИЗ с расширенной информацией'");
				
				КомандаОтчеты = Форма.Элементы.Добавить("СДИЗРасширеннаяЭтикетка", Тип("КнопкаФормы"), ПодменюОтчеты);
				КомандаОтчеты.ИмяКоманды = "ФормаОтчетСДИЗРасширеннаяЭтикетка";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(Форма, Контекст, Объект, Результат) Экспорт
КонецПроцедуры

Процедура ДобавитьУсловиеВидимостиКоманды(КомандаОтчет, ИмяРеквизита, ЗначениеРеквизита, ВидСравнения) Экспорт
КонецПроцедуры
