
// Возвращает коды реализаций услуг не на территории РФ
// (необходимы для принятия НДС к вычету в соответствии с 63-ФЗ от 15.04.2019)
//
// Возвращаемое значение:
//    КодыРеализацииУслугЗаРубежом - массив кодов, соответствующих реализации услуг не на территории РФ
//
Функция КодыРеализацииУслугЗаРубежом() Экспорт
	
	КодыРеализацииУслугЗаРубежом = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодРеализацияЗаРубежом", "1010812");
	Запрос.УстановитьПараметр("КодРеализацияВЕАЭС",     "1010821");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КодыОперацийРаздела7ДекларацииПоНДС.Ссылка КАК КодРеализацииЗаРубеж
	|ИЗ
	|	Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|ГДЕ
	|	(КодыОперацийРаздела7ДекларацииПоНДС.Код = &КодРеализацияЗаРубежом
	|			ИЛИ КодыОперацийРаздела7ДекларацииПоНДС.Код = &КодРеализацияВЕАЭС)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КодыРеализацииУслугЗаРубежом.Добавить(Выборка.КодРеализацииЗаРубеж);
	КонецЦикла;
	
	Возврат КодыРеализацииУслугЗаРубежом;
	
КонецФункции
