
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПерезаполнитьИзФайла(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок          = НСтр("ru = 'Выберите архив с доверенностью и подписью'"); 
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр             = НСтр("ru = 'Архив|*.zip'");
	ДиалогВыбораФайла.Расширение         = "zip";	 
	
	МассивПомещенных = Новый Массив;
	Если ПоместитьФайлы(, МассивПомещенных, ДиалогВыбораФайла,,УникальныйИдентификатор) Тогда
		Для Каждого ПомещенныйФайл из МассивПомещенных Цикл
			МашиночитаемыеДоверенностиКлиент.ЗагрузитьПерезаполнитьМЧДИзФайла(ПомещенныйФайл.Хранение);
			Элементы.Список.Обновить();
		КонецЦикла;
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти
