#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
		
КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка КАК Ссылка,
	|	ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки КАК ПравилоПроверки
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК МашиночитаемыеДоверенностиКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
	|		ПО (ПравилаПроверкиПолномочийПоМЧД.Доверенность = МашиночитаемыеДоверенностиКонтрагентов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенностиКонтрагентов.Представители КАК МашиночитаемыеДоверенностиКонтрагентовПредставители
	|		ПО МашиночитаемыеДоверенностиКонтрагентов.Ссылка = МашиночитаемыеДоверенностиКонтрагентовПредставители.Ссылка
	|ГДЕ
	|	(МашиночитаемыеДоверенностиКонтрагентов.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ МашиночитаемыеДоверенностиКонтрагентов.ПолномочияОграничены
	|				И ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки ЕСТЬ NULL
	|			ИЛИ (МашиночитаемыеДоверенностиКонтрагентовПредставители.Ссылка ЕСТЬ NULL
	|				И НЕ МашиночитаемыеДоверенностиКонтрагентов.УдалитьПредставительИНН = """"
	|				И МашиночитаемыеДоверенностиКонтрагентов.Подписана)
	|			ИЛИ МашиночитаемыеДоверенностиКонтрагентов.ВариантЗаполненияПолномочий = 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.ПустаяСсылка)
	|			ИЛИ (МашиночитаемыеДоверенностиКонтрагентов.ХешФайла = """" И МашиночитаемыеДоверенностиКонтрагентов.Подписана))
	|	И МашиночитаемыеДоверенностиКонтрагентов.Ссылка > &МЧДКонтрагентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	МашиночитаемыеДоверенностиОрганизаций.Ссылка КАК Ссылка,
	|	ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки КАК ПравилоПроверки
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
	|		ПО (ПравилаПроверкиПолномочийПоМЧД.Доверенность = МашиночитаемыеДоверенностиОрганизаций.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенностиОрганизаций.Представители КАК МашиночитаемыеДоверенностиОрганизацийПредставители
	|		ПО МашиночитаемыеДоверенностиОрганизаций.Ссылка = МашиночитаемыеДоверенностиОрганизацийПредставители.Ссылка
	|ГДЕ
	|	(МашиночитаемыеДоверенностиОрганизаций.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ МашиночитаемыеДоверенностиОрганизаций.ПолномочияОграничены
	|				И ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки ЕСТЬ NULL
	|			ИЛИ (МашиночитаемыеДоверенностиОрганизацийПредставители.Ссылка ЕСТЬ NULL
	|				И (НЕ МашиночитаемыеДоверенностиОрганизаций.УдалитьПредставительФЛ_ИНН = """"
	|					ИЛИ НЕ МашиночитаемыеДоверенностиОрганизаций.УдалитьПредставительЮЛ_ИНН = """")
	|				И МашиночитаемыеДоверенностиОрганизаций.Подписана)
	|			ИЛИ МашиночитаемыеДоверенностиОрганизаций.ВариантЗаполненияПолномочий = 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.ПустаяСсылка)
	|			ИЛИ (МашиночитаемыеДоверенностиОрганизаций.ХешФайла = """" И МашиночитаемыеДоверенностиОрганизаций.Подписана))
	|	И МашиночитаемыеДоверенностиОрганизаций.Ссылка > &МЧДОрганизаций
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ОтработаныВсеДанныеМЧДКонтрагентов = Ложь;
	ОтработаныВсеДанныеМЧДОрганизаций = Ложь;
	
	МЧДКонтрагентов = Справочники.МашиночитаемыеДоверенностиКонтрагентов.ПустаяСсылка();
	МЧДОрганизаций = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПустаяСсылка();
	
	Пока Не ОтработаныВсеДанныеМЧДКонтрагентов Или Не ОтработаныВсеДанныеМЧДОрганизаций Цикл
		
		Запрос.УстановитьПараметр("МЧДКонтрагентов", МЧДКонтрагентов);
		Запрос.УстановитьПараметр("МЧДОрганизаций", МЧДОрганизаций);
		
		ДанныеМЧДКонтрагентов = Запрос.ВыполнитьПакет()[0].Выгрузить();
		ДанныеМЧДОрганизаций = Запрос.ВыполнитьПакет()[1].Выгрузить();
		
		КоличествоСтрокМЧДКонтрагентов = ДанныеМЧДКонтрагентов.Количество();
		КоличествоСтрокМЧДОрганизаций = ДанныеМЧДОрганизаций.Количество();
		
		Если КоличествоСтрокМЧДКонтрагентов < 500 Тогда
			ОтработаныВсеДанныеМЧДКонтрагентов = Истина;
		КонецЕсли;
		Если КоличествоСтрокМЧДОрганизаций < 500 Тогда
			ОтработаныВсеДанныеМЧДОрганизаций = Истина;
		КонецЕсли;
		
		Если КоличествоСтрокМЧДКонтрагентов > 0 Тогда
			МЧДКонтрагентов = ДанныеМЧДКонтрагентов[КоличествоСтрокМЧДКонтрагентов - 1].Ссылка;
		КонецЕсли;
		Если КоличествоСтрокМЧДОрганизаций > 0 Тогда
			МЧДОрганизаций = ДанныеМЧДОрганизаций[КоличествоСтрокМЧДОрганизаций - 1].Ссылка;
		КонецЕсли;
		
		НаборСсылок = ДанныеМЧДКонтрагентов.ВыгрузитьКолонку("Ссылка");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НаборСсылок, ДанныеМЧДОрганизаций.ВыгрузитьКолонку("Ссылка"));
		
		Для каждого СсылкаНаОбъект Из НаборСсылок Цикл
			
			НачатьТранзакцию();
			Попытка
				
				Записать = Ложь;
				
				Объект = СсылкаНаОбъект.ПолучитьОбъект();
				Если Объект <> Неопределено Тогда
					
					ОбработатьДанные_ЗаполнитьВариантУказанияПолномочий(Объект, Записать);
					
					ОбработатьДанные_СоздатьПравилоПроверкиПолномочий(СсылкаНаОбъект);
					
					ВозможноВыполнитьОбработкуМЧД = ОбработатьДанные_ВозможноВыполнитьОбработкуМЧД(Объект);
					
					Если Не ЗначениеЗаполнено(Объект.Представители)
						И ВозможноВыполнитьОбработкуМЧД Тогда
						ОбработатьДанные_ЗаполнитьТаблицуПредставителей(Объект, Записать);
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(Объект.ХешФайла)
						И ВозможноВыполнитьОбработкуМЧД Тогда
						ОбработатьДанные_ЗаполнитьХешФайла(Объект, Записать);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Объект.ХешФайла) 
						И ВозможноВыполнитьОбработкуМЧД Тогда
						ОбработатьДанные_ЗаписатьВЖурналМЧД(Объект);
					КонецЕсли;
					
				КонецЕсли;
				
				Если Записать Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
				КонецЕсли;
				
				ОбъектовОбработано = ОбъектовОбработано + 1;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
				ШаблонСообщения = НСтр("ru = 'Не удалось обработать машиночитаемую доверенность ЭДО: %1 по причине:'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СсылкаНаОбъект) + Символы.ПС
					+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,, СсылкаНаОбъект, ТекстСообщения);
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;	

	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые машиночитаемые доверенности ЭДО (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция машиночитаемых доверенностей ЭДО: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#Область КлассификаторыМЧД

// Обновляет данные справочника КлассификаторПолномочийФНСМЧД002
// 
// Параметры:
//  ДанныеКлассификатора - см. СервисНастроекЭДО.ПолучитьКлассификаторПолномочийФНС_МЧД002
//  ДатаИзменения        - Дата
//
Процедура ОбновитьКлассификаторПолномочийФНС_МЧД002(ДанныеКлассификатора, ДатаИзменения) Экспорт
	
	ВидОперации = НСтр("ru = 'Синхронизация классификатора полномочий ФНС (МЧД 002) из сервиса настроек'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ИЗ
	|	Справочник.КлассификаторПолномочийФНСМЧД002 КАК КлассификаторПолномочийФНСМЧД002";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЕстьЗаписи = Не РезультатЗапроса.Пустой();
	
	Если ДанныеКлассификатора.ДатаПоследнегоИзменения <> ДатаИзменения Или Не ЕстьЗаписи Тогда
		
		НачатьТранзакцию();
		
		Попытка
		
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторПолномочийФНСМЧД002");
			ЭлементБлокировки.ИсточникДанных = ДанныеКлассификатора.КлассификаторПолномочийФНСМЧД002;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("КодКлассификатора", "КодКлассификатора");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаНовыхДанных.КодКлассификатора КАК КодКлассификатора,
			|	ТаблицаНовыхДанных.ДатаИзменения
			|ПОМЕСТИТЬ ТаблицаНовыхДанных
			|ИЗ
			|	&ТаблицаНовыхДанныхКлассификатора КАК ТаблицаНовыхДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаНовыхДанных.КодКлассификатора КАК КодКлассификатора,
			|	КлассификаторПолномочийФНСМЧД002.Ссылка,
			|	ВЫБОР
			|		КОГДА ТаблицаНовыхДанных.ДатаИзменения <> ЕСТЬNULL(КлассификаторПолномочийФНСМЧД002.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК БылоИзменение
			|ПОМЕСТИТЬ ТаблицаСравненияДанных
			|ИЗ
			|	ТаблицаНовыхДанных КАК ТаблицаНовыхДанных
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторПолномочийФНСМЧД002 КАК КлассификаторПолномочийФНСМЧД002
			|		ПО ТаблицаНовыхДанных.КодКлассификатора = КлассификаторПолномочийФНСМЧД002.КодКлассификатора
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаСравненияДанных.КодКлассификатора КАК КодКлассификатора,
			|	ТаблицаСравненияДанных.Ссылка КАК Ссылка
			|ИЗ
			|	ТаблицаСравненияДанных КАК ТаблицаСравненияДанных
			|ГДЕ
			|	ТаблицаСравненияДанных.БылоИзменение";
			
			Запрос.УстановитьПараметр("ТаблицаНовыхДанныхКлассификатора", ДанныеКлассификатора.КлассификаторПолномочийФНСМЧД002);
			
			УстановитьПривилегированныйРежим(Истина);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЗаполняемыеРеквизиты = "КодКлассификатора, Наименование, Полномочие, ТипОтношений, ДатаИзменения, Скрипт";
			ЗаполняемыеРеквизитыПравил = "ИмяПоляДанных, НачальноеЗначение, КонечноеЗначение";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
					СтрокаПолномочий = ДанныеКлассификатора.КлассификаторПолномочийФНСМЧД002.Найти(
						ВыборкаДетальныеЗаписи.КодКлассификатора, "КодКлассификатора");
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
					
						ОбъектКлассификатора = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
					
					Иначе
						
						ОбъектКлассификатора = Справочники.КлассификаторПолномочийФНСМЧД002.СоздатьЭлемент();
						
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ОбъектКлассификатора, СтрокаПолномочий, ЗаполняемыеРеквизиты);
					
					ОбъектКлассификатора.НастройкиПроверки.Очистить();
					
					Для Каждого НастройкаПроверки Из СтрокаПолномочий.НастройкиПроверки Цикл
						
						НоваяСтрока = ОбъектКлассификатора.НастройкиПроверки.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкаПроверки, ЗаполняемыеРеквизитыПравил);
						
						НоваяСтрока.Список = Неопределено;
						
						Если НастройкаПроверки.Список.Количество() > 0 Тогда
							
							НовыйСписок = Новый СписокЗначений;
							
							Для Каждого ЭлементСписка Из НастройкаПроверки.Список Цикл
																
								ВидДокумента = НайтиВидЭДПоЗначению(ЭлементСписка.ЗначениеПоляТипДокумента);
								
								Если ЗначениеЗаполнено(ВидДокумента) 
									И НовыйСписок.НайтиПоЗначению(ВидДокумента) = Неопределено Тогда
									
									НовыйЭлемент = НовыйСписок.Добавить();
									НовыйЭлемент.Значение = ВидДокумента;
									
								КонецЕсли;
								
							КонецЦикла;
							
							НоваяСтрока.ИмяПоляДанных = ?(НоваяСтрока.ИмяПоляДанных = "ВидДокумента", "ВидЭД", НоваяСтрока.ИмяПоляДанных);
							НоваяСтрока.Список = Новый ХранилищеЗначения(НовыйСписок, Новый СжатиеДанных(9));
							
						КонецЕсли;
					
					КонецЦикла;
					
					ВызовИзОбработчикаОбновления = ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы();
					Если ВызовИзОбработчикаОбновления Тогда
						ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектКлассификатора);
					Иначе
						ОбъектКлассификатора.Записать();
					КонецЕсли;
					
				КонецЦикла;
				
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки);
				
		КонецПопытки;
			
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет данные справочника КлассификаторПолномочийФНСМЧД003
// 
// Параметры:
//  ДанныеКлассификатора - см. СервисНастроекЭДО.ПолучитьКлассификаторПолномочийФНС_МЧД003
//  ДатаИзменения        - Дата
//
Процедура ОбновитьКлассификаторПолномочийФНС_МЧД003(ДанныеКлассификатора, ДатаИзменения) Экспорт
	
	ВидОперации = НСтр("ru = 'Синхронизация классификатора полномочий ФНС (МЧД 003) из сервиса настроек'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ИЗ
	|	Справочник.КлассификаторПолномочийФНСМЧД003 КАК КлассификаторПолномочийФНСМЧД003
	|ГДЕ
	|	НЕ КлассификаторПолномочийФНСМЧД003.ЭтоГруппа";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЕстьЗаписи = Не РезультатЗапроса.Пустой();
	
	Если ДанныеКлассификатора.ДатаПоследнегоИзменения <> ДатаИзменения Или Не ЕстьЗаписи Тогда
		
		НачатьТранзакцию();
		
		Попытка
		
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторПолномочийФНСМЧД003");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаНовыхДанных.КодКлассификатора КАК КодКлассификатора,
			|	ТаблицаНовыхДанных.ДатаИзменения
			|ПОМЕСТИТЬ ТаблицаНовыхДанных
			|ИЗ
			|	&ТаблицаНовыхДанныхКлассификатора КАК ТаблицаНовыхДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаНовыхДанных.КодКлассификатора КАК КодКлассификатора,
			|	КлассификаторПолномочийФНСМЧД003.Ссылка,
			|	ВЫБОР
			|		КОГДА ТаблицаНовыхДанных.ДатаИзменения <> ЕСТЬNULL(КлассификаторПолномочийФНСМЧД003.ДатаИзменения, ДАТАВРЕМЯ(1, 1,
			|			1))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК БылоИзменение
			|ПОМЕСТИТЬ ТаблицаСравненияДанных
			|ИЗ
			|	ТаблицаНовыхДанных КАК ТаблицаНовыхДанных
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторПолномочийФНСМЧД003 КАК КлассификаторПолномочийФНСМЧД003
			|		ПО ТаблицаНовыхДанных.КодКлассификатора = КлассификаторПолномочийФНСМЧД003.КодКлассификатора
			|		И НЕ КлассификаторПолномочийФНСМЧД003.ЭтоГруппа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаСравненияДанных.КодКлассификатора КАК КодКлассификатора,
			|	ТаблицаСравненияДанных.Ссылка КАК Ссылка
			|ИЗ
			|	ТаблицаСравненияДанных КАК ТаблицаСравненияДанных
			|ГДЕ
			|	ТаблицаСравненияДанных.БылоИзменение";
			
			Запрос.УстановитьПараметр("ТаблицаНовыхДанныхКлассификатора", ДанныеКлассификатора.КлассификаторПолномочийФНСМЧД003);
			
			УстановитьПривилегированныйРежим(Истина);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЗаполняемыеРеквизиты = "КодКлассификатора, Наименование, Полномочие, Мнемоника, ТипОтношений, ДатаИзменения, Скрипт";
			ЗаполняемыеРеквизитыПравил = "ИмяПоляДанных, НачальноеЗначение, КонечноеЗначение";
			КолонкиГруппировок = "Родитель, УИДРодителя";
			РодителиПолномочий = ДанныеКлассификатора.КлассификаторПолномочийФНСМЧД003.Скопировать(, КолонкиГруппировок);
			РодителиПолномочий.Свернуть(КолонкиГруппировок);
			
			Для Каждого РодительПолномочий Из РодителиПолномочий Цикл
				
				СсылкаНаГруппу = Справочники.КлассификаторПолномочийФНСМЧД003.ПолучитьСсылку(РодительПолномочий.УИДРодителя);
				
				Если Не ОбщегоНазначения.СсылкаСуществует(СсылкаНаГруппу) Тогда
					
					ГруппаОбъект = Справочники.КлассификаторПолномочийФНСМЧД003.СоздатьГруппу();
					ГруппаОбъект.УстановитьСсылкуНового(СсылкаНаГруппу);
					ГруппаОбъект.Наименование = РодительПолномочий.Родитель;
					
					ВызовИзОбработчикаОбновления = ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы();
					Если ВызовИзОбработчикаОбновления Тогда
						ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаОбъект);
					Иначе
						ГруппаОбъект.Записать();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
				
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				СтрокаПолномочий = ДанныеКлассификатора.КлассификаторПолномочийФНСМЧД003.Найти(
					ВыборкаДетальныеЗаписи.КодКлассификатора, "КодКлассификатора");
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
					
					ОбъектКлассификатора = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						
				Иначе
					
					ОбъектКлассификатора = Справочники.КлассификаторПолномочийФНСМЧД003.СоздатьЭлемент();
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ОбъектКлассификатора, СтрокаПолномочий, ЗаполняемыеРеквизиты);
				
				ОбъектКлассификатора.Родитель = Справочники.КлассификаторПолномочийФНСМЧД003.ПолучитьСсылку(
					РодительПолномочий.УИДРодителя);
				
				ОбъектКлассификатора.НастройкиПроверки.Очистить();
				
				Для Каждого НастройкаПроверки Из СтрокаПолномочий.НастройкиПроверки Цикл
					
					НоваяСтрока = ОбъектКлассификатора.НастройкиПроверки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкаПроверки, ЗаполняемыеРеквизитыПравил);
					
					НоваяСтрока.Список = Неопределено;
					
					Если НастройкаПроверки.Список.Количество() > 0 Тогда
						
						НовыйСписок = Новый СписокЗначений;
						
						Для Каждого ЭлементСписка Из НастройкаПроверки.Список Цикл
							
							ВидДокумента = НайтиВидЭДПоЗначению(ЭлементСписка.ЗначениеПоляТипДокумента);
						
							Если ЗначениеЗаполнено(ВидДокумента) 
								И НовыйСписок.НайтиПоЗначению(ВидДокумента) = Неопределено Тогда
								
								НовыйЭлемент = НовыйСписок.Добавить();
								НовыйЭлемент.Значение = ВидДокумента;
								
							КонецЕсли;
							
						КонецЦикла;
						
						НоваяСтрока.ИмяПоляДанных = ?(НоваяСтрока.ИмяПоляДанных = "ВидДокумента", "ВидЭД", НоваяСтрока.ИмяПоляДанных);
						НоваяСтрока.Список = Новый ХранилищеЗначения(НовыйСписок, Новый СжатиеДанных(9));
						
					КонецЕсли;
				
				КонецЦикла;
				
				ВызовИзОбработчикаОбновления = ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы();
				Если ВызовИзОбработчикаОбновления Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектКлассификатора);
				Иначе
					ОбъектКлассификатора.Записать();
				КонецЕсли;
			
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки);
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область События

// Параметры:
//  ВидФормы - Строка
//  Параметры - Структура
//  ВыбраннаяФорма - Строка, ОбъектМетаданныхФорма -
//  ДополнительнаяИнформация - Структура:
//  * ПовторноеИспользование - Булево
//  СтандартнаяОбработка - Булево
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если ВидФормы = "ФормаОбъекта" Тогда
		Ключ = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Параметры, "Ключ"); // ОпределяемыйТип.МашиночитаемаяДоверенность
		ВыбраннаяФорма = Неопределено;
		
		Если ЭтоЧерновикМЧД003(Ключ) Тогда
			Если ЭтоПередоверие(Ключ) Тогда
				ВыбраннаяФорма = Метаданные.Справочники.МЧД003.Формы.ЧерновикПередоверияМЧД;
			Иначе
				ВыбраннаяФорма = Метаданные.Справочники.МЧД003.Формы.ЧерновикМЧД;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		МетаданныеМЧД = Метаданные.НайтиПоТипу(ТипЗнч(Ключ)); // ОбъектМетаданныхСправочник
		Если МетаданныеМЧД <> Неопределено И ОбщегоНазначения.ЭтоСправочник(МетаданныеМЧД) Тогда
			ВыбраннаяФорма = МетаданныеМЧД.Формы.Найти("ФормаПросмотра");
			Если ЭтоМЧДКонтрагента(Ключ) Тогда
				ВыбраннаяФорма = МетаданныеМЧД.Формы.Найти("ФормаЭлемента");
			КонецЕсли;
		КонецЕсли;
		Если ВыбраннаяФорма = Неопределено Тогда
			ВыбраннаяФорма = Метаданные.Справочники.МЧД003.Формы.ЧерновикМЧД;
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаСписка" Или ВидФормы = "ФормаВыбора" Тогда
		ВыбраннаяФорма = Метаданные.РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.Формы.ФормаСписка;
		ТекущаяСтрока = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Параметры, "ТекущаяСтрока"); // ОпределяемыйТип.МашиночитаемаяДоверенность
		Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
			ЗначениеКлюча = Новый Структура("Хеш", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ХешФайла"));
			Параметры.Вставить("ТекущаяСтрока", РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.СоздатьКлючЗаписи(ЗначениеКлюча));
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  ДанныеВыбора - СписокЗначений Из ОпределяемыйТип.МашиночитаемаяДоверенность
//  Параметры - Структура:
//  * СтрокаПоиска - Строка, Неопределено -
//  * Отбор - Структура
//  * ВыборГруппИЭлементов - ИспользованиеГруппИЭлементов
//  * СпособПоискаСтроки - СпособПоискаСтрокиПриВводеПоСтроке
//  * ПолнотекстовыйПоиск - ПолнотекстовыйПоискПриВводеПоСтроке
//  * РежимПолученияДанныхВыбора - РежимПолученияДанныхВыбораПриВводеПоСтроке
//  СтандартнаяОбработка - Булево
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Доверенность,
	|	Доверенность.Представление КАК ПредставлениеДоверенности,
	|	Номер
	|ИЗ
	|	РегистрСведений.ЖурналМашиночитаемыхДоверенностей
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И &УсловиеПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыдачи";
	Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		ПараметрыПодстановки = Новый Структура;
		ПараметрыПодстановки.Вставить("ЭкранированнаяСтрока", СформироватьСтрокуДляПоискаВЗапросе(
			Параметры.СтрокаПоиска));
		Если Параметры.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.Начало Тогда
			СтрокаПоиска = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("[ЭкранированнаяСтрока]%",
				ПараметрыПодстановки);
		Иначе
			СтрокаПоиска = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("%[ЭкранированнаяСтрока]%",
				ПараметрыПодстановки);
		КонецЕсли;
		Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
		УсловиеПоиска = "Номер ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""";
	Иначе
		УсловиеПоиска = "Истина";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоиска", УсловиеПоиска);
	Выборка = Запрос.Выполнить().Выбрать();
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(
			Выборка.Доверенность, ФорматированнаяСтрока(
				НСтр("ru='%1 <span style=""color: НедоступныйДляВыбораЭлементБЭД"">[%2]</span>';"),
			Выборка.ПредставлениеДоверенности, Выборка.Номер));
	КонецЦикла;
КонецПроцедуры

// См. МашиночитаемыеДоверенностиВызовСервера.ДанныеВыбораСубъекта
Функция ДанныеВыбораСубъекта(СтрокаПоиска, ТипыСубъектов) Экспорт
	Лимит = 10;
	ПараметрыПодбора = Новый Структура("СтрокаПоиска, СпособПоискаСтроки", СтрокаПоиска,
		СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть);
	ИтоговыйСписок = Новый СписокЗначений;
	Индекс = 1;
	Для Каждого ЭлементСписка Из ТипыСубъектов Цикл
		ТекущийТип = ЭлементСписка.Значение;
		МетаданныеИсточника = Метаданные.НайтиПоТипу(ТекущийТип);
		Если ОбщегоНазначения.ЭтоСправочник(МетаданныеИсточника) Тогда
			ИмяСправочника = МетаданныеИсточника.Синоним;			
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеИсточника.ПолноеИмя());
			ДанныеВыбора = Менеджер.ПолучитьДанныеВыбора(ПараметрыПодбора);
			Для Каждого ЭлементВыбора Из ДанныеВыбора Цикл
				ЧастиПредставления = Новый Массив(2);
				ЧастиПредставления[0] = ЭлементВыбора.Представление;
				ЧастиПредставления[1] = ФорматированнаяСтрока(
					" <span style=""color:НедоступныйДляВыбораЭлементБЭД"">[%1]</span>", ИмяСправочника);
				ИтоговыйСписок.Добавить(ЭлементВыбора.Значение, Новый ФорматированнаяСтрока(ЧастиПредставления));
				Если Индекс >= Лимит Тогда
					Возврат ИтоговыйСписок;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат ИтоговыйСписок;
КонецФункции

#КонецОбласти

#Область УправлениеДоступом

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	Списки.Вставить(Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЖурналМашиночитаемыхДоверенностей, Истина);
КонецПроцедуры

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Чтение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Изменение.Организации
	|";
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс

// Параметры:
//  ЭлементыВыбораВидаДокумента - Массив Из РасширениеПоляФормыДляПоляВвода
Процедура УстановитьСписокВыбораДокументовФизическихЛиц(ЭлементыВыбораВидаДокумента) Экспорт
	ВидыДокументов = МашиночитаемыеДоверенностиКлиентСервер.ВидыДокументовФизическихЛиц();
	Для Каждого ПолеВвода Из ЭлементыВыбораВидаДокумента Цикл
		ПолеВвода.СписокВыбора.Очистить();
		Для Каждого ВидДок Из ВидыДокументов Цикл
			ПолеВвода.СписокВыбора.Добавить(ВидДок.Ключ, ВидДок.Значение);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Параметры:
//  Субъект - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовыйДоверитель
//          - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовыйПредставитель
// 
// Возвращаемое значение:
//  Строка -  Сформировать представление субъекта
Функция ПредставлениеСубъектаДоверенности(Субъект) Экспорт
	
	Журнал = РегистрыСведений.ЖурналМашиночитаемыхДоверенностей;
	ТипыДоверителей = Журнал.ТипыДоверителей();
	ТипыПредставителей = Журнал.ТипыПредставителей();
	
	Если Субъект.Тип = ТипыДоверителей.ЮридическоеЛицо
		Или Субъект.Тип = ТипыПредставителей.ЮридическоеЛицо Тогда
		Возврат ПредставлениеЮридическогоЛица(Субъект.ДанныеЮридическогоЛица);
	ИначеЕсли Субъект.Тип = ТипыДоверителей.ИндивидуальныйПредприниматель 
		Или Субъект.Тип = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда
		Возврат ПредставлениеИндивидуальногоПредпринимателя(Субъект.ДанныеИндивидуальногоПредпринимателя);
	ИначеЕсли Субъект.Тип = ТипыДоверителей.ФизическоеЛицо
		Или Субъект.Тип = ТипыПредставителей.ФизическоеЛицо Тогда
		Возврат ПредставлениеФизическогоЛица(Субъект.ДанныеФизическогоЛица);
	ИначеЕсли Субъект.Тип = ТипыДоверителей.ИностраннаяОрганизация Тогда
		Возврат ПредставлениеИностраннойОрганизации(Субъект.ДанныеИностраннойОрганизации);
	ИначеЕсли Субъект.Тип = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда
		Возврат ПредставлениеИностраннойОрганизации(Субъект.ДанныеФилиалаИностраннойОрганизации);
	ИначеЕсли Субъект.Тип = ТипыПредставителей.ФилиалЮридическогоЛица Тогда
		Возврат ПредставлениеЮридическогоЛица(Субъект.ДанныеФилиалаЮридическогоЛица);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Это передоверие МЧД003.
// 
// Параметры:
//  МЧД - ОбъектXDTO, ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоПередоверие(МЧД) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(МЧД) = Тип("ОбъектXDTO") Тогда
		Результат = (ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(МЧД, "Документ.Передов") <> Неопределено);
	Иначе
		Результат = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "НомерРодительскойДоверенности"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ИНН доверителя электронной подписи.
// 
// Параметры:
//  ХешПодписи - Строка
//  ПодписанныйОбъект - СправочникСсылка.СообщениеОбменСБанкамиПрисоединенныеФайлы
// 
// Возвращаемое значение:
//  - Строка - ИНН
//  
Функция ИННДоверителяЭлектроннойПодписиПоМЧД(ХешПодписи, ПодписанныйОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныеПодписиПоМЧД.Доверенность КАК МЧД
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиПоМЧД КАК ЭлектронныеПодписиПоМЧД
		|ГДЕ
		|	ЭлектронныеПодписиПоМЧД.Доверенность.НомерДоверенности > """"
		|	И ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект = &ПодписанныйОбъект
		|	И ЭлектронныеПодписиПоМЧД.ХешПодписи = &ХешПодписи";
	
	Запрос.УстановитьПараметр("ХешПодписи", ХешПодписи);
	Запрос.УстановитьПараметр("ПодписанныйОбъект", ПодписанныйОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СправочникМЧД = СправочникМЧД(Выборка.МЧД);
		
		СведенияМЧД = СправочникМЧД.СведенияМЧД(Выборка.МЧД);
		
		Возврат СведенияМЧД.ИННДоверителя;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Компонует параметры для отбора сертификата подписываемым доверителем
// 
// Параметры:
//  ИННОрганизации - Строка
//  ОГРНОрганизации - Строка
//  СНИЛСДоверителя - Строка
//  ИдентификаторОрганизации - Строка
// 
// Возвращаемое значение:
//  Структура:
// * ИННОрганизации - Строка
// * ОГРНОрганизации - Строка
// * СНИЛСДоверителя - Строка
// * ИдентификаторОрганизации - Строка
//
Функция ПараметрыОтбораСертификатаДляПодписанияМЧД(ИННОрганизации, ОГРНОрганизации, СНИЛСДоверителя, ИдентификаторОрганизации) Экспорт
	
	Структура = Новый Структура();
	Структура.Вставить("ИННОрганизации", ИННОрганизации);
	Структура.Вставить("ОГРНОрганизации", ОГРНОрганизации);
	Структура.Вставить("СНИЛСДоверителя", СНИЛСДоверителя);
	Структура.Вставить("ИдентификаторОрганизации", ИдентификаторОрганизации);
	
	Возврат Структура;
	
КонецФункции

// Проверяет сертификат на принадлежность к доверителю МЧД
//
// Параметры:
//  ИННОрганизации - Строка
//  ОГРНОрганизации - Строка
//  СНИЛСДоверителя - Строка
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//
// Возвращаемое значение:
//  Булево - Результат сравнения
//  
Функция ЭтоСертификатДоверителя(ИННОрганизации, ОГРНОрганизации, СНИЛСДоверителя, Сертификат) Экспорт

	СвойстваСубъектаСертификата = СвойстваСубъектаСертификатаПоСсылке(Сертификат);
	
	ИННПодписантаФЛ = СвойстваСубъектаСертификата.ИНН;
	ИННПодписантаЮЛ = СвойстваСубъектаСертификата.ИННЮЛ;
	ОГРНИП_Подписанта = СвойстваСубъектаСертификата.ОГРНИП;
	ОГРН_Подписанта = СвойстваСубъектаСертификата.ОГРН;
	СНИЛС_Сертификата = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" -", СвойстваСубъектаСертификата.СНИЛС, "");
	СНИЛС_МЧД = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" -", СНИЛСДоверителя, "");
	
	Если Не ЗначениеЗаполнено(ИННПодписантаЮЛ) Тогда
		ИННПодписантаЮЛ = Прав(СвойстваСубъектаСертификата.ИНН, 10);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СНИЛС_МЧД)
		И СНИЛС_МЧД = СНИЛС_Сертификата
		И (ИННПодписантаФЛ = ИННОрганизации 
			Или ИННПодписантаЮЛ = ИННОрганизации
			Или (ЗначениеЗаполнено(ОГРНИП_Подписанта) И ОГРНИП_Подписанта = ОГРНОрганизации)
			Или (ЗначениеЗаполнено(ОГРН_Подписанта) И ОГРН_Подписанта = ОГРНОрганизации)) Тогда
		
		ЭтоСертификатДоверителя = Истина;
	
	ИначеЕсли Не ЗначениеЗаполнено(СНИЛС_МЧД)
		И (ИННПодписантаФЛ = ИННОрганизации
			Или ИННПодписантаЮЛ = ИННОрганизации
			Или (ЗначениеЗаполнено(ОГРНИП_Подписанта) И ОГРНИП_Подписанта = ОГРНОрганизации)
			Или (ЗначениеЗаполнено(ОГРН_Подписанта) И ОГРН_Подписанта = ОГРНОрганизации)) Тогда
		
		ЭтоСертификатДоверителя = Истина;
		
	Иначе
		
		ЭтоСертификатДоверителя = Ложь;
		
	КонецЕсли;
	
	Возврат ЭтоСертификатДоверителя;	
	
КонецФункции

// Новая ошибка проверки полномочий.
// 
// Возвращаемое значение:
//  Структура - Новая ошибка проверки полномочий:
// * Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//                - СправочникСсылка.МЧД003
// * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 						 - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
// * ТекстОшибки - Строка
Функция НоваяОшибкаПроверкиПолномочийПриПодписании() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Доверенность", Справочники.МашиночитаемыеДоверенностиОрганизаций.ПустаяСсылка());
	Результат.Вставить("ЭлектронныйДокумент", Документы.ЭлектронныйДокументИсходящий.ПустаяСсылка());
	Результат.Вставить("ТекстОшибки", "");
	Возврат Результат;
	
КонецФункции

// Новая ошибка проверки полномочий.
// 
// Возвращаемое значение:
//  Структура - Новая ошибка проверки полномочий:
// * Доверенность - Строка
// * НомерДоверенности - Строка
// * ТекстОшибки - Строка
Функция НоваяОшибкаПроверкиПолномочий() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Доверенность", "");
	Результат.Вставить("НомерДоверенности", "");
	Результат.Вставить("ТекстОшибки", "");
	Возврат Результат;
	
КонецФункции

// Возвращает результат проверки на необходимость наличия доверенности на подпись.
//
// Параметры:
//  ИННДоверителя - Строка - ИНН доверителя
//  СвойстваСубъектаСертификата - см. КриптографияБЭД.СвойстваСубъектаСертификата
//  СвойстваИздателяСертификата - см. КриптографияБЭД.СвойстваИздателяСертификата
//
// Возвращаемое значение:
//  Булево - Истина, если для подписи требуется МЧД
//
Функция ТребуетсяМашиночитаемаяДоверенность(ИННДоверителя, СвойстваСубъектаСертификата, СвойстваИздателяСертификата) Экспорт
	
	ТребуетсяДоверенность = Ложь;
	
	ВидСертификата = ВидСертификатаПоДаннымСвойствСубъектаИИздателя(СвойстваСубъектаСертификата, 
		СвойстваИздателяСертификата);
	ВидыСертификатов = МашиночитаемыеДоверенностиКлиентСервер.ВидыСертификатовЭлектроннойПодписи();
	ДоверительЮЛ = СтрДлина(ИННДоверителя) = 10;
	ДоверительСовпадаетСПодписантом = (СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ИННДоверителя, 12) = 
		СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СвойстваСубъектаСертификата.ИНН, 12));
		
	Если ВидСертификата = ВидыСертификатов.СертификатДолжностногоЛицаГосОрганаУЦ
		Или ВидСертификата = ВидыСертификатов.СертификатЮЛ Тогда
		ТребуетсяДоверенность = Ложь;
	ИначеЕсли ВидСертификата = ВидыСертификатов.СертификатИП Тогда
		ТребуетсяДоверенность = Не ДоверительСовпадаетСПодписантом; 
	ИначеЕсли ВидСертификата = ВидыСертификатов.СертификатФЛ Тогда
		ТребуетсяДоверенность = ДоверительЮЛ Или Не ДоверительСовпадаетСПодписантом;
	КонецЕсли;
	
	Возврат ТребуетсяДоверенность;
	
КонецФункции

// Находит подписи с непроверенными полномочиями МЧД или иными проблемами связанными с МЧД.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.ЭДПрисодиненныеФайлы
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ПодписанныйОбъект - СправочникСсылка.ЭДПрисодиненныеФайлы
//  * ХешПодписи - Строка
//  * ДоверенностьНайдена - Булево
//  * ОшибкаПроверкиПолномочий - Булево
//  
Функция ПодписиСОшибкамиМЧД(ПодписанныйОбъект) Экспорт
	
	Результат = Новый Массив;
	
	РеквизитыЭД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодписанныйОбъект, "ВидЭД, ТипЭлементаВерсииЭД");
	Если ЭлектронныеДокументыСлужебный.ЭтоТитулФНС(РеквизитыЭД) Тогда
		Подписи = ЭлектронныеДокументыСлужебный.ЭлектронныеПодписиДвухТитулов(ПодписанныйОбъект);
	Иначе
		Подписи = ЭлектронныеДокументыСлужебный.УстановленныеПодписи(ПодписанныйОбъект);
    КонецЕсли;
	
	Для Каждого Подпись Из Подписи Цикл	
		ЭтоВходящаяПодпись = Подпись.СвойстваПодписи.ВходящаяПодпись;
		ЭтоПодписьПоДоверенности = Подпись.ЭтоПодписьПоДоверенности;
		
		Если ЭтоВходящаяПодпись И ЭтоПодписьПоДоверенности Тогда
			
			РезультатПроверкиПоМЧД = Подпись.РезультатПроверкиПоМЧД;
			
			ПроверкаВыполненаВручную = 
				МашиночитаемыеДоверенностиКлиентСервер.ПроверкаДоверенностиВыполненаВручную(
					РезультатПроверкиПоМЧД);
					
			Если ПроверкаВыполненаВручную Тогда
				Продолжить;
			КонецЕсли;
					
			ДоверенностьНайдена = ЗначениеЗаполнено(РезультатПроверкиПоМЧД.Доверенность);
					
			ПроверкаПолномочийВыполненаБезОшибок = Ложь;
			ДоверенностьПроверенаУспешно = Ложь;
			ОшибкаПроверкиПолномочий = Ложь;
			Если ЗначениеЗаполнено(РезультатПроверкиПоМЧД.ПротоколПроверки) Тогда
				
				ПроверкаПолномочийВыполненаБезОшибок = 
					РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий.Успех;				
				
				ДоверенностьПроверенаУспешно = 
					МашиночитаемыеДоверенностиКлиентСервер.ДоверенностьПроверенаУспешно(
						РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаМЧД);
						
				ОшибкаПроверкиПолномочий = ДоверенностьНайдена 
					И Не ДоверенностьПроверенаУспешно 
					И Не РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий.Успех;
			КонецЕсли;
					
			ДанныеПодписи = Новый Структура();
			ДанныеПодписи.Вставить("ПодписанныйОбъект", ПодписанныйОбъект);
			ДанныеПодписи.Вставить("ХешПодписи", Подпись.ХешПодписи);
			ДанныеПодписи.Вставить("ДоверенностьНайдена", ДоверенностьНайдена);
			ДанныеПодписи.Вставить("ОшибкаПроверкиПолномочий", ОшибкаПроверкиПолномочий);
					
			Если Не ДоверенностьНайдена
				ИЛИ НЕ ДоверенностьПроверенаУспешно Тогда
				Результат.Добавить(ДанныеПодписи);
			КонецЕсли;
				
		КонецЕсли;		
	КонецЦикла;
		
	Возврат Результат;	
КонецФункции

// Сохраняет в общем хранилище настроек параметры ручной проверки подписи по МЧД.
// 
// Параметры:
//  Настройки - см. МашиночитаемыеДоверенностиКлиент.НовыеНастройкиРучнойПроверкиПодписиПоМЧД
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//
Процедура СохранитьНастройкиРучнойПроверкиПодписиПоМЧД(Настройки, ЭлектронныйДокумент) Экспорт
			
КонецПроцедуры

// Проверяет является ли ссылка доверенностью контрагента.
// 
// Параметры:
//  МЧД - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  	- СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
// 	Булево
//  
Функция ЭтоМЧДКонтрагента(МЧД) Экспорт
	Возврат ТипЗнч(МЧД) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов");
КонецФункции

// Параметры:
//  Доверенность - ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоМЧД003(Доверенность) Экспорт
	Возврат ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003")
		Или ТипЗнч(Доверенность) = Тип("СправочникОбъект.МЧД003");
КонецФункции

// Это черновик МЧД003.
// 
// Параметры:
//  МЧД - ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоЧерновикМЧД003(МЧД) Экспорт
	
	Если ТипЗнч(МЧД) <> Тип("СправочникСсылка.МЧД003") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Подписана = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "Подписана"); // Булево
	
	Возврат Не Подписана;
	
КонецФункции

// Возвращает идентификатор пространства имен пилотного формата МЧД.
// 
// Возвращаемое значение:
//  Строка
Функция ПилотныйФорматМЧД() Экспорт
	Возврат "ON_DOVBB_1_928_00_01_01";
КонецФункции

// Возвращает идентификатор пространства имен утвержденного в 2022г. формата МЧД.
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_2022() Экспорт
	Возврат "ON_DOVBB_1_928_00_01_01_01";
КонецФункции

// Возвращает идентификатор пространства имен утвержденного в 2022г., формата МЧД версии 002
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_2022_Версия_002() Экспорт
	Возврат "ON_DOVBB_1_928_00_01_02_01";
КонецФункции

// Возвращает идентификатор пространства имен МЧД b2g
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_b2g() Экспорт
	Возврат "ON_DOVEL";
КонецФункции

// Возвращает идентификатор пространства имен универсального формата МЧД версии 003
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_003() Экспорт
	Возврат "ON_EMCHD_1_928_00_01_01_01";
КонецФункции

// Возвращает подстроку, характерную для пространства имен МЧД b2g.
// 
// Возвращаемое значение:
//  Строка
Функция ПространствоИмен_МЧД_b2g() Экспорт
	Возврат "ON_DOVEL";
КонецФункции

// Возвращает подстроку, характерную для пространства имен МЧД b2b версии 003.
// 
// Возвращаемое значение:
//  Строка
Функция ПространствоИмен_МЧД_003() Экспорт
	
	Возврат "ON_EMCHD";
	
КонецФункции

#Область ПолучениеСтатусаВРеестреФНС

// Получает статус МЧД из реестра ФНС.
// 
// Параметры:
//  ДанныеДоверенности - См. МашиночитаемыеДоверенностиКлиентСервер.ДанныеДляПроверкиВРеестреФНС
// 
// Возвращаемое значение:
// - Неопределено - если в данных доверенности указан пустой статус в реестре ФНС
// - См. МашиночитаемыеДоверенностиКлиентСервер.РезультатПроверкиВРеестреФНС
//
Функция ОбновитьСтатусМЧДИзРеестраФНС(ДанныеДоверенности) Экспорт

	Если ДанныеДоверенности.СтатусВРеестреФНС = ПредопределенноеЗначение(
		"Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТокенДоступа = "";
	Результат = МашиночитаемыеДоверенностиКлиентСервер.РезультатПроверкиВРеестреФНС();

	Если ДанныеДоверенности.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отправлено Тогда

		СведенияСтатусаТранзакции = ПолучитьСтатусТранзакцииМЧД(
			ДанныеДоверенности.ИдентификаторТранзакции, ТокенДоступа, ДанныеДоверенности.НомерДоверенности);

		Если СведенияСтатусаТранзакции.СтатусТранзакции = "SUCCESS" Тогда

			Результат.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано;

		ИначеЕсли СведенияСтатусаТранзакции.СтатусТранзакции = "FAILURE" Тогда

			Результат.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ОшибкаРегистрации;

		ИначеЕсли СведенияСтатусаТранзакции.СтатусТранзакции = "404" Или СведенияСтатусаТранзакции.СтатусТранзакции
			= "500" Тогда
			Результат.СтраницаНеНайдена = Истина;
		КонецЕсли;

	КонецЕсли;

	Если (ДанныеДоверенности.СтатусВРеестреФНС <> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отправлено
		И ДанныеДоверенности.СтатусВРеестреФНС
		<> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ОшибкаРегистрации) Или Результат.СтраницаНеНайдена Тогда

		СведенияСтатусаДоверенности = ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(
			ДанныеДоверенности.НомерДоверенности, ТокенДоступа);

		Если СведенияСтатусаДоверенности.СтатусДоверенности = "CREATED" И ДанныеДоверенности.СтатусВРеестреФНС
			<> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ДатаНачалаДействияНеНаступила Тогда

			Результат.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ДатаНачалаДействияНеНаступила;
			Результат.СостояниеИзменено = Истина;

		ИначеЕсли СведенияСтатусаДоверенности.СтатусДоверенности = "ACTIVE" И ДанныеДоверенности.СтатусВРеестреФНС
			<> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано
			И ДанныеДоверенности.СтатусВРеестреФНС <> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ОтправленоЗаявлениеНаОтзыв
			И ДанныеДоверенности.СтатусВРеестреФНС
			<> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ОшибкаОтзыва Тогда

			Результат.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано;
			Результат.СостояниеИзменено = Истина;

		ИначеЕсли СведенияСтатусаДоверенности.СтатусДоверенности = "EXPIRED" И ДанныеДоверенности.СтатусВРеестреФНС
			<> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ИстекСрокДействия Тогда

			Результат.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ИстекСрокДействия;
			Результат.СостояниеИзменено = Истина;

		ИначеЕсли СведенияСтатусаДоверенности.СтатусДоверенности = "DECLINED"
			Или СведенияСтатусаДоверенности.СтатусДоверенности = "REVOKED" Тогда
			ДоверительИНН = ?(ЗначениеЗаполнено(ДанныеДоверенности.ДоверительЮЛ_ИНН), 
				ДанныеДоверенности.ДоверительЮЛ_ИНН, ДанныеДоверенности.ДоверительФЛ_ИНН);
			Попытка
				ДатаОтзыва = ДатаОтзываДоверенности(ДанныеДоверенности.НомерДоверенности, ДоверительИНН, ТокенДоступа);
			Исключение
				Результат.СостояниеИзменено = Ложь;
				Результат.СтраницаНеНайдена = Истина;
			КонецПопытки;
			Если ДанныеДоверенности.СтатусВРеестреФНС <> Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отозвано
				Или ДанныеДоверенности.ДатаОтзыва <> ДатаОтзыва Тогда
				Результат.ДатаОтзыва = ДатаОтзыва;
				Результат.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отозвано;
				Результат.СостояниеИзменено = Истина;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Результат.ДатаПроверки = ТекущаяДатаСеанса();

	Возврат Результат;

КонецФункции

#КонецОбласти

// Возвращает дату отзыва доверенности по Номеру доверенности и ИНН доверителя.
// 
// Параметры:
//  НомерДоверенности - Строка
//  ДоверительИНН - Строка
//  ТокенДоступа - Строка - если не заполнен, то произойдет получение при обращении к серверу МЧД
// 
// Возвращаемое значение:
//  Дата
Функция ДатаОтзываДоверенности(НомерДоверенности, ДоверительИНН, ТокенДоступа = "") Экспорт
	
	СведенияОДоверенности = МашиночитаемыеДоверенностиПовтИсп.ПолучитьСведенияДоверенностиНаСервереМЧД(
		НомерДоверенности, ДоверительИНН, ТокенДоступа);
	
	ДанныеДляЗагрузки = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД();
	Если Не СведенияОДоверенности.Ошибка И ТипЗнч(СведенияОДоверенности.ПолныеДанные) = Тип("Структура") Тогда
		ДанныеДляЗагрузки.ДанныеДоверенности = СведенияОДоверенности.ПолныеДанные.ДанныеВыгрузки;
		ДанныеДляЗагрузки.ДанныеПодписи = СведенияОДоверенности.ПолныеДанные.ДанныеПодписи;
		ДанныеДляЗагрузки.ДанныеПодписиЗаявленияНаОтмену = СведенияОДоверенности.ПолныеДанные.ДанныеПодписиЗаявленияНаОтмену;
	Иначе
		ВызватьИсключение СведенияОДоверенности.ТекстОшибки;
	КонецЕсли;

	Возврат ДатаОтзываДоверенностиПоДаннымДляЗагрузкиМЧД(ДанныеДляЗагрузки);

КонецФункции

// Возвращает дату отзыва доверенности по данным для загрузки МЧД
// 
// Параметры:
//  ДанныеДляЗагрузки - См. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД
//  ТокенДоступа - Строка - Токен для получения сведений из распределенного реестра
// 
// Возвращаемое значение:
//  Дата
Функция ДатаОтзываДоверенностиПоДаннымДляЗагрузкиМЧД(ДанныеДляЗагрузки, ТокенДоступа = "") Экспорт

	ДатаОтзыва = Дата(1, 1, 1);
	
	Если ЗначениеЗаполнено(ДанныеДляЗагрузки.ДанныеПодписиЗаявленияНаОтмену) Тогда
		ДатаОтзыва = ДатаПодписания(ДанныеДляЗагрузки.ДанныеПодписиЗаявленияНаОтмену);
	Иначе
		ПараметрыДляЗапросаРодительскойДоверенности = ПараметрыДляЗапросаРодительскойДоверенности(ДанныеДляЗагрузки.ДанныеДоверенности);
		Если ЗначениеЗаполнено(ПараметрыДляЗапросаРодительскойДоверенности) Тогда
			ДатаОтзыва = ДатаОтзываДоверенности(ПараметрыДляЗапросаРодительскойДоверенности.НомерДоверенности,
				ПараметрыДляЗапросаРодительскойДоверенности.ИННДоверителя, ТокенДоступа);
		КонецЕсли;
	КонецЕсли;
		
	Возврат ДатаОтзыва;

КонецФункции

// Определяет пространство имен XDTO объекта МЧД по его содержимому.
// 
// Параметры:
//  ДанныеXDTO - ОбъектXDTO
// 
// Возвращаемое значение:
//  Строка
Функция ВерсияФорматаОбъектаМЧД(ДанныеXDTO) Экспорт

	ЭтоФормализованныеДоверенностиB2B = ДанныеXDTO.Свойства().Получить("ИдФайл") <> Неопределено
		И ЭтоПространствоИменМЧД(ДанныеXDTO.ИдФайл);
	
	ЭтоДоверенностиB2B = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO, "Документ.СвДов") <> Неопределено
		И ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO, "Документ.СвПолн") <> Неопределено;
	
	Если ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO, "ВерсФорм") = "EMCHD_1"
		И ЭтоФормализованныеДоверенностиB2B Тогда
		Возврат МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003();
	КонецЕсли;
	
	Если ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO, "ВерсФорм") = "002"
		И ЭтоФормализованныеДоверенностиB2B Тогда
		Возврат ФорматМЧД_2022_Версия_002();
	КонецЕсли;
	
	Если ЭтоДоверенностиB2B Тогда
		Возврат ФорматМЧД_2022();
	КонецЕсли;
	
	Если ЭтоФормализованныеДоверенностиB2B Тогда
		Возврат ПилотныйФорматМЧД();
	ИначеЕсли ДанныеXDTO.Свойства().Получить("ИдФайл") <> Неопределено
		И СтрНайти(ДанныеXDTO.ИдФайл, ПространствоИмен_МЧД_b2g()) > 0 Тогда
		Возврат ФорматМЧД_b2g();
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Проверяет, действительна ли доверенность.
// 
// Параметры:
//  СвойстваДоверенности - см. НовыеСвойстваДоверенности
//  ДатаПроверки - Дата - дата, на которую выполняется проверка
// 
// Возвращаемое значение:
//  Булево
Функция ДоверенностьДействительнаПоСвойствам(СвойстваДоверенности, ДатаПроверки) Экспорт
	
	ДействительнаПоСроку = ДатаПроверки > СвойстваДоверенности.ДатаВыдачи
		И ДатаПроверки < КонецДня(СвойстваДоверенности.ДатаОкончания);
	Отозвана = СвойстваДоверенности.Отозвана И ДатаПроверки >= СвойстваДоверенности.ДатаОтзыва;
	ДействительнаПоСтатусу = СтатусыДействительнойДоверенности().Найти(СвойстваДоверенности.СтатусВРеестреФНС) <> Неопределено;
	
	Возврат ДействительнаПоСроку И СвойстваДоверенности.Верна И Не Отозвана И ДействительнаПоСтатусу;
	
КонецФункции

// Получить свойства доверенности по номеру.
// 
// Параметры:
//  НомерДоверенности - Строка
// 
// Возвращаемое значение:
//  см. НовыеСвойстваДоверенности
//
Функция СвойстваДоверенностиПоНомеру(НомерДоверенности) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЧД003.ДатаВыдачи КАК ДатаВыдачи,
		|	МЧД003.СрокДействия КАК ДатаОкончания,
		|	МЧД003.ПолномочияОграничены КАК ПолномочияОграничены,
		|	МЧД003.ДатаПрекращения КАК ДатаОтзыва,
		|	МЧД003.Верна КАК Верна,
		|	МЧД003.СтатусВРеестреФНС КАК СтатусВРеестреФНС,
		|	МЧД003.ДатаПрекращения > ДАТАВРЕМЯ(1, 1, 1) КАК Отозвана,
		|	МЧД003.ВариантЗаполненияПолномочий КАК ВариантЗаполненияПолномочий,
		|	МЧД003.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МЧД003 КАК МЧД003
		|ГДЕ
		|	МЧД003.НомерДоверенности = &НомерДоверенности
		|	И МЧД003.Подписана
		|	И НЕ МЧД003.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаВыдачи,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаОкончания,
		|	МашиночитаемыеДоверенностиКонтрагентов.ПолномочияОграничены,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаОтзыва,
		|	МашиночитаемыеДоверенностиКонтрагентов.Верна,
		|	МашиночитаемыеДоверенностиКонтрагентов.СтатусВРеестреФНС,
		|	МашиночитаемыеДоверенностиКонтрагентов.Отозвана,
		|	МашиночитаемыеДоверенностиКонтрагентов.ВариантЗаполненияПолномочий,
		|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК МашиночитаемыеДоверенностиКонтрагентов
		|ГДЕ
		|	МашиночитаемыеДоверенностиКонтрагентов.НомерДоверенности = &НомерДоверенности
		|	И МашиночитаемыеДоверенностиКонтрагентов.Подписана
		|	И НЕ МашиночитаемыеДоверенностиКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерДоверенности", НомерДоверенности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СвойстваМЧД = НовыеСвойстваДоверенности();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СвойстваМЧД, ВыборкаДетальныеЗаписи);
	КонецЕсли; 

	Возврат СвойстваМЧД;
	
КонецФункции

// Возвращает снилс доверителей по переданному массиву ссылок МЧД организаций
// 
// Параметры:
//  МассивМЧД - Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций, СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//      * Ключ     - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//      * Значение - Строка - СНИЛС подписанта (только цифры)
//  
Функция ДанныеСнилсПодписантов(МассивМЧД) Экспорт

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка,
	|	ЛицоБезДовФЛ_СНИЛС КАК СНИЛС,
	|	Неопределено КАК Файл
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиОрганизаций
	|ГДЕ
	|	Ссылка В (&Доверенности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ссылка,
	|	"""",
	|	ФайлМЧД
	|ИЗ
	|	Справочник.МЧД003
	|ГДЕ
	|	Ссылка В (&Доверенности)";
	Запрос.УстановитьПараметр("Доверенности", МассивМЧД);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СНИЛС) Тогда
			Результат.Вставить(Выборка.Ссылка, УбратьИзСтрокиВсеНеЦифры(Выборка.СНИЛС));
		ИначеЕсли Выборка.Файл <> Неопределено Тогда
			
			ДанныеМЧД = Выборка.Файл.Получить();
			РезультатЧтения = ОбъектXDTOМЧД(ДанныеМЧД);
			
			Если ЗначениеЗаполнено(РезультатЧтения.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;
			
			СНИЛС = СНИЛСФизическогоЛицаДоверителя(РезультатЧтения.ОбъектМЧД);
			Результат.Вставить(Выборка.Ссылка, УбратьИзСтрокиВсеНеЦифры(СНИЛС));
				
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

#Область ОтражениеВУчете

// Читает данные файла ЭД и формирует дерево ЭД
// 
// Параметры:
//  ДанныеФайлаЭД - ОбъектXDTO
//  НовыйЭД - Структура
//  
Процедура ПрочитатьМЧД(ДанныеФайлаЭД, НовыйЭД) Экспорт

	Если ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеФайлаЭД, "Документ.Довер.СвДов") <> Неопределено Тогда
		СведенияДоверенности = ДанныеФайлаЭД.Документ.Довер.СвДов;
	ИначеЕсли ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеФайлаЭД, "Документ.Передов.СвДовПер") <> Неопределено Тогда
		СведенияДоверенности = ДанныеФайлаЭД.Документ.Передов.СвДовПер;
	ИначеЕсли ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеФайлаЭД, "Документ.Передов.СвПереДовер") <> Неопределено Тогда
		СведенияДоверенности = ДанныеФайлаЭД.Документ.Передов.СвПереДовер;		
	Иначе
		СведенияДоверенности = ДанныеФайлаЭД.Документ.СвДов;
	КонецЕсли;
	
	НовыйЭД.ВидЭД = Перечисления.ВидыЭД.МашиночитаемаяДоверенность;
	НовыйЭД.ИД = СведенияДоверенности.НомДовер;
	НовыйЭД.НаправлениеЭД = Перечисления.НаправленияЭД.Входящий;

	ДеревоДляСовместимостиСБЭД = Новый ДеревоЗначений;
	ДеревоДляСовместимостиСБЭД.Колонки.Добавить("ПолныйПуть", Новый ОписаниеТипов("Строка"));
	ДеревоДляСовместимостиСБЭД.Колонки.Добавить("Значение", Новый ОписаниеТипов);

	СтрокаЭДОбъектXDTO = ДеревоДляСовместимостиСБЭД.Строки.Добавить();
	СтрокаЭДОбъектXDTO.ПолныйПуть = "ОбъектXDTO";
	СтрокаЭДОбъектXDTO.Значение = ДанныеФайлаЭД;

	УзелСведений = СведенияДоверенности;

	СтрокаЭДДата = ДеревоДляСовместимостиСБЭД.Строки.Добавить();
	СтрокаЭДДата.ПолныйПуть = "Дата";
	ДатаВыдДовер = УзелСведений.Свойства().Получить("ДатаВыдДовер");
	Если ДатаВыдДовер <> Неопределено Тогда
		Дата = УзелСведений.ДатаВыдДовер;
	Иначе
		Дата = УзелСведений.ДатаНач;
	КонецЕсли;
	
	// Совместимость с деревом БЭД 1.1
	СтрокаЭДДата.Значение = Дата(СтрЗаменить(Дата, "-", ""));

	СтрокаЭДДНомер = ДеревоДляСовместимостиСБЭД.Строки.Добавить();
	СтрокаЭДДНомер.ПолныйПуть = "Номер";
	СтрокаЭДДНомер.Значение = УзелСведений.НомДовер;
	
	СтрокаНЭДДата                   = НовыйЭД.Строки.Добавить();
	СтрокаНЭДДата.Реквизит          = "Дата";
	СтрокаНЭДДата.ЗначениеРеквизита = СтрокаЭДДата.Значение;
	
	СтрокаНЭДДНомер                   = НовыйЭД.Строки.Добавить();
	СтрокаНЭДДНомер.Реквизит          = "Номер";
	СтрокаНЭДДНомер.ЗначениеРеквизита = УзелСведений.НомДовер;
	
	НовыйЭД.ЗначениеРеквизита = ДеревоДляСовместимостиСБЭД;

КонецПроцедуры

// Заполняет документ учета для типа ЭД - МашиночитаемаяДоверенность.
//
// Параметры:
//  ДанныеЭлектронногоДокумента - см. ОтражениеВУчетеЭДО.НовыеДанныеЭлектронногоДокументаДляОтраженияВУчете
//  ДокументыУчета 	- Неопределено,
//  				- Массив из ОпределяемыйТип.МашиночитаемаяДоверенность
//  СпособОбработки - Строка
//  ОписаниеОшибки  - Строка - описание ошибки создания МЧД. Может быть выведена пользователю.
//  
Процедура ОтразитьВУчете(ДанныеЭлектронногоДокумента, ДокументыУчета, СпособОбработки = "", ОписаниеОшибки = "") Экспорт
	
	ДанныеФайла = ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла;
	
	ВерсияФорматаМЧД = ВерсияФорматаПоДаннымЭлектронногоДокумента(ДанныеФайла.ДвоичныеДанные);
	Если ВерсияФорматаМЧД = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
		СправочникМЧД = Справочники.МЧД003;
	ИначеЕсли СпособОбработки = "МашиночитаемыеДоверенностиОрганизаций" Тогда
		СправочникМЧД = Справочники.МашиночитаемыеДоверенностиОрганизаций;
	Иначе
		СправочникМЧД = Справочники.МашиночитаемыеДоверенностиКонтрагентов;
	КонецЕсли;

	ДанныеФайла = ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла;
	Если ДокументыУчета <> Неопределено И ДокументыУчета.Количество() > 0 Тогда
		Для Каждого МЧД Из ДокументыУчета Цикл
			РезультатЗагрузки = СправочникМЧД.ЗагрузитьМЧДИзФайла(ДанныеФайла.ДвоичныеДанные, МЧД);
			Если НЕ ЗначениеЗаполнено(РезультатЗагрузки.МЧД) Тогда
				ОписаниеОшибки = НСтр("ru = 'Не удалось записать машиночитаемую доверенность'");
				ВызватьИсключение(ОписаниеОшибки);
			КонецЕсли;
		КонецЦикла;
	Иначе
		РезультатЗагрузки = СправочникМЧД.ЗагрузитьМЧДИзФайла(ДанныеФайла.ДвоичныеДанные);
		МЧД = РезультатЗагрузки.МЧД;
		Если ЗначениеЗаполнено(МЧД) Тогда
			ДокументыУчета = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(МЧД);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Формирует список операций ЭД типа МашиночитаемаяДоверенность.
// 
// Возвращаемое значение:
//  СписокЗначений из Строка - Список операций типа документа
//  
Функция СписокОперацийТипаДокумента() Экспорт

	Операции = Новый СписокЗначений;
	Способы = МашиночитаемыеДоверенностиКлиентСервер.СпособыОтраженияВУчете();

	Для Каждого Способ Из Способы Цикл
		Операции.Добавить(Способ.Ключ, Способ.Значение);
	КонецЦикла;

	Возврат Операции;

КонецФункции

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииИспользуемыхТиповЭлектронныхДокументов
Процедура ПриОпределенииИспользуемыхТиповЭлектронныхДокументов(ИспользуемыеТипы) Экспорт




КонецПроцедуры

// См. ОтражениеВУчетеЭДО.СписокОперацийТипаДокумента
Процедура СпособыОтраженияВУчетеТипаЭлектронногоДокумента(ТипДокумента, СпособыОтраженияВУчете) Экспорт

	Способы = МашиночитаемыеДоверенностиКлиентСервер.СпособыОтраженияВУчете();

	Если ТипДокумента = Перечисления.ВидыЭД.МашиночитаемаяДоверенность Тогда
		Для Каждого Способ Из Способы Цикл
			СпособыОтраженияВУчете.Добавить(
				Способ.Ключ,
				Способ.Значение,
				Способ.Ключ = "МашиночитаемыеДоверенностиКонтрагентов");
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Удаляет варианты отражения в учете из списка в зависимости от версии формата МЧД.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//                      - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  СписокВариантов - СписокЗначений из Строка - Список вариантов отражения в учете МЧД
Процедура ОграничитьВариантыОтраженияВУчетеПоДаннымЭлектронногоДокумента(ЭлектронныйДокумент, СписокВариантов) Экспорт
	
	ВерсияФорматаМЧД = ВерсияФорматаПоДаннымЭлектронногоДокумента(ЭлектронныйДокумент);
	Если ВерсияФорматаМЧД = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
		Индекс = 0;
		Пока Индекс < СписокВариантов.Количество() Цикл
			Если СписокВариантов[Индекс].Значение = "МЧД003" Тогда
				Индекс = Индекс + 1;
			Иначе
				СписокВариантов.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
	Иначе
		УдаляемыйТипДокумента = СписокВариантов.НайтиПоЗначению("МЧД003");
		Если УдаляемыйТипДокумента <> Неопределено Тогда
			СписокВариантов.Удалить(УдаляемыйТипДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Проверяет заполнение обязательных реквизитов в файле машиночитаемой доверенности.
//
// Параметры:
//  ДанныеДоверенности - См. МашиночитаемыеДоверенности.НовыеДанныеМЧД
//  ЭтоДоверенностьОрганизации - Булево
//
// Возвращаемое значение:
//  Структура - Результат проверки:
// * ЕстьОшибки - Булево
// * ТекстОшибки - Строка
//
Функция ПроверитьКлючевыеРеквизитыДанныхФайлаДоверенности(ДанныеДоверенности, ЭтоДоверенностьОрганизации = Ложь) Экспорт
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ЕстьОшибки", Ложь);
	РезультатПроверки.Вставить("ТекстОшибки", "");
	
	Если ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		КлючевыеРеквизиты = "ДоверительФЛ_ИНН,ДоверительФЛ_СНИЛС";
	Иначе
		КлючевыеРеквизиты = "ДоверительЮЛ_ИНН,ДоверительЮЛ_КПП";
	КонецЕсли;
	
	КлючевыеРеквизиты = КлючевыеРеквизиты + ",НомерДоверенности,ДатаВыдачи,ДатаОкончания";
	Если ЭтоДоверенностьОрганизации Тогда
		КлючевыеРеквизиты = КлючевыеРеквизиты + ",Организация,Представители";
	КонецЕсли;
	
	КлючевыеРеквизиты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючевыеРеквизиты,",", Истина);
	
	ТекстОшибки = "";
	
	Для Каждого КлючевойРеквизит Из КлючевыеРеквизиты Цикл
		Если ДанныеДоверенности.Свойство(КлючевойРеквизит)
			И ЗначениеЗаполнено(ДанныеДоверенности[КлючевойРеквизит]) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = НСтр("ru = 'Не заполнены реквизиты справочника'") + ":  " + КлючевойРеквизит;
		Иначе
			ТекстОшибки = ТекстОшибки + ", " + КлючевойРеквизит;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПроверки.ТекстОшибки = ТекстОшибки;
	РезультатПроверки.ЕстьОшибки = ЗначениеЗаполнено(ТекстОшибки);
	
	Возврат РезультатПроверки;
	
КонецФункции

// Структура адреса сервера МЧД.
// 
// Возвращаемое значение:
//  Структура:
//  * АдресСервера - Строка
//  * РесурсКорняAPI - Строка
//  * ИспользоватьРасширенияAPI - Булево
//  
Функция СтруктураАдресаСервераМЧД() Экспорт
	
	СтруктураАдреса = Новый Структура();
	СтруктураАдреса.Вставить("АдресСервера",				"https://1cpoagate.1c.ru/");
	СтруктураАдреса.Вставить("РесурсКорняAPI",				"/applications/MChD/api/clientpoa");
	СтруктураАдреса.Вставить("ИспользоватьРасширенияAPI",	Истина);
	
	Возврат СтруктураАдреса;
	
КонецФункции

// Формирует файл заявления на отмену МЧД.
// 
// Параметры:
//  НомерДоверенности - Строка - Номер доверенности
//  ПричинаОтмены - Строка - Причина отмены доверенности
// 
// Возвращаемое значение:
//  Структура - Подготовленный файл:
//  * ИмяФайла - Строка - Имя файла
//  * Содержимое - Строка - Содержимое файла
//
Функция ВыгрузитьЗаявлениеНаОтменуМЧД(НомерДоверенности, ПричинаОтмены) Экспорт
	
	МЧД = Справочники.МашиночитаемыеДоверенностиОрганизаций.НайтиПоРеквизиту("НомерДоверенности", НомерДоверенности);
	
	Если Не ЗначениеЗаполнено(МЧД) Тогда
		МЧД = Справочники.МЧД003.НайтиПоРеквизиту("НомерДоверенности", НомерДоверенности);
	КонецЕсли;
	
	ДвоичныеДанныеМЧД = ПолучитьДвоичныеДанныеМЧД(МЧД);
	
	ДанныеДоверенности = ДанныеИзФайлаОбмена(ДвоичныеДанныеМЧД).ДанныеДоверенности;
	
	Если ДанныеДоверенности = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось распознать двоичные данные доверенности'");
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл");
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "001");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");

	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЗаяв");
	ЗаписьXML.ЗаписатьАтрибут("НомДовер", НомерДоверенности);
	ЗаписьXML.ЗаписатьАтрибут("ПричОтз", ПричинаОтмены);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвЗаявит");
	ЗаписьXML.ЗаписатьНачалоЭлемента("СвДоверит");
	
	Если Не ТипЗнч(ДанныеДоверенности) = Тип("Структура") Тогда
		ДанныеДоверенности = Справочники.МЧД003.ДанныеДляПодачиЗаявленияНаОтмену(ДанныеДоверенности);
	КонецЕсли;
	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда

		ЗаписьXML.ЗаписатьНачалоЭлемента("РосОргДовер");
		ЗаписьXML.ЗаписатьАтрибут("НаимОрг", ДанныеДоверенности.ДоверительЮЛ_НаимОрг);
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", ДанныеДоверенности.ДоверительЮЛ_ИНН);
		ЗаписьXML.ЗаписатьАтрибут("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);
		ЗаписьXML.ЗаписатьАтрибут("ОГРН", ДанныеДоверенности.ДоверительЮЛ_ОГРН);
		ЗаписьXML.ЗаписатьКонецЭлемента();

	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда

		ЗаписьXML.ЗаписатьНачалоЭлемента("ИПДовер");
		ЗаписьXML.ЗаписатьАтрибут("НаимИП", ДанныеДоверенности.ДоверительЮЛ_НаимОрг);
		ЗаписьXML.ЗаписатьАтрибут("ИННФЛ", ДанныеДоверенности.ДоверительЮЛ_ИНН);
		ЗаписьXML.ЗаписатьАтрибут("ОГРНИП", ДанныеДоверенности.ДоверительЮЛ_ОГРН);
		ЗаписьXML.ЗаписатьКонецЭлемента();

	Иначе

		ТекстОшибки = НСтр("ru = 'Не поддерживается отзыв с типом доверителя:'") + ДанныеДоверенности.ТипОрганизации;
		ВызватьИсключение ТекстОшибки;

	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат Новый Структура("ИмяФайла, Содержимое", "revoke.xml", ЗаписьXML.Закрыть());
	
КонецФункции

// Получает номер МЧД на сервере МЧД.
// 
// Параметры:
//  ТокенДоступа - Строка - Токен доступа к серверу МЧД.
// 
// Возвращаемое значение:
//  Структура - Результат:
//   * НомерДоверенности - Строка - Номер доверенности
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//
Функция ПолучитьНомерМЧД(ТокенДоступа = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НомерДоверенности", "");
	Результат.Вставить("ТекстОтвета", 		"");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен номер доверенности с сервера МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось получить данные номера доверенности с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось получить данные номера доверенности с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при получении номера доверенности с сервера МЧД распределенного реестра. %1'");
	ШаблоныОшибок.ШаблоныДляКодовОшибок = КодыОшибокДоступа();
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/number", "/poar-webapp/integration/poa/generate-number");
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	ЗаголовкиHTTP.Вставить(?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI, "authorizationtoken", "authorization"),
		"Bearer " + ТокенДоступа);
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере, ЗаголовкиHTTP);
	
	Попытка
		ОтветHTTP = ПолучитьОтвет(СвойстваСервераМЧД, ЗапросHTTP);
	Исключение
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Попытка
		
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета	= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Результат.НомерДоверенности = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("poaNumber"),
			СтруктураОтвета.poaNumber, "");		
	Исключение
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать данные при получении номера доверенности с сервера МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если НЕ ЗначениеЗаполнено(Результат.НомерДоверенности) Тогда
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Регистрирует МЧД на сервере МЧД.
// 
// Параметры:
//  ДанныеВыгрузки - ДвоичныеДанные - Данные выгрузки
//  ДанныеПодписи - ДвоичныеДанные - Данные подписи
//  ТокенДоступа - Строка - Токен доступа
//  НомерДоверенности - Строка - Номер доверенности
//  СсылкаНаДоверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций, СправочникСсылка.МЧД003 -
// 
// Возвращаемое значение:
//  Структура - Результат регистрации:
//   * ИдентификаторТранзакции - Строка - Идентификатор транзакции
//   * НомерДоверенности - Строка - Номер доверенности
//   * ХешДоверенности - Строка - Хеш доверенности
//   * ИННДоверителя - Строка - ИНН доверителя
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//
Функция ЗарегистрироватьМЧД(ДанныеВыгрузки, ДанныеПодписи, ТокенДоступа = "", НомерДоверенности = "",
	СсылкаНаДоверенность = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерДоверенности) Тогда
		НомерДоверенности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДоверенность, "НомерДоверенности");
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторТранзакции", 	"");
	Результат.Вставить("НомерДоверенности", 		"");
	Результат.Вставить("ХешДоверенности", 			"");
	Результат.Вставить("ИННДоверителя", 			"");
	Результат.Вставить("ТекстОтвета", 				"");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен идентификатор загрузки доверенности на сервер МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось загрузить доверенность на сервер МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось загрузить доверенность на сервер МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при загрузке доверенности на сервер МЧД распределенного реестра. %1'");
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок, КодыОшибокДоступа());
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/contract/pre_validation/failed",
		СтрШаблон(
			НСтр("ru = 'Регистрационный номер или имя файла регистрируемой доверенности ""%1"" уже используется'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/unknown-poa-type",
		СтрШаблон(
			НСтр("ru = 'Некорректный префикс имени файла доверенности ""%1"", невозможно определить тип доверенности'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/poa.signature_is_invalid",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка валидности электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/certificate_cn_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не заполнены фамилия, имя, отчество владельца в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/certificate_snils_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не заполнен СНИЛС владельца в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/certificate_ogrn_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не заполнен ОГРН организации, к которой принадлежит владелец, в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/certificate_ogrnip_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не заполнен ОГРНИП в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/individual_entrepreneur_signer_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка подписанта на соответствие данным сертификата электронной подписи доверенности ""%1"" или в качестве доверителя указан ИП'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/individual_entrepreneur_snils_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка правомерности загрузки: СНИЛС подписанта доверенности не совпадает со СНИЛС в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/individual_entrepreneur_ogrnip_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка правомерности загрузки: ОГРНИП доверителя не указан в доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/individual_entrepreneur_ogrnip_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка правомерности загрузки: ОГРНИП доверителя в доверенности не совпадает с ОГРНИП в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/russian_legal_entity_snils_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка правомерности загрузки: СНИЛС подписанта доверенности не совпадает со СНИЛС в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/russian_legal_entity_ogrn_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка правомерности загрузки: ОГРН доверителя в доверенности не совпадает с ОГРН в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/russian_legal_entity_inner_ogrn_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка правомерности загрузки: ОГРН организации-доверителя не совпадает с ОГРН в сертификате электронной подписи доверенности ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/russian_legal_entity_signer_check_failed",
		СтрШаблон(
			НСтр("ru = 'Данные доверителя и подписанта в доверенности не соответствуют данным из ЕГРЮЛ для доверенности ""%1""'"),
			НомерДоверенности));
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/poa", "/poar-webapp/integration/poa");
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=My1cV8bNdr");
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	ЗаголовкиHTTP.Вставить(?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI, "authorizationtoken", "authorization"),
		"Bearer " + ТокенДоступа);
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	МассивДвоичныхДанных = Новый Массив();
	
	ИмяФайлаВыгрузки = ПолучитьИмяФайлаВыгрузки(СсылкаНаДоверенность);
	
	ШаблонФайла = "--My1cV8bNdr
		|Content-Disposition: form-data; name=""poa""; filename=""%1""
		|Content-Type: text/xml
		|
		|";
	
	ШаблонФайла = СтрЗаменить(ШаблонФайла,  Символы.ПС, Символы.ВК + Символы.ПС);
	СодержимоеФайла = СтрШаблон(ШаблонФайла, ИмяФайлаВыгрузки);
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СодержимоеФайла, "windows-1251"));	
	МассивДвоичныхДанных.Добавить(ДанныеВыгрузки);
	
	ШаблонФайла = "
		|--My1cV8bNdr
		|Content-Disposition: form-data; name=""signature""; filename=""%1.sig""
		|Content-Type: text/xml
		|
		|";
		
	ШаблонФайла = СтрЗаменить(ШаблонФайла,  Символы.ПС, Символы.ВК + Символы.ПС);
	СодержимоеФайла = СтрШаблон(ШаблонФайла, ИмяФайлаВыгрузки);
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СодержимоеФайла, "windows-1251"));
	
	Подпись64 = Base64Строка(ДанныеПодписи);
	Подпись64 = СтрЗаменить(Подпись64, Символы.ВК, "");
	Подпись64 = СтрЗаменить(Подпись64, Символы.ПС, "");
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(Подпись64, "windows-1251"));
	
	ШаблонФайла = "
		|--My1cV8bNdr--";
	СодержимоеФайла = СтрЗаменить(ШаблонФайла,  Символы.ПС, Символы.ВК + Символы.ПС);
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СодержимоеФайла, "windows-1251"));
	
	ПередаваемыеДанные = СоединитьДвоичныеДанные(МассивДвоичныхДанных);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере, ЗаголовкиHTTP);
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ПередаваемыеДанные);
	
	Попытка
		ОтветHTTP = ОтправитьЗапросДляОбработки(СвойстваСервераМЧД, ЗапросHTTP);
	Исключение
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Попытка
		
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета	= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Результат.ИдентификаторТранзакции = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("txId"),
			СтруктураОтвета.txId, "");
		Результат.НомерДоверенности = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("poaNumber"),
			СтруктураОтвета.poaNumber, "");
		Результат.ХешДоверенности = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("poaId"),
			СтруктураОтвета.poaId, "");
		Результат.ИННДоверителя = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("issuerInn"),
			СтруктураОтвета.issuerInn, "");
	Исключение
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать ответ при загрузке доверенности на сервер МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если НЕ ЗначениеЗаполнено(Результат.ИдентификаторТранзакции) Тогда
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	ЗаписатьМЧД(Результат, СсылкаНаДоверенность);
	
	Возврат Результат;
	
КонецФункции

// Получает статус транзакции МЧД.
// 
// Параметры:
//  ИдентификаторТранзакции - Строка - Идентификатор транзакции
//  ТокенДоступа - Строка - Токен доступа
//  НомерДоверенности - Строка - Номер доверенности
// 
// Возвращаемое значение:
//  Структура - Результат получения статуса транзакции МЧД:
//   * СтатусТранзакции - Строка - Статус транзакции
//   * ИдентификаторТранзакции - Строка - Идентификатор транзакции
//   * ДатаВремяТранзакции - Дата, Неопределено - Дата и время транзакции
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//
Функция ПолучитьСтатусТранзакцииМЧД(ИдентификаторТранзакции, ТокенДоступа = "", НомерДоверенности = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусТранзакции", 			"");
	Результат.Вставить("ИдентификаторТранзакции", 	"");
	Результат.Вставить("ДатаВремяТранзакции", 		Неопределено);
	Результат.Вставить("ТекстОтвета", 				"");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен статус обработки с сервера МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось получить статус обработки с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось получить статус обработки с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при получении статус обработки с сервера МЧД распределенного реестра. %1'");
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок, КодыОшибокДоступа());
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок,
		КодыОшибокОтзыва(НомерДоверенности));
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/transactions?txId=" + ИдентификаторТранзакции,
		"/poar-webapp/integration/poa/" + ИдентификаторТранзакции + "/status");
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	ЗаголовкиHTTP.Вставить(?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI, "authorizationtoken", "authorization"),
		"Bearer " + ТокенДоступа);
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере, ЗаголовкиHTTP);
	
	Попытка
		ОтветHTTP = ПолучитьОтвет(СвойстваСервераМЧД, ЗапросHTTP);
	Исключение
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Попытка
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета	= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Результат.СтатусТранзакции = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("status"),
			СтруктураОтвета.status, "");
		Результат.ИдентификаторТранзакции = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("txId"),
			СтруктураОтвета.txId, "");
		
		Результат.ДатаВремяТранзакции = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("timestamp"),
			СтруктураОтвета.timestamp, Неопределено);
	Исключение
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать ответ при получении данных доверенности с сервера МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если ЗначениеЗаполнено(Результат.ДатаВремяТранзакции) Тогда
		Попытка
			Результат.ДатаВремяТранзакции = XMLЗначение(Тип("Дата"), Результат.ДатаВремяТранзакции);
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось разобрать дату и время транзакции'");
			СтруктураПараметров = Новый Структура("ШаблонОшибкиИзИсключения", ТекстСообщения); 
			ВывестиИЗаписатьОшибкуМЧД(СтруктураПараметров, ОтветHTTP, , "ТолькоЗаписатьВЖурналРегистрации");
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат.ИдентификаторТранзакции) Тогда
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Загружает и возвращает сведения доверенности с сервера МЧД.
// 
// Параметры:
//   НомерДоверенности - Строка - Номер доверенности
//   ИННДоверителя - Строка - ИНН доверителя
//  ТокенДоступа - Строка - Токен доступа
// 
// Возвращаемое значение:
//  Структура:
//   * Ошибка - Булево
//   * ТекстОшибки - Строка
//   * ЧастичныеДанные - Неопределено
//   				   - см. МашиночитаемыеДоверенности.ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД
//   * ПолныеДанные - Неопределено
//                  - Структура - Полные данные доверенности:
//                    ** ДанныеВыгрузки - ДвоичныеДанные, Неопределено - Данные выгрузки
//                    ** ДанныеПодписи - ДвоичныеДанные, Неопределено - Данные подписи
//                    ** ДанныеПодписиЗаявленияНаОтмену - ДвоичныеДанные, Неопределено - Данные подписи заявления на отмену
//                    ** ДанныеАрхива - ДвоичныеДанные, Неопределено - Данные архива
//                    ** СтатусПолучения - Строка - Статус получения
//                    ** ТекстОтвета - Строка - Текст ответа сервера МЧД
//   * ДатаЗагрузкиИзРеестра - Дата
// 
Функция ПолучитьСведенияДоверенностиНаСервереМЧД(НомерДоверенности, ИННДоверителя, ТокенДоступа = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ЧастичныеДанные", Неопределено);
	Результат.Вставить("ПолныеДанные", Неопределено);
	Результат.Вставить("ДатаЗагрузкиИзРеестра", '00010101');
	
	Если Не ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;

	ЧастичныеДанные = ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, ТокенДоступа);
	
	Если ПустаяСтрока(ЧастичныеДанные.НомерДоверенности) Тогда
		
		Результат.Ошибка = Истина;
		Результат.ТекстОшибки
			= НСтр("ru = 'Не удалось получить данные доверенности в реестре ФНС. Повторите попытку позже'");
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.ЧастичныеДанные = ЧастичныеДанные;
	
	ПолныеДанные = ПолучитьПолныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, ИННДоверителя, ТокенДоступа);
		
	Если ЗначениеЗаполнено(ПолныеДанные.ТекстОшибки) Тогда
		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = ПолныеДанные.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПолныеДанные.ДанныеВыгрузки) Тогда
		
		Результат.Ошибка = Истина;
		ШаблонОшибки = НСтр(
			"ru = 'Не удалось получить данные доверенности в реестре ФНС.
			|Возможно доверенность: %1 не выдана доверителем с ИНН: %2'"); 
		Результат.ТекстОшибки = СтрШаблон(ШаблонОшибки, НомерДоверенности, ИННДоверителя);
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.ПолныеДанные = ПолныеДанные;
	Результат.ДатаЗагрузкиИзРеестра = ТекущаяДатаСеанса();
	
	Возврат Результат;
			
КонецФункции

// Получает частичные данные доверенности на сервере МЧД.
// 
// Параметры:
//  НомерДоверенности - Строка - Номер доверенности
//  ТокенДоступа - Строка - Токен доступа
// 
// Возвращаемое значение:
//  Структура - Частичные данные доверенности:
//   * СтатусДоверенности - Строка - Статус доверенности
//   * ХешДоверенности - Строка - Хеш доверенности
//   * НомерДоверенности - Строка - Номер доверенности
//   * ДатаВыдачи - Дата, Неопределено - Дата выдачи доверенности
//   * ДатаОкончания - Дата, Неопределено - Дата окончания доверенности
//   * ДатаОбновленияСтатуса - Дата, Неопределено - Дата обновления статуса доверенности
//   * ПубличныйКлюч - Строка - Публичный ключ
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//
Функция ПолучитьЧастичныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, ТокенДоступа = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусДоверенности", 	"");
	Результат.Вставить("ХешДоверенности", 		"");
	Результат.Вставить("НомерДоверенности", 	"");
	Результат.Вставить("ДатаВыдачи", 			Неопределено);
	Результат.Вставить("ДатаОкончания", 		Неопределено);
	Результат.Вставить("ДатаОбновленияСтатуса", Неопределено);
	Результат.Вставить("ПубличныйКлюч", 		"");
	Результат.Вставить("ТекстОтвета", 			"");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен статус доверенности с сервера МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось получить статус доверенности с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось получить статус доверенности с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при получении статуса доверенности с сервера МЧД распределенного реестра. %1'");
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок, КодыОшибокДоступа());
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок,
		КодыОшибокОтзыва(НомерДоверенности));
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/poaopen?poaNumber=" + НомерДоверенности, "/poar-webapp/integration/poa/" + НомерДоверенности + "/public");
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	ЗаголовкиHTTP.Вставить(?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI, "authorizationtoken", "authorization"),
		"Bearer " + ТокенДоступа);
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере, ЗаголовкиHTTP);
	
	Попытка
		ОтветHTTP = ПолучитьОтвет(СвойстваСервераМЧД, ЗапросHTTP);
	Исключение
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Попытка
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета	= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Результат.СтатусДоверенности = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("status"),
			СтруктураОтвета.status, "");
		Результат.ХешДоверенности = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("id"),
			СтруктураОтвета.id, "");
		Результат.НомерДоверенности = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("poaNumber"),
			СтруктураОтвета.poaNumber, "");
		Результат.ДатаВыдачи = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("startDate"),
			СтрокаВДату(СтруктураОтвета.startDate), Неопределено);
		Результат.ДатаОкончания = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("endDate"),
			СтрокаВДату(СтруктураОтвета.endDate), Неопределено);
		Результат.ДатаОбновленияСтатуса = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("statusDate"), 
			СтрокаВДату(СтруктураОтвета.statusDate), Неопределено);
		Результат.ПубличныйКлюч = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("issuerPublicKey"),
			СтруктураОтвета.issuerPublicKey, "");
	Исключение
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать ответ при получении статуса доверенности с сервера МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если НЕ ЗначениеЗаполнено(Результат.ХешДоверенности) И НЕ ЗначениеЗаполнено(Результат.НомерДоверенности) Тогда
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Отменяет МЧД на сервере МЧД.
// 
// Параметры:
//  ИмяФайлаВыгрузки - Строка - Имя файла выгрузки
//  ДанныеВыгрузки - ДвоичныеДанные - Данные выгрузки
//  ДанныеПодписи - ДвоичныеДанные - Данные подписи
//  ДанныеСертификата - ДвоичныеДанные - Данные сертификата
//  ТокенДоступа - Строка - Токен доступа
//  НомерДоверенности - Строка - Номер доверенности
//  СсылкаНаДоверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций, Неопределено - Ссылка на доверенность
// 
// Возвращаемое значение:
//  Структура - Результат отмены:
//   * ИдентификаторТранзакции - Строка - Идентификатор транзакции
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//
Функция ОтменитьМЧД(ИмяФайлаВыгрузки, ДанныеВыгрузки, ДанныеПодписи, ДанныеСертификата, ТокенДоступа = "", 
	НомерДоверенности = "",	СсылкаНаДоверенность = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаНаДоверенность) Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ЭтоМЧД003 = ТипЗнч(СсылкаНаДоверенность) = Тип("СправочникСсылка.МЧД003");
			
			Если Не ЭтоМЧД003 Тогда
				ОбъектДоверенность = СсылкаНаДоверенность.ПолучитьОбъект();
				ОбъектДоверенность.ИмяФайлаЗаявленияНаОтзыв = ИмяФайлаВыгрузки;
				ОбъектДоверенность.ФайлЗаявленияНаОтзыв = Новый ХранилищеЗначения(ДанныеВыгрузки, Новый СжатиеДанных(9));
				ОбъектДоверенность.ЭлектроннаяПодписьЗаявленияНаОтзыв = Новый ХранилищеЗначения(ДанныеПодписи,
					Новый СжатиеДанных(9));
				ОбъектДоверенность.Записать();
			Иначе
				ОбъектДоверенность = СсылкаНаДоверенность.ПолучитьОбъект();
				ОбъектДоверенность.ИмяФайлаЗаявленияНаОтзыв = ИмяФайлаВыгрузки;
				ОбъектДоверенность.ФайлЗаявленияНаОтзыв = Новый ХранилищеЗначения(ДанныеВыгрузки, Новый СжатиеДанных(9));
				
				ОбъектДоверенность.ПодписиЗаявленияНаОтзыв.Очистить();
				
				НоваяПодписьЗаявленияНаОтзыв = ОбъектДоверенность.ПодписиЗаявленияНаОтзыв.Добавить();
				НоваяПодписьЗаявленияНаОтзыв.Подпись = 
					Новый ХранилищеЗначения(ДанныеПодписи, Новый СжатиеДанных(9));
				НоваяПодписьЗаявленияНаОтзыв.Сертификат = 
					Новый ХранилищеЗначения(ДанныеСертификата, Новый СжатиеДанных(9));
				ОбъектДоверенность.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВидОперации = НСтр("ru = 'Отзыв доверенности.'");
			ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru = 'Не удалось отозвать доверенность. Подробности в журнале регистрации.'");
			ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторТранзакции", "");
	Результат.Вставить("ТекстОтвета", "");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен идентификатор отзыва доверенности с сервера МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось отозвать доверенность на сервере МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось отозвать доверенность на сервере МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при отзыве доверенности на сервере МЧД распределенного реестра. %1'");
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок, КодыОшибокДоступа());
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок,
		КодыОшибокОтзыва(НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/not-valid",
		СтрШаблон(
			НСтр("ru = 'Операция запрещена: данные в сертификате не совпадают с данными досрочно отзываемой доверенности номер ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/certificate_validation_exception",
		СтрШаблон(
			НСтр("ru = 'Электронная подпись запроса на досрочный отзыв доверенности номер ""%1"" невалидна'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/expired_poa",
		СтрШаблон(
			НСтр("ru = 'Досрочный отзыв недоступен: доверенность номер ""%1"" истекла'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoked_poa",
		СтрШаблон(
			НСтр("ru = 'Досрочный отзыв недоступен: доверенность номер ""%1"" уже отозвана'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoke_terminal_poa_status",
		СтрШаблон(
			НСтр("ru = 'Невозможен отзыв доверенности номер ""%1"", имеющей статус, отличный от ""Зарегистрировано""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/poa.revoke.revocable_poa_status_is_terminal",
		СтрШаблон(
			НСтр("ru = 'Невозможен отзыв доверенности номер ""%1"", имеющей статус, отличный от ""Зарегистрировано""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoke_signature_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка валидности электронной подписи отзыва доверенности номер ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoke_signature_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка полномочий подписанта, так как ОГРН/ОГРНИП доверителя в отзываемой доверенности не соответствуют ОГРН/ОГРНИП в сертификате электронной подписи отзыва доверенности номер ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoke_certificate_ogrn_or_ogrnip_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка полномочий подписанта, так как в сертификате электронной подписи не заполнен ОГРН/ОГРНИП для отзыва доверенности номер ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoke_certificate_snils_not_specified",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка полномочий подписанта, так как в сертификате электронной подписи не заполнен СНИЛС владельца для отзыва доверенности номер ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/revoke_snils_check_failed",
		СтрШаблон(
			НСтр("ru = 'Не пройдена проверка полномочий подписанта, так как СНИЛС подписанта в отзываемой доверенности не соответствуют СНИЛС в сертификате электронной подписи для отзыва доверенности номер ""%1""'"),
			НомерДоверенности));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/invalid_poa_revoke_xml",
		СтрШаблон(
			НСтр("ru = 'XML-файл отзыва доверенности не соответствует XSD-схеме для отзыва доверенности номер ""%1""'"),
			НомерДоверенности));
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/poacancel", "/poar-webapp/integration/poa/revoke");
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Content-Type", "multipart/form-data; boundary=My1cV8bNdr");
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	ЗаголовкиHTTP.Вставить(?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI, "authorizationtoken", "authorization"),
		"Bearer " + ТокенДоступа);
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	// Запись передаваемых данных
	МассивДвоичныхДанных = Новый Массив();
	
	ШаблонФайла = "--My1cV8bNdr
		|Content-Disposition: form-data; name=""poaRevoke""; filename=""%1""
		|Content-Type: text/xml
		|
		|";
	
	ШаблонФайла = СтрЗаменить(ШаблонФайла,  Символы.ПС, Символы.ВК + Символы.ПС);
	СодержимоеФайла = СтрШаблон(ШаблонФайла, ИмяФайлаВыгрузки);
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СодержимоеФайла, "windows-1251"));	
	МассивДвоичныхДанных.Добавить(ДанныеВыгрузки);
	
	ШаблонФайла = "
		|--My1cV8bNdr
		|Content-Disposition: form-data; name=""signature""; filename=""%1""
		|Content-Type: application/octet-stream
		|
		|";
	
	ШаблонФайла = СтрЗаменить(ШаблонФайла,  Символы.ПС, Символы.ВК + Символы.ПС);
	СодержимоеФайла = СтрШаблон(ШаблонФайла, ИмяФайлаВыгрузки);
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СодержимоеФайла, "windows-1251"));
	
	Подпись64 = Base64Строка(ДанныеПодписи);
	Подпись64 = СтрЗаменить(Подпись64, Символы.ВК, "");
	Подпись64 = СтрЗаменить(Подпись64, Символы.ПС, "");
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(Подпись64, "windows-1251"));
	
	ШаблонФайла = "
		|--My1cV8bNdr--";
	СодержимоеФайла = СтрЗаменить(ШаблонФайла,  Символы.ПС, Символы.ВК + Символы.ПС);
	
	МассивДвоичныхДанных.Добавить(ПолучитьДвоичныеДанныеИзСтроки(СодержимоеФайла, "windows-1251"));
	
	ПередаваемыеДанные = СоединитьДвоичныеДанные(МассивДвоичныхДанных);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере, ЗаголовкиHTTP);
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ПередаваемыеДанные);
	
	Попытка
		ОтветHTTP = ОтправитьЗапросДляОбработки(СвойстваСервераМЧД, ЗапросHTTP);
	Исключение
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Попытка
		
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета	= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Результат.ИдентификаторТранзакции = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("txId"),
			СтруктураОтвета.txId, "");
	Исключение
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать ответ при отмене доверенности на сервере МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если НЕ ЗначениеЗаполнено(Результат.ИдентификаторТранзакции) Тогда
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает URL информационной системы.
// 
// Возвращаемое значение:
//  Строка - url
// 
Функция СведенияОбИнформационнойСистеме() Экспорт
	Возврат "https://m4d.nalog.gov.ru";
КонецФункции

// Определяет наличие у пользователя прав на изменение машиночитаемых доверенностей организаций.
//
// Возвращаемое значение:
//  Булево - Истина, если у пользователя есть право на изменение, иначе Ложь.
//
Функция ЕстьПравоИзменения() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций);
	
КонецФункции

// Возвращает таблицу значений с данными результатов проверки МЧД оператором ЭДО. 
//
// Параметры:
//  ПодписанныеОбъекты - Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//
// Возвращаемое значение:
// 	ТаблицаЗначений:
// 	 * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
// 	 * Отпечаток - Строка
// 	 * ДоверенностьВерна - Булево
//
Функция РезультатыПроверокМЧДОператоромЭДО(ПодписанныеОбъекты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РезультатыПроверкиМЧД.ПодписанныйОбъект КАК ПодписанныйОбъект,
	|	РезультатыПроверкиМЧД.Отпечаток КАК Отпечаток,
	|	РезультатыПроверкиМЧД.ДоверенностьВерна КАК ДоверенностьВерна
	|ИЗ
	|	РегистрСведений.РезультатыПроверкиМЧДОператором КАК РезультатыПроверкиМЧД
	|ГДЕ
	|	РезультатыПроверкиМЧД.ПодписанныйОбъект В (&ПодписанныеОбъекты)";
	
	Запрос.УстановитьПараметр("ПодписанныеОбъекты", ПодписанныеОбъекты);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить(); 
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Описывает пустую структуру сведений МЧД
// 
// Возвращаемое значение:
//  Структура - результат получения данных:
//  * Ссылка - ОпределяемыйТип.МашиночитаемаяДоверенность
//  * НомерДоверенности - Строка
//  * НомерРодительскойДоверенности - Строка
//  * ИННДоверителя - строка
//  * ИННДоверителяРодительскойДоверенности - Строка
//  * ИННПредставителей - Массив из Строка
//  * СтатусВРеестреФНС - ПеречислениеСсылка.СтатусыМашиночитаемойДоверенностиВРеестреФНС
//  * ДатаВыдачи - Дата
//  * ДатаОкончания - Дата
//  * ДатаПолученияСведений - Дата
//  * Подписана - Булево
//  * Верна - Булево
//  * Отозвана - Булево
//  * ДатаОтзыва - Дата
//  * ПолномочияОграничены - Булево
//  * ПолномочияУказаныИзКлассификатора - Булево
//  * Полномочия - Массив из См.НовыеПолномочияПредставителя
//  * ТипПередоверия - Строка
//  * ПравилоПроверки - СправочникСсылка.ПравилаПроверкиПолномочийМЧД
//  * СовместныеПолномочия - Булево
//  * НесколькоПредставителей - Булево
//  * ДатаЗагрузкиИзРеестраРодительскихДанных - Дата
//  * РодительскиеДанныеМЧД - Неопределено,
//  							См. НовыеСведенияМЧД
//  * ВариантЗаполненияПолномочий - ПеречислениеСсылка.ВариантыЗаполненияПолномочийМЧД
//  
Функция НовыеСведенияМЧД() Экспорт
	
	Сведения = Новый Структура;
	Сведения.Вставить("Ссылка", Неопределено);
	Сведения.Вставить("НомерДоверенности", "");
	Сведения.Вставить("НомерРодительскойДоверенности", "");
	Сведения.Вставить("ИННДоверителя", "");
	Сведения.Вставить("ИННДоверителяРодительскойДоверенности", "");
	Сведения.Вставить("ИННПредставителей", Новый Массив());
	Сведения.Вставить("СтатусВРеестреФНС", Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка());
	Сведения.Вставить("ДатаВыдачи", Дата(1, 1, 1));
	Сведения.Вставить("ДатаОкончания", Дата(1, 1, 1));
	Сведения.Вставить("Подписана", Ложь);
	Сведения.Вставить("Верна", Ложь);
	Сведения.Вставить("Отозвана", Ложь);
	Сведения.Вставить("ДатаОтзыва", Дата(1, 1, 1));
	Сведения.Вставить("ДатаПолученияСведений", Дата(1, 1, 1));
	Сведения.Вставить("ПолномочияОграничены", Истина);
	Сведения.Вставить("ПолномочияУказаныИзКлассификатора", Ложь);
	Сведения.Вставить("Полномочия", Новый Массив());
	Сведения.Вставить("ТипПередоверия", "");
	Сведения.Вставить("ПравилоПроверки", Справочники.ПравилаПроверкиПолномочийМЧД.ПустаяСсылка());
	Сведения.Вставить("СовместныеПолномочия", Ложь);
	Сведения.Вставить("НесколькоПредставителей", Ложь);
	Сведения.Вставить("ДатаЗагрузкиИзРеестраРодительскихДанных", Дата(1, 1, 1));
	Сведения.Вставить("РодительскиеДанныеМЧД", Неопределено);
	Сведения.Вставить("ВариантЗаполненияПолномочий", Перечисления.ВариантыЗаполненияПолномочийМЧД.ПустаяСсылка());
	
	Возврат Сведения;
	
КонецФункции

// Описывает пустую структуру статуса МЧД
// 
// Возвращаемое значение:
//  Структура - результат получения данных:
//  * Ошибка - Булево
//  * ОписаниеОшибки - Строка - причина по которой не удалось получить данные доверенности, заполняется при Ошибка = Истина
//  * Сведения - Неопределено, см. НовыеСведенияМЧД
//  * ТребуетсяПроверкаМЧДНаКлиенте - Булево - Флаг устанавливается в Истина, 
//                                             если отсутствует возможность проверить подпись МЧД на сервере 
//                                             (в настройках установлена проверка подписи на клиенте) 
//                                             и необходимо выполнить проверку на клиенте.
//
Функция НовыеДанныеСтатусаМЧД() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ОписаниеОшибки", "");
	Результат.Вставить("Сведения", Неопределено); 
	Результат.Вставить("ТребуетсяПроверкаМЧДНаКлиенте", Ложь);
	Возврат Результат;
	
КонецФункции

// Возвращает сведения о статусах доверенностей контрагентов.
// 
// Параметры:
//  ДанныеМЧД - Массив из Структура см. НовыеДанныеДоверенности
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - Номер доверенности
//  * Значение - Структура см. НовыеДанныеСтатусаМЧД
//  
Функция СведенияОСтатусахДоверенностейКонтрагентов(ДанныеМЧД) Экспорт
	
	СправочникМЧД = Справочники.МашиночитаемыеДоверенностиКонтрагентов;
	Возврат СведенияОСтатусахДоверенностей(СправочникМЧД, ДанныеМЧД);
	
КонецФункции

// Возвращает сведения о статусах доверенностей организаций.
// 
// Параметры:
//  ДанныеМЧД - Массив из Структура См. НовыеДанныеДоверенности
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - Номер доверенности
//  * Значение - Структура см. НовыеДанныеСтатусаМЧД
//  
Функция СведенияОСтатусахДоверенностейОрганизаций(ДанныеМЧД) Экспорт
	
	СправочникМЧД = Справочники.МашиночитаемыеДоверенностиОрганизаций;
	Возврат СведенияОСтатусахДоверенностей(СправочникМЧД, ДанныеМЧД);
	
КонецФункции

// Возвращает общие свойства доверенностей.
// 
// Параметры:
//  Доверенности - Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций,
//  						 СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов, СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//         - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//         - СправочникСсылка.МЧД003
//  * Значение - См. НовыеОбщиеСвойстваДоверенности
Функция ОбщиеСвойстваДоверенностей(Доверенности) Экспорт
	
	СвойстваДоверенностей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиОрганизаций.Ссылка КАК Ссылка,
		|	МашиночитаемыеДоверенностиОрганизаций.НомерРодительскойДоверенности КАК НомерРодительскойДоверенности,
		|	МашиночитаемыеДоверенностиОрганизаций.НомерДоверенности КАК НомерДоверенности,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаВыдачи КАК ДатаВыдачи,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаОкончания КАК ДатаОкончания,
		|	МашиночитаемыеДоверенностиОрганизаций.ДоверительЮЛ_НаимОрг КАК Доверитель,
		|	МашиночитаемыеДоверенностиОрганизаций.ДоверительЮЛ_ИНН КАК ДоверительИНН,
		|	МашиночитаемыеДоверенностиОрганизаций.Верна КАК Верна,
		|	МашиночитаемыеДоверенностиОрганизаций.Отозвана КАК Отозвана,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаОтзыва КАК ДатаОтзыва,
		|	МашиночитаемыеДоверенностиОрганизаций.СтатусВРеестреФНС КАК СтатусВРеестреФНС,
		|	МашиночитаемыеДоверенностиОрганизаций.ПолномочияОграничены КАК ПолномочияОграничены,
		|	МашиночитаемыеДоверенностиОрганизаций.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС) КАК ПолномочияУказаныИзКлассификатора
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
		|ГДЕ
		|	МашиночитаемыеДоверенностиОрганизаций.Ссылка В(&Доверенности)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка,
		|	МашиночитаемыеДоверенностиКонтрагентов.НомерРодительскойДоверенности,
		|	МашиночитаемыеДоверенностиКонтрагентов.НомерДоверенности,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаВыдачи,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаОкончания,
		|	МашиночитаемыеДоверенностиКонтрагентов.Доверитель,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДоверительИНН,
		|	МашиночитаемыеДоверенностиКонтрагентов.Верна,
		|	МашиночитаемыеДоверенностиКонтрагентов.Отозвана,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаОтзыва,
		|	МашиночитаемыеДоверенностиКонтрагентов.СтатусВРеестреФНС,
		|	МашиночитаемыеДоверенностиКонтрагентов.ПолномочияОграничены,
		|	МашиночитаемыеДоверенностиКонтрагентов.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС)
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК МашиночитаемыеДоверенностиКонтрагентов
		|ГДЕ
		|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка В(&Доверенности)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МЧД003.Ссылка,
		|	МЧД003.НомерРодительскойДоверенности,
		|	МЧД003.НомерДоверенности,
		|	МЧД003.ДатаВыдачи,
		|	МЧД003.СрокДействия,
		|	ЖурналМашиночитаемыхДоверенностей.ВсеДоверители,
		|	"""",
		|	МЧД003.Верна,
		|	МЧД003.ДатаПрекращения > ДАТАВРЕМЯ(1, 1, 1),
		|	МЧД003.ДатаПрекращения,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка),
		|	МЧД003.ПолномочияОграничены,
		|	МЧД003.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС)
		|ИЗ
		|	Справочник.МЧД003 КАК МЧД003
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК ЖурналМашиночитаемыхДоверенностей
		|		ПО МЧД003.ХешФайла = ЖурналМашиночитаемыхДоверенностей.Хеш
		|ГДЕ
		|	МЧД003.Ссылка В(&Доверенности)";
	Запрос.УстановитьПараметр("Доверенности", Доверенности);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Свойства = НовыеОбщиеСвойстваДоверенности();
		ЗаполнитьЗначенияСвойств(Свойства, Выборка);
		
		Если ЭтоМЧД003(Выборка.Ссылка)
			И ЗначениеЗаполнено(Выборка.Доверитель) Тогда
			
			СведенияОДоверителе = 
				РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.СведенияОДоверителях(Выборка.Доверитель)[0];
			
			ТипыДоверителей = РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.ТипыДоверителей();
			Если СведенияОДоверителе.Тип = ТипыДоверителей.ЮридическоеЛицо Тогда
				Свойства.Доверитель = СведенияОДоверителе.ДанныеЮридическогоЛица.Наименование;
				Свойства.ДоверительИНН = СведенияОДоверителе.ДанныеЮридическогоЛица.ИНН;
			ИначеЕсли СведенияОДоверителе.Тип = ТипыДоверителей.ИностраннаяОрганизация Тогда
				Свойства.Доверитель = СведенияОДоверителе.ДанныеИностраннойОрганизации.Наименование;
				Свойства.ДоверительИНН = СведенияОДоверителе.ДанныеИностраннойОрганизации.ИНН;
			ИначеЕсли СведенияОДоверителе.Тип = ТипыДоверителей.ИндивидуальныйПредприниматель Тогда
				Свойства.Доверитель = СведенияОДоверителе.ДанныеИндивидуальногоПредпринимателя.Наименование;
				Свойства.ДоверительИНН = СведенияОДоверителе.ДанныеИндивидуальногоПредпринимателя.ИНН;
			ИначеЕсли СведенияОДоверителе.Тип = ТипыДоверителей.ФизическоеЛицо Тогда
				Свойства.Доверитель = СведенияОДоверителе.ДанныеФизическогоЛица.ФИО;
				Свойства.ДоверительИНН = СведенияОДоверителе.ДанныеФизическогоЛица.ИНН;
			КонецЕсли;
		КонецЕсли;
		
		СвойстваДоверенностей.Вставить(Выборка.Ссылка, Свойства);
	КонецЦикла;
	
	Возврат СвойстваДоверенностей;
	
КонецФункции

// Возвращает общие свойства доверенности.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
// 
// Возвращаемое значение:
//  - Неопределено
//  - см. НовыеОбщиеСвойстваДоверенности
Функция ОбщиеСвойстваДоверенности(Доверенность) Экспорт
	Доверенности = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(Доверенность);
	ОбщиеСвойстваДоверенностей = ОбщиеСвойстваДоверенностей(Доверенности);
	Возврат ОбщиеСвойстваДоверенностей[Доверенность];
КонецФункции

// Возвращает номера актуальных доверенностей по данным доверителя и представителя с ИНН доверителей.
// 
// Параметры:
//  ДоверительИНН - Строка
//  ПредставительИНН - Строка
//  ДействительныеНаДату - Дата
//  ЭлектронныйДокумент - Неопределено
//  					- ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  ПодобратьМЧДКонтрагента - Булево
// 
// Возвращаемое значение:
//  Структура:
//  * НомераМЧДСИННДоверителей - Соответствие Из КлючИЗначение:
//	 ** Ключ - Строка - номер МЧД
//	 ** Значение - Структура:
//	  *** ИННДоверителя - Строка
//	  *** ИННДоверителяРодительскойДоверенности - Строка
//  * ОшибкиПроверкиПолномочий - Массив из см. НоваяОшибкаПроверкиПолномочий
Функция НомераДоверенностейСИННДоверителейПоУчастникам(ДоверительИНН, ПредставительИНН, ДействительныеНаДату,
	ЭлектронныйДокумент = Неопределено, ПодобратьМЧДКонтрагента = Истина) Экспорт
	
	Результат = НомераДоверенностейСИННДоверителейПоУчастникамB2B(
		ДоверительИНН, ПредставительИНН, ДействительныеНаДату, ЭлектронныйДокумент, ПодобратьМЧДКонтрагента);
		
	Справочники.МЧД003.ДополнитьНомерамиДоверенностейСИННДоверителейПоУчастникам(
		Результат, ДоверительИНН, ПредставительИНН, ДействительныеНаДату, ЭлектронныйДокумент);
		
	Возврат Результат;
	
КонецФункции

// Записывает результат проверки в элемент справочника машиночитаемой доверенности.
//
// Параметры:
//  МЧД - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  	- СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  Результат - Булево
//  ТекстОшибки - Строка
//
Процедура ОтразитьРезультатПроверкиМЧД(МЧД, Результат, ТекстОшибки) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		МЧДОбъект = МЧД.ПолучитьОбъект();
		МЧДОбъект.Верна = Результат;
		МЧДОбъект.ТекстОшибкиПроверкиМЧД = ТекстОшибки;
		УстановитьПривилегированныйРежим(Истина);
		МЧДОбъект.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		ЗафиксироватьТранзакцию();
		МЧДОбъект.Разблокировать();
		
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru = 'Запись результата проверки доверенности'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Заполняет реквизиты подписи в объекте справочника машиночитаемые доверенности.
//
// Параметры:
//  ОбъектМЧД - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//			  - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//			  - СправочникОбъект.МЧД003
//  ДанныеДляПроверки - См. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД
//  ТребуетсяПроверкаМЧДНаКлиенте - Булево - Флаг устанавливается в Истина, 
//                                             если отсутствует возможность проверить подпись МЧД на сервере 
//                                             (в настройках установлена проверка подписи на клиенте) 
//                                             и необходимо выполнить проверку на клиенте.
//  ФорматДоверенности - Строка
//
Процедура ЗаполнитьПодписанаВерна(ОбъектМЧД, ДанныеДляПроверки, ТребуетсяПроверкаМЧДНаКлиенте = Ложь,
	ФорматДоверенности = "") Экспорт

	Если ЗначениеЗаполнено(ДанныеДляПроверки.ДанныеПодписи) И ЭлектронныеДокументыСлужебныйВызовСервера.ВыполнятьКриптооперацииНаСервере() Тогда
		РезультатПроверкиДоверенности = ПроверитьДоверенность(ДанныеДляПроверки);
		РезультатВерна = РезультатПроверкиДоверенности.Результат;
		РезультатТекстОшибки = РезультатПроверкиДоверенности.ТекстОшибки;
	Иначе
		ТребуетсяПроверкаМЧДНаКлиенте = Истина;
		РезультатВерна = Ложь;
		РезультатТекстОшибки = "";
	КонецЕсли;

	ДоверенностьПодписана = ЗначениеЗаполнено(ДанныеДляПроверки.ДанныеПодписи) И ЗначениеЗаполнено(
		ДанныеДляПроверки.ДанныеДоверенности);

	Если ДоверенностьПодписана Тогда
		Подпись = Новый ХранилищеЗначения(ДанныеДляПроверки.ДанныеПодписи, Новый СжатиеДанных(9));
		Если ТипЗнч(ОбъектМЧД) = Тип("СправочникОбъект.МЧД003") Тогда
			ПодписьУжеДобавлена = Ложь;
			Для Каждого Строка Из ОбъектМЧД.Подписи Цикл
				Если Строка.Подпись.Получить() = ДанныеДляПроверки.ДанныеПодписи Тогда
					ПодписьУжеДобавлена = Истина;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ПодписьУжеДобавлена Тогда
				НоваяСтрока = ОбъектМЧД.Подписи.Добавить();
				НоваяСтрока.Подпись = Подпись;
			КонецЕсли;
		Иначе
			ОбъектМЧД.ЭлектроннаяПодпись = Подпись;
		КонецЕсли;
	КонецЕсли;

	ОбъектМЧД.Подписана = ДоверенностьПодписана;
	ОбъектМЧД.Верна = РезультатВерна;
	ОбъектМЧД.ТекстОшибкиПроверкиМЧД = РезультатТекстОшибки;

КонецПроцедуры

// Формирует данные доверенности для транспортного контейнера.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//               - СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  См. ТранспортныеКонтейнерыЭДО.НовоеОписаниеДанныхДоверенности
Функция ДанныеДоверенностиДляКонтейнера(Доверенность) Экспорт
	ДанныеДоверенностиДляКонтейнера = СправочникМЧД(Доверенность).ДанныеДоверенностиДляКонтейнера(Доверенность);
	СсылкаНаРеестр = ДанныеДоверенностиДляКонтейнера.СсылкаНаРеестр;
	ДанныеДоверенностиДляКонтейнера.СсылкаНаРеестр = ?(ПустаяСтрока(СсылкаНаРеестр), МашиночитаемыеДоверенности.СведенияОбИнформационнойСистеме(), СсылкаНаРеестр);
	Возврат ДанныеДоверенностиДляКонтейнера;
КонецФункции

// Получает данные МЧД.
// 
// Параметры:
//  МЧД - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//      - СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенности.НовыеДанныеДоверенности
//
Функция ПолучитьДанныеМЧД(МЧД) Экспорт
	Возврат СправочникМЧД(МЧД).ПолучитьДанныеМЧД(МЧД);
КонецФункции

// Возвращает идентификатор машиночитаемой доверенности.
// 
// Параметры:
//  Ссылка - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//         - СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  Строка - Идентификатор машиночитаемой доверенности.
//
Функция ПолучитьИдентификаторМЧД(Ссылка) Экспорт
	Возврат СправочникМЧД(Ссылка).ПолучитьИдентификаторМЧД(Ссылка);
КонецФункции

// Возвращает сохраненные данные файла доверенности и электронную подпись, которой подписана доверенность.
//
// Параметры:
//  МЧД - ОпределяемыйТип.МашиночитаемаяДоверенность
//
// Возвращаемое значение:
//  Структура - Данные файла доверенности и подписи:
//   * ДанныеФайла - ДвоичныеДанные
//   * ДанныеПодписи - ДвоичныеДанные,Неопределено
Функция ДанныеФайлаДоверенностиИПодписи(МЧД) Экспорт
	
	РеквизитыМЧД = РеквизитыДляВыгрузкиДанныхДоверенности(МЧД);
	ДанныеФайла = РеквизитыМЧД.XMLфайлМЧД.Получить();
	Если ТипЗнч(РеквизитыМЧД.ЭлектроннаяПодпись) = Тип("ХранилищеЗначения") Тогда
		ДанныеПодписи = РеквизитыМЧД.ЭлектроннаяПодпись.Получить();
	ИначеЕсли ТипЗнч(РеквизитыМЧД.ЭлектроннаяПодпись) = Тип("ДвоичныеДанные") Тогда
		ДанныеПодписи = РеквизитыМЧД.ЭлектроннаяПодпись;
	Иначе
		ДанныеПодписи = Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеФайла", ДанныеФайла);
	Результат.Вставить("ДанныеПодписи", ДанныеПодписи);

	Возврат Результат;
	
КонецФункции

// Возвращает данные доверенности из файла обмена.
// 
// Параметры:
//  ОписаниеФайлаОбмена - См. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
// 
// Возвращаемое значение:
//  См. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
Функция ДанныеДоверенностиИзФайлаОбмена(ОписаниеФайлаОбмена) Экспорт
	
	ОписаниеФайла = НовоеОписаниеФайла();
	
	ЭлементZipФайлаДанныхДоверенности = Неопределено;
	Поток = ОписаниеФайлаОбмена.ДвоичныеДанные.ОткрытьПотокДляЧтения();
	ЧтениеZip = Новый ЧтениеZipФайла(Поток);
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
		Если НРег(Элемент.Расширение) = "xml"
			И ЭтоПространствоИменМЧД(Элемент.Имя) Тогда
			ЭлементZipФайлаДанныхДоверенности = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементZipФайлаДанныхДоверенности = Неопределено Тогда
		ЧтениеZip.Закрыть();
		Поток.Закрыть();
		Возврат ОписаниеФайла;
	КонецЕсли;
	
	ВременныйКаталог = "";
	
	Попытка
		ВременныйКаталог = ЭлектронныеДокументыСлужебный.РабочийКаталог();
		ЧтениеZip.Извлечь(ЭлементZipФайлаДанныхДоверенности, ВременныйКаталог);
		ОписаниеФайла.ИмяФайла = ЭлементZipФайлаДанныхДоверенности.Имя;
		ОписаниеФайла.ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйКаталог + ЭлементZipФайлаДанныхДоверенности.Имя);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось извлечь файл %1 из архива %2 по причине:'"),
			ЭлементZipФайлаДанныхДоверенности.Имя, ОписаниеФайлаОбмена.ИмяФайла);
		ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронныеДокументыСлужебныйВызовСервера.ЗаписатьВЖурналРегистрации(ТекстОшибки, 2, "Ошибка");
	КонецПопытки;
	
	ЧтениеZip.Закрыть();
	Поток.Закрыть();
	
	Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
		УдалитьФайлы(ВременныйКаталог);
	КонецЕсли;
	
	Возврат ОписаниеФайла;
	
КонецФункции

// Возвращает признак использования распределенного реестра доверенностей ФНС.
// 
// Возвращаемое значение:
//  Булево
Функция ИспользоватьРеестрДоверенностейФНС() Экспорт
	
	Возврат Константы.ИспользоватьРеестрДоверенностейФНСЭДО.Получить();
	
КонецФункции

#Область ПроверкаПодписи

// Записывает результат ручной проверки подписи по доверенности.
// 
// Параметры:
//  ДанныеПодписи - см. ЭлектронныеДокументыЭДОКлиентСервер.НовыеДанныеПодписиСУчетомДоверенности
//
Процедура ЗаписатьРезультатРучнойПроверкиПодписи(ДанныеПодписи) Экспорт
	
	СвойстваПодписи = ДанныеПодписи.СвойстваПодписи;
	ПодписанныйОбъект = ДанныеПодписи.ПодписанныйОбъект;
	
	РезультатПроверкиПоМЧД = ДанныеПодписи.РезультатПроверкиПоМЧД;
		
	РезультатПроверкиПоМЧД.ПроверкаВыполнена = Истина;
	РезультатПроверкиПоМЧД.ДатаПроверки = ТекущаяДатаСеанса();
	РезультатПроверкиПоМЧД.ПодписьВерна = Истина;
	
	Если Не ЗначениеЗаполнено(РезультатПроверкиПоМЧД.ПротоколПроверки) Тогда
		РезультатПроверкиПоМЧД.ПротоколПроверки = НовыйПротоколПроверкиПодписи();
	КонецЕсли;
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПредставлениеПользователя = ТекущийПользователь.ПолноеИмя;
	ИдентификаторПользователя = Строка(ТекущийПользователь.УникальныйИдентификатор);
	
	ПроверкаПодписиДокумента = МашиночитаемыеДоверенностиКлиентСервер.НовыйРезультатПроверки();
	ПроверкаПодписиДокумента.Выполнено = Истина;
	ПроверкаПодписиДокумента.ДатаПроверки = РезультатПроверкиПоМЧД.ДатаПроверки;
	ПроверкаПодписиДокумента.Успех = Истина;
	ПроверкаПодписиДокумента.РучнаяПроверка = Истина;
	ПроверкаПодписиДокумента.ПредставлениеПользователя = ПредставлениеПользователя;
	ПроверкаПодписиДокумента.ИдентификаторПользователя = ИдентификаторПользователя;
	
	РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаПодписиДокумента = ПроверкаПодписиДокумента;
	
	ПроверкаПолномочий = МашиночитаемыеДоверенностиКлиентСервер.НовыйРезультатПроверки();
	ЗаполнитьЗначенияСвойств(ПроверкаПолномочий, ПроверкаПодписиДокумента);
	
	РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий = ПроверкаПолномочий;

	ЗаписатьРезультатПроверкиПодписи(ПодписанныйОбъект, СвойстваПодписи.ХешПодписи, РезультатПроверкиПоМЧД);
	
КонецПроцедуры

// Записывает результат проверки полномочий доверенности.
// 
// Параметры:
//  ДанныеПроверки - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеПроверкиПолномочий
//  
//  Возвращаемое значение:
//    Структура:
//      * Успех - Булево
//      * ТекстОшибки - Строка
//      * РезультатыПроверкиПодписи - Массив из Структура:
//  	  ** ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  	  ** ХешПодписи - Строка
//  	  ** ПроверкаПодписи - см. НовыйРезультатПроверкиПодписи
//      
Функция ЗаписатьРезультатПроверкиПолномочий(Знач ДанныеПроверки) Экспорт
	
	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");
	Результат.Вставить("РезультатыПроверкиПодписи", Новый Массив);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого Данные Из ДанныеПроверки Цикл
		
			НаборЗаписей = РегистрыСведений.ЭлектронныеПодписиПоМЧД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(Данные.ПодписанныйОбъект);
			НаборЗаписей.Отбор.ХешПодписи.Установить(Данные.ХешПодписи);
			
			НаборЗаписей.Прочитать();
			ТребуетсяЗапись = Ложь;
			
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				
				ПротоколПроверкиJSON = ЗаписьНабора.ПротоколПроверки.Получить();
				
				Если ПротоколПроверкиJSON <> Неопределено Тогда
					
					ПротоколПроверки = ПрочитатьПротоколПроверкиJSON(ПротоколПроверкиJSON);
					
					ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий = Данные.РезультатПроверки;
					ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий.ДатаПроверки = ТекущаяДатаСеанса();
					ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий.РучнаяПроверка = Данные.РучнаяПроверка;
					
					Если ЗначениеЗаполнено(Данные.НомерРодительскойДоверенности) Тогда
					
						ПротоколПроверки.ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия
							= ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(Данные.РезультатПроверки);
						ПротоколПроверки.ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия.ДатаПроверки
							= ТекущаяДатаСеанса();
						ПротоколПроверки.ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия.РучнаяПроверка
							= Данные.РучнаяПроверка;
						ПротоколПроверки.ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия.НомерДоверенности
							= Данные.НомерРодительскойДоверенности;
						
					Иначе
						ПротоколПроверки.ПроверкаМЧД.РодительскиеПолномочияСоответствуютПолномочиямПередоверия = Неопределено;
					КонецЕсли;
					
					ПротоколJSON = JSONСтрока(ПротоколПроверки);
					ЗаписьНабора.ПротоколПроверки = Новый ХранилищеЗначения(ПротоколJSON, Новый СжатиеДанных(9));
					
					ТребуетсяЗапись = Истина;
					
					ЗаписьНабора.ПодписьВерна = ПротоколПроверки.ПроверкаПодписиДокумента.Успех
						И (МашиночитаемыеДоверенностиКлиентСервер.ДоверенностьПроверенаУспешно(
							ПротоколПроверки.ПроверкаМЧД) Или Данные.РучнаяПроверка);
					ПроверкаПодписи = НовыйРезультатПроверкиПодписи();
					ПроверкаПодписи.ПроверкаВыполнена = ЗаписьНабора.ПроверкаВыполнена;
					ПроверкаПодписи.ПодписьВерна = ЗаписьНабора.ПодписьВерна;
					ПроверкаПодписи.ТребуетсяДоверенность = Истина;
					ПроверкаПодписи.ПротоколПроверки = ПротоколПроверки;
					ПроверкаПодписи.Доверенность = ЗаписьНабора.Доверенность;
					
					СтруктураРезультата = Новый Структура();
					СтруктураРезультата.Вставить("ПодписанныйОбъект", Данные.ПодписанныйОбъект);
					СтруктураРезультата.Вставить("ХешПодписи", Данные.ХешПодписи);
					СтруктураРезультата.Вставить("ПроверкаПодписи", ПроверкаПодписи);
					Результат.РезультатыПроверкиПодписи.Добавить(ПроверкаПодписи);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТребуетсяЗапись Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				НаборЗаписей.Записать();
				УстановитьПривилегированныйРежим(Ложь);

			КонецЕсли;
	
		КонецЦикла;
		
		Результат.Успех = Истина;
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронныеДокументыСлужебныйВызовСервера.ЗаписатьВЖурналРегистрации(Результат.ТекстОшибки, 2, "Ошибка");
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Проверяет необходимость ручной проверки доверенности.
// 
// Параметры:
//  МЧД - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  	- СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  Булево
//  
Функция ДоступнаРучнаяПроверка(МЧД) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "ПолномочияОграничены");
КонецФункции

// Возвращает сведения для проверки подписей по МЧД.
// 
// Параметры:
//  ТекущийПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  РазмерПорции - Число
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ХешПодписи - См. КриптографияБЭД.ХешПодписи
Функция ПорцияСведенийОПодписяхДляПроверки(ТекущийПодписанныйОбъект, РазмерПорции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000 РАЗРЕШЕННЫЕ
		|	ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект КАК ПодписанныйОбъект,
		|	ЭлектронныеПодписиПоМЧД.ХешПодписи КАК ХешПодписи
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиПоМЧД КАК ЭлектронныеПодписиПоМЧД
		|ГДЕ
		|	НЕ ЭлектронныеПодписиПоМЧД.ПроверкаВыполнена
		|	И ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект > &ПодписанныйОбъект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодписанныйОбъект";
	Если РазмерПорции <> 1000 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", СтрШаблон("ПЕРВЫЕ %1", РазмерПорции));
	КонецЕсли;
	Запрос.УстановитьПараметр("ПодписанныйОбъект", ТекущийПодписанныйОбъект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает новые параметры проверки подписи по МЧД.
// 
// Возвращаемое значение:
//  Структура:
//  * ИННДоверителя - Строка - ИНН доверителя по данным файла электронного документа.
//  * СвойстваПодписи - См. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
//  * СведенияМЧД - см. МашиночитаемыеДоверенности.НовыеСведенияМЧД
//  * ПроверкаОператором - См. НовыйПротоколПроверкиОператором
//  * ТекстОшибки - Строка 
//  * ТребуетсяПроверкаМЧДНаКлиенте - Булево - Флаг устанавливается в Истина, 
//                                             если отсутствует возможность проверить подпись МЧД на сервере 
//                                             (в настройках установлена проверка подписи на клиенте) 
//                                             и необходимо выполнить проверку на клиенте.
//  * ДанныеДляПроверки - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД
//  * ПроверятьПолномочияВручную - Булево - Признак обязательности интерактивной проверки.
//  * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  					- ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//
Функция НовыеПараметрыПроверкиПодписи() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИННДоверителя", "");
	Параметры.Вставить("СвойстваПодписи", МашиночитаемыеДоверенностиКлиентСервер.НовыеСвойстваПодписи());
	Параметры.Вставить("СведенияМЧД", НовыеСведенияМЧД());
	Параметры.Вставить("ПроверкаОператором", НовыйПротоколПроверкиОператором());
	Параметры.Вставить("ТекстОшибки", "");
	Параметры.Вставить("ТребуетсяПроверкаМЧДНаКлиенте", Ложь); 
	Параметры.Вставить("ДанныеДляПроверки", Неопределено);
	Параметры.Вставить("ЭлектронныйДокумент", Неопределено);
	
	Возврат Параметры;
	
КонецФункции

// Возвращает новый результат проверки подписи по МЧД.
// 
// Возвращаемое значение:
//  Структура:
//  * ПроверкаВыполнена - Булево
//  * ТребуетсяДоверенность - Булево
//  * Доверенность - Неопределено,
//  			   - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций,
//  			   - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  			   - СправочникСсылка.МЧД003
//  * ДатаПроверки - Дата
//  * ПодписьВерна - Булево
//  * ПротоколПроверки - Неопределено
//					   - См. НовыйПротоколПроверкиПодписи
//	* ТребуетсяПроверкаМЧДНаКлиенте - Булево - Флаг устанавливается в Истина, 
//                                             если отсутствует возможность проверить подпись МЧД на сервере 
//                                             (в настройках установлена проверка подписи на клиенте) 
//                                             и необходимо выполнить проверку на клиенте.
//
Функция НовыйРезультатПроверкиПодписи() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверкаВыполнена", Ложь);
	Результат.Вставить("ТребуетсяДоверенность", Ложь);
	Результат.Вставить("Доверенность", Неопределено);
	Результат.Вставить("ДатаПроверки", '00010101');
	Результат.Вставить("ПодписьВерна", Ложь);
	Результат.Вставить("ПротоколПроверки", Неопределено);
	Результат.Вставить("ТребуетсяПроверкаМЧДНаКлиенте", Ложь);
	Возврат Результат;
	
КонецФункции

// Возвращает новый протокол проверки МЧД оператором.
// 
// Возвращаемое значение:
//  Структура:
// * ДоверенностьДействительна - Булево
// * ДоверенностьДействительнаОшибка - Строка
Функция НовыйПротоколПроверкиОператором() Экспорт
	Протокол = Новый Структура;
	Протокол.Вставить("ДоверенностьДействительна", Ложь);
	Протокол.Вставить("ДоверенностьДействительнаОшибка", "");
	Возврат Протокол;
КонецФункции

// Возвращает результат проверки подписей файла сообщения электронного документа по МЧД.
// 
// Параметры:
//  ПараметрыПроверки - См. НовыеПараметрыПроверкиПодписи
// 
// Возвращаемое значение:
//  См. НовыйРезультатПроверкиПодписи
Функция ПроверитьПодпись(ПараметрыПроверки) Экспорт
	
	Результат = НовыйРезультатПроверкиПодписи();
	Результат.ПроверкаВыполнена = Истина;
	Результат.ТребуетсяПроверкаМЧДНаКлиенте = ПараметрыПроверки.ТребуетсяПроверкаМЧДНаКлиенте;
	
	СвойстваПодписи = ПараметрыПроверки.СвойстваПодписи;
	ПротоколПроверки = НовыйПротоколПроверкиПодписи();
	
	ПроверкаПодписи = ПротоколПроверки.ПроверкаПодписиДокумента;
	ПроверкаПодписи.Выполнено = Истина;
	ПроверкаПодписи.ДатаПроверки = СвойстваПодписи.ДатаПроверкиПодписи;
	ПроверкаПодписи.Успех = СвойстваПодписи.ПодписьВерна;
	Если Не СвойстваПодписи.ПодписьВерна Тогда
		ПроверкаПодписи.Ошибка = СвойстваПодписи.Комментарий;
	КонецЕсли;
	
	ПроверкаДоверенности = ПротоколПроверки.ПроверкаМЧД;
	
	ИННПредставителя = "";
	Если ЗначениеЗаполнено(СвойстваПодписи.Сертификат) Тогда
		СертификатКриптографии = Новый СертификатКриптографии(СвойстваПодписи.Сертификат);

		СвойстваСубъектаСертификата = СвойстваСубъектаСертификата(СертификатКриптографии);
		СвойстваИздателяСертификата = СвойстваИздателяСертификата(СертификатКриптографии);
		
		ИННПредставителя = СвойстваСубъектаСертификата.ИНН;
		Результат.ТребуетсяДоверенность = ТребуетсяМашиночитаемаяДоверенность(
			ПараметрыПроверки.ИННДоверителя, СвойстваСубъектаСертификата, СвойстваИздателяСертификата);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПараметрыПроверки.ТекстОшибки) Тогда
		Результат.ПроверкаВыполнена = Ложь;
		Результат.Доверенность = ПараметрыПроверки.СведенияМЧД.Ссылка;
		
		ЗаполнитьПротоколПроверкиДоверенности(ПроверкаДоверенности, ПараметрыПроверки, ИННПредставителя,
			СвойстваПодписи.ДатаПодписи);
		
		ПроверкаДоверенности.Выполнена = Истина;
		ПроверкаДоверенности.ОшибкаВыполнения = ПараметрыПроверки.ТекстОшибки;
	Иначе
		Результат.Доверенность = ПараметрыПроверки.СведенияМЧД.Ссылка;
		ЗаполнитьПротоколПроверкиДоверенности(ПроверкаДоверенности, ПараметрыПроверки, ИННПредставителя,
			СвойстваПодписи.ДатаПодписи);
	КонецЕсли;
	
	Результат.ПодписьВерна = ПроверкаПодписи.Успех 
		И МашиночитаемыеДоверенностиКлиентСервер.ДоверенностьПроверенаУспешно(ПротоколПроверки.ПроверкаМЧД);
	
	Результат.ПротоколПроверки = ПротоколПроверки;
	Результат.ДатаПроверки = ТекущаяДатаСеанса();
	
	Возврат Результат;
	
КонецФункции

// Записать результат проверки подписи по МЧД.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешПодписи - См. КриптографияБЭД.ХешПодписи
//  РезультатПроверки - См. ПроверитьПодпись
Процедура ЗаписатьРезультатПроверкиПодписи(ПодписанныйОбъект, ХешПодписи, РезультатПроверки) Экспорт
	
	Если РезультатПроверки.ПроверкаВыполнена И Не РезультатПроверки.ТребуетсяДоверенность Тогда
		ОтключитьПроверкуПодписи(ПодписанныйОбъект, ХешПодписи);
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ЭлектронныеПодписиПоМЧД.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПодписанныйОбъект = ПодписанныйОбъект;
	МенеджерЗаписи.ХешПодписи = ХешПодписи;
	МенеджерЗаписи.Доверенность = РезультатПроверки.Доверенность;
	МенеджерЗаписи.ПроверкаВыполнена = РезультатПроверки.ПроверкаВыполнена;
	МенеджерЗаписи.ДатаПроверки = РезультатПроверки.ДатаПроверки;
	МенеджерЗаписи.ПодписьВерна = РезультатПроверки.ПодписьВерна;
	
	МенеджерЗаписи.ПроверкаВыполненаВРучную = 
		МашиночитаемыеДоверенностиКлиентСервер.ПроверкаДоверенностиВыполненаВручную(РезультатПроверки);
	
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ИдентификаторПользователя = 
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	
	СформированПротокол = ЗначениеЗаполнено(РезультатПроверки.ПротоколПроверки);
	
	Если СформированПротокол Тогда	
		ПротоколПроверкиJSON = JSONСтрока(РезультатПроверки.ПротоколПроверки);
		МенеджерЗаписи.ПротоколПроверки = Новый ХранилищеЗначения(ПротоколПроверкиJSON, Новый СжатиеДанных(9));
	Иначе
		МенеджерЗаписи.ПротоколПроверки = Неопределено;
	КонецЕсли;

	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Добавляет подпись в очередь на проверку по доверенности.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешПодписи - См. КриптографияБЭД.ХешПодписи
Процедура ВключитьПроверкуПодписи(ПодписанныйОбъект, ХешПодписи) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ЭлектронныеПодписиПоМЧД.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПодписанныйОбъект = ПодписанныйОбъект;
	МенеджерЗаписи.ХешПодписи = ХешПодписи;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращает результаты проверок подписей по МЧД.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешиПодписей - Массив из см. КриптографияБЭД.ХешПодписи
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - См. КриптографияБЭД.ХешПодписи
//  * Значение - См. НовыйРезультатПроверкиПодписи
Функция РезультатыПроверокПодписей(ПодписанныйОбъект, ХешиПодписей) Экспорт
	
	РезультатыПроверок = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронныеПодписиПоМЧД.ХешПодписи,
		|	ЭлектронныеПодписиПоМЧД.Доверенность,
		|	ЭлектронныеПодписиПоМЧД.ПроверкаВыполнена,
		|	ЭлектронныеПодписиПоМЧД.ДатаПроверки,
		|	ЭлектронныеПодписиПоМЧД.ПодписьВерна,
		|	ЭлектронныеПодписиПоМЧД.ПротоколПроверки
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиПоМЧД КАК ЭлектронныеПодписиПоМЧД
		|ГДЕ
		|	ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект = &ПодписанныйОбъект
		|	И ЭлектронныеПодписиПоМЧД.ХешПодписи В (&ХешиПодписей)";
	Запрос.УстановитьПараметр("ПодписанныйОбъект", ПодписанныйОбъект);
	Запрос.УстановитьПараметр("ХешиПодписей", ХешиПодписей);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатыПроверок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РезультатПроверки = НовыйРезультатПроверкиПодписи();
		РезультатПроверки.Доверенность = Выборка.Доверенность;
		РезультатПроверки.ДатаПроверки = Выборка.ДатаПроверки;
		РезультатПроверки.ПодписьВерна = Выборка.ПодписьВерна;
		РезультатПроверки.ПроверкаВыполнена = Выборка.ПроверкаВыполнена;
		
		ПротоколПроверкиJSON = Выборка.ПротоколПроверки.Получить();
		Если ПротоколПроверкиJSON <> Неопределено Тогда
			ПротоколПроверки = ПрочитатьПротоколПроверкиJSON(ПротоколПроверкиJSON);
			РезультатПроверки.ПротоколПроверки = ПротоколПроверки;
		КонецЕсли;
		
		РезультатыПроверок.Вставить(Выборка.ХешПодписи, РезультатПроверки);
		
	КонецЦикла;
	
	Возврат РезультатыПроверок;
	
КонецФункции

// Возвращает результат проверки подписи по МЧД.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешПодписи - см. КриптографияБЭД.ХешПодписи
// 
// Возвращаемое значение:
//  - Неопределено - если для подписи не требуется проверка по МЧД
//  - См. НовыйРезультатПроверкиПодписи
Функция РезультатПроверкиПодписи(ПодписанныйОбъект, ХешПодписи) Экспорт
	
	ХешиПодписей = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(ХешПодписи);
	РезультатыПроверок = РезультатыПроверокПодписей(ПодписанныйОбъект, ХешиПодписей);
	Возврат РезультатыПроверок[ХешПодписи];
	
КонецФункции

#КонецОбласти

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
КонецПроцедуры

// См. ОбменСКонтрагентамиИнтеграцияСобытия.ПриДобавленииПереименованийОбъектовМетаданных
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
		
КонецПроцедуры

// Выгружает данные доверенности в zip архив, в составе которого содержатся xml файл доверенности, подпись
// и файл визуализации.
// 
// Параметры:
//  Ссылка - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  Структура - Выгрузить данные доверенности:
// * ОписаниеФайла - см. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
// * Ошибка - Булево - Истина, если выгрузить данные не удалось.
// * ТекстОшибки - Строка - заполнено, если свойство Ошибка = Истина.
Функция ВыгрузитьДанныеДоверенности(Ссылка) Экспорт
	
	РезультатВыгрузки = Новый Структура;
	РезультатВыгрузки.Вставить("ОписаниеФайла", НовоеОписаниеФайла());
	РезультатВыгрузки.Вставить("Ошибка", Ложь);
	РезультатВыгрузки.Вставить("ТекстОшибки", "");
	
	Если Ссылка.Пустая() Тогда
		Возврат РезультатВыгрузкиНеподписаннойДоверенности(РезультатВыгрузки);
	КонецЕсли;
	
	ЗначенияРеквизитов = РеквизитыДляВыгрузкиДанныхДоверенности(Ссылка);
	
	Подпись = ЗначенияРеквизитов.ЭлектроннаяПодпись;
	Если ТипЗнч(Подпись) = Тип("ХранилищеЗначения") Тогда
		Подпись = ЗначенияРеквизитов.ЭлектроннаяПодпись.Получить();
	КонецЕсли;
	
	Если НЕ ЗначенияРеквизитов.Подписана Тогда
		Возврат РезультатВыгрузкиНеподписаннойДоверенности(РезультатВыгрузки);
	КонецЕсли;
	
	Если Подпись = Неопределено Тогда
		Возврат РезультатВыгрузкиНеподписаннойДоверенности(РезультатВыгрузки);
	КонецЕсли;
	
	ДвоичныеДанныеДоверенности = ЗначенияРеквизитов.XMLфайлМЧД.Получить();
	Если ДвоичныеДанныеДоверенности = Неопределено Тогда
		Возврат РезультатВыгрузкиНеподписаннойДоверенности(РезультатВыгрузки);
	КонецЕсли;
	
	Файлы = Новый Массив;
	
	ИмяВременногоКаталога = ЭлектронныеДокументыСлужебный.РабочийКаталог();
	ИмяФайлаДоверенностьБезРасширения = ПолучитьИмяФайлаМЧД(Ссылка);
	ИмяФайлаДоверенность = ИмяВременногоКаталога + ИмяФайлаДоверенностьБезРасширения + ".xml";
	ИмяФайлаПодпись = ИмяВременногоКаталога + ИмяФайлаДоверенностьБезРасширения + ".p7s";
	
	ДвоичныеДанныеДоверенности.Записать(ИмяФайлаДоверенность);
	Файлы.Добавить(ИмяФайлаДоверенность);
	
	Подпись.Записать(ИмяФайлаПодпись);
	Файлы.Добавить(ИмяФайлаПодпись);
		
	ИмяФайлаВизуализация = ИмяВременногоКаталога + ИмяФайлаДоверенностьБезРасширения + ".pdf";
	РезультатФормирования = ТабличныйДокументМЧД(ДвоичныеДанныеДоверенности);
	
	ТабличныйДокумент = РезультатФормирования.ПредставлениеДокумента;
	Если ТабличныйДокумент <> Неопределено Тогда
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			ТабличныйДокумент.Записать(ИмяФайлаВизуализация, ТипФайлаТабличногоДокумента.PDF);
			УстановитьПривилегированныйРежим(Ложь);
			
			Файлы.Добавить(ИмяФайлаВизуализация);
		Исключение
			ВидОперации = НСтр("ru = 'Выгрузка представления машиночитаемой доверенности из файла.'");
			ШаблонОшибки = НСтр("ru = 'Не удалось сформировать файл с представлением доверенности, по причине %1'");
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонОшибки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));			
			
			РезультатВыгрузки.ТекстОшибки = ТекстОшибки;
			ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, РезультатВыгрузки.ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
	РезультатВыгрузки.ОписаниеФайла.ИмяФайла = ИмяФайлаДоверенностьБезРасширения + ".zip";
	
	Архив = ЭлектронныеДокументыСлужебный.СформироватьЗипАрхивФайлов(ИмяВременногоКаталога + 
		РезультатВыгрузки.ОписаниеФайла.ИмяФайла, Файлы);
		
	Если Архив <> "" Тогда 
		Архив = Новый ДвоичныеДанные(Архив);
	Иначе
		РезультатВыгрузки.Ошибка = Истина;
		РезультатВыгрузки.ТекстОшибки = НСтр("ru = 'Не удалось сформировать архив с данными доверенности. Проверьте наличие доступа к каталогу временных файлов.'");
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременногоКаталога);
		
	РезультатВыгрузки.ОписаниеФайла.ДвоичныеДанные = Архив;
	
	Возврат РезультатВыгрузки;
	
КонецФункции

// Возвращает данные доверенности в виде строки XML.
// 
// Параметры:
//  Ссылка - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  	   - СправочникСсылка.МЧД003
// 
// Возвращаемое значение:
//  Строка - данные доверенности в виде строки XML.
Функция ВыгрузитьXML(Ссылка) Экспорт
	
	ИмяРеквизитаФайлаМЧД = ?(ТипЗнч(Ссылка) = Тип("СправочникСсылка.МЧД003"), "ФайлМЧД", "XMLфайлМЧД");
	ХранилищеДанныхДоверенности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизитаФайлаМЧД);
	ДвоичныеДанныеДоверенности = ХранилищеДанныхДоверенности.Получить();
	Если ДвоичныеДанныеДоверенности = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Поток = ДвоичныеДанныеДоверенности.ОткрытьПотокДляЧтения();
	ЧтениеТекста = Новый ЧтениеТекста(Поток);
	
	СтрокаXML = ЧтениеТекста.Прочитать();
	
	ЧтениеТекста.Закрыть();
	Поток.Закрыть();
	
	Если СтрокаXML = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрокаXML;
	
КонецФункции

// Параметры:
//  Ссылка - См. ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Представление МЧД или пустой табличный документ, если не удалось сформировать представление
//
Функция ТабличныйДокументМЧДПоСсылке(Ссылка) Экспорт
	
	ТабличныйДокумент = Неопределено;
	
	Если ЭтоЧерновикМЧД003(Ссылка) Тогда
		
		ДвоичныеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ФайлМЧД").Получить();
		ОбъектДоверенности = Справочники.МЧД003.ОбъектXDTOМЧДИзДвоичныхДанных(ДвоичныеДанные);
		ТабличныйДокумент = Справочники.МЧД003.ТабличныйДокументМЧД(ОбъектДоверенности.Доверенность);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций") Тогда
		ДвоичныеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "XMLфайлМЧД").Получить();
		ТабличныйДокумент = ТабличныйДокументМЧД(ДвоичныеДанные).ПредставлениеДокумента;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов") Тогда
		ДвоичныеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "XMLфайлМЧД").Получить();
		ТабличныйДокумент = ТабличныйДокументМЧД(ДвоичныеДанные, Истина).ПредставлениеДокумента;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.МЧД003") Тогда
		ДвоичныеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ФайлМЧД").Получить();
		ТабличныйДокумент = ТабличныйДокументМЧД(ДвоичныеДанные).ПредставлениеДокумента;
	Иначе
		ШаблонОшибки = НСтр("ru='Для доверенности типа %1 не определен метод получения табличного документа - представления';");
		ВызватьИсключение СтрШаблон(ШаблонОшибки, ТипЗнч(Ссылка));
	КонецЕсли;
	
	Если ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
		Возврат ТабличныйДокумент;
	Иначе
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
КонецФункции

// Возвращает табличный документ МЧД.
// 
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные.
//  ЭтоМЧДКонтрагента - Булево
// 
// Возвращаемое значение:
//  Структура:
//   * ПредставлениеДокумента - Неопределено, ТабличныйДокумент -  табличный документ МЧД
//   * Успех - Булево - Табличный документ сформирован
Функция ТабличныйДокументМЧД(ДвоичныеДанные, ЭтоМЧДКонтрагента = Ложь) Экспорт

	РезультатФормирования = Новый Структура;
	РезультатФормирования.Вставить("ПредставлениеДокумента", Неопределено);
	РезультатФормирования.Вставить("Успех", Ложь);
	
	Если ДвоичныеДанные = Неопределено Тогда
		ТекстСообщения = НСтр(
				"ru = 'Ошибка формирования табличного документа МЧД'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат РезультатФормирования;	
	КонецЕсли;				
	
	РезультатЧтения = ДанныеИзФайлаОбмена(ДвоичныеДанные);
	Если НЕ РезультатЧтения.Успех Тогда
		Возврат РезультатФормирования;
	КонецЕсли;
	
	Если РезультатЧтения.ЭтоОбъектXDTO Тогда
		
		ТабличныйДокумент = 
			ТабличныйДокументПоФормату(РезультатЧтения.ВерсияФорматаМЧД, РезультатЧтения.ДанныеДоверенности);
		РезультатФормирования.ПредставлениеДокумента = ТабличныйДокумент;
		РезультатФормирования.Успех = ТабличныйДокумент <> Неопределено;
		
	Иначе
	
		СтруктураДанных = РезультатЧтения.ДанныеДоверенности;
		
		ДоверительФЛ_ФИО = "";
		ДоверительФЛ_Удостоверение = "";
		
		ЭтоПередоверие = ЗначениеЗаполнено(
			МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(СтруктураДанных, "НомерРодительскойДоверенности", ""));
	
		ЭтоДоверительЮрЛицо = СтруктураДанных.ТипОрганизации = "ЮЛ" ИЛИ СтруктураДанных.ТипОрганизации = "ИО";
		
		Для каждого Строка Из СтруктураДанных.ФИО Цикл
			Если Строка.Владелец = Перечисления.СубъектыДоверенности.ДоверительРук
				Или Строка.Владелец = Перечисления.СубъектыДоверенности.ДоверительФЛ Тогда
				ДоверительФЛ_ФИО = ПолучитьПредставлениеФИО(Строка);
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого Строка Из СтруктураДанных.УдостоверенияЛичности Цикл
			Если Строка.Владелец = Перечисления.СубъектыДоверенности.ДоверительФЛ Тогда
				ДоверительФЛ_Удостоверение = ПолучитьПредставлениеУдостоверение(Строка);
			КонецЕсли;
		КонецЦикла;
		
		ИмяСправочника = ?(ЭтоМЧДКонтрагента, "Контрагенты", "Организации");
		
		Доверитель = Неопределено;
		СведенияДоверителя = Новый Структура("ИНН", 
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ДоверительЮЛ_ИНН, СтруктураДанных.ДоверительФЛ_ИНН));
		СведенияПодписанта = Новый Структура("ИНН",
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ЛицоБезДовФЛ_ИНН, СтруктураДанных.ДоверительФЛ_ИНН));
		
		Доверитель = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект(ИмяСправочника, , СведенияДоверителя);
		Подписант = ЭлектронныеДокументыПереопределяемый.ПолучитьФизЛицоМЧД(СведенияПодписанта);
			
		СтруктураДанных.Вставить("ЗаголовокДолжность",
			?(ЗначениеЗаполнено(СтруктураДанных.ЛицоБезДовФЛ_Должность), НСтр("ru = 'Должность'"), ""));
		СтруктураДанных.Вставить("Должность", СтруктураДанных.ЛицоБезДовФЛ_Должность);
		СтруктураДанных.Вставить("ДоверительФИО", ДоверительФЛ_ФИО);
		СтруктураДанных.Вставить("ДоверительИНН", 
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ЛицоБезДовФЛ_ИНН, СтруктураДанных.ДоверительФЛ_ИНН));
		СтруктураДанных.Вставить("ДоверительСНИЛС", 
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ЛицоБезДовФЛ_СНИЛС, СтруктураДанных.ДоверительФЛ_СНИЛС));
		
		СтруктураДанных.Вставить("Подписант", Подписант);
		СтруктураДанных.Вставить("Доверитель", Доверитель);
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ИмяМакета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("КарточкаМЧД_%1", 
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		Макет = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПолучитьМакет(ИмяМакета);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьШапкаПередоверие = Макет.ПолучитьОбласть("ОбластьШапкаПередоверие");
		
		ОбластьЗаголовокСведенияДоверителя = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияДоверителя");
		ОбластьЗаголовокПередовериеЛицоПередавшееПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПередовериеЛицоПередавшееПолномочия");
		ОбластьЗаголовокСведенияОПредставителе = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияОПредставителе");
		ОбластьЗаголовокСведенияОПредставителях = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияОПредставителях");
		ОбластьЗаголовокСведенияОПредставителеФИО = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияОПредставителеФИО");
		ОбластьЗаголовокПередовериеЛицоПолучившееПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПередовериеЛицоПолучившееПолномочия");
		ОбластьЗаголовокПередовериеЛицаПолучившиеПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПередовериеЛицаПолучившиеПолномочия");
		
		ОбластьСведенияОбОрганизацииДоверителя = Макет.ПолучитьОбласть("ОбластьСведенияОбОрганизацииДоверителя");
		ОбластьСведенияОДоверителеИП = Макет.ПолучитьОбласть("ОбластьСведенияОДоверителеИП");
		ОбластьСведенияОПодписанте = Макет.ПолучитьОбласть("ОбластьСведенияОПодписанте");
		ОбластьСведенияОДоверенномЛице = Макет.ПолучитьОбласть("ОбластьСведенияОДоверенномЛице");
		ОбластьСведенияОПредставителеИП = Макет.ПолучитьОбласть("ОбластьСведенияОПредставителеИП");
		
		ОбластьПередовериеДоверительЮлЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительЮлЛицо");
		ОбластьПередовериеДоверительФизЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительФизЛицо");
		ОбластьПередовериеДоверительИП = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительИП");
		ОбластьПередовериеПолучательПолномочийФизЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеПолучательПолномочийФизЛицо");
		ОбластьПередовериеПолучательЮлЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеПолучательЮлЛицо");
		ОбластьПередовериеПолучательИП = Макет.ПолучитьОбласть("ОбластьПередовериеПолучательИП");
		ОбластьПередовериеДоверительФизЛицоЮЛ = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительФизЛицоЮЛ");
		
		ОбластьЗаголовокПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПолномочия");
		ОбластьПереченьПолномочий = Макет.ПолучитьОбласть("ОбластьПереченьПолномочий");
		ОбластьПредставительОрганизация = Макет.ПолучитьОбласть("ОбластьПредставительОрганизация");
		ОбластьБезПраваПередоверия = Макет.ПолучитьОбласть("ОбластьБезПраваПередоверия");
		ОбластьСПравомПередоверия = Макет.ПолучитьОбласть("ОбластьСПравомПередоверия");
		ОбластьИндивидуальныеПолномочия =  Макет.ПолучитьОбласть("ОбластьИндивидуальныеПолномочия");
		ОбластьСовместныеПолномочия =  Макет.ПолучитьОбласть("ОбластьСовместныеПолномочия");
		ОбластьОднократногоПередоверия = Макет.ПолучитьОбласть("ОбластьОднократногоПередоверия");
		
		ОбластьОтступ = Макет.ПолучитьОбласть("ОбластьОтступ");
		ОбластьОтступЗаполнение = Макет.ПолучитьОбласть("ОбластьОтступЗаполнение");
		ОбластьДокументУдостоверяющийЛичность = Макет.ПолучитьОбласть("ОбластьДокументУдостоверяющийЛичность");
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
		ОбластьШапкаПередоверие.Параметры.Заполнить(СтруктураДанных);
		
		ОбластьСведенияОбОрганизацииДоверителя.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОДоверителеИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОПодписанте.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОДоверенномЛице.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОПредставителеИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьПредставительОрганизация.Параметры.Заполнить(СтруктураДанных);
		
		ОбластьПередовериеДоверительЮлЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеДоверительИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеДоверительФизЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеПолучательПолномочийФизЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеПолучательЮлЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеПолучательИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеДоверительФизЛицоЮЛ.Параметры.Заполнить(СтруктураДанных);
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
			
		НесколькоПредставителей = СтруктураДанных.Представители.Количество() > 1;
	
		Если ЭтоПередоверие Тогда
			
			ТабличныйДокумент.Вывести(ОбластьШапкаПередоверие);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокПередовериеЛицоПередавшееПолномочия);
			
			Если (СтруктураДанных.Свойство("ТипДоверителяОсновнойДоверенности")
					И СтруктураДанных.ТипДоверителяОсновнойДоверенности = "ЮЛ")
				Или (СтруктураДанных.Свойство("ТипДоверителяОсновнойДоверенности")
					И СтруктураДанных.ТипДоверителяОсновнойДоверенности = "ИО") Тогда
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительЮлЛицо);
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительФизЛицоЮЛ);
			ИначеЕсли СтруктураДанных.Свойство("ТипДоверителяОсновнойДоверенности")
					И СтруктураДанных.ТипДоверителяОсновнойДоверенности = "ИП" Тогда
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительИП);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительФизЛицо);
			КонецЕсли;
			
			Если Не ЭтоДоверительЮрЛицо И ЗначениеЗаполнено(ДоверительФЛ_Удостоверение) Тогда
				ОбластьДокументУдостоверяющийЛичность.Параметры.ДокументУдостоверяющийЛичность = 
					ДоверительФЛ_Удостоверение;
				ТабличныйДокумент.Вывести(ОбластьДокументУдостоверяющийЛичность);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			
			Если НесколькоПредставителей Тогда 
				ТабличныйДокумент.Вывести(ОбластьЗаголовокПередовериеЛицаПолучившиеПолномочия);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьЗаголовокПередовериеЛицоПолучившееПолномочия);
			КонецЕсли;
			
			Для Каждого СведенияОПредставителе Из СтруктураДанных.Представители Цикл
				
				Если НесколькоПредставителей Тогда 
					ОбластьЗаголовокСведенияОПредставителеФИО.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителеФИО);
				КонецЕсли;
				
				Если СведенияОПредставителе.ТипУполномоченногоПредставителя = "ЮЛ"
					Или СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИО" Тогда
					
					ОбластьПередовериеПолучательЮлЛицо.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательЮлЛицо);
					
					ОбластьПередовериеПолучательПолномочийФизЛицо.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательПолномочийФизЛицо);
					
				ИначеЕсли СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИП" Тогда
					ОбластьПередовериеПолучательИП.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательИП);
				Иначе
					ОбластьПередовериеПолучательПолномочийФизЛицо.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательПолномочийФизЛицо);
				КонецЕсли;
				
				Если СведенияОПредставителе.Свойство("ПредставлениеУдостоверения") Тогда 
					ОбластьДокументУдостоверяющийЛичность.Параметры.ДокументУдостоверяющийЛичность =
						СведенияОПредставителе.ПредставлениеУдостоверения;
					ТабличныйДокумент.Вывести(ОбластьДокументУдостоверяющийЛичность);
				КонецЕсли;
				
			КонецЦикла;
					
		Иначе
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияДоверителя);
			
			Если ЭтоДоверительЮрЛицо Тогда
				ТабличныйДокумент.Вывести(ОбластьСведенияОбОрганизацииДоверителя);
				ТабличныйДокумент.Вывести(ОбластьСведенияОПодписанте);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьСведенияОДоверителеИП);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			
			Если НесколькоПредставителей Тогда 
				ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителях);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителе);
			КонецЕсли;
			
			Для Каждого СведенияОПредставителе Из СтруктураДанных.Представители Цикл
				
				Если НесколькоПредставителей Тогда 
					ОбластьЗаголовокСведенияОПредставителеФИО.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителеФИО);
				КонецЕсли;
				
				Если СведенияОПредставителе.ТипУполномоченногоПредставителя = "ЮЛ"
					ИЛИ СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИО" Тогда 
	
					ОбластьПредставительОрганизация.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПредставительОрганизация);
	
					ОбластьСведенияОДоверенномЛице.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьСведенияОДоверенномЛице);
	
				ИначеЕсли СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИП" Тогда 
					ОбластьСведенияОПредставителеИП.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьСведенияОПредставителеИП);
				Иначе
					ОбластьСведенияОДоверенномЛице.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьСведенияОДоверенномЛице);
				КонецЕсли;
	
				Если СведенияОПредставителе.Свойство("ПредставлениеУдостоверения") Тогда 
					ОбластьДокументУдостоверяющийЛичность.Параметры.ДокументУдостоверяющийЛичность =
						СведенияОПредставителе.ПредставлениеУдостоверения;
					ТабличныйДокумент.Вывести(ОбластьДокументУдостоверяющийЛичность);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Полномочия = ПолномочияДоверенности(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокПолномочия);
		Для Каждого СтрокаПолномочий Из Полномочия Цикл
			ОбластьПереченьПолномочий.Параметры.ПереченьПолномочий = СтрокаПолномочий;
			ТабличныйДокумент.Вывести(ОбластьПереченьПолномочий);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьОтступЗаполнение);
		
		Если СтруктураДанных.Свойство("ТипПередоверия") Тогда
			Если СтруктураДанных.ТипПередоверия = "1" Тогда
				ТабличныйДокумент.Вывести(ОбластьОднократногоПередоверия);
			ИначеЕсли СтруктураДанных.ТипПередоверия = "3" Тогда
				ТабличныйДокумент.Вывести(ОбластьСПравомПередоверия);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьБезПраваПередоверия);
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураДанных.СовместныеПолномочия Тогда
			ТабличныйДокумент.Вывести(ОбластьСовместныеПолномочия);
		Иначе
			ТабличныйДокумент.Вывести(ОбластьИндивидуальныеПолномочия);
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
		РезультатФормирования.ПредставлениеДокумента = ТабличныйДокумент;
		РезультатФормирования.Успех = ТабличныйДокумент <> Неопределено;
	
	КонецЕсли;
	
	Возврат РезультатФормирования;
	
КонецФункции
	
#Область XDTO

// Читает XDTO-объект МЧД из двоичных данных.
// 
// Параметры:
//  ДанныеМЧД - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Структура:
// * ТекстОшибки - Строка
// * ОбъектМЧД - Неопределено
//             - ОбъектXDTO
Функция ОбъектXDTOМЧД(ДанныеМЧД) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ОбъектМЧД", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
		
	Попытка
		
		РезультатЧтения = ДанныеXMLМЧД(ДанныеМЧД);
		Если НЕ РезультатЧтения.Успех Тогда
			Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		
		Результат.ОбъектМЧД = РезультатЧтения.ДанныеДоверенности;
		
	Исключение
		
		ВидОперации = НСтр("ru = 'Загрузка машиночитаемой доверенности из файла.'");
		ТекстОшибки = НСтр("ru = 'Ошибка при чтении файла доверенности: файл не соответствует формату ФНС.'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки);
		Результат.ТекстОшибки = ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Возвращает пустую структуру данных доверенности.
// 
// Возвращаемое значение:
//  Структура:
//  * НомерДоверенности - Строка
//  * ИННДоверителя - Строка
Функция НовыеДанныеДоверенности() Экспорт
	ДанныеДоверенности = Новый Структура;
	ДанныеДоверенности.Вставить("НомерДоверенности", "");
	ДанныеДоверенности.Вставить("ИННДоверителя", "");
	Возврат ДанныеДоверенности;
КонецФункции

// Возвращает новые общие свойства доверенности.
// 
// Возвращаемое значение:
//  Структура:
//  * НомерДоверенности - Строка
//  * НомерРодительскойДоверенности - Строка
//  * ДатаВыдачи - Дата
//  * ДатаОкончания - Дата
//  * Доверитель - Строка
//  * ДоверительИНН - Строка
//  * Верна - Булево
//  * Отозвана - Булево
//  * ДатаОтзыва - Дата
//  * СтатусВРеестреФНС - ПеречислениеСсылка.СтатусыМашиночитаемойДоверенностиВРеестреФНС
//  * ПолномочияОграничены - Булево
//  * ПолномочияУказаныИзКлассификатора - Булево
//  * Ссылка - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  		 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  		 - СправочникСсылка.МЧД003
Функция НовыеОбщиеСвойстваДоверенности() Экспорт
	
	Свойства = Новый Структура;
	Свойства.Вставить("НомерДоверенности", "");
	Свойства.Вставить("НомерРодительскойДоверенности", "");
	Свойства.Вставить("ДатаВыдачи", '00010101');
	Свойства.Вставить("ДатаОкончания", '00010101');
	Свойства.Вставить("Доверитель", "");
	Свойства.Вставить("ДоверительИНН", "");
	Свойства.Вставить("Верна", Ложь);
	Свойства.Вставить("Отозвана", Ложь);
	Свойства.Вставить("ДатаОтзыва", '00010101');
	Свойства.Вставить("СтатусВРеестреФНС", Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка());
	Свойства.Вставить("ПолномочияОграничены", Ложь);
	Свойства.Вставить("ПолномочияУказаныИзКлассификатора", Ложь);
	Свойства.Вставить("Ссылка", Справочники.МашиночитаемыеДоверенностиКонтрагентов.ПустаяСсылка());
	
	Возврат Свойства;
	
КонецФункции

// Формирует пустую структуру данных удостоверения личности субъекта МЧД.
// 
// Возвращаемое значение:
//  Структура:
//  * СерДок - Строка
//  * НомДок - Строка
//  * ДатаДок - Дата
//  * ВыдДок - Строка
//  * ВидДок - Строка
//  * КодВыдДок - Строка
//  * Владелец - ПеречислениеСсылка.СубъектыДоверенности
//  
Функция НовыеДанныеУдостоверенияЛичности() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СерДок", "");
	Результат.Вставить("НомДок", "");
	Результат.Вставить("ДатаДок", '00010101');
	Результат.Вставить("ВыдДок", "");
	Результат.Вставить("ВидДок", "");
	Результат.Вставить("КодВыдДок", "");
	Результат.Вставить("Владелец", Перечисления.СубъектыДоверенности.ПустаяСсылка());
	Возврат Результат;
	
КонецФункции

// Формирует представление удостоверения личности
//
// Параметры:
//  ДанныеУдостоверенияЛичности - См. НовыеДанныеУдостоверенияЛичности
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьПредставлениеУдостоверение(ДанныеУдостоверенияЛичности) Экспорт

	Представление = "";
	
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.ВидДок) Тогда
		ВидыДокументов = МашиночитаемыеДоверенностиКлиентСервер.ВидыДокументовФизическихЛиц();
		Представление = ВидыДокументов.Получить(ДанныеУдостоверенияЛичности.ВидДок);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.СерДок) Тогда
		Представление = Представление + " " + ДанныеУдостоверенияЛичности.СерДок;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.НомДок) Тогда
		Представление = Представление + " " + ДанныеУдостоверенияЛичности.НомДок;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.ДатаДок) Тогда
		Представление = Представление + " " + НСтр("ru = 'выдан'") + " " + Формат(ДанныеУдостоверенияЛичности.ДатаДок, "ДЛФ=ДД");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.ВыдДок) Тогда
		Представление = Представление + " " + ДанныеУдостоверенияЛичности.ВыдДок;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.КодВыдДок) Тогда
		Представление = Представление + ", " + НСтр("ru = 'код подразделения'") + ":" + ДанныеУдостоверенияЛичности.КодВыдДок;
	КонецЕсли;

	Возврат Представление;

КонецФункции


// Дополняет массив номеров МЧД номерами, пришедшими в контейнере сообщения
// 
// Параметры:
//  НомераМЧД - Массив из Строка
//  ФайлСообщения - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешПодписи - Строка
Процедура ДополнитьНомерамиДоверенностейСообщений(НомераМЧД, СоответствиеИННДоверителяСНомерамиМЧД, ФайлСообщения, ХешПодписи) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МашиночитаемыеДоверенностиСообщений.Доверенность КАК Доверенность,
		|	МашиночитаемыеДоверенностиСообщений.ДоверительИНН КАК ДоверительИНН,
		|	МашиночитаемыеДоверенностиСообщений.НомерДоверенности КАК НомерДоверенности
		|ИЗ
		|	РегистрСведений.МашиночитаемыеДоверенностиСообщений КАК МашиночитаемыеДоверенностиСообщений
		|ГДЕ
		|	МашиночитаемыеДоверенностиСообщений.ПодписанныйОбъект = &ПодписанныйОбъект
		|	И МашиночитаемыеДоверенностиСообщений.ХешПодписи = &ХешПодписи
		|";
	
	Запрос.УстановитьПараметр("ПодписанныйОбъект", ФайлСообщения);
	Запрос.УстановитьПараметр("ХешПодписи", ХешПодписи);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.НомерДоверенности) Тогда
			НомераМЧД.Добавить(Выборка.НомерДоверенности);
		КонецЕсли;

		Если ЗначениеЗаполнено(Выборка.ДоверительИНН) 
			И ЗначениеЗаполнено(Выборка.НомерДоверенности) Тогда
			СоответствиеИННДоверителяСНомерамиМЧД.Вставить(Выборка.НомерДоверенности, Выборка.ДоверительИНН);
		ИначеЕсли ЗначениеЗаполнено(Выборка.Доверенность) Тогда
			СправочникМЧД = МашиночитаемыеДоверенности.СправочникМЧД(Выборка.Доверенность);
			СведенияМЧД   = СправочникМЧД.СведенияМЧД(Выборка.Доверенность);
			
			СоответствиеИННДоверителяСНомерамиМЧД.Вставить(СведенияМЧД.НомерДоверенности, СведенияМЧД.ИННДоверителя);
			
			НомераМЧД.Добавить(СведенияМЧД.НомерДоверенности);		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет к подписанному объекту МЧД контрагента из ТК.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  Доверенности - см. ТранспортныеКонтейнерыЭДО.ПрочитатьКарточкуМЧД
Процедура ДобавитьДоверенностиСообщений(ПодписанныйОбъект, Доверенности) Экспорт
	
	Если Не ЗначениеЗаполнено(Доверенности) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Для Каждого Доверенность Из Доверенности Цикл

			ДанныеДоверенности = Доверенность.Значение;
			МенеджерЗаписи = РегистрыСведений.МашиночитаемыеДоверенностиСообщений.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ПодписанныйОбъект = ПодписанныйОбъект;
			МенеджерЗаписи.ХешПодписи = Доверенность.Ключ;

			Если ДанныеДоверенности.ЭтоФайловаяДоверенность Тогда

				Попытка
					Результат = ДанныеXMLМЧД(ДанныеДоверенности.Доверенность.ДвоичныеДанные);
				Исключение

					ШаблонОшибки = НСтр(
						"ru = 'Ошибка при чтении файла доверенности: файл %1 не соответствует формату ФНС.'");
					ТекстОшибки = СтрШаблон(ШаблонОшибки, ДанныеДоверенности.Доверенность.ИмяФайла);
					ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(
						НСтр("ru = 'Запись МЧД сообщений ЭДО'"), ПодробныйТекстОшибки, ТекстОшибки);
					ВызватьИсключение;

				КонецПопытки;
				
				Если НЕ Результат.Успех Тогда
					ВызватьИсключение Результат.ТекстОшибки;
				КонецЕсли;

				МенеджерЗаписи.ДанныеДоверенности = Новый ХранилищеЗначения(ДанныеДоверенности.Доверенность.ДвоичныеДанные,
					Новый СжатиеДанных(9));
				МенеджерЗаписи.ДанныеПодписи = Новый ХранилищеЗначения(ДанныеДоверенности.Подпись.ДвоичныеДанные,
					Новый СжатиеДанных(9));
					
				ДанныеДляЗагрузки = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД();
				ДанныеДляЗагрузки.ДанныеДоверенности = ДанныеДоверенности.Доверенность.ДвоичныеДанные;
				ДанныеДляЗагрузки.ДанныеПодписи = ДанныеДоверенности.Подпись.ДвоичныеДанные;
					
				ВерсияМЧД = ВерсияФорматаОбъектаМЧД(Результат.ДанныеДоверенности);
				Если ВерсияМЧД = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
					ДанныеДляЗагрузки.ДанныеПодписей.Добавить(ДанныеДоверенности.Подпись.ДвоичныеДанные);
					Результат = Справочники.МЧД003.ЗагрузитьМЧДИзФайла(ДанныеДляЗагрузки);
				Иначе
					Результат = 
						Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьМЧДИзФайла(ДанныеДляЗагрузки);
				КонецЕсли;
				
				МенеджерЗаписи.Доверенность = Результат.МЧД;
				
			Иначе

				МенеджерЗаписи.НомерДоверенности = ДанныеДоверенности.НомерДоверенности;
				МенеджерЗаписи.ДоверительИНН = ДанныеДоверенности.ДоверительИНН;
				МенеджерЗаписи.СсылкаНаРеестр = ДанныеДоверенности.СсылкаНаРеестр;
				
				НайденныеДоверенности = НайтиДоверенности(МенеджерЗаписи.НомерДоверенности, 
					МенеджерЗаписи.ДоверительИНН, 
					Справочники.МашиночитаемыеДоверенностиКонтрагентов);
					
				Если ЗначениеЗаполнено(НайденныеДоверенности) Тогда
					МенеджерЗаписи.Доверенность = НайденныеДоверенности[0];
				КонецЕсли;

			КонецЕсли;

			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи.Записать();
			УстановитьПривилегированныйРежим(Ложь);

		КонецЦикла;
	ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВидОперации = НСтр("ru = 'Запись МЧД сообщений ЭДО.'");
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(
			ВидОперации, ПодробноеПредставлениеОшибки, КраткоеПредставлениеОшибки,,ПодписанныйОбъект);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Добавляет к подписанному объекту МЧД контрагента.
// 
// Параметры:
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект - Ссылка на подписанный объект
//  НомерДоверенности - Строка - Номер доверенности
//  ИННДоверителя - Строка - ИНН доверителя
//  
Процедура ДобавитьДоверенностьКонтрагента(ПодписанныйОбъект, НомерДоверенности, ИННДоверителя) Экспорт
	
КонецПроцедуры

// Добавляет к подписанному объекту МЧД организации.
// 
// Параметры:
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект - Ссылка на подписанный объект
//  МЧД - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций - Ссылка на МЧД организации
//  
Процедура ДобавитьДоверенностьОрганизации(ПодписанныйОбъект, МЧД) Экспорт
		
КонецПроцедуры

// Записывает результат проверки МЧД в информационную базу.
// 
// Параметры:
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект - Ссылка на подписанный объект.
//  Отпечаток - Строка
//  ДоверенностьВерна - Булево
//
Процедура ЗаписатьРезультатПроверкиМЧД(ПодписанныйОбъект, Отпечаток, ДоверенностьВерна) Экспорт
	
	Если ДоверенностьВерна <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		МенеджерЗаписи = РегистрыСведений.РезультатыПроверкиМЧДОператором.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПодписанныйОбъект = ПодписанныйОбъект;
		МенеджерЗаписи.Отпечаток = Отпечаток;
		МенеджерЗаписи.ДоверенностьВерна = ДоверенностьВерна;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Инициализирует структуру для отбора машиночитаемых доверенностей.
// 
// Возвращаемое значение:
//  Структура:
//   * Доверитель - ОпределяемыйТип.Организация - Организация предприятия
//   * Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования, СертификатКриптографии - Сертификат
//                  доверенного лица.
// 
Функция НовыйОтборМЧД() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Доверитель", Неопределено);
	Отбор.Вставить("Сертификат", Неопределено);
	
	Возврат Отбор;
	
КонецФункции

// Возвращает массив ссылок МЧД 
//
// Параметры:
// 	Отбор - см. НовыйОтборМЧД 
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//
Функция ПолучитьДоверенностиОрганизации(Отбор) Экспорт
	
	Доверитель = Отбор.Доверитель;
	Сертификат = Отбор.Сертификат;
	
	Если ТипЗнч(Сертификат) = Тип("СертификатКриптографии") Тогда
		СвойстваСубъектаСертификата = СвойстваСубъектаСертификата(Сертификат);
	Иначе
		СвойстваСубъектаСертификата = СвойстваСубъектаСертификатаПоСсылке(Сертификат);
	КонецЕсли;
	
	ПредставительИНН = СвойстваСубъектаСертификата.ИНН;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МашиночитаемыеДоверенностиОрганизаций.Ссылка КАК Ссылка,
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаВыдачи КАК ДатаВыдачи,
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаОкончания КАК ДатаОкончания,
	|	МашиночитаемыеДоверенностиОрганизаций.СтатусВРеестреФНС КАК СтатусВРеестреФНС,
	|	МашиночитаемыеДоверенностиОрганизаций.Верна КАК Верна,
	|	МашиночитаемыеДоверенностиОрганизаций.Отозвана КАК Отозвана,
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаОтзыва КАК ДатаОтзыва,
	|	МашиночитаемыеДоверенностиОрганизаций.ПолномочияОграничены КАК ПолномочияОграничены,
	|	МашиночитаемыеДоверенностиОрганизаций.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС) КАК
	|		ПолномочияУказаныИзКлассификатора
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенностиОрганизаций.Представители КАК
	|			МашиночитаемыеДоверенностиОрганизацийПредставители
	|		ПО МашиночитаемыеДоверенностиОрганизаций.Ссылка = МашиночитаемыеДоверенностиОрганизацийПредставители.Ссылка
	|		И МашиночитаемыеДоверенностиОрганизаций.Организация = &Организация
	|		И МашиночитаемыеДоверенностиОрганизацийПредставители.ФЛ_ИНН = &ПредставительИНН
	|		И НЕ МашиночитаемыеДоверенностиОрганизаций.ПометкаУдаления
	|		И МашиночитаемыеДоверенностиОрганизаций.СтатусВРеестреФНС В (&СтатусВРеестреФНС)
	|		И НЕ МашиночитаемыеДоверенностиОрганизаций.СовместныеПолномочия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МашиночитаемыеДоверенностиОрганизаций.Ссылка,
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаВыдачи,
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаОкончания,
	|	МашиночитаемыеДоверенностиОрганизаций.СтатусВРеестреФНС,
	|	МашиночитаемыеДоверенностиОрганизаций.Верна,
	|	МашиночитаемыеДоверенностиОрганизаций.Отозвана,
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаОтзыва,
	|	МашиночитаемыеДоверенностиОрганизаций.ПолномочияОграничены,
	|	МашиночитаемыеДоверенностиОрганизаций.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС) КАК
	|		ПолномочияУказаныИзКлассификатора
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенностиОрганизаций.Представители КАК
	|			МашиночитаемыеДоверенностиОрганизацийПредставители
	|		ПО МашиночитаемыеДоверенностиОрганизаций.Ссылка = МашиночитаемыеДоверенностиОрганизацийПредставители.Ссылка
	|		И МашиночитаемыеДоверенностиОрганизаций.Организация = &Организация
	|		И МашиночитаемыеДоверенностиОрганизацийПредставители.ЮЛ_ИНН = &ПредставительИНН
	|		И НЕ МашиночитаемыеДоверенностиОрганизаций.ПометкаУдаления
	|		И МашиночитаемыеДоверенностиОрганизаций.СтатусВРеестреФНС В (&СтатусВРеестреФНС)
	|		И НЕ МашиночитаемыеДоверенностиОрганизаций.СовместныеПолномочия";
	
	Запрос.УстановитьПараметр("Организация", Доверитель);
	Запрос.УстановитьПараметр("СтатусВРеестреФНС", СтатусыДействительнойДоверенности());
	Запрос.УстановитьПараметр("ПредставительИНН", ПредставительИНН);  
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Результат = Новый Массив;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваДоверенности = НовыеСвойстваДоверенности();
		ЗаполнитьЗначенияСвойств(СвойстваДоверенности, Выборка);
		
		Если ДоверенностьДействительнаПоСвойствам(СвойстваДоверенности, ТекущаяДатаСеанса()) Тогда
			Результат.Добавить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает ссылку на последнюю выданную МЧД. Если нет действующих доверенностей, то возвращает пустую ссылку.
//
// Параметры:
// 	Отбор - см. НовыйОтборМЧД
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО 
//
// Возвращаемое значение:
//  Структура:
//  * Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//                 - СправочникСсылка.МЧД003
//  * ОшибкиПроверкиПолномочий - Соответствие из КлючИЗначение:
//    ** Ключ - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//    ** Значение - см. МашиночитаемыеДоверенности.НоваяОшибкаПроверкиПолномочийПриПодписании
//
Функция ПолучитьПоследнююВыданнуюДоверенностьОрганизации(Отбор, ЭлектронныйДокумент) Экспорт
	
	Результат = ПолучитьПоследнююВыданнуюДоверенностьB2B(Отбор, ЭлектронныйДокумент);
	Справочники.МЧД003.ПолучитьПоследнююВыданнуюДоверенность(Отбор, ЭлектронныйДокумент, Результат);
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на последнюю выданную МЧД. Если нет действующих доверенностей, то возвращает пустую ссылку.
//
// Параметры:
// 	Отбор - см. НовыйОтборМЧД
// 	ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО 
//
// Возвращаемое значение:
//  Структура:
//  * Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//                 - СправочникСсылка.МЧД003
//  * ОшибкиПроверкиПолномочий - Соответствие из КлючИЗначение:
//    ** Ключ - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//    ** Значение - см. МашиночитаемыеДоверенности.НоваяОшибкаПроверкиПолномочийПриПодписании
//
Функция ПолучитьПоследнююВыданнуюДоверенностьB2B(Отбор, ЭлектронныйДокумент)
	
	Результат = Новый Структура("Доверенность, ОшибкиПроверкиПолномочий",
		Справочники.МашиночитаемыеДоверенностиОрганизаций.ПустаяСсылка(), Новый Соответствие());
	
	ОшибкиПроверкиПолномочий = Новый Соответствие();
	
	Доверенности = ПолучитьДоверенностиОрганизации(Отбор);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Доверенности", Доверенности);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МашиночитаемыеДоверенностиОрганизаций.Ссылка КАК Ссылка,
	|	МашиночитаемыеДоверенностиОрганизаций.ПолномочияОграничены КАК ПолномочияОграничены,
	|	МашиночитаемыеДоверенностиОрганизаций.НомерДоверенности КАК НомерДоверенности,
	|	МашиночитаемыеДоверенностиОрганизаций.Представление КАК Представление,
	|	МашиночитаемыеДоверенностиОрганизаций.ВариантЗаполненияПолномочий =
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС) КАК ПолномочияУказаныИзКлассификатора
	|ИЗ
	|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
	|ГДЕ
	|	МашиночитаемыеДоверенностиОрганизаций.Ссылка В (&Доверенности)
	|	И НЕ МашиночитаемыеДоверенностиОрганизаций.СовместныеПолномочия
	|
	|УПОРЯДОЧИТЬ ПО
	|	МашиночитаемыеДоверенностиОрганизаций.ДатаВыдачи УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.ПолномочияОграничены Тогда
			
			Результат.Доверенность = Выборка.Ссылка;
			Возврат Результат;
			
		Иначе
			
			ПравилоПроверки = РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки(Выборка.Ссылка);
			
			Если Выборка.ПолномочияУказаныИзКлассификатора Или ПравилоНастроено(ПравилоПроверки) Тогда
				
				РезультатПроверки = ПроверитьПолномочияДоверенности(Выборка.Ссылка, ЭлектронныйДокумент);
			
				Если РезультатПроверки.Успех Тогда
					
					Результат.Доверенность = Выборка.Ссылка;
					Возврат Результат;
					
				Иначе
					
					Ошибка = НоваяОшибкаПроверкиПолномочийПриПодписании();
					Ошибка.Доверенность = Выборка.Ссылка;
					Ошибка.ЭлектронныйДокумент = ЭлектронныйДокумент;
					Ошибка.ТекстОшибки = РезультатПроверки.ТекстОшибки;
					ОшибкиПроверкиПолномочий.Вставить(Выборка.Ссылка, Ошибка);
					
				КонецЕсли;
				
			Иначе
				
				Ошибка = НоваяОшибкаПроверкиПолномочийПриПодписании();
				Ошибка.Доверенность = Выборка.Ссылка;
				Ошибка.ЭлектронныйДокумент = ЭлектронныйДокумент;
				Ошибка.ТекстОшибки = ТекстОшибкиНеНастроенаАвтопроверка();
				ОшибкиПроверкиПолномочий.Вставить(Выборка.Ссылка, Ошибка);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОшибкиПроверкиПолномочий.Количество() > 0 Тогда
		Результат.ОшибкиПроверкиПолномочий = ОшибкиПроверкиПолномочий;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получить номера доверенностей.
// 
// Параметры:
//  Доверенности - Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  КлючИЗначение:
//      * Ключ - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//      * Значение - Строка - номер доверенности
Функция ПолучитьНомераДоверенностей(Доверенности) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Доверенности, "НомерДоверенности");
	
КонецФункции

// Возвращает данные, полученные из файла обмена.
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеДоверенности - Неопределено, ОбъектXDTO, Структура - Данные доверенности, см. НовыеДанныеМЧД
//  * ВерсияФорматаМЧД - Строка
//  * ЭтоОбъектXDTO - Булево
//
Функция ДанныеИзФайлаОбмена(ВходящиеДанные, ЭтоДоверенностьОрганизации = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ДанныеДоверенности", Неопределено);
	Результат.Вставить("ВерсияФорматаМЧД", "");
	Результат.Вставить("ЭтоОбъектXDTO", Ложь);
	
	ДвоичныеДанныеМЧД = Неопределено;
	
	Если ТипЗнч(ВходящиеДанные) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанныеМЧД = ВходящиеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ВходящиеДанные) Тогда
		ДвоичныеДанныеМЧД = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	Иначе
		ДвоичныеДанныеМЧД = Новый ДвоичныеДанные(ВходящиеДанные);
	КонецЕсли;

	ВерсияФормата = ВерсияФорматаФайлаМЧД(ДвоичныеДанныеМЧД);
	Результат.ВерсияФорматаМЧД = ВерсияФормата;
	
	Если ВерсияФормата = ФорматМЧД_2022() Тогда
		
		РезультатЧтения = ДанныеИзФайлаОбменаВУтвержденномФормате(ВходящиеДанные, ЭтоДоверенностьОрганизации);
		
	ИначеЕсли  ВерсияФормата = ПилотныйФорматМЧД() Тогда
		
		РезультатЧтения = ДанныеИзФайлаОбменаВПилотномФормате(ВходящиеДанные);
		
	ИначеЕсли ВерсияФормата = ФорматМЧД_2022_Версия_002() Тогда
		
		РезультатЧтения = ДанныеИзФайлаОбменаВУтвержденномФорматеВерсия002(ВходящиеДанные, ЭтоДоверенностьОрганизации);
		
	ИначеЕсли ВерсияФормата = ФорматМЧД_b2g() Тогда
		
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ТекстОшибкиЗагрузкиДоверенности_B2G();
		Возврат Результат;
		
	ИначеЕсли ВерсияФормата = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
		
		РезультатЧтения = ДанныеИзФайлаОбменаОбъектомXDTO(ВходящиеДанные);
		Результат.ЭтоОбъектXDTO = Истина;
		
	Иначе
		
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ТекстОшибкиЗагрузкиДоверенностиДругогоФормата();
		Возврат Результат;
		
	КонецЕсли;
	
	Если Не РезультатЧтения.Успех Тогда
		Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Успех = Истина;
	Результат.ДанныеДоверенности = РезультатЧтения.ДанныеДоверенности;
	Возврат Результат;
	
КонецФункции

// Проверяет, действительна ли доверенность.
// 
// Параметры:
//  Ссылка - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//         - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  ДатаПроверки - Дата - дата, на которую выполняется проверка
// 
// Возвращаемое значение:
//  Булево
Функция ДоверенностьДействительна(Ссылка, ДатаПроверки) Экспорт
	
	Доверенности = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(Ссылка);
	РезультатПроверки = ДоверенностиДействительны(Доверенности, ДатаПроверки);
	Возврат РезультатПроверки[Ссылка];

КонецФункции

Функция ПолучитьПредставлениеФИО(СтрокаФИО) Экспорт

	Представление = "";

	Если ЗначениеЗаполнено(СтрокаФИО.Фамилия) Тогда
		Представление = СтрокаФИО.Фамилия;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаФИО.Имя) Тогда
		Представление = Представление + " " + СтрокаФИО.Имя;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаФИО.Отчество) Тогда
		Представление = Представление + " " + СтрокаФИО.Отчество;
	КонецЕсли;

	Возврат Представление;

КонецФункции

// Получает представление статуса автоматической проверки доверенности
//
// Параметры:
//  ДоверенностьДействует - см. ДоверенностьДействительнаПоСвойствам
//
// Возвращаемое значение:
//  Строка
Функция ПредставлениеРезультатаАвтоматическойПроверкиМЧД(ДоверенностьДействует) Экспорт

	Возврат ?(ДоверенностьДействует, НСтр("ru = 'Доверенность действительна'"), 
					НСтр("ru = 'Доверенность недействительна'")) ;

КонецФункции

// Получает представление статуса ручной проверки доверенности
//
// Возвращаемое значение:
//  Строка
Функция ПредставлениеРезультатаРучнойПроверкиМЧД() Экспорт

	Возврат НСтр("ru = 'Доверенность проверена вручную'");

КонецФункции

// Получает имя файла МЧД
//
// Параметры:
//  Доверенность - СправочникСсылка.МЧД003,
//  				СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьИмяФайлаМЧД(Доверенность) Экспорт
	
	Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
		ИмяФайлаДоверенностьБезРасширения = Справочники.МЧД003.ПолучитьИмяФайлаМЧД(Доверенность);
	Иначе
		ИмяФайлаДоверенностьБезРасширения = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПолучитьИмяФайлаМЧД(Доверенность);
	КонецЕсли;
	
	Возврат ИмяФайлаДоверенностьБезРасширения;
	
КонецФункции

// Получает двоичные данные доверенности
//
// Параметры:
//  Доверенность - СправочникСсылка.МЧД003,
//  				СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//
// Возвращаемое значение:
//  ДвоичныеДанные
//
Функция ПолучитьДвоичныеДанныеМЧД(Доверенность) Экспорт
	
	Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
		ДвоичныеДанные = Справочники.МЧД003.ПолучитьДвоичныеДанныеМЧД(Доверенность);
	Иначе
		ДвоичныеДанные = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПолучитьДвоичныеДанныеМЧД(Доверенность);
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Получает двоичные данные заявления на отзыв доверенности
//
// Параметры:
//  Доверенность - СправочникСсылка.МЧД003,
//  				СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//
// Возвращаемое значение:
//  ДвоичныеДанные
//
Функция ПолучитьДвоичныеДанныеЗаявленияНаОтзыв(Доверенность) Экспорт
	
	Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
		ДвоичныеДанные = Справочники.МЧД003.ПолучитьДвоичныеДанныеЗаявленияНаОтзыв(Доверенность);
	Иначе
		ДвоичныеДанные = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПолучитьДвоичныеДанныеЗаявленияНаОтзыв(Доверенность);
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Возвращает ИНН доверителя.
// 
// Параметры:
//  Ссылка - ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  Строка
Функция ИННДоверителя(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.МЧД003") Тогда
		ДанныеДоверителей = Справочники.МЧД003.ПолучитьИННКППДоверителей(Ссылка);
		ДоверительИНН = ДанныеДоверителей[0].ИНН;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов") Тогда
		ДоверительИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДоверительИНН");
	Иначе
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "XMLфайлМЧД, ДоверительЮЛ_ИНН, ДоверительФЛ_ИНН");
		ДвоичныеДанныеДоверенности = ЗначенияРеквизитов.XMLфайлМЧД.Получить();
		Если ДвоичныеДанныеДоверенности <> Неопределено Тогда
			ДанныеДоверителей = ИННКППДоверителей(ДвоичныеДанныеДоверенности);
			Если ДанныеДоверителей.ТипДоверителя = "ЮЛ"
				Или ДанныеДоверителей.ТипДоверителя = "ИО" Тогда
				ДоверительИНН = ДанныеДоверителей.ИННЮЛ;
			Иначе
				ДоверительИНН = ДанныеДоверителей.ИННФЛ;
			КонецЕсли;
		Иначе
			ДоверительИНН = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ДоверительЮЛ_ИНН), 
				ЗначенияРеквизитов.ДоверительЮЛ_ИНН, ЗначенияРеквизитов.ДоверительФЛ_ИНН);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДоверительИНН;
	
КонецФункции

// Получает доверенность из журнала
//
// Параметры:
//  НомерДоверенности - Строка - Номер доверенности
//
// Возвращаемое значение:
//  ОпределяемыйТип.МашиночитаемаяДоверенность - Доверенность
Функция ПолучитьДоверенностьИзЖурналаПоНомеру(НомерДоверенности) Экспорт
	
	Если ЗначениеЗаполнено(НомерДоверенности) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Доверенность
			|ИЗ
			|	РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК Журнал
			|ГДЕ
			|	Журнал.Номер = &Номер";
		
		Запрос.УстановитьПараметр("Номер", НомерДоверенности);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Доверенность;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Параметры:
//  ВерсияФорматаМЧД - Строка - Версия формата машиночитаемой доверенности.
// 
// Возвращаемое значение:
//  Булево - Истина, если поддерживается вариант заполнения полномочий из классификатора
//
Функция ФорматМЧДПоддерживаетКлассификаторПолномочий (ВерсияФорматаМЧД) Экспорт
	
	Если Не ЗначениеЗаполнено(ВерсияФорматаМЧД) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВерсияФорматаМЧД = ФорматМЧД_2022_Версия_002()
		Или ВерсияФорматаМЧД = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003();
	
КонецФункции

// Проверяет, принадлежит ли ИНН гос. органу, являющемуся удостоверяющим центром.
// 
// Параметры:
//  ИНН - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоИННГосОрганаЯвляющегосяУдостоверяющимЦентром(Знач ИНН) Экспорт
	
	ИНН = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ИНН, 12);
	ИННКазначейства = "007710568760";
	ИННЦентральногоБанка = "007702235133";
	
	Возврат ИНН = ИННКазначейства Или ИНН = ИННЦентральногоБанка;
	
КонецФункции

#Область События

// См. ЭлектронныеДокументыЭДОСобытия.ЗаписатьМашиночитаемуюДоверенностьВЖурнал
Процедура ЗаписатьМашиночитаемуюДоверенностьВЖурнал(Источник, Отказ) Экспорт
	ПередЗаписьюДоверенностиВЖурнал(Источник, Отказ);
	Источник.ЗаписатьВЖурнал(Отказ);
КонецПроцедуры

// Новые параметры записи в журнал МЧД.
// 
// Возвращаемое значение:
//  Структура:
// * ИзменилсяХеш - Булево - Изменение хеша приведет к удалению предыдущей записи из журнала
// * ПредыдущееЗначениеХеша - Строка
Функция НовыеПараметрыЗаписиВЖурналМЧД() Экспорт
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИзменилсяХеш", Ложь);
	ПараметрыЗаписи.Вставить("ПредыдущееЗначениеХеша", "");
	Возврат ПараметрыЗаписи;
КонецФункции

// Читает из дополнительных свойств источника параметры записи в журнал МЧД
// 
// Параметры:
//  Источник - ОпределяемыйТип.ИсточникЗаписиЖурналаМЧД
// 
// Возвращаемое значение:
//  См. НовыеПараметрыЗаписиВЖурналМЧД
Функция ПолучитьПараметрыЗаписиВЖурналМЧД(Источник)
	ПараметрыЗаписи = НовыеПараметрыЗаписиВЖурналМЧД();
	Если Источник.ДополнительныеСвойства.Свойство("ПараметрыЗаписиВЖурналМЧД") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаписи, Источник.ДополнительныеСвойства.ПараметрыЗаписиВЖурналМЧД);
	КонецЕсли;
	Возврат ПараметрыЗаписи;
КонецФункции

#КонецОбласти

#Область ЗагрузкаИзФайла

// Загрузить МЧДИз файла.
// 
// Параметры:
//  АдресХранилища - Строка - адрес хранения двоичных данных файла
//  			   - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД
//  ТребуетсяПроверкаМЧДНаКлиенте - Булево
//  ОбновлятьСуществующий - Булево
//  ДополнительныеСведения - См. МашиночитаемыеДоверенностиКлиентСервер.ДополнительныеСведенияПоЗагрузкеМЧД
//  						- Неопределено
// 
// Возвращаемое значение:
//  Структура:
//  * МЧД - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций.
//  * ТребуетсяПроверкаМЧДНаКлиенте - Булево - Флаг устанавливается в Истина, 
//                                             если отсутствует возможность проверить подпись МЧД на сервере 
//                                             (в настройках установлена проверка подписи на клиенте) 
//                                             и необходимо выполнить проверку на клиенте.
//  * ДанныеДляПроверки - Неопределено
//  					- См. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД
//  * ТекстОшибки - Строка
Функция ЗагрузитьМЧДИзФайла(АдресХранилища, ТребуетсяПроверкаМЧДНаКлиенте = Ложь, ОбновлятьСуществующий = Ложь,
	ДополнительныеСведения = Неопределено) Экспорт
	
	ТребуетсяПроверкаМЧДНаКлиенте = Ложь;
	
	Результат = Новый Структура;
	Результат.Вставить("МЧД", Неопределено);
	Результат.Вставить("ТребуетсяПроверкаМЧДНаКлиенте", ТребуетсяПроверкаМЧДНаКлиенте);
	Результат.Вставить("ДанныеДляПроверки", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	
	Если ТипЗНч(АдресХранилища) = Тип("Структура") Тогда
		Данные = АдресХранилища;
	Иначе
		Данные = ПрочитатьАрхив(АдресХранилища);
	КонецЕсли;
	
	Если Данные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	РезультатЧтения = ДанныеXMLМЧД(Данные.ДанныеДоверенности);
	
	Если НЕ РезультатЧтения.Успех Тогда
		Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Если ДополнительныеСведения = Неопределено Тогда
		ДополнительныеСведения = МашиночитаемыеДоверенностиКлиентСервер.ДополнительныеСведенияПоЗагрузкеМЧД();
	КонецЕсли;
	ДополнительныеСведения.ДатаЗагрузки = ТекущаяДатаСеанса();
	
	ЭтоФормат003 = 
		ВерсияФорматаОбъектаМЧД(РезультатЧтения.ДанныеДоверенности) = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003();

	Если ЭтоФормат003 Тогда
		Возврат Справочники.МЧД003.ЗагрузитьМЧДИзФайла(АдресХранилища,, ДополнительныеСведения); 
	Иначе
		
		ДанныеДоверителей = ИННКППДоверителей(Данные.ДанныеДоверенности);
		
		ИННОрганизации = ДанныеДоверителей.ИННЮЛ;
		Если Не ЗначениеЗаполнено(ДанныеДоверителей.ИННЮЛ)
			И ЗначениеЗаполнено(ДанныеДоверителей.ИННФЛ) Тогда
			ИННОрганизации = ДанныеДоверителей.ИННФЛ;
		КонецЕсли;
		
		Организация = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект("Организации", , Новый Структура("ИНН", ИННОрганизации));
		СубъектЕстьСредиОрганизаций = ЗначениеЗаполнено(Организация);
		Если СубъектЕстьСредиОрганизаций Или ДополнительныеСведения.ЭтоМЧДОрганизации Тогда
			
			Если Не Справочники.МашиночитаемыеДоверенностиОрганизаций.ЕстьПравоИзменения() Тогда
				Результат.ТекстОшибки = НСтр("ru='У пользователя нет прав на создание МЧД Организации 002 формата'");
				Возврат Результат;
			КонецЕсли;
			
			Возврат Справочники.МашиночитаемыеДоверенностиОрганизаций.ЗагрузитьМЧДИзФайла(
				АдресХранилища,, ДополнительныеСведения);
		Иначе
			Возврат Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЗагрузитьМЧДИзФайла(
				АдресХранилища,, ДополнительныеСведения);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
// Возвращает подстроку, характерную для пространства имен МЧД.
// 
// Возвращаемое значение:
//  Строка
Функция ПространствоИмен_МЧД() Экспорт
	
	Возврат "ON_DOVBB";
	
КонецФункции

Функция ЭтоПространствоИменМЧД(ПространствоИмен) Экспорт
	Возврат СтрНачинаетсяС(ПространствоИмен, ПространствоИмен_МЧД())
			Или СтрНачинаетсяС(ПространствоИмен, ПространствоИмен_МЧД_003());
КонецФункции

Функция ЗначениеАтрибутаУзла(ЧтениеXML, ИмяУзла, ИмяАтрибута) Экспорт
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = ИмяУзла Тогда
			Возврат ЧтениеXML.ЗначениеАтрибута(ИмяАтрибута);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область События

Процедура ПередЗаписьюДоверенностиВЖурнал(Источник, Отказ)
	ПараметрыЗаписи = ПолучитьПараметрыЗаписиВЖурналМЧД(Источник);
	Если ПараметрыЗаписи.ИзменилсяХеш Тогда
		РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.УдалитьЗапись(ПараметрыЗаписи.ПредыдущееЗначениеХеша);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

// возвращает результат чтения данных xml файла МЧД.
//
// Параметры:
//  ДанныеXML - ДвоичныеДанные - Двоичные данные xml файла машиночитаемой доверенности.
//
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ДанныеДоверенности - ОбъектXDTO, Неопределено - в случае неудачного чтения данных - Неопределено
//  * ТекстОшибки - Строка
//
Функция ДанныеXMLМЧД(Знач ДанныеXML)
	
	Результат = Новый Структура("Успех, ДанныеДоверенности, ТекстОшибки", Ложь, Неопределено, "");
	
	ИмяТипа = "Файл";
	ПространствоИмен = "";
	ВидОперации = НСтр("ru = 'Чтение данных машиночитаемой доверенности.'");
	
	Попытка
		
		ПространствоИмен = ВерсияФорматаФайлаМЧД(ДанныеXML);
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки, ТекстОшибки);
		Результат.ТекстОшибки =
			НСтр("ru = 'Не удалось прочитать данные доверенности. Подробности в журнале регистрации'");
		Возврат Результат;
		
	КонецПопытки;
	
	Если ПространствоИмен = ПилотныйФорматМЧД()
		Или ПространствоИмен = ФорматМЧД_2022()
		Или ПространствоИмен = ФорматМЧД_2022_Версия_002()
		Или ПространствоИмен = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
			ИмяТипа = "Доверенность";
	ИначеЕсли ПространствоИмен = ФорматМЧД_b2g() Тогда
		ТекстОшибки = ТекстОшибкиЗагрузкиДоверенности_B2G();
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки);
		Результат.ТекстОшибки = ТекстОшибки;
		Возврат Результат;
	Иначе
		ТекстОшибки = ТекстОшибкиЗагрузкиДоверенностиДругогоФормата();
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки);
		Результат.ТекстОшибки = ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Кодировка = КодировкаИзОбъявленияXML(ДанныеXML); // для поддержки устаревших версий МЧД
	Если ПустаяСтрока(Кодировка) Тогда
		Кодировка = "windows-1251";
	КонецЕсли;
	Данные = ДобавитьПространствоИмен(ДанныеXML, ПространствоИмен, Кодировка);
	Объект = ОбъектXDTOИзДанныхXML(Данные, ПространствоИмен, ИмяТипа, Кодировка);
	Результат.ДанныеДоверенности = Объект;
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  СвойстваСервераМЧД - см. СвойстваСервераМЧД
//  ЗапросHTTP - HTTPЗапрос
//
// Возвращаемое значение:
//  HTTPОтвет
//
Функция ОтправитьЗапросДляОбработки(СвойстваСервераМЧД, ЗапросHTTP)

	ОписаниеСоединения =
		ОписаниеHTTPСоединения(СвойстваСервераМЧД.АдресСервераБезАутентификации, 30);
	
	Результат = ВызватьHTTPМетод(ОписаниеСоединения, ЗапросHTTP,
		"POST",  НСтр("ru = 'Запрос данных с узла ФНС'"));
	
	Возврат Результат.Ответ;
	
КонецФункции

// Параметры:
//  СвойстваСервераМЧД - см. СвойстваСервераМЧД
//  ЗапросHTTP - HTTPЗапрос
//
// Возвращаемое значение:
//  HTTPОтвет
//
Функция ПолучитьОтвет(СвойстваСервераМЧД, ЗапросHTTP)

	ОписаниеСоединения =
		ОписаниеHTTPСоединения(СвойстваСервераМЧД.АдресСервераБезАутентификации, 30);
	Результат = ВызватьHTTPМетод(ОписаниеСоединения, ЗапросHTTP,
		"GET",  НСтр("ru = 'Запрос данных с узла ФНС'"));
	
	Возврат Результат.Ответ;
	
КонецФункции


// Имеется право изменения машиночитаемой доверенности
//
// Возвращаемое значение:
//  Булево
Функция ИмеетсяПравоИзмененияМЧД() Экспорт
	
	ИмеетсяПравоИзменения = Справочники.МЧД003.ЕстьПравоИзменения()
		Или Справочники.МашиночитаемыеДоверенностиОрганизаций.ЕстьПравоИзменения()
		Или Справочники.МашиночитаемыеДоверенностиКонтрагентов.ЕстьПравоИзменения();
	
	Возврат ИмеетсяПравоИзменения;
	
КонецФункции

// Получает реквизиты для выгрузки данных доверенностей
//
// Параметры:
//  Доверенность - СправочникСсылка.МЧД003,
//  				СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  
// Возвращаемое значение:
//  Структура:
//   * ЭлектроннаяПодпись - ДвоичныеДанные
//   						# ХранилищеЗначения
//   * Подписана - Булево
//   * XMLфайлМЧД - ХранилищеЗначения
//
Функция РеквизитыДляВыгрузкиДанныхДоверенности(Доверенность)
		
	Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
		
		Подписи = Справочники.МЧД003.ПодписиДоверенности(Доверенность);
		Подписана = ЗначениеЗаполнено(Подписи);
		Подпись = Неопределено;
		
		Если Подписана Тогда
			Подпись = Подписи[0];
		КонецЕсли;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Доверенность, "ФайлМЧД");
		ЗначенияРеквизитов.Вставить("ЭлектроннаяПодпись", Подпись);
		ЗначенияРеквизитов.Вставить("Подписана", Подписана);
		ЗначенияРеквизитов.Вставить("XMLфайлМЧД", ЗначенияРеквизитов.ФайлМЧД);
		
	Иначе
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Доверенность, "ЭлектроннаяПодпись, XMLфайлМЧД, Подписана");
		
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает данные файлов из архива с машиночитаемой доверенностью и подписью.
//
// Параметры:
//  ДанныеАрхива - ДвоичныеДанные, Строка - Двоичные данные архива или адрес во временном хранилище.
//
// Возвращаемое значение:
//  - Неопределено
//  - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД
Функция ПрочитатьАрхив(ДанныеАрхива) Экспорт
	
	ВидОперации = НСтр("ru = 'Чтение архива машиночитаемой доверенности'");
	Если ТипЗнч(ДанныеАрхива) = Тип("Строка") Тогда
		ДвоичныеДанныеАрхива = ПолучитьИзВременногоХранилища(ДанныеАрхива);
	Иначе
		ДвоичныеДанныеАрхива = ДанныеАрхива;
	КонецЕсли;
	
	РезультатЧтения = ПрочитатьАрхивДоверенности(ДвоичныеДанныеАрхива);
	Если РезультатЧтения.ОшибкаДоступаНаLinux Тогда
		
		ИсправленныеДанныАрхива = ИсправитьСигнатуруАрхиваДляЧтенияВLinux(ДвоичныеДанныеАрхива);
		Если ТипЗнч(ИсправленныеДанныАрхива) = Тип("ДвоичныеДанные") Тогда
			РезультатЧтения = ПрочитатьАрхивДоверенности(ИсправленныеДанныАрхива);
		Иначе
			
			ТекстОшибки = НСтр("ru = 'Не удалось прочитать файл машиночитаемой доверенности.'");
			ПодробныйТекстОшибки = ИсправленныеДанныАрхива;
			ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(НСтр("ru = 'Чтение архива машиночитаемой доверенности'"),
				ПодробныйТекстОшибки, ТекстОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеФайлов = РезультатЧтения.ДанныеФайлов;
	Если ДанныеФайлов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоФормат003 = ВерсияФорматаФайлаМЧД(ДанныеФайлов.ДанныеДоверенности)
		= МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003();
	Если ДанныеФайлов.ПодписиДоверенности.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'В архиве отсутствует подпись'");
	ИначеЕсли ДанныеФайлов.ПодписиДоверенности.Количество() > 1 И Не ЭтоФормат003 Тогда
		ТекстОшибки = НСтр("ru = 'В архиве несколько файлов подписи'");
	Иначе
		ТекстОшибки = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки, ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляЗагрузкиМЧД = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД();
	ДанныеДляЗагрузкиМЧД.ДанныеДоверенности = ДанныеФайлов.ДанныеДоверенности;
	ДанныеДляЗагрузкиМЧД.ДанныеПодписи = ДанныеФайлов.ПодписиДоверенности[0];
	ДанныеДляЗагрузкиМЧД.ДанныеПодписей = ДанныеФайлов.ПодписиДоверенности;
	Если ЗначениеЗаполнено(ДанныеФайлов.ПодписиЗаявленияНаОтмену) Тогда
		ДанныеДляЗагрузкиМЧД.ДанныеПодписиЗаявленияНаОтмену = ДанныеФайлов.ПодписиЗаявленияНаОтмену[0];
	КонецЕсли;
	
	Возврат ДанныеДляЗагрузкиМЧД;
	
КонецФункции

// Параметры:
//  ДвоичныеДанныеАрхива - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Структура:
//  * ОшибкаДоступаНаLinux - Булево
//  * ДанныеФайлов - Неопределено
//                 - Структура:
//                    ** ДанныеДоверенности - ДвоичныеДанные
//                    ** ПодписиДоверенности - Массив Из ДвоичныеДанные
//                    ** ПодписиЗаявленияНаОтмену - Массив Из ДвоичныеДанные
Функция ПрочитатьАрхивДоверенности(ДвоичныеДанныеАрхива)
	
	Результат = Новый Структура;
	Результат.Вставить("ОшибкаДоступаНаLinux", Ложь);
	Результат.Вставить("ДанныеФайлов", Неопределено);
	
	ВидОперации = НСтр("ru = 'Чтение архива машиночитаемой доверенности'");
	ШаблонОшибки = НСтр("ru = 'Ошибка при чтении архива: %1'");
	
	ВременныйКаталог = ЭлектронныеДокументыСлужебный.РабочийКаталог();
	
	Попытка
		ЧтениеZipФайла = Новый ЧтениеZipФайла(ДвоичныеДанныеАрхива.ОткрытьПотокДляЧтения());
		ЧтениеZipФайла.ИзвлечьВсе(ВременныйКаталог);
		ЧтениеZipФайла.Закрыть();
	Исключение
		КраткийТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось распаковать архив машиночитаемой доверенности по причине %1'"), КраткийТекстОшибки);
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки);
		УдалитьФайлы(ВременныйКаталог);
		Возврат Результат;
	КонецПопытки;
	
	ФайлыXML = НайтиФайлы(ВременныйКаталог, "*.xml", Истина);
	
	ФайлыДоверенностей = Новый Массив;
	Для Каждого ФайлВАрхиве Из ФайлыXML Цикл 
		ЭтоКвитанция = СтрНачинаетсяС(НРег(ФайлВАрхиве.Имя), НРег("Квит_"));
		ЭтоЗаявлениеНаОтмену = СтрНачинаетсяС(НРег(ФайлВАрхиве.Имя), НРег("ЗаявОтм_"));
		Если Не ЭтоКвитанция
			И Не ЭтоЗаявлениеНаОтмену Тогда
				ФайлыДоверенностей.Добавить(ФайлВАрхиве);
		КонецЕсли;
	КонецЦикла;
	
	ФайлыXML = ФайлыДоверенностей;

	Если ФайлыXML.Количество() <> 1 Тогда
		Если ФайлыXML.Количество() = 0 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки,
				НСтр("ru = 'нет файла xml'"));
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки,
				НСтр("ru = 'несколько файлов xml'"));
		КонецЕсли;
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки, ТекстОшибки);
		УдалитьФайлы(ВременныйКаталог);
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		ДанныеДоверенности = Новый ДвоичныеДанные(ФайлыXML[0].ПолноеИмя);
	Исключение
		Если ЭтоLinuxСервер() Тогда
			Результат.ОшибкаДоступаНаLinux = Истина;
		Иначе
			ТекстОшибки = НСтр("ru = 'Не удалось прочитать xml файл по причине:'")
				+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭлектронныеДокументыСлужебныйВызовСервера.ЗаписатьВЖурналРегистрации(ТекстОшибки, 2, "Ошибка");
		КонецЕсли;
		УдалитьФайлы(ВременныйКаталог);
		Возврат Результат;
	КонецПопытки;
	
	МассивРасширений = РасширенияФайловПодписи();
	Для Индекс = 0 По МассивРасширений.ВГраница() Цикл
		МассивРасширений[Индекс] = СтрШаблон("*.%1", МассивРасширений[Индекс]);
	КонецЦикла;
	
	ДанныеФайлов = Новый Структура;
	ДанныеФайлов.Вставить("ДанныеДоверенности", ДанныеДоверенности);
	ДанныеФайлов.Вставить("ПодписиДоверенности", Новый Массив);
	ДанныеФайлов.Вставить("ПодписиЗаявленияНаОтмену", Новый Массив);
	Результат.ДанныеФайлов = ДанныеФайлов;
	
	Для Каждого РасширениеПодписи Из МассивРасширений Цикл
		// обход ошибки платформы 60003608
		ВсеФайлыСРасширением = НайтиФайлы(ВременныйКаталог, РасширениеПодписи, Истина);
		Для Индекс = 0 По ВсеФайлыСРасширением.ВГраница() Цикл
			
			ЭтоПодписьКвитанции = СтрНачинаетсяС(НРег(ВсеФайлыСРасширением[Индекс].Имя), НРег("Квит_"));
			Если ЭтоПодписьКвитанции Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоЗаявлениеНаОтмену = СтрНачинаетсяС(НРег(ВсеФайлыСРасширением[Индекс].Имя), НРег("ЗаявОтм_"));
			Если ЭтоЗаявлениеНаОтмену Тогда
				ЗаполняемаяКоллекция = ДанныеФайлов.ПодписиЗаявленияНаОтмену;
			Иначе
				ЗаполняемаяКоллекция = ДанныеФайлов.ПодписиДоверенности;
			КонецЕсли;
			
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ВсеФайлыСРасширением[Индекс].ПолноеИмя);
			ДанныеПодписи = МашиночитаемыеДоверенностиКлиентСервер.ДекодированныеДвоичныеДанные(ДвоичныеДанныеФайла);
			
			Если ЗаполняемаяКоллекция.Найти(ДанныеПодписи) = Неопределено Тогда
				ЗаполняемаяКоллекция.Добавить(ДанныеПодписи);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;

	ЭлектронныеДокументыКлиентСервер.УстановитьТолькоЧтениеВсемФайламВКаталоге(ВременныйКаталог, Ложь);	
	УдалитьФайлы(ВременныйКаталог);
	
	Возврат Результат;
	
КонецФункции

// Получает значение передоверия из представления реестра ФНС
//
// Параметры:
//  ЗначениеПередоверия - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ПередовериеВозможно(ЗначениеПередоверия)
	
	ПередовериеВозможно = Ложь;
	
	Если ЗначениеПередоверия = "3" Или ЗначениеПередоверия = "1"  Тогда
		ПередовериеВозможно = Истина;
	КонецЕсли;
	
	Возврат ПередовериеВозможно;
	
КонецФункции

Функция ТекстОшибкиЗагрузкиДоверенности_B2G()
	Возврат НСтр("ru = 'Загружаемая доверенность, предназначена для передачи в адрес налоговых органов.
						|Такая доверенность не может быть использована при обмене с контрагентами.
						|Выберите для загрузки доверенность подходящего назначения.'");
КонецФункции

Функция ТекстОшибкиЗагрузкиДоверенностиДругогоФормата()
	Возврат НСтр("ru = 'Формат загружаемой доверенности не поддерживается в текущей версии программы.
						|Обновитесь до актуальной версии и повторите загрузку.'");
КонецФункции

// Получает МЧД контрагента по номеру доверенности
//
// Параметры:
//  НомерДоверенности - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
Функция ПолучитьМЧДКонтрагента(НомерДоверенности) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка КАК Доверенность
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК МашиночитаемыеДоверенностиКонтрагентов
		|ГДЕ
		|	МашиночитаемыеДоверенностиКонтрагентов.НомерДоверенности = &НомерДоверенности";
	Запрос.УстановитьПараметр("НомерДоверенности", НомерДоверенности);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Доверенность;
	
КонецФункции

// Загружает родительские доверенности для данной доверенности
//
// Параметры:
// Записывает результат проверки в элемент справочника машиночитаемой доверенности.
//
// Параметры:
//  МЧД - ОпределяемыйТип.МашиночитаемаяДоверенность
//
Процедура ЗагрузитьРодительскиеДоверенности(МЧД) Экспорт
	
	Если Не ЗначениеЗаполнено(МЧД) Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеРодительскойДоверенности = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МЧД, 
		"НомерРодительскойДоверенности, ИННДоверителяРодительскойДоверенности");
	
	Если Не ЗначениеЗаполнено(ДанныеРодительскойДоверенности.НомерРодительскойДоверенности) Тогда
		Возврат;
	КонецЕсли;
	
	НаборДанныхМЧД = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(НовыеДанныеДоверенности());
	НаборДанныхМЧД[0].НомерДоверенности = ДанныеРодительскойДоверенности.НомерРодительскойДоверенности;
	НаборДанныхМЧД[0].ИННДоверителя     = ДанныеРодительскойДоверенности.ИННДоверителяРодительскойДоверенности;

	Если ЭтоМЧДКонтрагента(МЧД) Тогда
		СведенияОСтатусахДоверенностейКонтрагентов(НаборДанныхМЧД);
	Иначе
		СведенияОСтатусахДоверенностейОрганизаций(НаборДанныхМЧД);
	КонецЕсли;
	
КонецПроцедуры

// Получает родительские данные доверенности
//
// Параметры:
//  НомерДоверенности - Строка
//  ИННДоверителя - Строка
//  НомераМЧД - Массив из строка, Неопределено
//
// Возвращаемое значение:
//  См. НовыеСведенияМЧД
//
Функция ПолучитьРодительскиеДанныеДоверенности(НомерДоверенности,
	ИННДоверителя, НомераМЧД = Неопределено)
	
	Если НомераМЧД = Неопределено Тогда
		НомераМЧД = Новый Массив();
	КонецЕсли;
	
	НомераМЧД.Добавить(НомерДоверенности);

	СведенияМЧД = НовыеСведенияМЧД();

	Доверенности = НайтиДоверенности(НомерДоверенности, ИННДоверителя, Справочники.МашиночитаемыеДоверенностиОрганизаций);
	Если Доверенности.Количество() > 0 Тогда
		Доверенность = Доверенности[0];
		СправочникМЧД = СправочникМЧД(Доверенность); 
		
		Если СправочникМЧД.ЭтоНереестроваяМЧД(Доверенность) Тогда
			СведенияМЧД = СправочникМЧД.СведенияМЧД(Доверенность);
			Если ЗначениеЗаполнено(СведенияМЧД)
				И ЗначениеЗаполнено(СведенияМЧД.НомерРодительскойДоверенности) 
				И НомераМЧД.Найти(СведенияМЧД.НомерРодительскойДоверенности) = Неопределено Тогда
				
				СведенияМЧД.РодительскиеДанныеМЧД = ПолучитьРодительскиеДанныеДоверенности(
					СведенияМЧД.НомерРодительскойДоверенности,
					СведенияМЧД.ИННДоверителяРодительскойДоверенности, НомераМЧД);
			КонецЕсли;		
			Возврат СведенияМЧД;
		КонецЕсли; 
	КонецЕсли;
	
	СведенияДоверенности = МашиночитаемыеДоверенностиПовтИсп.ПолучитьСведенияДоверенностиНаСервереМЧД(
		НомерДоверенности, ИННДоверителя);
	
	
	СведенияМЧД.НомерДоверенности = НомерДоверенности;
	СведенияМЧД.ИННДоверителя = ИННДоверителя;
	СведенияМЧД.ДатаЗагрузкиИзРеестраРодительскихДанных = СведенияДоверенности.ДатаЗагрузкиИзРеестра;
		
	Если ЗначениеЗаполнено(СведенияДоверенности.ПолныеДанные) Тогда
		
		ДанныеДляЗагрузки = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД();
		ДанныеДляЗагрузки.ДанныеДоверенности = СведенияДоверенности.ПолныеДанные.ДанныеВыгрузки;
		ДанныеДляЗагрузки.ДанныеПодписи = СведенияДоверенности.ПолныеДанные.ДанныеПодписи;
		ДанныеДляЗагрузки.ДанныеПодписиЗаявленияНаОтмену = СведенияДоверенности.ПолныеДанные.ДанныеПодписиЗаявленияНаОтмену;
		
		ДатаЗагрузки = СведенияДоверенности.ДатаЗагрузкиИзРеестра;
		СтатусВРеестреФНС = 
			МашиночитаемыеДоверенностиКлиентСервер.СтатусВРеестреФНС(
				СведенияДоверенности.ЧастичныеДанные.СтатусДоверенности);
		
		ДополнительныеСведения = МашиночитаемыеДоверенностиКлиентСервер.ДополнительныеСведенияПоЗагрузкеМЧД();
		ДополнительныеСведения.СтатусВРеестреФНС = СтатусВРеестреФНС;
		ДополнительныеСведения.ДатаЗагрузки = ДатаЗагрузки;
			
		РезультатЗагрузки =
			МашиночитаемыеДоверенностиВызовСервера.ЗагрузитьМЧД(ДанныеДляЗагрузки,
				Ложь, Истина, ДополнительныеСведения);
			
		ДанныеИзФайлаОбмена = ДанныеИзФайлаОбмена(СведенияДоверенности.ПолныеДанные.ДанныеВыгрузки);
		ДанныеДоверенности = ДанныеИзФайлаОбмена.ДанныеДоверенности;

		Если ЭтоМЧД003(РезультатЗагрузки.МЧД) Тогда
			СведенияМЧД = Справочники.МЧД003.СведенияМЧД(РезультатЗагрузки.МЧД);
			СведенияМЧД.ДатаЗагрузкиИзРеестраРодительскихДанных = СведенияДоверенности.ДатаЗагрузкиИзРеестра;
		Иначе
			Представители = ДанныеДоверенности.Представители;
			
			Для Каждого Представитель Из Представители Цикл
				
				Если Представитель.ТипУполномоченногоПредставителя = "ЮЛ"
					Или Представитель.ТипУполномоченногоПредставителя = "ИО" Тогда
					СведенияМЧД.ИННПредставителей.Добавить(Представитель.ПредставительЮЛ_ИНН);
				Иначе
					СведенияМЧД.ИННПредставителей.Добавить(Представитель.ПредставительФЛ_ИНН);
				КонецЕсли;
				
			КонецЦикла;
			
			СведенияМЧД.Ссылка = РезультатЗагрузки.МЧД;
			СведенияМЧД.СтатусВРеестреФНС = СтатусВРеестреФНС;
			СведенияМЧД.ДатаПолученияСведений = СведенияДоверенности.ДатаЗагрузкиИзРеестра;
			СведенияМЧД.Верна = Истина;
			СведенияМЧД.ДатаВыдачи = ДанныеДоверенности.ДатаВыдачи;
			СведенияМЧД.ДатаОкончания = ДанныеДоверенности.ДатаОкончания;
			СведенияМЧД.НомерДоверенности = НомерДоверенности;
			СведенияМЧД.НомерРодительскойДоверенности = ДанныеДоверенности.НомерРодительскойДоверенности;
			СведенияМЧД.ИННДоверителя = ИННДоверителя;
			СведенияМЧД.ИННДоверителяРодительскойДоверенности = ДанныеДоверенности.ИННДоверителяРодительскойДоверенности;
			СведенияМЧД.Полномочия = ДанныеДоверенности.Полномочия;
			СведенияМЧД.ПравилоПроверки = РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки(РезультатЗагрузки.МЧД);
			СведенияМЧД.ТипПередоверия = ДанныеДоверенности.ТипПередоверия;
			СведенияМЧД.Подписана = ЗначениеЗаполнено(СведенияДоверенности.ПолныеДанные.ДанныеПодписи)
				И ЗначениеЗаполнено(СведенияДоверенности.ПолныеДанные.ДанныеВыгрузки);
				ЗаполнитьРеквизитыОтзыва(СведенияМЧД, ДанныеДляЗагрузки);
		КонецЕсли;

		
				
		Если ЗначениеЗаполнено(СведенияМЧД.НомерРодительскойДоверенности)
			И НомераМЧД.Найти(СведенияМЧД.НомерРодительскойДоверенности) = Неопределено Тогда
			СведенияМЧД.РодительскиеДанныеМЧД = ПолучитьРодительскиеДанныеДоверенности(
				СведенияМЧД.НомерРодительскойДоверенности, СведенияМЧД.ИННДоверителяРодительскойДоверенности, НомераМЧД);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СведенияМЧД;
	
КонецФункции

// Получает полные данные доверенности на сервере МЧД.
// 
// Параметры:
//  НомерДоверенности - Строка - Номер доверенности
//  ИННДоверителя - Строка - ИНН доверителя
//  ТокенДоступа - Строка - Токен доступа
// 
// Возвращаемое значение:
//  Структура - Полные данные доверенности:
//   * ДанныеВыгрузки - ДвоичныеДанные, Неопределено - Данные выгрузки
//   * ДанныеПодписи - ДвоичныеДанные, Неопределено - Данные подписи
//   * ДанныеПодписиЗаявленияНаОтмену - ДвоичныеДанные, Неопределено - Данные подписи заявления на отмену
//   * ДанныеАрхива - ДвоичныеДанные, Неопределено - Данные архива
//   * СтатусПолучения - Строка - Статус получения
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//   * ТекстОшибки - Строка - Текст ошибки при успешном ответе сервера на запрос
//
Функция ПолучитьПолныеДанныеДоверенностиНаСервереМЧД(НомерДоверенности, ИННДоверителя, ТокенДоступа = "")
	
	Если НЕ ЗначениеЗаполнено(ТокенДоступа) Тогда
		ТокенДоступа = АвторизоватьсяНаСервереМЧД().ТокенДоступа;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеВыгрузки", Неопределено);
	Результат.Вставить("ДанныеПодписи", Неопределено);
	Результат.Вставить("ДанныеАрхива", Неопределено);
	Результат.Вставить("ДанныеПодписиЗаявленияНаОтмену", Неопределено);
	Результат.Вставить("СтатусПолучения", "");
	Результат.Вставить("ТекстОтвета", "");
	Результат.Вставить("ТекстОшибки", "");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен статус запроса данных доверенности с сервера МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось получить данные доверенности с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось получить данные доверенности с сервера МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при получении данных доверенности с сервера МЧД распределенного реестра. %1'");
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок, КодыОшибокДоступа());
	ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСоответствие(ШаблоныОшибок.ШаблоныДляКодовОшибок,
		КодыОшибокОтзыва(НомерДоверенности));
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/poazip?poaNumber=" + НомерДоверенности + ?(ИННДоверителя = Неопределено, "", "&issuerInn=" + ИННДоверителя),
		"/poar-webapp/integration/poa/" + НомерДоверенности
			+ ?(ИННДоверителя = Неопределено, "", "/" + ИННДоверителя) + "/zip");
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	ЗаголовкиHTTP.Вставить(?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI, "authorizationtoken", "authorization"),
		"Bearer " + ТокенДоступа);
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере, ЗаголовкиHTTP);
	
	Попытка
		ОтветHTTP = ПолучитьОтвет(СвойстваСервераМЧД, ЗапросHTTP);
	Исключение
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Если НРег(ОтветHTTP.Заголовки["Content-Type"]) = "application/zip"
		ИЛИ НРег(ОтветHTTP.Заголовки["content-type"]) = "application/zip"
		ИЛИ НРег(ОтветHTTP.Заголовки["Content-Type"]) = "multipart"
		ИЛИ НРег(ОтветHTTP.Заголовки["content-type"]) = "multipart"
		ИЛИ НРег(Лев(ОтветHTTP.Заголовки["Content-Disposition"], 10)) = "attachment"
		ИЛИ НРег(Лев(ОтветHTTP.Заголовки["content-disposition"], 10)) = "attachment" Тогда
		
		Попытка
			
			Результат.ДанныеАрхива = ОтветHTTP.ПолучитьТелоКакДвоичныеДанные();
				
			РезультатРаспаковкиАрхива = РаспаковатьАрхивСМЧДИзПолныхДанных(Результат.ДанныеАрхива);
			
			Результат.ДанныеВыгрузки = РезультатРаспаковкиАрхива.ДанныеДоверенности;
			Результат.ДанныеПодписи = РезультатРаспаковкиАрхива.ДанныеПодписи;
			Результат.ДанныеПодписиЗаявленияНаОтмену = РезультатРаспаковкиАрхива.ДанныеПодписиЗаявленияНаОтмену;
		
		Исключение
			
			ВывестиИЗаписатьОшибкуМЧД(Новый Структура("ШаблонОшибкиИзИсключения",
				НСтр("ru = 'Не удалось распаковать ответ при получении данных доверенности с сервера МЧД: %1'")));
			Возврат Результат;
		КонецПопытки;
		
		Если Результат.ДанныеВыгрузки = Неопределено Тогда
			
			ВывестиИЗаписатьОшибкуМЧД(Новый Структура("ТекстОшибкиПоУмолчанию",
				НСтр("ru = 'Не получены данные доверенности с сервера МЧД'")));
			Возврат Результат;
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета	= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Результат.СтатусПолучения = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("reqStatus"),
			СтруктураОтвета.reqStatus, "");
		Если Результат.СтатусПолучения = "PENDING" Тогда
			Результат.ТекстОшибки = 
				НСтр("ru='Операция выполняется, идет запрос данных с узла ФНС. Повторите попытку позже.'");
		КонецЕсли;
	Исключение
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать ответ при получении данных доверенности с сервера МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если НЕ ЗначениеЗаполнено(Результат.СтатусПолучения) Тогда
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Производит распаковку полных данных доверенности, полученных с узла распределенного реестра МЧД.
// 
// Параметры:
//  ДанныеАрхива - ДвоичныеДанные - Данные архива
// 
// Возвращаемое значение:
//  Структура:
//   * ДанныеДоверенности - ДвоичныеДанные, Неопределено - Данные доверенности
//   * ДанныеПодписи - ДвоичныеДанные, Неопределено - Данные подписи доверенности
//   * ДанныеЗаявленияНаОтмену - ДвоичныеДанные, Неопределено - Данные заявления на отмену
//   * ДанныеПодписиЗаявленияНаОтмену - ДвоичныеДанные, Неопределено - Данные подписи заявления на отмену
//
Функция РаспаковатьАрхивСМЧДИзПолныхДанных(ДанныеАрхива)
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеДоверенности", Неопределено);
	Результат.Вставить("ДанныеПодписи", Неопределено);
	Результат.Вставить("ДанныеЗаявленияНаОтмену", Неопределено);
	Результат.Вставить("ДанныеПодписиЗаявленияНаОтмену", Неопределено);
		
	ОбъектЧтение = Новый ЧтениеZipФайла(ДанныеАрхива.ОткрытьПотокДляЧтения());
	Если ОбъектЧтение.Элементы.Количество() <> 0 Тогда

		КаталогРаспаковки = ЭлектронныеДокументыСлужебный.РабочийКаталог();

		Для Каждого ЭлементАрхива Из ОбъектЧтение.Элементы Цикл

			РасширениеЭлемента = НРег(ЭлементАрхива.Расширение);

			ЭтоИмяФайлаДоверенности = ЭтоИмяФайлаДоверенности(ЭлементАрхива.Имя);
			
			ЭтоДоверенность = РасширениеЭлемента = "xml" И ЭтоИмяФайлаДоверенности;
			
			ЭтоПодписьДоверенности = ЭтоРасширениеФайлаПодписи(РасширениеЭлемента) И ЭтоИмяФайлаДоверенности;

			ЭтоИмяФайлаЗаявленияНаОтмену = ЭтоИмяФайлаЗаявленияНаОтмену(ЭлементАрхива.Имя);
			ЭтоПодписьЗаявленияНаОтмену = ЭтоРасширениеФайлаПодписи(РасширениеЭлемента)
				И ЭтоИмяФайлаЗаявленияНаОтмену;

			ОбъектЧтение.Извлечь(ЭлементАрхива, КаталогРаспаковки, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			
			Если ЭтоДоверенность Или ЭтоПодписьДоверенности Или ЭтоПодписьЗаявленияНаОтмену Тогда
				
				ДвоичныеДанные = Новый ДвоичныеДанные(КаталогРаспаковки + ЭлементАрхива.Имя);
				
				Если ЭтоДоверенность Тогда
					Результат.ДанныеДоверенности = ДвоичныеДанные;
				Иначе
					ДанныеПодписи = МашиночитаемыеДоверенностиКлиентСервер.ДекодированныеДвоичныеДанные(ДвоичныеДанные);
					Если ЭтоПодписьДоверенности Тогда
						Результат.ДанныеПодписи = ДанныеПодписи;
					Иначе
						Результат.ДанныеПодписиЗаявленияНаОтмену = ДанныеПодписи;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Результат.ДанныеДоверенности = Неопределено Тогда // Не удалось найти файлы МЧД по префиксам.
			
			НаименованиеФайлаДоверенности = "";
			НаименованиеФайлаЗаявленияНаОтмену = "";
			
			Для Каждого ЭлементАрхива Из ОбъектЧтение.Элементы Цикл // Ищем доверенности или заявления на отмену
				Если НРег(ЭлементАрхива.Расширение) = "xml" Тогда
					
					ДвоичныеДанные = Новый ДвоичныеДанные(КаталогРаспаковки + ЭлементАрхива.Имя);
					
					ЭтоМЧД = Ложь;
					Попытка
						ЭтоМЧД = ЗначениеЗаполнено(ВерсияФорматаФайлаМЧД(ДвоичныеДанные));
					Исключение
						ВывестиИЗаписатьОшибкуМЧД(Новый Структура("ШаблонОшибкиИзИсключения", НСтр(
							"ru = 'Не удалось распаковать ответ при получении данных доверенности с сервера МЧД: %1'")));
						Продолжить;
					КонецПопытки;
					
					Если ЭтоМЧД Тогда
						НаименованиеФайлаДоверенности = ЭлементАрхива.ИмяБезРасширения;
						Результат.ДанныеДоверенности = ДвоичныеДанные;
						Продолжить;
					КонецЕсли;
					
					ЭтоЗаявлениеНаОтмену = Ложь;
					Попытка
						ЭтоЗаявлениеНаОтмену = ЭтоЗаявлениеНаОтмену(ДвоичныеДанные);
					Исключение
						ВывестиИЗаписатьОшибкуМЧД(Новый Структура("ШаблонОшибкиИзИсключения", НСтр(
							"ru = 'Не удалось распаковать ответ при получении данных заявления на отмену с сервера МЧД: %1'")));
						Продолжить;
					КонецПопытки;
					
					Если ЭтоЗаявлениеНаОтмену Тогда
						НаименованиеФайлаЗаявленияНаОтмену = ЭлементАрхива.ИмяБезРасширения;
						Результат.ДанныеЗаявленияНаОтмену = ДвоичныеДанные;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ПустаяСтрока(НаименованиеФайлаДоверенности) 
				Или Не ПустаяСтрока(НаименованиеФайлаЗаявленияНаОтмену) Тогда // Ищем подписи доверенности или заявления на отмену
				Для Каждого ЭлементАрхива Из ОбъектЧтение.Элементы Цикл
					Если ЭтоПодписьМЧД(ЭлементАрхива, НаименованиеФайлаДоверенности) Тогда
							ДвоичныеДанные = Новый ДвоичныеДанные(КаталогРаспаковки + ЭлементАрхива.Имя);
							Результат.ДанныеПодписи = МашиночитаемыеДоверенностиКлиентСервер.ДекодированныеДвоичныеДанные(ДвоичныеДанные);
					ИначеЕсли ЭтоПодписьЗаявленияНаОтмену(ЭлементАрхива, НаименованиеФайлаЗаявленияНаОтмену) Тогда
							ДвоичныеДанные = Новый ДвоичныеДанные(КаталогРаспаковки + ЭлементАрхива.Имя);
							Результат.ДанныеПодписиЗаявленияНаОтмену = МашиночитаемыеДоверенностиКлиентСервер.ДекодированныеДвоичныеДанные(ДвоичныеДанные);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаталогРаспаковки) Тогда
		УдалитьФайлы(КаталогРаспаковки);
	КонецЕсли;
	
	ОбъектЧтение.Закрыть();
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак является ли элемент архива файлом подписи МЧД по имени файла.
// 
// Параметры:
//  ЭлементАрхива - ЭлементZipФайла
//  ИмяФайла - Строка
//  
// Возвращаемое значение:
//  Булево
Функция ЭтоПодписьМЧД(ЭлементАрхива, ИмяФайла)
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЭтоРасширениеФайлаПодписи(НРег(ЭлементАрхива.Расширение)) 
		И СтрНачинаетсяС(НРег(ЭлементАрхива.Имя), НРег(ИмяФайла));

КонецФункции 

// Возвращает признак является ли элемент архива файлом подписи заявления на отмену по имени файла.
// 
// Параметры:
//  ЭлементАрхива - ЭлементZipФайла
//  ИмяФайла - Строка
//  
// Возвращаемое значение:
//  Булево
Функция ЭтоПодписьЗаявленияНаОтмену(ЭлементАрхива, ИмяФайла)

	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЭтоРасширениеФайлаПодписи(НРег(ЭлементАрхива.Расширение)) 
		И СтрНачинаетсяС(НРег(ЭлементАрхива.Имя), НРег(ИмяФайла));

КонецФункции 

// Возвращает признак того, что префикс в имени файла относится к МЧД
// 
// Возвращаемое значение:
//  Булево - возвращается Истина, если имя файла начинается с префикса, относящегося к МЧД
Функция ЭтоИмяФайлаДоверенности(ИмяФайла)
	Возврат СтрНачинаетсяС(НРег(ИмяФайла), НРег("Дов_"))
		Или СтрНачинаетсяС(НРег(ИмяФайла), НРег("ON_EMCHD_"));
КонецФункции

// Возвращает признак того, что префикс в имени файла относится к МЧД
// 
// Возвращаемое значение:
//  Булево - возвращается Истина, если имя файла начинается с префикса, относящегося к заявлению на отмену МЧД
Функция ЭтоИмяФайлаЗаявленияНаОтмену(ИмяФайла)
	Возврат СтрНачинаетсяС(НРег(ИмяФайла), НРег("ЗаявОтм_"));
КонецФункции

Функция ТекстОшибкиНеНастроенаАвтопроверка() Экспорт
	Возврат НСтр("ru = 'Не настроены правила проверки полномочий'");
КонецФункции

Функция ТекстПодсказкиСкриптаПроверкиПолномочий() Экспорт
	
	// Текст изменен при адаптации
	
	Возврат ФорматированнаяСтрока(НСтр(
		"ru = '<b>Доступные параметры:</b>
		|  <b>Входные:</b>
		|  Параметры.ЭлектронныйДокумент - Ссылка на электронный документ Входящий или Исходящий
		|  Параметры.Доверенность - Ссылка на доверенность
		|  <b>Выходные:</b>
		|  Параметры.Результат - Структура с полями: Успех - Булево, ТекстОшибки - Строка|
		|
		|<b>Пример скрипта:</b>
		|Если Параметры.ЭлектронныйДокумент.ВидЭД = Перечисления.ВидыЭД.СчетФактура Тогда
		|    Параметры.Результат.Успех = НЕ Параметры.ЭлектронныйДокумент.СуммаДокумента > 1000000;
		|    Если НЕ Параметры.Результат.Успех Тогда
		|        Параметры.Результат.ТекстОшибки = ""Превышена максимально разрешенная доверенностью сумма"";
		|    КонецЕсли;
		|Иначе
		|    Параметры.Результат.ТекстОшибки = ""Не разрешено подписание документов данного вида"";
		|КонецЕсли;'"));
	
КонецФункции

// Проверяет полномочия доверенности по правилам проверки.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  			 - СправочникСсылка.МЧД003
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  					- ДокументСсылка.ЭлектронныйДокументВходящийЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * Выполнено - Булево
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  
Функция ПроверитьПолномочияДоверенности(Доверенность, ЭлектронныйДокумент) Экспорт
	
	ТекстПолномочияНеПодтверждены = НСтр("ru = 'Полномочия не подтверждены правилами проверки'");
	
	Результат = Новый Структура("Выполнено, Успех, ТекстОшибки", Ложь, Ложь, "");
	
	Если Не ПолномочияМЧДУказаныИзКлассификатора(Доверенность) Тогда
		
		// Проверка текстовых полномочий
		
		ПравилоПроверки = РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки(Доверенность);
		
		Если НЕ ЗначениеЗаполнено(ПравилоПроверки) Тогда
			
			ВывестиОшибкуНекорректныхПравилПроверки(Доверенность, ЭлектронныйДокумент);
			Результат.ТекстОшибки = НСтр("ru = 'Проверка полномочий завершилась с ошибкой. Правила настроены некорректно.'");
			Возврат Результат;
			
		КонецЕсли;
		
		Скрипт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоПроверки, "Скрипт");
		
		ПравилоПроверки = РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки(Доверенность);
		
		Если НЕ ЗначениеЗаполнено(ПравилоПроверки) Тогда
			
			ВывестиОшибкуНекорректныхПравилПроверки(Доверенность, ЭлектронныйДокумент);
			Результат.ТекстОшибки = НСтр("ru = 'Проверка полномочий завершилась с ошибкой. Правила настроены некорректно.'");
			Возврат Результат;
			
		КонецЕсли;
		
		Скрипт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоПроверки, "Скрипт");
		
		Если ЗначениеЗаполнено(Скрипт) Тогда
			
			Попытка
				
				ПараметрыПроверки = Новый Структура();
				ПараметрыПроверки.Вставить("Доверенность", Доверенность);
				ПараметрыПроверки.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
				Ответ = Новый Структура("Успех, ТекстОшибки", Ложь, "");
				ПараметрыПроверки.Вставить("Результат", Ответ);
				
				Параметры = ПараметрыПроверки;
				Выполнить Скрипт;
				
				Результат.Выполнено = Истина;
				Результат.Успех = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Ответ, "Успех", Ложь);
				Результат.ТекстОшибки = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Ответ, "ТекстОшибки", "");
				
				Если НЕ Результат.Успех Тогда
					
					Если ПустаяСтрока(Результат.ТекстОшибки) Тогда
						Результат.ТекстОшибки = ТекстПолномочияНеПодтверждены;
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВидОперации = НСтр("ru = 'Проверка полномочий доверенности.'");
				ШаблонСообщения =
					Нстр("ru = 'Ошибка при выполнении алгоритма проверки полномочий доверенности: %1 для документа: %2'");
				Сообщение = СтрШаблон(ШаблонСообщения, Доверенность, ЭлектронныйДокумент);
				ПодробныйТекстОшибки = Сообщение + Символы.ПС + ТекстОшибки; 
				ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, Сообщение);
				Результат.ТекстОшибки = НСтр("ru = 'Проверка полномочий завершилась с ошибкой.
					|Возможно правила настроены некорректно.'");
				
			КонецПопытки;
			
		Иначе // Упрощенная настройка
			
			ТаблицаНастроек = Справочники.ПравилаПроверкиПолномочийМЧД.ТаблицаНастроекОтбора(ПравилоПроверки);
			ТаблицаНастроек.Колонки.Добавить("УсловиеВыполнено", Новый ОписаниеТипов("Булево"));
			Результат.Выполнено = Истина;
			
			Если ТаблицаНастроек.Количество() > 0 Тогда
				
				МассивПолей = ТаблицаНастроек.ВыгрузитьКолонку("ИмяПоляДанных");
				ПоляСтрокой = СтрСоединить(МассивПолей, ",");
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент, ПоляСтрокой);
				
				Для Каждого СтрокаТЗНастроек Из ТаблицаНастроек Цикл
					
					СвойствоДокумента = Неопределено;
					РеквизитыДокумента.Свойство(СтрокаТЗНастроек.ИмяПоляДанных, СвойствоДокумента);
					Список = СтрокаТЗНастроек.Список.Получить();
					
					Если СвойствоДокумента = Неопределено Тогда
						
						ВывестиОшибкуНекорректныхПравилПроверки(Доверенность, ЭлектронныйДокумент, ПравилоПроверки);
						Возврат Результат;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Список) Тогда
						
						Для Каждого ЭлементСписка Из Список Цикл
							
							Если СвойствоДокумента = ЭлементСписка.Значение Тогда
								СтрокаТЗНастроек.УсловиеВыполнено = Истина;
								Продолжить;
							КонецЕсли;
							
						КонецЦикла;
						
					ИначеЕсли ТипЗнч(СтрокаТЗНастроек.НачальноеЗначение) = Тип("Булево") Тогда
						
						СтрокаТЗНастроек.УсловиеВыполнено = СвойствоДокумента = СтрокаТЗНастроек.НачальноеЗначение;
						
					ИначеЕсли ТипЗнч(СтрокаТЗНастроек.НачальноеЗначение) = Тип("Число") Тогда
						
						СтрокаТЗНастроек.УсловиеВыполнено =
							?(СтрокаТЗНастроек.НачальноеЗначение = 0, Истина, СвойствоДокумента >= СтрокаТЗНастроек.НачальноеЗначение)
							И ?(СтрокаТЗНастроек.КонечноеЗначение = 0, Истина, СвойствоДокумента <= СтрокаТЗНастроек.КонечноеЗначение);
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				ВывестиОшибкуНекорректныхПравилПроверки(Доверенность, ЭлектронныйДокумент, ПравилоПроверки);
				
			КонецЕсли;
			
			СтрокаТЗНастроек = ТаблицаНастроек.Найти(Ложь, "УсловиеВыполнено");
			Результат.Успех = СтрокаТЗНастроек = Неопределено;
			
			Если НЕ Результат.Успех Тогда
				Результат.ТекстОшибки = ТекстПолномочияНеПодтверждены;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ПроверкаПройденаУспешно = Ложь;
		ДополнительнаяПроверкаПройденаУспешно = Ложь;
		МассивОшибок = Новый Массив;
		
		РезультатПолученияПолномочий = МашиночитаемыеПолномочияДоверенности(Доверенность);
		
		Если ЗначениеЗаполнено(РезультатПолученияПолномочий.ТекстОшибки) Тогда
			Результат.ТекстОшибки = РезультатПолученияПолномочий.ТекстОшибки;
			ВывестиОшибкуНекорректныхПравилПроверки(Доверенность, ЭлектронныйДокумент);
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы Из РезультатПолученияПолномочий.Полномочия Цикл
			
			Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
				ПроверяемоеПолномочие =
					Справочники.КлассификаторПолномочийФНСМЧД003.НайтиПолномочиеПоКоду(СтрокаТаблицы.Код);
				ТаблицаНастроек = 
					Справочники.КлассификаторПолномочийФНСМЧД003.ТаблицаНастроекОтбора(ПроверяемоеПолномочие);
			Иначе
				ПроверяемоеПолномочие =
					Справочники.КлассификаторПолномочийФНСМЧД002.НайтиПолномочиеПоКоду(СтрокаТаблицы.Код);
				ТаблицаНастроек = 
					Справочники.КлассификаторПолномочийФНСМЧД002.ТаблицаНастроекОтбора(ПроверяемоеПолномочие);
			КонецЕсли;
			
			РеквизитыПолномочия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроверяемоеПолномочие, 
				"Скрипт, ДополнительныйСкрипт");
			
			ПроверятьДополнительныйСкрипт = ЗначениеЗаполнено(РеквизитыПолномочия.ДополнительныйСкрипт);
			
			Если ЗначениеЗаполнено(РеквизитыПолномочия.Скрипт) Тогда
				
				Попытка
					
					ПараметрыПроверки = Новый Структура();
					ПараметрыПроверки.Вставить("Доверенность", Доверенность);
					ПараметрыПроверки.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
					Ответ = Новый Структура("Успех, ТекстОшибки", Ложь, "");
					ПараметрыПроверки.Вставить("Результат", Ответ);
					
					Параметры = ПараметрыПроверки;
					Выполнить Скрипт;
					
					Успех = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Ответ, "Успех", Ложь);
					ТекстОшибки = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Ответ, "ТекстОшибки", "");
					
					Если НЕ Успех Тогда
						
						Если ПустаяСтрока(ТекстОшибки) Тогда
							ТекстОшибки = ТекстПолномочияНеПодтверждены;
						КонецЕсли;
						
						ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
							ЭлектронныйДокумент, МассивОшибок);
					Иначе
						
						ПроверкаПройденаУспешно = Истина;
						Прервать;
						
					КонецЕсли;
					
				Исключение
					
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
						ЭлектронныйДокумент, МассивОшибок, Истина);
					Продолжить;
					
				КонецПопытки;
				
			ИначеЕсли ТаблицаНастроек.Количество() > 0 Тогда // Упрощенная настройка
				
				ТаблицаНастроек.Колонки.Добавить("УсловиеВыполнено", Новый ОписаниеТипов("Булево"));
				
				МассивПолей = ТаблицаНастроек.ВыгрузитьКолонку("ИмяПоляДанных");
				ПоляСтрокой = СтрСоединить(МассивПолей, ",");
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент, ПоляСтрокой);
				
				Для Каждого СтрокаТЗНастроек Из ТаблицаНастроек Цикл
					
					СвойствоДокумента = Неопределено;
					РеквизитыДокумента.Свойство(СтрокаТЗНастроек.ИмяПоляДанных, СвойствоДокумента);
					Список = СтрокаТЗНастроек.Список.Получить();
					
					Если СвойствоДокумента = Неопределено Тогда
						
						ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найдено поле данных: %1'"), 
							СтрокаТЗНастроек.ИмяПоляДанных);
						ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
							ЭлектронныйДокумент, МассивОшибок, Истина);
						Продолжить;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Список) Тогда
						
						Для Каждого ЭлементСписка Из Список Цикл
							
							Если СвойствоДокумента = ЭлементСписка.Значение Тогда
								СтрокаТЗНастроек.УсловиеВыполнено = Истина;
								Продолжить;
							КонецЕсли;
							
						КонецЦикла;
						
					ИначеЕсли ТипЗнч(СтрокаТЗНастроек.НачальноеЗначение) = Тип("Булево") 
						И ТипЗнч(СвойствоДокумента) = Тип("Булево") Тогда
							
						СтрокаТЗНастроек.УсловиеВыполнено = СвойствоДокумента = СтрокаТЗНастроек.НачальноеЗначение;
						
					ИначеЕсли ТипЗнч(СтрокаТЗНастроек.НачальноеЗначение) = Тип("Число") 
						И ТипЗнч(СвойствоДокумента) = Тип("Число") Тогда
						
						СтрокаТЗНастроек.УсловиеВыполнено =
							?(СтрокаТЗНастроек.НачальноеЗначение = 0, Истина, СвойствоДокумента >= СтрокаТЗНастроек.НачальноеЗначение)
							И ?(СтрокаТЗНастроек.КонечноеЗначение = 0, Истина, СвойствоДокумента <= СтрокаТЗНастроек.КонечноеЗначение);
						
					КонецЕсли;
					
				КонецЦикла;
				
				СтрокаТЗНастроек = ТаблицаНастроек.Найти(Ложь, "УсловиеВыполнено");
				ПроверкаПройденаУспешно = СтрокаТЗНастроек = Неопределено;
				
				Если ПроверкаПройденаУспешно Тогда
					Прервать;
				Иначе
					
					ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстПолномочияНеПодтверждены,
						Доверенность, ЭлектронныйДокумент, МассивОшибок);
					
				КонецЕсли;
							
			ИначеЕсли Не ПроверятьДополнительныйСкрипт Тогда
				
				ТекстОшибки = НСтр("ru = 'Не настроены правила проверки полномочий.'");
				ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
					ЭлектронныйДокумент, МассивОшибок);
				Продолжить;
				
			КонецЕсли;
			
			Если ПроверятьДополнительныйСкрипт Тогда
					
				Попытка
					
					ПараметрыПроверки = Новый Структура();
					ПараметрыПроверки.Вставить("Доверенность", Доверенность);
					ПараметрыПроверки.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
					Ответ = Новый Структура("Успех, ТекстОшибки", Ложь, "");
					ПараметрыПроверки.Вставить("Результат", Ответ);
					
					Параметры = ПараметрыПроверки;
					Выполнить РеквизитыПолномочия.ДополнительныйСкрипт;
					
					Успех = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Ответ, "Успех", Ложь);
					ТекстОшибки = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Ответ, "ТекстОшибки", "");
					
					Если НЕ Успех Тогда
						
						ДополнительнаяПроверкаПройденаУспешно = Ложь;
						Если ПустаяСтрока(ТекстОшибки) Тогда
							ТекстОшибки = НСтр("ru = 'Полномочия не подтверждены дополнительными правилами проверки'");
						КонецЕсли;
						
						ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
							ЭлектронныйДокумент, МассивОшибок);
						
					Иначе
						
						ДополнительнаяПроверкаПройденаУспешно = Истина;
						Прервать;
						
					КонецЕсли;
					
				Исключение
					
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
						ЭлектронныйДокумент, МассивОшибок, Истина);
					Продолжить;
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Результат.Выполнено = Истина;
		Результат.Успех = ПроверкаПройденаУспешно ИЛИ ДополнительнаяПроверкаПройденаУспешно;
		Если Не Результат.Успех Тогда
			ОбщийТекстОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
			Результат.ТекстОшибки = ОбщийТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОшибкуПроверкиПолномочийДоверенностиВМассив(СтрокаТаблицы, ТекстОшибки, Доверенность,
	ЭлектронныйДокумент, МассивОшибок, ЗаписыватьВЖурналРегистрации = Ложь)
	
	Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
			
		ПредставлениеПолномочия = Справочники.МЧД003.СформироватьПредставлениеПолномочия(
		СтрокаТаблицы.Код,
		СтрокаТаблицы.Наименование);
	
	Иначе
			
		ПредставлениеПолномочия = МашиночитаемыеДоверенностиКлиентСервер.СформироватьПредставлениеПолномочия(
			СтрокаТаблицы.Код,
			СтрокаТаблицы.Содержание,
			СтрокаТаблицы.Описание);
			
	КонецЕсли;
		
	ОшибкаПроверки = СтрШаблон(НСтр("ru = '%1
	|%2'"), ПредставлениеПолномочия, ТекстОшибки);
	
	Если ЗаписыватьВЖурналРегистрации Тогда
		
		ВидОперации = НСтр("ru = 'Проверка полномочий доверенности.'");
		ШаблонСообщения =
			Нстр("ru = 'Ошибка при проверке полномочий доверенности: %1 для документа: %2'");
		Сообщение = СтрШаблон(ШаблонСообщения, Доверенность, ЭлектронныйДокумент);
		ПодробныйТекстОшибки = Сообщение + Символы.ПС + ОшибкаПроверки; 
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, Сообщение);
	
	КонецЕсли;
	
	МассивОшибок.Добавить(ОшибкаПроверки);

КонецПроцедуры

// Проверяет наличие ограниченных полномочий доверенности
// 
// Параметры:
//  ДанныеДоверенности - Неопределено - допустимо в случае если задан параметр "Доверенность" 
//  				   - см. НовыеДанныеМЧД
//  Доверенность - Неопределено - допустимо в случае если задан параметр "ДанныеДоверенности" 
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов,
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  Булево
//  
Функция ПолномочияОграничены(ДанныеДоверенности = Неопределено, Доверенность = Неопределено) Экспорт
	
	Если ДанныеДоверенности = Неопределено Тогда
		
		ДвоичныеДанныеДоверенности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Доверенность, "XMLфайлМЧД").Получить();
		РезультатЧтения = ДанныеИзФайлаОбмена(ДвоичныеДанныеДоверенности);
		Если НЕ РезультатЧтения.Успех Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Полномочие Из ДанныеДоверенности.Полномочия Цикл
		
		Если Полномочие.Код = "99" Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если МашиночитаемыеДоверенностиКлиентСервер.ЭтоТекстПолныхПолномочий(Полномочие.Описание) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Возвращает массив со строками полномочий доверенности
// 
// Параметры:
//  ДанныеДоверенности - Неопределено - допустимо в случае если задан параметр "Доверенность" 
//  				   - см. НовыеДанныеМЧД
//  Доверенность - Неопределено - допустимо в случае если задан параметр "ДанныеДоверенности" 
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов,
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  Массив из Строка
//  
Функция ПолномочияДоверенности(ДанныеДоверенности = Неопределено, Доверенность = Неопределено) Экспорт
	
	Если ДанныеДоверенности = Неопределено Тогда
		
		ДвоичныеДанныеДоверенности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Доверенность, "XMLфайлМЧД").Получить();
		РезультатЧтения = ДанныеИзФайлаОбмена(ДвоичныеДанныеДоверенности);
		Если НЕ РезультатЧтения.Успех Тогда
			Возврат Новый Массив();
		КонецЕсли;
		ДанныеДоверенности = РезультатЧтения.ДанныеДоверенности;
		
	КонецЕсли;
	
	КодыПолномочий = Новый Массив;
	ТекстыПолномочий = Новый Массив;
	
	Для Каждого Полномочие Из ДанныеДоверенности.Полномочия Цикл
		
		МассивПолей = Новый Массив;
		
		Для Каждого КлючИЗначение Из Полномочие Цикл
			
			Если КлючИЗначение.Ключ <> "Код" И НЕ ПустаяСтрока(КлючИЗначение.Значение) Тогда
				МассивПолей.Добавить(КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Полномочие.Код) И Полномочие.Код <> "99" Тогда
			
			Если МассивПолей.Количество() = 0 Тогда
				КодыПолномочий.Добавить(Полномочие.Код);
			Иначе
				МассивПолей.Вставить(0, Полномочие.Код);
			КонецЕсли;
				
		КонецЕсли;
		
		Если МассивПолей.Количество() > 0 Тогда
			ТекстыПолномочий.Добавить(СтрСоединить(МассивПолей, "; "));
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиПолномочий = Новый Массив();
	
	Если КодыПолномочий.Количество() > 0 Тогда
		СтрокиПолномочий.Добавить(НСтр("ru = 'Коды полномочий:'") + " " + СтрСоединить(КодыПолномочий, ", "));
	КонецЕсли;
	
	Если ТекстыПолномочий.Количество() > 0 Тогда
		
		Если ТекстыПолномочий.Количество() = 1 Тогда
			СтрокиПолномочий.Добавить(ТекстыПолномочий[0]);
		Иначе
			Для Счетчик = 1 По ТекстыПолномочий.Количество() Цикл
				Индекс = Счетчик-1;
				СтрокаПолномочий = СтрШаблон("%1. %2", Счетчик, ТекстыПолномочий[Индекс]);
				СтрокиПолномочий.Добавить(СтрокаПолномочий);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокиПолномочий;
	
КонецФункции

// Возвращает текстовое представление полномочий доверенности
// 
// Параметры:
//  ДанныеДоверенности - Неопределено - допустимо в случае если задан параметр "Доверенность" 
//  				   - см. НовыеДанныеМЧД
//  Доверенность - Неопределено - допустимо в случае если задан параметр "ДанныеДоверенности" 
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов,
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  Строка
//  
Функция ТекстПолномочий(ДанныеДоверенности = Неопределено, Доверенность = Неопределено) Экспорт
	
	СтрокиПолномочий = ПолномочияДоверенности(ДанныеДоверенности, Доверенность);
	Возврат СтрСоединить(СтрокиПолномочий, Символы.ПС);
	
КонецФункции

// Формирует пустую структуру описания полномочия представителя МЧД.
// 
// Возвращаемое значение:
//  Структура:
//	  * Код - Строка
//	  * Описание - Строка
//	  * Содержание - Строка
//	  * Пояснение - Строка
// 
Функция НовыеПолномочияПредставителя() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Код", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("Содержание", "");
	Результат.Вставить("Пояснение", "");
	
	Возврат Результат;
	
КонецФункции

// Заполняет данные о полномочиях МЧД
//
// Параметры:
//  ДанныеДоверенности - см. НовыеДанныеМЧД
//  Полномочия - СписокXDTO
//
Процедура ЗаполнитьПолномочия(ДанныеДоверенности, Полномочия)
	
	Для Каждого Полномочие Из Полномочия Цикл 
		
		КодПолномочий = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "КодПолн", "Строка");
		ОписаниеПолномочий = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "ТекстПолн", "Строка");
		СодержаниеПолномочий = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "СодержПолн", "Строка");
		ПояснениеПолномочий = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "ДопТекстПолн", "Строка");
		
		СведенияОПолномочиях = НовыеПолномочияПредставителя();
		СведенияОПолномочиях.Код = КодПолномочий;
		СведенияОПолномочиях.Описание = ОписаниеПолномочий;
		СведенияОПолномочиях.Содержание = СодержаниеПолномочий;
		СведенияОПолномочиях.Пояснение = ПояснениеПолномочий; 
		ДанныеДоверенности.Полномочия.Добавить(СведенияОПолномочиях);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует пустую структуру данных субъекта МЧД.
// 
// Возвращаемое значение:
//  Структура:
//	* Фамилия - Строка -
//	* Имя - Строка -
//	* Отчество - Строка -
//	* Владелец - ПеречислениеСсылка.СубъектыДоверенности
// 
Функция НовыеДанныеСубъектаМЧД()
	
	Результат = Новый Структура;
	Результат.Вставить("Фамилия", "");
	Результат.Вставить("Имя", "");
	Результат.Вставить("Отчество", "");
	Результат.Вставить("Владелец", Перечисления.СубъектыДоверенности.ПустаяСсылка());
	Возврат Результат;
	
КонецФункции

// Формирует пустую структуру данных МЧД.
// 
// Возвращаемое значение:
//  Структура:
//	* XMLфайлМЧД - Неопределено
//				 - ХранилищеЗначения
//	* ДатаЗагрузкиИзРеестра - Дата
//	* НомерДоверенности - Строка
//	* ДатаВыдачи - Дата
//	* ДатаОкончания - Дата
//	* СрокДействия - Строка
//	* СведенияОбИнформационнойСистеме - Строка
//	* НомерРодительскойДоверенности - Строка
//	* НомерОсновнойДоверенности - Строка
//	* ИННДоверителяРодительскойДоверенности - Строка
//	* КППДоверителяРодительскойДоверенности - Строка
//	* ВозможноПередоверие - Булево
//	* ТипПередоверия - Строка
//	* ФИО - Массив из см. НовыеДанныеСубъектаМЧД
//	* Полномочия - Массив из см. НовыеПолномочияПредставителя
//	* УдостоверенияЛичности - Массив из см. НовыеДанныеУдостоверенияЛичности
//	* ТипОрганизации - Строка
//	* СовместныеПолномочия - Булево
//	* НесколькоПредставителей - Булево
//	* Представители - Массив Из Структура:
//		** ПредставительЮЛ_НаимОрг - Строка
//		** ПредставительЮЛ_ИНН - Строка
//		** ПредставительЮЛ_КПП - Строка
//		** ПредставительЮЛ_ОГРН - Строка
//		** ПредставительФЛ_ИНН - Строка
//		** ПредставительФЛ_ОГРН - Строка
//		** ПредставительФЛ_СНИЛС - Строка
//		** ПредставительФЛ_Гражданство - СправочникСсылка.СтраныМира
//		** ПредставительФЛ_ДатаРождения - Дата
//		** Представитель - Неопределено,
//						- СправочникСсылка
//		** Фамилия - Строка
//		** Имя - Строка
//		** Отчество - Строка
//		** УдостоверениеЛичности см. НовыеДанныеУдостоверенияЛичности
//		** ТипУполномоченногоПредставителя - Строка
//	* ДоверительЮЛ_НаимОрг - Строка
//	* ДоверительЮЛ_ИНН - Строка
//	* ДоверительЮЛ_КПП - Строка
//	* ДоверительЮЛ_ОГРН - Строка
//	* ДоверительЮЛ_Адр - Строка
//	* ЛицоБезДовФЛ_ИНН - Строка
//	* ЛицоБезДовФЛ_СНИЛС - Строка
//	* ЛицоБезДовФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ЛицоБезДовФЛ_ДатаРождения - Дата
//	* ЛицоБезДовФЛ_Должность - Строка
//	* ЛицоБезДовФЛ - Неопределено,
//				   - СправочникСсылка
//	* ЛицоБезДовЮЛ_НаимОрг - Строка
//	* ЛицоБезДовЮЛ_ИНН - Строка
//	* ЛицоБезДовЮЛ_КПП - Строка
//	* ЛицоБезДовЮЛ_ОГРН - Строка
//	* ЛицоБезДовЮЛ - Неопределено,
//				   - СправочникСсылка
//	* ДоверительЮЛ_ИностраннаяОрганизация - Булево
//	* ДоверительЮЛ_СтрРег - СправочникСсылка.СтраныМира
//	* ДоверительЮЛ_НаимРегОрг - Строка
//	* ДоверительЮЛ_РегНомер - Строка
//	* ДоверительФЛ_ИНН - Строка
//	* ДоверительФЛ_СНИЛС - Строка
//	* ДоверительФЛ_ДатаРождения - Дата
//	* ДоверительФЛ_МестоРожд - Строка
//	* ДоверительФЛ_Пол - Число - 1-мужской, 2-женский
//	* ДоверительФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ПредставительЮЛ_НаимОрг - Строка
//	* ПредставительЮЛ_ИНН - Строка
//	* ПредставительЮЛ_КПП - Строка
//	* ПредставительЮЛ_ОГРН - Строка
//	* ПредставительФЛ_ИНН - Строка
//	* ПредставительФЛ_ОГРН - Строка
//	* ПредставительФЛ_СНИЛС - Строка
//	* ПредставительФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ПредставительФЛ_ДатаРождения - Дата
//	* Представитель - Неопределено,
//					- СправочникСсылка
//	* Организация - Неопределено,
//				  - СправочникСсылка
// 
Функция НовыеДанныеМЧД() Экспорт
	КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");

	ДанныеДоверенности = Новый Структура;

	ДанныеДоверенности.Вставить("XMLфайлМЧД", Неопределено);
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');
	ДанныеДоверенности.Вставить("НомерДоверенности", "");
	ДанныеДоверенности.Вставить("ДатаВыдачи", '00010101');
	ДанныеДоверенности.Вставить("ДатаОкончания", '00010101');
	ДанныеДоверенности.Вставить("СрокДействия", "");
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", "");
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", "");
	ДанныеДоверенности.Вставить("НомерОсновнойДоверенности", "");
	ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", "");
	ДанныеДоверенности.Вставить("КППДоверителяРодительскойДоверенности", "");
	
	ДанныеДоверенности.Вставить("ВозможноПередоверие", Ложь);
	ДанныеДоверенности.Вставить("ТипПередоверия", "");
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("Полномочия", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);
	ДанныеДоверенности.Вставить("ТипОрганизации", "");
	ДанныеДоверенности.Вставить("СовместныеПолномочия", Ложь);
	ДанныеДоверенности.Вставить("НесколькоПредставителей", Ложь);
	ДанныеДоверенности.Вставить("Представители", Новый Массив);

	ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", "");

	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка());
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", '00010101');
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ", Неопределено);

	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ", Неопределено);
	
	ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Ложь);
	ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", Справочники[КлассификаторСтранМира].ПустаяСсылка());
	ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", "");

	ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", "");
	ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", '00010101');
	ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", "");
	ДанныеДоверенности.Вставить("ДоверительФЛ_Пол", 1);
	ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка());

	ДанныеДоверенности.Вставить("ПредставительЮЛ_НаимОрг", "");
	ДанныеДоверенности.Вставить("ПредставительЮЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ПредставительЮЛ_КПП", "");
	ДанныеДоверенности.Вставить("ПредставительЮЛ_ОГРН", "");
	
	ДанныеДоверенности.Вставить("ПредставительФЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ПредставительФЛ_ОГРН", "");
	ДанныеДоверенности.Вставить("ПредставительФЛ_СНИЛС", "");
	ДанныеДоверенности.Вставить("ПредставительФЛ_Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка());
	ДанныеДоверенности.Вставить("ПредставительФЛ_ДатаРождения", '00010101');
	
	ДанныеДоверенности.Вставить("Представитель", Неопределено);
	ДанныеДоверенности.Вставить("Организация", Неопределено);
		
	Возврат ДанныеДоверенности;
	
КонецФункции

// Доверенности действительны.
// 
// Параметры:
//  Доверенности - Массив Из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//               - Массив Из СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  ДатаПроверки - Дата - дата, на которую выполняется проверка
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение  - результат проверки:
//   * Ключ - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//          - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//   * Значение - Булево
//
Функция ДоверенностиДействительны(Доверенности, ДатаПроверки)
	
	РезультатПроверки = Новый Соответствие;
	СписокРеквизитов = "ДатаВыдачи, ДатаОкончания, Отозвана, ДатаОтзыва, СтатусВРеестреФНС, Верна,
		|ВариантЗаполненияПолномочий";
	РеквизитыДоверенностей = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Доверенности, СписокРеквизитов);
	Для Каждого Доверенность Из Доверенности Цикл
		СвойстваДоверенности = НовыеСвойстваДоверенности();
		ЗаполнитьЗначенияСвойств(СвойстваДоверенности, РеквизитыДоверенностей[Доверенность]);
		СвойстваДоверенности.ПолномочияУказаныИзКлассификатора =
			ПолномочияМЧДУказаныИзКлассификатора(Неопределено, Доверенность.ВариантЗаполненияПолномочий);
		РезультатПроверки.Вставить(Доверенность, ДоверенностьДействительнаПоСвойствам(СвойстваДоверенности, ДатаПроверки));
	КонецЦикла;
	Возврат РезультатПроверки;
	
КонецФункции

// Возвращает гражданство участника МЧД.
// 
// Параметры:
//  СведенияПоФизическомуЛицу - ОбъектXDTO
// 
// Возвращаемое значение:
//  СправочникСсылка.СтраныМира
//  
Функция ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу)
	КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");
	
	Гражданство = Справочники[КлассификаторСтранМира].ПустаяСсылка();
	ПризнакГражданства =
		ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "ПрГражд", "Строка");
	
	Если ПризнакГражданства = "1" Тогда
		
		Гражданство = Справочники[КлассификаторСтранМира].Россия;
		
	ИначеЕсли ПризнакГражданства = "2" Тогда
		
		КодСтраны = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Гражданство", "Строка");
		Гражданство = Справочники[КлассификаторСтранМира].НайтиПоКоду(КодСтраны);
		
	КонецЕсли;
	
	Возврат Гражданство;
	
КонецФункции

// Возвращает табличный документ МЧД в зависимости от версии формата.
// 
// Параметры:
//  ВерсияФормата - Строка
//  ДанныеМЧД - ОбъектXDTO
// 
// Возвращаемое значение:
//  ТабличныйДокумент, Неопределено -  табличный документ МЧД
//
Функция ТабличныйДокументПоФормату(ВерсияФормата, ДанныеМЧД)

	ТабличныйДокумент = Неопределено;
	
	Если ВерсияФормата = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
		ТабличныйДокумент = Справочники.МЧД003.ТабличныйДокументМЧД(ДанныеМЧД);
	КонецЕсли;	
		
	Возврат ТабличныйДокумент;
	
КонецФункции	

#Область БазовыйФункционалDOM

// Возвращает ДокументDOM, полученный из двоичных данных.
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные или адрес временного хранилища
// 
// Возвращаемое значение:
//  ДокументDOM - Возвращаемый документ дом по входящим данным
//
Функция ПодготовитьДокументDOM(ВходящиеДанные)

	ЭтоФайл = Ложь;
	ТекущиеДанные = ВходящиеДанные;
	Если ТипЗнч(ВходящиеДанные) = Тип("ДвоичныеДанные") Тогда
		ТекущиеДанные = ВходящиеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ВходящиеДанные) Тогда
		ТекущиеДанные = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	ИначеЕсли ТипЗнч(ВходящиеДанные) = Тип("Строка") И НайтиФайлы(ВходящиеДанные).Количество() > 0 Тогда
		ЭтоФайл = Истина;
	КонецЕсли;

	ЧтениеXML = Новый ЧтениеXML;
	Если ТипЗнч(ТекущиеДанные) = Тип("ДвоичныеДанные") Тогда
		БуферДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ТекущиеДанные);
		ЧтениеXML.ОткрытьПоток(Новый ПотокВПамяти(БуферДанных));
	ИначеЕсли ЭтоФайл Тогда
		ЧтениеXML.ОткрытьФайл(ТекущиеДанные);
	Иначе
		ЧтениеXML.УстановитьСтроку(ТекущиеДанные);
	КонецЕсли;

	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);

	Возврат ДокументDOM;

КонецФункции

// Возвращает найденные по выражению XPath элементы узла в виде массива
// 
// Параметры:
//  УзелВладелец - ДокументDOM
//  ТекстПоиска - Строка - выражение XPath
// 
// Возвращаемое значение:
//  Массив - Массив с найденными элементами DOM
//
Функция ПолучитьВыборкуЭлементовDOM(УзелВладелец, ТекстПоиска)

	Результат = Новый Массив;

	ДокументВладелец = УзелВладелец.ДокументВладелец;
	РазыменовательИмен = Новый РазыменовательПространствИменDOM(ДокументВладелец);
	НашлиЭлементы = ДокументВладелец.ВычислитьВыражениеXPath(ТекстПоиска, УзелВладелец, РазыменовательИмен);

	ОчереднойЭлемент = НашлиЭлементы.ПолучитьСледующий();
	Пока ОчереднойЭлемент <> Неопределено Цикл
		Результат.Добавить(ОчереднойЭлемент);
		ОчереднойЭлемент = НашлиЭлементы.ПолучитьСледующий();
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает представление даты
// 
// Параметры:
//  ПредставлениеДаты - Строка
// 
// Возвращаемое значение:
//  Строка - представление даты
//
Функция ПодготовитьПредставлениеДаты(ПредставлениеДаты)

	Результат = ПредставлениеДаты;

	МассивСтроки = СтрРазделить(ПредставлениеДаты, ".", Ложь);

	Если МассивСтроки.Количество() = 3 И СтрДлина(МассивСтроки[2]) = 4 Тогда
		Результат = МассивСтроки[2] + МассивСтроки[1] + МассивСтроки[0];
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает ссылку на элемент справочника стран мира, найденную по коду
// 
// Параметры:
//  ПредставлениеСтраны - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.СтраныМира, Неопределено - Найденный элемент справочника стран мира
//
Функция ПодготовитьПредставлениеСтраны(ПредставлениеСтраны)
	
    КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");
	
	Результат = Справочники[КлассификаторСтранМира].ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ПредставлениеСтраны) Тогда
		ДанныеОСтране = ДанныеСтраныМира(ПредставлениеСтраны);
		Если ДанныеОСтране <> Неопределено Тогда
			Результат = ДанныеОСтране.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает представление серии и номера документа в виде структуры
// 
// Параметры:
//  ПредставлениеСерияНомер - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Серия - Строка
//  * Номер - Строка
//
Функция ПодготовитьПредставлениеСерияНомер(ПредставлениеСерияНомер)

	Результат = Новый Структура;
	Результат.Вставить("Серия", ПредставлениеСерияНомер);
	Результат.Вставить("Номер", "");

	МассивСтроки = СтрРазделить(ПредставлениеСерияНомер, " ", Ложь);

	Если МассивСтроки.Количество() > 2 Тогда
		Результат.Вставить("Серия", МассивСтроки[0] + " " + МассивСтроки[1]);
		МассивСтроки.Удалить(0);
		МассивСтроки.Удалить(0);
		Результат.Вставить("Номер", СтрСоединить(МассивСтроки, " "));
	ИначеЕсли МассивСтроки.Количество() = 2 Тогда
		Результат.Вставить("Серия", МассивСтроки[0]);
		Результат.Вставить("Номер", МассивСтроки[1]);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает ссылку на физическое лицо по сведениям.
// 
// Параметры:
//  СписокСправочников - Строка - список справочников через запятую
//  ИНН - Строка
//  КПП - Строка
//  СНИЛС - Строка
// 
// Возвращаемое значение:
//  - СправочникСсылка.ФизическиеЛица
//  - Неопределено - если не элемент не найден в ИБ.
//
Функция ПодыскатьИнформациюВладельца(СписокСправочников, ИНН, КПП = "", СНИЛС = "")

	Результат = Неопределено;

	МассивСправочников = СтрРазделить(СписокСправочников, ",", Ложь);

	Если МассивСправочников.Найти("Организации") <> Неопределено
		ИЛИ МассивСправочников.Найти("Контрагенты") <> Неопределено Тогда
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("ИНН", ИНН);
		Если ЗначениеЗаполнено(КПП) Тогда
			СтруктураПоиска.Вставить("КПП", КПП);
		КонецЕсли;
		
		ИмяСправочника = ?(МассивСправочников.Найти("Организации") <> Неопределено, "Организации", "Контрагенты");
		Результат = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект(ИмяСправочника, , СтруктураПоиска);
		
		Если Результат = Неопределено Тогда
			ИмяСправочника = ?(МассивСправочников.Найти("Контрагенты") <> Неопределено, "Контрагенты", "Организации");
			Результат = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект(ИмяСправочника, , СтруктураПоиска); 
		КонецЕсли;
				
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) И МассивСправочников.Найти("ФизическиеЛица") <> Неопределено Тогда
		
		СведенияФизлица = Новый Структура;
		СведенияФизлица.Вставить("ИНН", ИНН);
		Результат = ЭлектронныеДокументыПереопределяемый.ПолучитьФизЛицоМЧД(СведенияФизлица);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Находит элемент документа DOM, проверяет что оно одно и пытается получить значение и привести тип.
//
// Параметры:
//  УзелВладелец - Строка
//  ТекстПоиска - Строка
//  ЗначениеПоУмолчанию - Строка
// 
// Возвращаемое значение:
//  - Строка 
//  - Дата
//  - СправочникСсылка
//
Функция ПолучитьЗначениеДокумента(УзелВладелец, ТекстПоиска, ЗначениеПоУмолчанию = Неопределено)
	
	КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");
	
	Результат = ЗначениеПоУмолчанию;

	ВыборкаЭлементов = ПолучитьВыборкуЭлементовDOM(УзелВладелец, ТекстПоиска);

	Если ВыборкаЭлементов.Количество() = 1 Тогда

		ЭлементВыборки = ВыборкаЭлементов[0];
		Если ТипЗнч(ЭлементВыборки) = Тип("АтрибутDOM") Тогда
			ПредставлениеЗначения = ЭлементВыборки.Значение;
		ИначеЕсли ТипЗнч(ЭлементВыборки) = Тип("ЭлементDOM") Тогда
			ПредставлениеЗначения = ЭлементВыборки.ТекстовоеСодержимое;
		Иначе
			ПредставлениеЗначения = ЭлементВыборки.ЗначениеУзла;
		КонецЕсли;

		Если ТипЗнч(ЗначениеПоУмолчанию) = Тип("Дата") Тогда
			ПредставлениеЗначения = ПодготовитьПредставлениеДаты(ПредставлениеЗначения);
		ИначеЕсли ТипЗнч(ЗначениеПоУмолчанию) = Тип("СправочникСсылка."+КлассификаторСтранМира) Тогда
			ПредставлениеЗначения = ПодготовитьПредставлениеСтраны(ПредставлениеЗначения);
		КонецЕсли;

		Если ЗначениеПоУмолчанию <> Неопределено Тогда
			МассивТипов = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(ТипЗнч(ЗначениеПоУмолчанию));
			ТекущийТип = Новый ОписаниеТипов(МассивТипов);
			Результат = ТекущийТип.ПривестиЗначение(ПредставлениеЗначения);
		Иначе
			Результат = ПредставлениеЗначения;
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

// Добавляет сведения об участнике МЧД в коллекцию.
// 
// Параметры:
//  ФИО - ОбъектXDTO
//  ТипУчастника - ПеречислениеСсылка.СубъектыДоверенности 
//  МассивУчастников - Массив из Структура:
//  * Фамилия - Строка
//  * Имя - Строка
//  * Отчество - Строка
//  * Владелец - ПеречислениеСсылка.СубъектыДоверенности
Процедура ДобавитьСведенияОбУчастникеМЧД(ФИО, ТипУчастника, МассивУчастников)
	
	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Фамилия", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ФИО, "Фамилия", "Строка"));
	НоваяСтрока.Вставить("Имя", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ФИО, "Имя", "Строка"));
	НоваяСтрока.Вставить("Отчество", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ФИО, "Отчество", "Строка"));
	НоваяСтрока.Вставить("Владелец", ТипУчастника);
	МассивУчастников.Добавить(НоваяСтрока);
			
КонецПроцедуры

// Инициализирует свойства доверенности.
// 
// Возвращаемое значение:
//  Структура:
//  * Ссылка - ОпределяемыйТип.МашиночитаемаяДоверенность
//	* ДатаВыдачи - Дата
//	* ДатаОкончания - Дата
//	* Отозвана - Булево
//	* ДатаОтзыва - Дата
//	* СтатусВРеестреФНС - ПеречислениеСсылка.СтатусыМашиночитаемойДоверенностиВРеестреФНС
//	* Верна - Булево
//	* ПолномочияОграничены - Булево
//  * ПолномочияУказаныИзКлассификатора - Булево
//	* ПравилоПроверки - СправочникСсылка.ПравилаПроверкиПолномочийМЧД
//
Функция НовыеСвойстваДоверенности() Экспорт
	
	Свойства = Новый Структура;
	Свойства.Вставить("Ссылка", Неопределено);
	Свойства.Вставить("ДатаВыдачи", Дата(1, 1, 1));
	Свойства.Вставить("ДатаОкончания", Дата(1, 1, 1));
	Свойства.Вставить("Отозвана", Ложь);
	Свойства.Вставить("ДатаОтзыва", Дата(1, 1, 1));
	Свойства.Вставить("СтатусВРеестреФНС",
		ПредопределенноеЗначение("Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка"));
	Свойства.Вставить("Верна", Ложь);
	Свойства.Вставить("ПолномочияОграничены", Истина);
	Свойства.Вставить("ПолномочияУказаныИзКлассификатора", Ложь);
	Свойства.Вставить("ПравилоПроверки", Справочники.ПравилаПроверкиПолномочийМЧД.ПустаяСсылка());
	Свойства.Вставить("ВариантЗаполненияПолномочий", Перечисления.ВариантыЗаполненияПолномочийМЧД.ПустаяСсылка());
	
	Возврат Свойства;
	
КонецФункции

//	Заполняет сведения о представителе с соблюдением формата МЧД версий 001, 002 и пилотной.
//	Состав ключей зависит от типа представителя.
//
// Параметры:
//  СведенияОбУполномоченномПредставителе - ОбъектXDTO
//  ТипУполномоченногоПредставителя - Строка
//  
// Возвращаемое значение:
//  Структура:
//	* ПредставительЮЛ_НаимОрг - Строка
//	* ПредставительЮЛ_ИНН - Строка
//	* ПредставительЮЛ_КПП - Строка
//	* ПредставительЮЛ_ОГРН - Строка
//	* ПредставительФЛ_ИНН - Строка
//	* ПредставительФЛ_ОГРН - Строка
//	* ПредставительФЛ_СНИЛС - Строка
//	* ПредставительФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ПредставительФЛ_ДатаРождения - Дата
//	* ПредставительФИО - Строка
//	* Представитель - Неопределено
//					- ОпределяемыйТип.Организация
//					- ОпределяемыйТип.КонтрагентБЭД
//					- ОпределяемыйТип.ФизическоеЛицо
//	* Фамилия - Строка
//	* Имя - Строка
//	* Отчество - Строка
//	* УдостоверениеЛичности - см. НовыеДанныеУдостоверенияЛичности
//	* ТипУполномоченногоПредставителя - Строка
//
Функция ЗаполнитьСведенияОПредставителеМЧД(СведенияОбУполномоченномПредставителе, ТипУполномоченногоПредставителя)
	
	Представитель = Новый Структура;
	Представитель.Вставить("ТипУполномоченногоПредставителя", ТипУполномоченногоПредставителя);

	Если ТипУполномоченногоПредставителя  = "ЮЛ" Тогда
			
		СведенияОрганизации = 
			ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОбУполномоченномПредставителе, "СвОрг.СвОрг", "Строка");
			
		Если ПустаяСтрока(СведенияОрганизации) Тогда
			СведенияОрганизации = 
				СведенияОбУполномоченномПредставителе.СвОрг;
		КонецЕсли;

		Представитель.Вставить("ПредставительЮЛ_НаимОрг", СведенияОрганизации.НаимОрг);
		Представитель.Вставить("ПредставительЮЛ_ИНН", СведенияОрганизации.ИННЮЛ);
		Представитель.Вставить("ПредставительЮЛ_КПП", СведенияОрганизации.КПП);
		ОГРН = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОрганизации, "ОГРН", "Строка");
		Представитель.Вставить("ПредставительЮЛ_ОГРН", ОГРН);
		
		СведенияФизЛица = 
			ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОбУполномоченномПредставителе, "СвОрг.СвФЛ", "Строка");
			
		Если ПустаяСтрока(СведенияФизЛица) Тогда
			СведенияФизЛица = 
				СведенияОбУполномоченномПредставителе.СведФизЛ;
		Иначе
			СведенияФизЛица = СведенияФизЛица[0];
		КонецЕсли;
		
		Если Не ПустаяСтрока(СведенияФизЛица) Тогда
		
			Представитель.Вставить("ПредставительФЛ_ИНН", СведенияФизЛица.ИННФЛ);
			Представитель.Вставить("ПредставительФЛ_СНИЛС", СведенияФизЛица.СНИЛС);
			
			СведенияПоФизическомуЛицу = СведенияФизЛица.СведФЛ;
			Представитель.Вставить("ПредставительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
			Представитель.Вставить("ПредставительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
			
			Представитель.Вставить("Фамилия", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Фамилия", "Строка"));
			Представитель.Вставить("Имя", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Имя", "Строка"));
			Представитель.Вставить("Отчество", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Отчество", "Строка"));
			
			ФИО = МашиночитаемыеДоверенностиКлиентСервер.ФИОСтрокой(Представитель);
			Представитель.Вставить("ПредставительФИО", ФИО);
			
		КонецЕсли;
		
	ИначеЕсли ТипУполномоченногоПредставителя = "ИП" Тогда
		
		СведенияИП = СведенияОбУполномоченномПредставителе.СведИП;
		Представитель.Вставить("ПредставительЮЛ_НаимОрг", СведенияИП.НаимИП);
		Представитель.Вставить("ПредставительЮЛ_ИНН", СведенияИП.ИННФЛ);
		Представитель.Вставить("ПредставительЮЛ_ОГРН", СведенияИП.ОГРНИП);
		
		Представитель.Вставить("Фамилия", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияИП.ФИО, "Фамилия", "Строка"));
		Представитель.Вставить("Имя", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияИП.ФИО, "Имя", "Строка"));
		Представитель.Вставить("Отчество", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияИП.ФИО, "Отчество", "Строка"));
		
		ФИО = МашиночитаемыеДоверенностиКлиентСервер.ФИОСтрокой(Представитель);
		Представитель.Вставить("ПредставительФИО", ФИО);
		
		СведенияПоФизическомуЛицу = СведенияИП.СведФЛ;
		Представитель.Вставить("ПредставительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		Представитель.Вставить("ПредставительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		Представитель.Вставить("ПредставительФЛ_СНИЛС", СведенияИП.СНИЛС);
		
	ИначеЕсли ТипУполномоченногоПредставителя = "ФЛ" Тогда
		
		СведенияФизЛица = СведенияОбУполномоченномПредставителе.СведФизЛ;
		
		Представитель.Вставить("ПредставительФЛ_ИНН", СведенияФизЛица.ИННФЛ);
		Представитель.Вставить("ПредставительФЛ_СНИЛС", СведенияФизЛица.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияФизЛица.СведФЛ;
		Представитель.Вставить("ПредставительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		Представитель.Вставить("ПредставительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
		Представитель.Вставить("Фамилия", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Фамилия", "Строка"));
		Представитель.Вставить("Имя", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Имя", "Строка"));
		Представитель.Вставить("Отчество", ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Отчество", "Строка"));
		
		ФИО = МашиночитаемыеДоверенностиКлиентСервер.ФИОСтрокой(Представитель);
		Представитель.Вставить("ПредставительФИО", ФИО);

	КонецЕсли;
	
	УдостоверениеЛичности = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "УдЛичнФЛ", ,,Истина);
	Если УдостоверениеЛичности <> Неопределено Тогда
		
		ДатаДок = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(УдостоверениеЛичности, "ДатаДок", "Дата");
		ВыдДок = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(УдостоверениеЛичности, "ВыдДок", "Строка");
		Номер = УдостоверениеЛичности.СерНомДок;
		Серия = "";
		СерияНомерДокумента = СтрРазделить(СокрЛП(УдостоверениеЛичности.СерНомДок), " ", Ложь);
		
		Если СерияНомерДокумента.Количество() > 1 Тогда
			Номер = СерияНомерДокумента[СерияНомерДокумента.Количество() - 1];
			Серия = СокрЛП(СтрЗаменить(УдостоверениеЛичности.СерНомДок, Номер, ""));
		КонецЕсли;
		
		ДанныеУдостоверенияЛичности = НовыеДанныеУдостоверенияЛичности();
		ДанныеУдостоверенияЛичности.СерДок = Серия;
		ДанныеУдостоверенияЛичности.НомДок = Номер;
		ДанныеУдостоверенияЛичности.ДатаДок = ДатаДок;
		ДанныеУдостоверенияЛичности.ВыдДок = ВыдДок;
		ДанныеУдостоверенияЛичности.ВидДок = УдостоверениеЛичности.КодВидДок;
		ДанныеУдостоверенияЛичности.КодВыдДок = УдостоверениеЛичности.КодВыдДок;
		
		Представитель.Вставить("УдостоверениеЛичности", ДанныеУдостоверенияЛичности);
		
		ПредставлениеУдостоверения = 
			ПолучитьПредставлениеУдостоверение(ДанныеУдостоверенияЛичности);
		
		Представитель.Вставить("ПредставлениеУдостоверения", ПредставлениеУдостоверения);
	
	КонецЕсли;
	
	ПредставительСсылка = Неопределено;
	Если Представитель.Свойство("ПредставительЮЛ_ИНН") 
		И ЗначениеЗаполнено(Представитель.ПредставительЮЛ_ИНН)
		И Представитель.Свойство("ПредставительЮЛ_КПП") Тогда
			ПредставительСсылка = ПодыскатьИнформациюВладельца("Контрагенты, Организации",
				Представитель.ПредставительЮЛ_ИНН, Представитель.ПредставительЮЛ_КПП);
			Представитель.Вставить("ПредставительЮЛ", ПредставительСсылка);
			Если Представитель.Свойство("ПредставительФЛ_ИНН") Тогда
				ПредставительСсылка = 
					ПодыскатьИнформациюВладельца("ФизическиеЛица", Представитель.ПредставительФЛ_ИНН);
				Представитель.Вставить("Представитель", ПредставительСсылка);
			КонецЕсли;
	КонецЕсли;
	
	Если Представитель.Свойство("ПредставительЮЛ_ИНН") 
		И ЗначениеЗаполнено(Представитель.ПредставительЮЛ_ИНН) 
		И Не ЗначениеЗаполнено(ПредставительСсылка) 
		И ЗначениеЗаполнено(Представитель.ПредставительЮЛ_ОГРН) Тогда
			ПредставительСсылка = ПодыскатьИнформациюВладельца("Контрагенты", Представитель.ПредставительЮЛ_ИНН);
			Представитель.Вставить("ПредставительЮЛ", ПредставительСсылка);
			ПредставительСсылка = ПодыскатьИнформациюВладельца("ФизическиеЛица", Представитель.ПредставительЮЛ_ИНН);
			Представитель.Вставить("Представитель", ПредставительСсылка);
	КонецЕсли;
	
	Если Не Представитель.Свойство("ПредставительЮЛ_ИНН") 
		Или Не ЗначениеЗаполнено(Представитель.ПредставительЮЛ_ИНН) 
		И Не ЗначениеЗаполнено(ПредставительСсылка) Тогда
			ПредставительСсылка = ПодыскатьИнформациюВладельца("ФизическиеЛица", Представитель.ПредставительФЛ_ИНН);
			Представитель.Вставить("Представитель", ПредставительСсылка);
	КонецЕсли;
	
	Возврат Представитель;
	
КонецФункции

// Возвращает данные, полученные из файла обмена в пилотном формате.
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеДоверенности - См. НовыеДанныеМЧД
//
Функция ДанныеИзФайлаОбменаВУтвержденномФормате(ВходящиеДанные, ЭтоДоверенностьОрганизации = Неопределено)
	
	Результат = Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Ложь, "", НовыеДанныеМЧД());
	ДанныеДоверенности = Результат.ДанныеДоверенности;
	
	Если ТипЗнч(ВходящиеДанные) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные = ВходящиеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ВходящиеДанные) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	Иначе
		ДвоичныеДанные = Новый ДвоичныеДанные(ВходящиеДанные);
	КонецЕсли;
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = НСтр("ru = 'При загрузке файла МЧД возникла ошибка: %1'");
	ДанныеXDTO = Неопределено;
	
	Попытка
		
		РезультатЧтения = ДанныеXMLМЧД(ДвоичныеДанные);
		Если НЕ РезультатЧтения.Успех Тогда
			Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			Возврат Результат
		КонецЕсли;
		
		ДанныеXDTO = РезультатЧтения.ДанныеДоверенности;
		
	Исключение
		
		Операция = НСтр("ru = 'Разбор МЧД'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Ошибка при разборе файла МЧД'");
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения);
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
		
	КонецПопытки;
	
	ДанныеДоверенности.Вставить("XMLфайлМЧД", Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9)));
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');

	Документ = ДанныеXDTO.Документ;	
	СведенияДоверенности = Документ.СвДов;
		
	ДанныеДоверенности.Вставить("НомерДоверенности", СведенияДоверенности.НомДовер);
	ДанныеДоверенности.Вставить("ДатаВыдачи", СведенияДоверенности.ДатаВыдДовер);
	ДанныеДоверенности.Вставить("ДатаОкончания", СведенияДоверенности.ДатаКонДовер);
	ДанныеДоверенности.Вставить("СрокДействия", "");
	СведенияОбИнформационнойСистеме = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверенности, "СведСистОтм", "Строка");	
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", СведенияОбИнформационнойСистеме);	
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", "");		
	ДанныеДоверенности.Вставить("ВозможноПередоверие", ?(СведенияДоверенности.ПрПередов = "1", Истина, Ложь));
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);	

	СведенияОДоверителе = Документ.СвДоверит[0];
	ДанныеДоверенности.Вставить("ТипОрганизации", СведенияОДоверителе.ТипДовер);
	
	Если СведенияОДоверителе.ТипДовер = "ЮЛ" Тогда
		СведенияДоверителя = СведенияОДоверителе.РосОргДовер;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИО" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИнОргДовер;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИП" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИПДовер;
	Иначе
		СведенияДоверителя = СведенияОДоверителе.ФЛДовер;
	КонецЕсли;

	РеквизитыПоискаОрганизации = Новый Соответствие;
	
	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", СведенияДоверителя.ИННЮЛ);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", СведенияДоверителя.КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", СведенияДоверителя.ОГРН);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрРФ);

		ЛицоБезДоверенности = СведенияДоверителя.ЛицоБезДов;
		СведенияПоФизическомуЛицу = ЛицоБезДоверенности.СвФЛ;
		СведенияОЮридическомЛице = ЛицоБезДоверенности.СвОрг;
		
		ОснованиеПолномочий = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "НаимДокПолн", "Строка");
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ОснованиеПолномочий", ОснованиеПолномочий);
		
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "ИННФЛ", "Строка");		
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", ИННФЛ);		
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", СведенияПоФизическомуЛицу.СНИЛС);
		
		ДанныеДоверенности.Вставить(
			"ЛицоБезДовФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу.СведФЛ));
				
		ДатаРожд = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу.СведФЛ, "ДатаРожд", "Дата");		
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", ДатаРожд);
		Должность = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Должность", "Строка");
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", Должность);		
		ЛицоБезДовЮЛ_НаимОрг = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "НаимОрг", "Строка");		
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", ЛицоБезДовЮЛ_НаимОрг);
		ЛицоБезДовЮЛ_ИНН = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ИННЮЛ", "Строка");
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", ЛицоБезДовЮЛ_ИНН);
		ЛицоБезДовЮЛ_КПП = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "КПП", "Строка");
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", ЛицоБезДовЮЛ_КПП);
		ОГРН = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ОГРН", "Строка");
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", ОГРН);

		Если ЗначениеЗаполнено(ДанныеДоверенности.ЛицоБезДовФЛ_ИНН) Тогда
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ", ПодыскатьИнформациюВладельца("Контрагенты,ФизическиеЛица",
				ДанныеДоверенности.ЛицоБезДовФЛ_ИНН,, ДанныеДоверенности.ЛицоБезДовФЛ_СНИЛС));
		КонецЕсли;

		Если ЗначениеЗаполнено(ДанныеДоверенности.ЛицоБезДовЮЛ_ИНН) Тогда
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ", ПодыскатьИнформациюВладельца("Контрагенты,Организации",
				ДанныеДоверенности.ЛицоБезДовЮЛ_ИНН, ДанныеДоверенности.ЛицоБезДовЮЛ_КПП));
		КонецЕсли;

		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительЮЛ_ИНН);
		РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);
		
		ДобавитьСведенияОбУчастникеМЧД(
			СведенияОДоверителе.Подписант[0],
			Перечисления.СубъектыДоверенности.ДоверительРук,
			ДанныеДоверенности.ФИО); 

	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИО" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Истина);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИО);
		ИННЮЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННЮЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", ИННЮЛ);
		КПП = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "КПП", "Строка");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", СведенияДоверителя.СтрРег);
		НаимРегОрг = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "НаимРегОрг", "Строка");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", НаимРегОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", СведенияДоверителя.РегНомер);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрСтрРег);

		СведенияОРуководителеОбособленногоПодразделения = СведенияДоверителя.СвРукОП;
		СведенияПоФизическомуЛицу = СведенияОРуководителеОбособленногоПодразделения.СведФЛ;
		
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОРуководителеОбособленногоПодразделения, "ИННФЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		МестоРожд = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "МестоРожд", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", МестоРожд);
		Пол = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Пол", "Число");
		Пол = ?(Пол=0, 1, Пол);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Пол", Пол);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));

		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительЮЛ_ИНН);
		РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);

	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", СведенияДоверителя.ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", СведенияДоверителя.ОГРНИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СведенияДоверителя.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));

		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительФЛ_ИНН);

		ДобавитьСведенияОбУчастникеМЧД(
			СведенияОДоверителе.Подписант[0],
			Перечисления.СубъектыДоверенности.ДоверительФЛ,
			ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
		
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННФЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		СНИЛС = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "СНИЛС", "Строка");		
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительФЛ_ИНН);

	КонецЕсли;
	
	Для Каждого СведенияОбУполномоченномПредставителе Из Документ.СвУпПред Цикл
		
		ТипУполномоченногоПредставителя = СведенияОбУполномоченномПредставителе.ТипПред;
		
		СведенияОПредставителеМЧД = Новый Структура;
		Для Каждого СведенияОПредставителе Из СведенияОбУполномоченномПредставителе.СвПред Цикл
			
			СведенияФизЛица = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОПредставителе, "СведФизЛ",,,Истина);
			СведенияЮрЛица = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОПредставителе, "СвОрг",,,Истина);
			СведенияИП = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОПредставителе, "СведИП",,,Истина);
			
			Если СведенияЮрЛица <> Неопределено 
				Или СведенияИП <> Неопределено Тогда
					СведенияОПредставителеМЧД = 
						ЗаполнитьСведенияОПредставителеМЧД(СведенияОПредставителе, ТипУполномоченногоПредставителя);
			КонецЕсли;
			
			ДобавляемыеСведенияОПредставителе = Новый Структура;
			Если СведенияФизЛица <> Неопределено Тогда
				ДобавляемыеСведенияОПредставителе =	ЗаполнитьСведенияОПредставителеМЧД(СведенияОПредставителе, "ФЛ");
				ДобавляемыеСведенияОПредставителе.ТипУполномоченногоПредставителя = ТипУполномоченногоПредставителя;
			КонецЕсли;
			
			ЭлектронныеДокументыСлужебныйВызовСервера.ДополнитьСтруктуру(
				СведенияОПредставителеМЧД, ДобавляемыеСведенияОПредставителе, Ложь);
			
		КонецЦикла;
		
		ДанныеДоверенности.Представители.Добавить(СведенияОПредставителеМЧД);
		
	КонецЦикла;
	
	ОрганизацияИНН =  РеквизитыПоискаОрганизации.Получить("ИНН");
	ОрганизацияКПП = РеквизитыПоискаОрганизации.Получить("КПП");
	
	Если ЭтоДоверенностьОрганизации = Неопределено Тогда
		РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП("Организации", ОрганизацияИНН, ОрганизацияКПП);
		Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
			РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП("Контрагенты", ОрганизацияИНН, ОрганизацияКПП);
		КонецЕсли;
	Иначе
		СправочникДляПоиска = ?(ЭтоДоверенностьОрганизации, "Организации", "Контрагенты");
		РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП(СправочникДляПоиска, ОрганизацияИНН, ОрганизацияКПП);
	КонецЕсли;
	
	ДанныеДоверенности.Вставить("Организация", РезультатПоиска);
	
	Полномочия = Документ.СвПолн;
	
	Для Каждого Полномочие Из Полномочия Цикл
		
		СведенияОПолномочиях = НовыеПолномочияПредставителя();
		СведенияОПолномочиях.Код = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "КодПолн", "Строка");
		СведенияОПолномочиях.Описание = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "ТекстПолн", "Строка");
		СведенияОПолномочиях.Содержание = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "СодержПолн", "Строка");
		СведенияОПолномочиях.Пояснение = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Полномочие, "ДопТекстПолн", "Строка");
		ДанныеДоверенности.Полномочия.Добавить(СведенияОПолномочиях);
		
	КонецЦикла;
	
	Результат.Успех = Истина;
	Возврат Результат; 

КонецФункции

// Возвращает данные, полученные из файла обмена в формате версии 002
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеДоверенности - См. НовыеДанныеМЧД
//
Функция ДанныеИзФайлаОбменаВУтвержденномФорматеВерсия002(ВходящиеДанные, ЭтоДоверенностьОрганизации = Неопределено)
	
	Результат = Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Ложь, "", НовыеДанныеМЧД());
	ДанныеДоверенности = Результат.ДанныеДоверенности;
	
	Если ТипЗнч(ВходящиеДанные) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные = ВходящиеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ВходящиеДанные) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	Иначе
		ДвоичныеДанные = Новый ДвоичныеДанные(ВходящиеДанные);
	КонецЕсли;
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = НСтр("ru = 'При загрузке файла МЧД возникла ошибка: %1'");
	ДанныеXDTO = Неопределено;
	
	Попытка
		
		РезультатЧтения = ДанныеXMLМЧД(ДвоичныеДанные);
		Если НЕ РезультатЧтения.Успех Тогда
			Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		
		ДанныеXDTO = РезультатЧтения.ДанныеДоверенности;
		
	Исключение
		
		Операция = НСтр("ru = 'Разбор МЧД'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Ошибка при разборе файла МЧД'");		
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения);
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Результат.ТекстОшибки = ТекстСообщения;
		Возврат Результат;
		
	КонецПопытки;
	
	ДанныеДоверенности.Вставить("XMLфайлМЧД", Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9)));
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');
	
	Документ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO.Документ, "Довер");

	ЭтоПередоверие = Ложь;
	Если ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO.Документ, "Передов") <> Неопределено Тогда
		Документ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO.Документ, "Передов"); 
		ЭтоПередоверие = Истина;
	КонецЕсли;

	ДанныеДоверенности.Вставить("ЭтоПередоверие", ЭтоПередоверие);
	
	Если ЭтоПередоверие Тогда
		ЗаполнитьПередовериеПоФормату002(ДанныеДоверенности, Документ, ЭтоДоверенностьОрганизации);
	Иначе
		ЗаполнитьДовериеПоФормату002(ДанныеДоверенности, Документ, ЭтоДоверенностьОрганизации);
	КонецЕсли;
	
	Результат.Успех = Истина;
	Возврат Результат; 

КонецФункции

// Возвращает xdto-объект с данными, полученные из файла обмена.
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеДоверенности - ОбъектXDTO
//
Функция ДанныеИзФайлаОбменаОбъектомXDTO(ВходящиеДанные)
	
	Результат = Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Ложь, "", Неопределено);
		
	Если ТипЗнч(ВходящиеДанные) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные = ВходящиеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ВходящиеДанные) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	Иначе
		ДвоичныеДанные = Новый ДвоичныеДанные(ВходящиеДанные);
	КонецЕсли;
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = НСтр("ru = 'При загрузке файла МЧД возникла ошибка: %1'");
	
	Попытка
		
		РезультатЧтения = ДанныеXMLМЧД(ДвоичныеДанные);
		Если НЕ РезультатЧтения.Успех Тогда
			Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		
	Исключение
		
		Операция = НСтр("ru = 'Разбор МЧД'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Ошибка при разборе файла МЧД'");
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения);
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Результат.ТекстОшибки = ТекстСообщения;
		Возврат Результат;
		
	КонецПопытки;
	
	Результат.Успех = Истина;
	Результат.ДанныеДоверенности = РезультатЧтения.ДанныеДоверенности;
	Возврат Результат; 

КонецФункции

// Возвращает данные, полученные из файла обмена доверенности в формате 002
// 
// Параметры:
//  ДанныеДоверенности - См. НовыеДанныеМЧД
//  Документ - Произвольный
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
//
Процедура ЗаполнитьДовериеПоФормату002(ДанныеДоверенности, Документ, ЭтоДоверенностьОрганизации = Неопределено)
	
	СведенияДоверенности = Документ.СвДов;
	
	ДанныеДоверенности.Вставить("НомерДоверенности", СведенияДоверенности.НомДовер);
	ДанныеДоверенности.Вставить("ДатаВыдачи", СведенияДоверенности.ДатаВыдДовер);
	ДанныеДоверенности.Вставить("ДатаОкончания", СведенияДоверенности.ДатаКонДовер);
	ДанныеДоверенности.Вставить("СрокДействия", "");
	СведенияОбИнформационнойСистеме = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверенности, "СведСистОтм", "Строка");	
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", СведенияОбИнформационнойСистеме);	
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", "");		
	ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", "");
	ДанныеДоверенности.Вставить("ТипПередоверия", СведенияДоверенности.ПрПередов);
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);	
	ДанныеДоверенности.Вставить("СовместныеПолномочия", ?(СведенияДоверенности.ПрСовмПолн = "2", Истина, Ложь));
	
	СведенияОДоверителе = Документ.СвДоверит[0];
	ДанныеДоверенности.Вставить("ТипОрганизации", СведенияОДоверителе.ТипДовер);
	
	Если СведенияОДоверителе.ТипДовер = "ЮЛ" Тогда
		СведенияДоверителя = СведенияОДоверителе.РосОргДовер.СвРосОрг;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИО" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИнОргДовер;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИП" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИПДовер;
	Иначе
		СведенияДоверителя = СведенияОДоверителе.ФЛДовер;
	КонецЕсли;
	
	РеквизитыПоискаОрганизации = Новый Соответствие;
	
	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
		
		ЛицоБезДоверенности = СведенияОДоверителе.РосОргДовер.ЛицоБезДов;
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", СведенияДоверителя.ИННЮЛ);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", СведенияДоверителя.КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", СведенияДоверителя.ОГРН);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрРФ);
		
		СведенияПоФизическомуЛицу = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СвФЛ");		
		Если СведенияПоФизическомуЛицу <> Неопределено Тогда
			
			ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "ИННФЛ", "Строка");		
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", ИННФЛ);		
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", СведенияПоФизическомуЛицу.СНИЛС);
			
			ДанныеДоверенности.Вставить(
				"ЛицоБезДовФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу.СведФЛ));
			
			ДатаРожд = 
				ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(
					СведенияПоФизическомуЛицу.СведФЛ, "ДатаРожд", "Дата");
			
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", ДатаРожд);
			Должность = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Должность", "Строка");
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", Должность);
			
		КонецЕсли;
		
		СведенияОЮридическомЛице = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СвОрг");
		Если СведенияОЮридическомЛице <> Неопределено Тогда
			ЛицоБезДовЮЛ_НаимОрг = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "НаимОрг", "Строка");		
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", ЛицоБезДовЮЛ_НаимОрг);
			ЛицоБезДовЮЛ_ИНН = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ИННЮЛ", "Строка");
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", ЛицоБезДовЮЛ_ИНН);
			ЛицоБезДовЮЛ_КПП = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "КПП", "Строка");
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", ЛицоБезДовЮЛ_КПП);
			ОГРН = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ОГРН", "Строка");
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", ОГРН);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДоверенности.ЛицоБезДовФЛ_ИНН) Тогда
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ", ПодыскатьИнформациюВладельца("Контрагенты,ФизическиеЛица",
			ДанныеДоверенности.ЛицоБезДовФЛ_ИНН,, ДанныеДоверенности.ЛицоБезДовФЛ_СНИЛС));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДоверенности.ЛицоБезДовЮЛ_ИНН) Тогда
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ", ПодыскатьИнформациюВладельца("Контрагенты,Организации",
			ДанныеДоверенности.ЛицоБезДовЮЛ_ИНН, ДанныеДоверенности.ЛицоБезДовЮЛ_КПП));
		КонецЕсли;
		
		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительЮЛ_ИНН);
		РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);
		
		ДобавитьСведенияОбУчастникеМЧД(
			СведенияОДоверителе.Подписант,
			Перечисления.СубъектыДоверенности.ДоверительРук,
			ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИО" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Истина);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИО);
		ИННЮЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННЮЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", ИННЮЛ);
		КПП = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "КПП", "Строка");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", СведенияДоверителя.СтрРег);
		НаимРегОрг = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "НаимРегОрг", "Строка");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", НаимРегОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", СведенияДоверителя.РегНомер);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрСтрРег);
		
		СведенияОРуководителеОбособленногоПодразделения = СведенияДоверителя.СвРукОП;
		СведенияПоФизическомуЛицу = СведенияОРуководителеОбособленногоПодразделения.СведФЛ;
		
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияОРуководителеОбособленногоПодразделения, "ИННФЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		МестоРожд = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "МестоРожд", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", МестоРожд);
		Пол = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Пол", "Число");
		Пол = ?(Пол = 0, 1, Пол);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Пол", Пол);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		
		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительЮЛ_ИНН);
		РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", СведенияДоверителя.ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", СведенияДоверителя.ОГРНИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СведенияДоверителя.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;		
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		
		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительФЛ_ИНН);
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		Перечисления.СубъектыДоверенности.ДоверительФЛ,
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
		
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННФЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		СНИЛС = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "СНИЛС", "Строка");		
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
		РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительФЛ_ИНН);
		
	КонецЕсли;
	
	Для Каждого СведенияОбУполномоченномПредставителе Из Документ.СвУпПред Цикл
		
		ТипУполномоченногоПредставителя = СведенияОбУполномоченномПредставителе.ТипПред;
		ДанныеДоверенности.Представители.Добавить(ЗаполнитьСведенияОПредставителеМЧД(
			СведенияОбУполномоченномПредставителе, ТипУполномоченногоПредставителя));
		
	КонецЦикла;
		
	ОрганизацияИНН =  РеквизитыПоискаОрганизации.Получить("ИНН");
	ОрганизацияКПП = РеквизитыПоискаОрганизации.Получить("КПП");
	
	Если ЭтоДоверенностьОрганизации = Неопределено Тогда
		РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП("Организации", ОрганизацияИНН, ОрганизацияКПП);
		Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
			РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП("Контрагенты", ОрганизацияИНН, ОрганизацияКПП);
		КонецЕсли;
	Иначе
		СправочникДляПоиска = ?(ЭтоДоверенностьОрганизации, "Организации", "Контрагенты");
		РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП(СправочникДляПоиска, ОрганизацияИНН, ОрганизацияКПП);
	КонецЕсли;
	
	ДанныеДоверенности.Вставить("Организация", РезультатПоиска);
	
	Полномочия = Документ.СвПолн;
	ЗаполнитьПолномочия(ДанныеДоверенности, Полномочия);
	
КонецПроцедуры

// Возвращает данные, полученные из файла обмена передоверия в формате 002
// 
// Параметры:
//  ДанныеДоверенности - См. НовыеДанныеМЧД
//  Документ - Произвольный
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
//
Процедура ЗаполнитьПередовериеПоФормату002(ДанныеДоверенности, Документ, ЭтоДоверенностьОрганизации = Неопределено)
	
	СведенияДоверенности = Документ.СвДовПер.СвПереДовер;
	
	ДанныеДоверенности.Вставить("НомерДоверенности", СведенияДоверенности.НомДовер);
	ДанныеДоверенности.Вставить("ДатаВыдачи", СведенияДоверенности.ДатаВыдДовер);
	ДанныеДоверенности.Вставить("ДатаОкончания", СведенияДоверенности.ДатаКонДовер);
	ДанныеДоверенности.Вставить("СрокДействия", "");

	СведенияОбИнформационнойСистеме = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверенности, "СведСистОтм", "Строка");	
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", СведенияОбИнформационнойСистеме);	

	НомерРодительскойДоверенности = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(Документ, "СвДовПер.НомДоверN", "Строка");	
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", НомерРодительскойДоверенности);	
	ДанныеДоверенности.Вставить("ТипПередоверия", СведенияДоверенности.ПрПередов);
	ДанныеДоверенности.Вставить("УтратаПолномочийПриПередоверии", ?(СведенияДоверенности.ПрУтрПолн = "1", Истина, Ложь));
	ДанныеДоверенности.Вставить("СовместныеПолномочия", ?(СведенияДоверенности.ПрСовмПолн = "2", Истина, Ложь));
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);	
	
	СведенияОбОсновнойДоверенности = Документ.СвДовПер.СвОснДовер;
	СведенияОДоверителеОсновнойДоверенности = СведенияОбОсновнойДоверенности.СвДовер0[0];
	ДанныеДоверенности.НомерОсновнойДоверенности = СведенияОбОсновнойДоверенности.НомДовер0;
	ДанныеДоверенности.НомерРодительскойДоверенности = ДанныеДоверенности.НомерОсновнойДоверенности;
	ДанныеДоверенности.Вставить("ТипДоверителяОсновнойДоверенности", СведенияОДоверителеОсновнойДоверенности.ТипДовер);
	
	Если СведенияОДоверителеОсновнойДоверенности.ТипДовер = "ЮЛ" Тогда
		СведенияДоверителяОсновнойДоверенности = СведенияОДоверителеОсновнойДоверенности.РосОргДовер;
	ИначеЕсли СведенияОДоверителеОсновнойДоверенности.ТипДовер = "ИП" Тогда
		СведенияДоверителяОсновнойДоверенности = СведенияОДоверителеОсновнойДоверенности.ИПДовер;
	Иначе
		СведенияДоверителяОсновнойДоверенности = СведенияОДоверителеОсновнойДоверенности.ФЛДовер;
	КонецЕсли;
	
	Если ДанныеДоверенности.ТипДоверителяОсновнойДоверенности = "ЮЛ" Тогда
		ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", СведенияДоверителяОсновнойДоверенности.ИННЮЛ);
		ДанныеДоверенности.КППДоверителяРодительскойДоверенности = СведенияДоверителяОсновнойДоверенности.КПП;
	ИначеЕсли ДанныеДоверенности.ТипДоверителяОсновнойДоверенности = "ИП" Тогда
		ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", СведенияДоверителяОсновнойДоверенности.ИННФЛ);
	ИначеЕсли ДанныеДоверенности.ТипДоверителяОсновнойДоверенности = "ФЛ" Тогда
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителяОсновнойДоверенности, "ИННФЛ", "Строка");
		ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", ИННФЛ);
	КонецЕсли;
	
	СведенияОДоверителе = Документ.СвЛицПередПолн[0];
	ДанныеДоверенности.Вставить("ТипОрганизации", СведенияОДоверителе.ТипЛицПрдПолн);
	
	Если СведенияОДоверителе.ТипЛицПрдПолн = "ЮЛ" Тогда
		СведенияДоверителя = СведенияОДоверителе.РосОргПрдПолн;
	ИначеЕсли СведенияОДоверителе.ТипЛицПрдПолн = "ИП" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИППрдПолн;
	Иначе
		СведенияДоверителя = СведенияОДоверителе.ФЛПрдПолн;
	КонецЕсли;
	
	РеквизитыПоискаОрганизации = Новый Соответствие;
	РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ИННДоверителяРодительскойДоверенности);
	Если ЗначениеЗаполнено(ДанныеДоверенности.КППДоверителяРодительскойДоверенности) Тогда
		РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.КППДоверителяРодительскойДоверенности);
	КонецЕсли;
	
	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", СведенияДоверителя.ИННЮЛ);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", СведенияДоверителя.КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", СведенияДоверителя.ОГРН);
		
		АдрРег = СведенияДоверителя.АдрРег;
		Если АдрРег <> Неопределено Тогда
			ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", АдрРег.АдрРФ);
		КонецЕсли;
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		Перечисления.СубъектыДоверенности.ДоверительРук,
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", СведенияДоверителя.ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", СведенияДоверителя.ОГРНИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СведенияДоверителя.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;		
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		Перечисления.СубъектыДоверенности.ДоверительФЛ,
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
		
		ИННФЛ = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННФЛ", "Строка");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		СНИЛС = ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(СведенияДоверителя, "СНИЛС", "Строка");		
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
	КонецЕсли;
	
	Для Каждого СведенияОбУполномоченномПредставителе Из Документ.СвЛицПолучПолн Цикл
		
		ТипУполномоченногоПредставителя = СведенияОбУполномоченномПредставителе.ТипПред;
		ДанныеДоверенности.Представители.Добавить(ЗаполнитьСведенияОПредставителеМЧД(
			СведенияОбУполномоченномПредставителе, ТипУполномоченногоПредставителя));
		
	КонецЦикла;
	
	ОрганизацияИНН =  РеквизитыПоискаОрганизации.Получить("ИНН");
	ОрганизацияКПП = РеквизитыПоискаОрганизации.Получить("КПП");
	
	Если ЭтоДоверенностьОрганизации = Неопределено Тогда
		РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП("Организации", ОрганизацияИНН, ОрганизацияКПП);
		Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
			РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП("Контрагенты", ОрганизацияИНН, ОрганизацияКПП);
		КонецЕсли;
	Иначе
		СправочникДляПоиска = ?(ЭтоДоверенностьОрганизации, "Организации", "Контрагенты");
		РезультатПоиска = ЭлектронныеДокументыПереопределяемый.СсылкаНаОбъектПоИННКПП(СправочникДляПоиска, ОрганизацияИНН, ОрганизацияКПП);
	КонецЕсли;
	
	ДанныеДоверенности.Вставить("Организация", РезультатПоиска);
	
	Полномочия = Документ.СвПолн;
	ЗаполнитьПолномочия(ДанныеДоверенности, Полномочия);
	
КонецПроцедуры

// Возвращает данные, полученные из файла обмена в пилотном формате.
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеМЧД - см. НовыеДанныеМЧД
//
Функция ДанныеИзФайлаОбменаВПилотномФормате(ВходящиеДанные)
	
	КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");

	ДанныеДоверенности = НовыеДанныеМЧД();
	
	Если ТипЗнч(ВходящиеДанные) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные = ВходящиеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ВходящиеДанные) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ВходящиеДанные);
	Иначе
		ДвоичныеДанные = Новый ДвоичныеДанные(ВходящиеДанные);
	КонецЕсли;
	
	ДокументОбработки = ПодготовитьДокументDOM(ВходящиеДанные);
	
	ДанныеДоверенности.Вставить("XMLфайлМЧД", Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9)));
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');
	
	СведенияДоверенности = ПолучитьВыборкуЭлементовDOM(ДокументОбработки, "/Файл/Документ/СвДов");

	Если СведенияДоверенности.Количество() = 1 Тогда

		ЭлементВыборки = СведенияДоверенности[0];
		ДанныеДоверенности.Вставить("НомерДоверенности", ПолучитьЗначениеДокумента(ЭлементВыборки, "@НомДовер"));
		ДанныеДоверенности.Вставить("ДатаВыдачи", ПолучитьЗначениеДокумента(ЭлементВыборки, "@ДатаНач", '00010101'));
		ДанныеДоверенности.Вставить("ДатаОкончания", ПолучитьЗначениеДокумента(ЭлементВыборки, "ДатаОкон", '00010101'));
		ДанныеДоверенности.Вставить("СрокДействия", ПолучитьЗначениеДокумента(ЭлементВыборки, "СрокДейст", ""));
		ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", ПолучитьЗначениеДокумента(ЭлементВыборки,
			"СведСистОтм", ""));
		ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", ПолучитьЗначениеДокумента(ЭлементВыборки,
			"@НомПредДовер", ""));
		ПравоПередоверияСтрока = ПолучитьЗначениеДокумента(ЭлементВыборки, "@ПрПередов");
		ДанныеДоверенности.Вставить("ВозможноПередоверие", ?(ПравоПередоверияСтрока = "1", Истина, Ложь));
	КонецЕсли;

	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);
	ДанныеДоверенности.Вставить("ТипОрганизации", "");

	СведенияДоверителяЮЛ = ПолучитьВыборкуЭлементовDOM(ДокументОбработки, "/Файл/Документ/СвДоверит/РосОргДовер");
	СведенияДоверителяФЛ = ПолучитьВыборкуЭлементовDOM(ДокументОбработки, "/Файл/Документ/СвДоверит/ФЛДовер");
	СведенияДоверителяИО = ПолучитьВыборкуЭлементовDOM(ДокументОбработки, "/Файл/Документ/СвДоверит/ИнОргДовер");

	Если СведенияДоверителяЮЛ.Количество() = 1 Тогда
		ДанныеДоверенности.ТипОрганизации = "ЮЛ";
		СведенияДоверителя = СведенияДоверителяЮЛ;
	ИначеЕсли СведенияДоверителяФЛ.Количество() = 1 Тогда
		ДанныеДоверенности.ТипОрганизации = "ФЛ";
		СведенияДоверителя = СведенияДоверителяФЛ;
	Иначе
		ДанныеДоверенности.ТипОрганизации = "ИО";
		СведенияДоверителя = СведенияДоверителяИО;
	КонецЕсли;

	РеквизитыПоискаОрганизации = Новый Соответствие;

	Если СведенияДоверителя.Количество() = 1 Тогда
		ЭлементВыборки = СведенияДоверителя[0];
		Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
			ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", ПолучитьЗначениеДокумента(ЭлементВыборки, "@НаимОрг"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", ПолучитьЗначениеДокумента(ЭлементВыборки, "@ИННЮЛ"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", ПолучитьЗначениеДокумента(ЭлементВыборки, "@КПП"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", ПолучитьЗначениеДокумента(ЭлементВыборки, "@ОГРН"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", ПолучитьЗначениеДокумента(ЭлементВыборки, "@АдрРФ"));

			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвФЛ/@ИННФЛ"));
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвФЛ/@СНИЛС"));
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Гражданство", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвФЛ/@Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка()));
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвФЛ/@ДатаРожд", '00010101'));
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвФЛ/@Должность"));

			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвОрг/@НаимОрг"));
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвОрг/@ИННЮЛ"));
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвОрг/@КПП"));
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"ЛицоБезДов/СвОрг/@ОГРН"));

			Если ЗначениеЗаполнено(ДанныеДоверенности.ЛицоБезДовФЛ_ИНН) Тогда
				ДанныеДоверенности.Вставить("ЛицоБезДовФЛ", ПодыскатьИнформациюВладельца("Контрагенты,ФизическиеЛица",
					ДанныеДоверенности.ЛицоБезДовФЛ_ИНН,, ДанныеДоверенности.ЛицоБезДовФЛ_СНИЛС));
			КонецЕсли;

			Если ЗначениеЗаполнено(ДанныеДоверенности.ЛицоБезДовЮЛ_ИНН) Тогда
				ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ", ПодыскатьИнформациюВладельца("Контрагенты,Организации",
					ДанныеДоверенности.ЛицоБезДовЮЛ_ИНН, ДанныеДоверенности.ЛицоБезДовЮЛ_КПП));
			КонецЕсли;

			РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительЮЛ_ИНН);
			РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);

		ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИО" Тогда
			ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Истина);
			ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", ПолучитьЗначениеДокумента(ЭлементВыборки, "@НаимИО"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", ПолучитьЗначениеДокумента(ЭлементВыборки, "@ИННЮЛ"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", ПолучитьЗначениеДокумента(ЭлементВыборки, "@КПП"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", ПолучитьЗначениеДокумента(ЭлементВыборки, "@СтрРег",
				Справочники[КлассификаторСтранМира].ПустаяСсылка()));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"@НаимРегОрг"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", ПолучитьЗначениеДокумента(ЭлементВыборки, "@РегНомер"));
			ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", ПолучитьЗначениеДокумента(ЭлементВыборки, "АдрСтрРег"));

			ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ПолучитьЗначениеДокумента(ЭлементВыборки, "СвРукОП/@ИННФЛ"));
			ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"СвРукОП/@ДатаРожд", '00010101'));
			ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"СвРукОП/@МестоРожд"));
			ДанныеДоверенности.Вставить(
				"ДоверительФЛ_Пол", ПолучитьЗначениеДокумента(ЭлементВыборки, "СвРукОП/@Пол", 1));
			ПризнакГражданства = ПолучитьЗначениеДокумента(ЭлементВыборки, "СвРукОП/@ПрГражд");
			Если ПризнакГражданства = 1 Тогда
				ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", Справочники[КлассификаторСтранМира].Россия);
			Иначе
				ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ПолучитьЗначениеДокумента(ЭлементВыборки,
					"СвРукОП/@Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка()));
			КонецЕсли;

			РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительЮЛ_ИНН);
			РеквизитыПоискаОрганизации.Вставить("КПП", ДанныеДоверенности.ДоверительЮЛ_КПП);

		ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
			ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ПолучитьЗначениеДокумента(ЭлементВыборки, "@ИННФЛ"));
			ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", ПолучитьЗначениеДокумента(ЭлементВыборки, "@ОГРНИП"));
			ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", ПолучитьЗначениеДокумента(ЭлементВыборки, "@СНИЛС"));
			ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"@Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка()));
			ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", ПолучитьЗначениеДокумента(ЭлементВыборки,
				"@ДатаРожд", '00010101'));

			РеквизитыПоискаОрганизации.Вставить("ИНН", ДанныеДоверенности.ДоверительФЛ_ИНН);

		КонецЕсли;

	КонецЕсли;

	СведенияУполномоченных = ПолучитьВыборкуЭлементовDOM(ДокументОбработки, "/Файл/Документ/СвУпПред");
	
	Для Каждого СтрокаМассива Из СведенияУполномоченных Цикл

		ПолномочияПредставителя = ПолучитьВыборкуЭлементовDOM(СтрокаМассива, "ПрОблПолн");
		
		Для каждого ПолномочиеПредставителя Из ПолномочияПредставителя Цикл
			
			ПредставлениеВида = СокрЛП(ПолномочиеПредставителя.ТекстовоеСодержимое);
			
			Если ПредставлениеВида = "99" Тогда
				
				Полномочие = НовыеПолномочияПредставителя();
				Полномочие.Описание = МашиночитаемыеДоверенностиКлиентСервер.ПредставлениеНеограниченныхПолномочий();
				ДанныеДоверенности.Полномочия.Добавить(Полномочие);
				
			ИначеЕсли СтрДлина(ПредставлениеВида) = 2 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПредставлениеВида) Тогда
				
				ВидПолномочия = Число(ПредставлениеВида);
				
				Если ВидПолномочия >= 1 И ВидПолномочия <= КоличествоВидовПолномочийПредставителя() Тогда
					
					Полномочие = НовыеПолномочияПредставителя();
					Полномочие.Код = ПредставлениеВида;
					ДанныеДоверенности.Полномочия.Добавить(Полномочие);

				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ВыборкаЭлементовТекстПолномочий = ПолучитьВыборкуЭлементовDOM(СтрокаМассива, "ТекстПолн");
		
		Для каждого СтрокаПолномочий Из ВыборкаЭлементовТекстПолномочий Цикл

			Полномочие = НовыеПолномочияПредставителя();
			Полномочие.Описание = СтрокаПолномочий.ТекстовоеСодержимое;
			ДанныеДоверенности.Полномочия.Добавить(Полномочие);

		КонецЦикла;
		
		Представитель = Новый Структура;
		
		ИнформацияОрганизации = ПолучитьВыборкуЭлементовDOM(СтрокаМассива, "СвПред/СвОрг");
		Если ИнформацияОрганизации.Количество() > 0 Тогда
			Представитель.Вставить("ТипУполномоченногоПредставителя", "ЮЛ");
			Представитель.Вставить("ПредставительЮЛ_НаимОрг", ПолучитьЗначениеДокумента(ИнформацияОрганизации[0],
				"@НаимОрг"));
			Представитель.Вставить("ПредставительЮЛ_ИНН", ПолучитьЗначениеДокумента(ИнформацияОрганизации[0],
				"@ИННЮЛ"));
			Представитель.Вставить("ПредставительЮЛ_КПП", ПолучитьЗначениеДокумента(ИнформацияОрганизации[0],
				"@КПП"));
			Представитель.Вставить("ПредставительЮЛ_ОГРН", ПолучитьЗначениеДокумента(ИнформацияОрганизации[0],
				"@ОГРН"));
		КонецЕсли;

		СведенияФЛ = ПолучитьВыборкуЭлементовDOM(СтрокаМассива, "СвПред/СведФизЛ");
		Если СведенияФЛ.Количество() > 0 Тогда 
			
			СведенияФЛ = СведенияФЛ[0];
			Представитель.Вставить("ПредставительФЛ_ИНН", ПолучитьЗначениеДокумента(СведенияФЛ, "@ИННФЛ"));
		
			Представитель.Вставить("ТипУполномоченногоПредставителя", "ФЛ");
			
			ОГРНИП = ПолучитьЗначениеДокумента(СведенияФЛ, "@ОГРНИП");
			Если ОГРНИП <> Неопределено Тогда
				Представитель.ТипУполномоченногоПредставителя = "ИП";
			КонецЕсли;

			Представитель.Вставить("ПредставительФЛ_СНИЛС", ПолучитьЗначениеДокумента(СведенияФЛ, "@СНИЛС"));
			Представитель.Вставить("ПредставительФЛ_Гражданство", ПолучитьЗначениеДокумента(СведенияФЛ,
				"@Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка()));
			Представитель.Вставить("ПредставительФЛ_ДатаРождения", ПолучитьЗначениеДокумента(СведенияФЛ,
				"@ДатаРожд", '00010101'));

			Представитель.Вставить("Фамилия", ПолучитьЗначениеДокумента(СведенияФЛ, "ФИО/@Фамилия"));
			Представитель.Вставить("Имя", ПолучитьЗначениеДокумента(СведенияФЛ, "ФИО/@Имя"));
			Представитель.Вставить("Отчество", ПолучитьЗначениеДокумента(СведенияФЛ, "ФИО/@Отчество"));
			ФИО = СокрЛП(СтрШаблон("%1 %2 %3", Представитель.Фамилия, Представитель.Имя, Представитель.Отчество));
			Представитель.Вставить("ПредставительФИО", ФИО);

			ДанныеУдостоверенияЛичности = НовыеДанныеУдостоверенияЛичности(); 
			СерияНомер = ПодготовитьПредставлениеСерияНомер(ПолучитьЗначениеДокумента(СведенияФЛ, "УдЛичн/@СерНомДок"));
			ДанныеУдостоверенияЛичности.СерДок = СерияНомер.Серия;
			ДанныеУдостоверенияЛичности.НомДок = СерияНомер.Номер;
			ДанныеУдостоверенияЛичности.ДатаДок = ПолучитьЗначениеДокумента(СведенияФЛ, "УдЛичн/@ДатаДок", '00010101');
			ДанныеУдостоверенияЛичности.ВыдДок = ПолучитьЗначениеДокумента(СведенияФЛ, "УдЛичн/@ВыдДок");
			ДанныеУдостоверенияЛичности.ВидДок = ПолучитьЗначениеДокумента(СведенияФЛ, "УдЛичн/@КодВидДок");
			ДанныеУдостоверенияЛичности.КодВыдДок = ПолучитьЗначениеДокумента(СведенияФЛ, "УдЛичн/@КодВыдДок");
			
			Представитель.Вставить("УдостоверениеЛичности", ДанныеУдостоверенияЛичности);
			
		КонецЕсли;

		ПредставительСсылка = Неопределено;
		Если Представитель.Свойство("ПредставительЮЛ_ИНН") И ЗначениеЗаполнено(
			Представитель.ПредставительЮЛ_ИНН) Тогда
			ПредставительСсылка = ПодыскатьИнформациюВладельца("Контрагенты,Организации",
				Представитель.ПредставительЮЛ_ИНН, Представитель.ПредставительЮЛ_КПП);
		КонецЕсли;

		Если Не Представитель.Свойство("ПредставительЮЛ_ИНН") Или Не ЗначениеЗаполнено(
			Представитель.ПредставительЮЛ_ИНН) И Не ЗначениеЗаполнено(Представитель) И ЗначениеЗаполнено(
			Представитель.ПредставительФЛ_ОГРН) Тогда
			ПредставительСсылка = ПодыскатьИнформациюВладельца("Контрагенты", Представитель.ПредставительФЛ_ИНН);
		КонецЕсли;

		Если Не Представитель.Свойство("ПредставительЮЛ_ИНН") Или Не ЗначениеЗаполнено(
			Представитель.ПредставительЮЛ_ИНН) И Не ЗначениеЗаполнено(Представитель) Тогда
			ПредставительСсылка = ПодыскатьИнформациюВладельца("ФизическиеЛица", Представитель.ПредставительФЛ_ИНН);
		КонецЕсли;
		
		Представитель.Вставить("Представитель", ПредставительСсылка);

		ДанныеДоверенности.Представители.Добавить(Представитель);

	КонецЦикла;

	СведенияПодписанта = ПолучитьВыборкуЭлементовDOM(ДокументОбработки, "/Файл/Документ/Подписант");
	Если СведенияПодписанта.Количество() = 1 Тогда
		ЭлементВыборки = СведенияПодписанта[0];

		НоваяСтрока = НовыеДанныеСубъектаМЧД();
		НоваяСтрока.Фамилия = ПолучитьЗначениеДокумента(ЭлементВыборки, "@Фамилия");
		НоваяСтрока.Имя = ПолучитьЗначениеДокумента(ЭлементВыборки, "@Имя");
		НоваяСтрока.Отчество = ПолучитьЗначениеДокумента(ЭлементВыборки, "@Отчество");
		Если ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
			НоваяСтрока.Владелец = Перечисления.СубъектыДоверенности.ДоверительФЛ;
		Иначе
			НоваяСтрока.Владелец = Перечисления.СубъектыДоверенности.ДоверительРук;
		КонецЕсли;
		ДанныеДоверенности.ФИО.Добавить(НоваяСтрока);
	КонецЕсли;

	РезультатПоиска = Неопределено;
	СтруктураПоиска = Новый Структура("ИНН, КПП");
	СтруктураПоиска.ИНН =  РеквизитыПоискаОрганизации.Получить("ИНН");
	СтруктураПоиска.КПП = РеквизитыПоискаОрганизации.Получить("КПП");
	РезультатПоиска = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект(
		"Организации", , СтруктураПоиска);
	ДанныеДоверенности.Вставить("Организация", РезультатПоиска);
	
	Возврат Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Истина, "", ДанныеДоверенности);

КонецФункции

// Отключает проверку подписи по МЧД.
// 
// Параметры:
//  ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  ХешПодписи - См. КриптографияБЭД.ХешПодписи
Процедура ОтключитьПроверкуПодписи(ПодписанныйОбъект, ХешПодписи)
	
	НаборЗаписей = РегистрыСведений.ЭлектронныеПодписиПоМЧД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(ПодписанныйОбъект);
	НаборЗаписей.Отбор.ХешПодписи.Установить(ХешПодписи);
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращает пространство имен файла МЧД, прочитав из содержимого файла информации отправителя электронного документа.
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Строка
Функция ВерсияФорматаПоДаннымЭлектронногоДокумента(ДвоичныеДанныеАрхива) Экспорт
	
	Результат = "";

	ДанныеАрхива = ПрочитатьАрхив(ДвоичныеДанныеАрхива);
	Если ДанныеАрхива = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	ДвоичныеДанныеМЧД = ДанныеАрхива.ДанныеДоверенности;
	Результат = ВерсияФорматаФайлаМЧД(ДвоичныеДанныеМЧД);

	Возврат Результат;
	
КонецФункции

// Определяет пространство имен файла МЧД по его содержимому.
// 
// Параметры:
//  ДвоичныеДанныеМЧД - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Строка
Функция ВерсияФорматаФайлаМЧД(ДвоичныеДанныеМЧД)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ДвоичныеДанныеМЧД.ОткрытьПотокДляЧтения());
	ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	Возврат ВерсияФорматаОбъектаМЧД(ДанныеXDTO);
	
КонецФункции

// Определяет являются ли двоичные данные файлом заявления на отмену МЧД.
// 
// Параметры:
//  ДвоичныеДанныеМЧД - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Строка
Функция ЭтоЗаявлениеНаОтмену(ДвоичныеДанныеМЧД)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ДвоичныеДанныеМЧД.ОткрытьПотокДляЧтения());
	ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Если ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO, "Файл.Документ.СвЗаяв.ПричОтз") <> Неопределено Тогда
		Возврат ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(ДанныеXDTO, "Файл.ВерсФорм") <> "";
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает коллекцию шаблонов ошибок доступа
// 
// Возвращаемое значение - Коллекция общих шаблонов ошибок:
//  Соответствие:
//   * Ключ - Строка
//   * Значение - Строка
Функция КодыОшибокДоступа()
	
	Результат = Новый Соответствие;
	Результат.Вставить("/errors/unauthenticated",
		НСтр("ru = 'Запрос к серверу МЧД распределенного реестра выполнен от неавторизованного пользователя'"));
	Результат.Вставить("/errors/unauthorized",
		НСтр("ru = 'Запрос выполнен не от пользователя с ролью для доступа к серверу МЧД распределенного реестра'"));
	Возврат Результат;
	
КонецФункции

// Возвращает коллекцию шаблонов ошибок отзыва
// 
// Возвращаемое значение - Коллекция общих шаблонов ошибок отзыва:
//  Соответствие:
//   * Ключ - Строка
//   * Значение - Строка
Функция КодыОшибокОтзыва(НомерДоверенности)
	
	Результат = Новый Соответствие;
	Результат.Вставить("/errors/not-found",
		СтрШаблон(НСтр("ru = 'Не найдена доверенность с номером ""%1""'"), НомерДоверенности));
	Возврат Результат;
	
КонецФункции

// Возвращает строку, из которой удалены все символы, не являющиеся цифрами
// 
// Параметры:
//  ИсходнаяСтрока - Строка
// 
// Возвращаемое значение:
//  Строка - Строка, состоящая только из цифр
//  
Функция УбратьИзСтрокиВсеНеЦифры(ИсходнаяСтрока)
	
	Результат = "";
	Для НомерСимвола = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		ТекущийСимвол = Сред(ИсходнаяСтрока, НомерСимвола, 1);
		Если Найти("0123456789", ТекущийСимвол) > 0 Тогда
			Результат = Результат + ТекущийСимвол; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак реестровой МЧД с необходимостью установки признака "Верна" и не требующего перезаполнения
//
//	Параметры:
//	 ДанныеДляПроверки - См.МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД
//	 ДанныеДоверенности - См. МашиночитаемыеДоверенности.ДанныеИзФайлаОбмена
//
//	Возвращаемое значение:
//	 Булево.
//
Функция ЭтоПровереннаяРеестроваяМЧД(ДанныеДляПроверки, ДанныеДоверенности) Экспорт
		
	ДоверенностьПодписана = ЗначениеЗаполнено(ДанныеДляПроверки.ДанныеПодписи)
							И ЗначениеЗаполнено(ДанныеДляПроверки.ДанныеДоверенности);
	СтатусВРеестреФНС = Неопределено;
	ДанныеДоверенности.Свойство("СтатусВРеестреФНС", СтатусВРеестреФНС);
	ДоверительныеСтатусы = ДоверительныеСтатусыВРеестреФНС();
	
	Возврат ДоверенностьПодписана И ДоверительныеСтатусы.Найти(СтатусВРеестреФНС) <> Неопределено;
	
КонецФункции

// Возвращает признак того что МЧД нуждается в перезаполнении и перепроверке на сервере.
//
//	Параметры:
//	 Доверенность - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//	              - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//	              - СправочникОбъект.МЧД003
//	 НовыеДанные - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД
//	 ФорматДоверенности - Строка
//
//	Возвращаемое значение:
//	 Булево
Функция ТребуетсяПерезаполнениеМЧД(Доверенность, НовыеДанные, ФорматДоверенности = "") Экспорт

	ТребуетсяПерезаполнение = Ложь;

	Если ТипЗнч(Доверенность) = Тип("СправочникОбъект.МЧД003") Тогда
		ТребуетсяПерезаполнение = Справочники.МЧД003.ТребуетсяПерезаполнениеМЧД(Доверенность, НовыеДанные);
	Иначе
		ДатаОтзыва = ДатаОтзываДоверенностиПоДаннымДляЗагрузкиМЧД(НовыеДанные);

		НеЗаполненИННДоверителя = ТипЗнч(Доверенность) = Тип("СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов")
			И Не ЗначениеЗаполнено(Доверенность.ДоверительИНН);
		ТребуетсяПерезаполнение = Доверенность.ЭлектроннаяПодпись.Получить() <> НовыеДанные.ДанныеПодписи
			Или Доверенность.XMLфайлМЧД.Получить() <> НовыеДанные.ДанныеДоверенности Или (ЗначениеЗаполнено(ДатаОтзыва)
			И Доверенность.ДатаОтзыва <> ДатаОтзыва) Или НеЗаполненИННДоверителя;
	КонецЕсли;

	Возврат ТребуетсяПерезаполнение;

КонецФункции

// Параметры:
//  Доверенность - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//	             - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//	             - СправочникОбъект.МЧД003
//	             - См. НовыеСведенияМЧД
//  ДанныеДляЗагрузки - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляЗагрузкиМЧД
Процедура ЗаполнитьРеквизитыОтзыва(Доверенность, ДанныеДляЗагрузки) Экспорт

	ДатаОтзыва = ДатаОтзываДоверенностиПоДаннымДляЗагрузкиМЧД(ДанныеДляЗагрузки);
	
	Если ЗначениеЗаполнено(ДатаОтзыва) Тогда
		Если ЭтоМЧД003(Доверенность) Тогда
			Доверенность.ДатаПрекращения = ДатаОтзыва;
		Иначе
			Доверенность.ДатаОтзыва = ДатаОтзыва;
			Доверенность.Отозвана = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ДоверительныеСтатусыВРеестреФНС()
	
	ДоверительныеСтатусы = Новый Массив();
	ДоверительныеСтатусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано);
	ДоверительныеСтатусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отозвано);
	ДоверительныеСтатусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ОтправленоЗаявлениеНаОтзыв);
	ДоверительныеСтатусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ОшибкаОтзыва);
	ДоверительныеСтатусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ДатаНачалаДействияНеНаступила);
	ДоверительныеСтатусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ИстекСрокДействия);
	
	Возврат ДоверительныеСтатусы;
	
КонецФункции

// Формирует пустую структуру данных физ лица.
// 
// Возвращаемое значение:
//  Структура:
// * ДатаРождения 		- Дата
// * ИНН 				- Строка
// * МестоРождения 		- Строка
// * Пол 				- Строка
// * СтраховойНомерПФР 	- Строка
// * ФИО 				- Строка
// * Фамилия 			- Строка
// * Имя 				- Строка
// * Отчество 			- Строка
// * Гражданство 		- СправочникСсылка.СтраныМира
// * КодФНС 			- Строка
// * Серия 				- Строка
// * Номер 				- Строка
// * ДатаВыдачи 		- Дата
// * КемВыдан 			- Строка
// * КодПодразделения 	- Строка
Функция НовыеДанныеФизЛица() Экспорт
	КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");
	
	Сведения = Новый Структура;
	Сведения.Вставить("ДатаРождения", Дата(1, 1, 1));
	Сведения.Вставить("ИНН", "");
	Сведения.Вставить("МестоРождения", "");
	Сведения.Вставить("Пол", "");
	Сведения.Вставить("СтраховойНомерПФР", "");
	Сведения.Вставить("ФИО", "");
	Сведения.Вставить("Фамилия", "");
	Сведения.Вставить("Имя", "");
	Сведения.Вставить("Отчество", "");
	Сведения.Вставить("Гражданство", Справочники[КлассификаторСтранМира].ПустаяСсылка());
	Сведения.Вставить("КодФНС", "");
	Сведения.Вставить("Серия", "");
	Сведения.Вставить("Номер", "");
	Сведения.Вставить("ДатаВыдачи", Дата(1, 1, 1));
	Сведения.Вставить("КемВыдан", "");
	Сведения.Вставить("КодПодразделения", "");
	
	Возврат Сведения;
	
КонецФункции

// Формирует структуру с заполненными данными о физическом лице
//
//	Параметры:
//   ФизЛицо - СправочникСсылка - ссылка на элемент справочника, по которому получаются данные.
//
//	Возвращаемое значение:
//	 см. НовыеДанныеФизЛица
//
Функция ДанныеФизЛица(ФизЛицо) Экспорт
	
	Сведения = НовыеДанныеФизЛица();
	ЭлектронныеДокументыПереопределяемый.ПриИзмененииДанныеФизЛицаМЧД(ФизЛицо, Сведения);
	ДлинаКодаПодразделенияБезРазделителя = 6;
	Если СтрДлина(Сведения.КодПодразделения) = ДлинаКодаПодразделенияБезРазделителя Тогда
		Сведения.КодПодразделения = Лев(Сведения.КодПодразделения, 3) + "-" + Прав(Сведения.КодПодразделения, 3);
	КонецЕсли;
	Возврат Сведения;
	
КонецФункции

// Возвращает представление объекта.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура,
//         - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций,
//         - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов,
//         - СправочникОбъект.МЧД003
// 
// Возвращаемое значение:
//  Строка - Представление объекта
//
Функция ПредставлениеОбъекта(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект.НомерДоверенности) Тогда
		ЧастьНомераДоверенности = "*" + Прав(Объект.НомерДоверенности, 4) + " ";
	Иначе
		ЧастьНомераДоверенности = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		ДатаВыдачиСтрокой = НСтр("ru = 'от'") + " " + Формат(Объект.ДатаВыдачи, "ДЛФ=D;");
	Иначе
		ДатаВыдачиСтрокой = "";
	КонецЕсли;
	
	Представление = ЧастьНомераДоверенности + ДатаВыдачиСтрокой;
	
	Возврат Представление;
	
КонецФункции

// Ищет доверенности в справочниках.
// 
// Параметры:
//  НомерДоверенности - Строка
//  ИННДоверителя - Строка
//  СправочникМЧД - СправочникиМенеджер, Неопределено - менеджер справочника доверенностей (002)
//  ВключаяПомеченныеНаУдаление - Булево
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.МЧД003, СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов, СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
Функция НайтиДоверенности(НомерДоверенности, ИННДоверителя, СправочникМЧД = Неопределено, ВключаяПомеченныеНаУдаление = Ложь)
	
	Результат = Справочники.МЧД003.НайтиДоверенности(НомерДоверенности, ИННДоверителя, ВключаяПомеченныеНаУдаление);
	
	Если СправочникМЧД <> Неопределено Тогда
		
		Доверенности = СправочникМЧД.НайтиДоверенности(НомерДоверенности, ВключаяПомеченныеНаУдаление);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Доверенности);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает менеджер справочника МЧД
// 
// Параметры:
//  МЧД - СправочникСсылка.МЧД003
//      - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//      - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
// 
// Возвращаемое значение:
//  - СправочникМенеджер.МЧД003
//  - СправочникМенеджер.МашиночитаемыеДоверенностиКонтрагентов
//  - СправочникМенеджер.МашиночитаемыеДоверенностиОрганизаций
Функция СправочникМЧД(МЧД) Экспорт
	Возврат Справочники[МЧД.Метаданные().Имя];
КонецФункции

// Возвращает сведения о статусах доверенностей.
// 
// Параметры:
//  СправочникМЧД - СправочникМенеджер.МашиночитаемыеДоверенностиКонтрагентов,
//  				СправочникМенеджер.МашиночитаемыеДоверенностиОрганизаций 
// 
//  ДанныеМЧД - Массив из Структура см. НовыеДанныеДоверенности
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - Номер доверенности
//  * Значение - см. НовыеДанныеСтатусаМЧД
//  
Функция СведенияОСтатусахДоверенностей(СправочникМЧД, ДанныеМЧД)
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Соответствие;
	
	Для Каждого ДанныеДоверенности Из ДанныеМЧД Цикл
		
		СтатусМЧД = НовыеДанныеСтатусаМЧД();
		
		НомерДоверенности = ДанныеДоверенности.НомерДоверенности;
		ИННДоверителя = ДанныеДоверенности.ИННДоверителя;
		ВключаяПомеченныеНаУдаление = Истина;
		Доверенности = НайтиДоверенности(НомерДоверенности, ИННДоверителя, СправочникМЧД, ВключаяПомеченныеНаУдаление);
		
		МЧД = Неопределено;
		
		Если Доверенности.Количество() > 0 Тогда
			МЧД = Доверенности[0];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МЧД) Тогда
			
			Если СправочникМЧД(МЧД).ЭтоНереестроваяМЧД(МЧД) Тогда
				
				СтатусМЧД.Сведения = СправочникМЧД(МЧД).СведенияМЧД(МЧД);
				Если ЗначениеЗаполнено(СтатусМЧД.Сведения)
					И ЗначениеЗаполнено(СтатусМЧД.Сведения.НомерРодительскойДоверенности) Тогда
					
					//Рекурсивное получение сведений родительских доверенностей
					СтатусМЧД.Сведения.РодительскиеДанныеМЧД = ПолучитьРодительскиеДанныеДоверенности(
						СтатусМЧД.Сведения.НомерРодительскойДоверенности,
						СтатусМЧД.Сведения.ИННДоверителяРодительскойДоверенности);
				КонецЕсли;
				
				Результат.Вставить(НомерДоверенности, СтатусМЧД);
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(МЧД) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций") Тогда
				ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "ДоверительЮЛ_ИНН");
				Если ЗначениеЗаполнено(ИНН) Тогда
					ИННДоверителя = ИНН;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипЗнч(МЧД) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов") Тогда
				ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МЧД, "ДоверительИНН");
				Если ЗначениеЗаполнено(ИНН) Тогда
					ИННДоверителя = ИНН;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		СведенияИзРеестра = МашиночитаемыеДоверенностиПовтИсп.ПолучитьСведенияДоверенностиНаСервереМЧД(
			НомерДоверенности, ИННДоверителя);
		
		Если СведенияИзРеестра.Ошибка Тогда
			
			СтатусМЧД.Ошибка = Истина;
			СтатусМЧД.ОписаниеОшибки = СведенияИзРеестра.ТекстОшибки;
			Результат.Вставить(НомерДоверенности, СтатусМЧД);
			Продолжить;
			
		КонецЕсли;
		
		РезультатЧтения = ДанныеXMLМЧД(СведенияИзРеестра.ПолныеДанные.ДанныеВыгрузки);
		
		Если НЕ РезультатЧтения.Успех Тогда
			
			СтатусМЧД.Ошибка = Истина;
			СтатусМЧД.ОписаниеОшибки = РезультатЧтения.ТекстОшибки;
			Результат.Вставить(НомерДоверенности, СтатусМЧД);
			Продолжить;
			
		КонецЕсли;
		
		Если ВерсияФорматаОбъектаМЧД(РезультатЧтения.ДанныеДоверенности) = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
			
			СтатусМЧД = Справочники.МЧД003.ЗагрузитьМЧД(СведенияИзРеестра);
			
			Если ЗначениеЗаполнено(СтатусМЧД.Сведения)
				И ЗначениеЗаполнено(СтатусМЧД.Сведения.НомерРодительскойДоверенности) Тогда
				
				//Рекурсивное получение сведений родительских доверенностей
				СтатусМЧД.Сведения.РодительскиеДанныеМЧД = ПолучитьРодительскиеДанныеДоверенности(
					СтатусМЧД.Сведения.НомерРодительскойДоверенности,
					СтатусМЧД.Сведения.ИННДоверителяРодительскойДоверенности);
					
			КонецЕсли;
			
		Иначе
			
			РезультатЗаполнения = СправочникМЧД.ЗаполнитьМЧД(НомерДоверенности, ИННДоверителя, СведенияИзРеестра);
			
			Если РезультатЗаполнения.Ошибка Тогда
				
				СтатусМЧД.Ошибка = Истина;
				СтатусМЧД.ОписаниеОшибки = РезультатЗаполнения.ОписаниеОшибки;
				Результат.Вставить(НомерДоверенности, СтатусМЧД);
				Продолжить;
			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РезультатЗаполнения.Сведения)
				И ЗначениеЗаполнено(РезультатЗаполнения.Сведения.НомерРодительскойДоверенности) Тогда
				
				РезультатЗаполнения.Сведения.РодительскиеДанныеМЧД = ПолучитьРодительскиеДанныеДоверенности(
					РезультатЗаполнения.Сведения.НомерРодительскойДоверенности,
					РезультатЗаполнения.Сведения.ИННДоверителяРодительскойДоверенности);
					
			КонецЕсли;
			
			СтатусМЧД.Сведения = РезультатЗаполнения.Сведения;
			СтатусМЧД.ТребуетсяПроверкаМЧДНаКлиенте = РезультатЗаполнения.ТребуетсяПроверкаМЧДНаКлиенте;
			
		КонецЕсли;
		
		Результат.Вставить(НомерДоверенности, СтатусМЧД);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Авторизуется на сервере МЧД.
// 
// Возвращаемое значение:
//  Структура - Результат авторизации:
//   * ТокенДоступа - Строка - Токен доступа
//   * ТекстОтвета - Строка - Текст ответа сервера МЧД
//
Функция АвторизоватьсяНаСервереМЧД()
	
	Результат = Новый Структура;
	Результат.Вставить("ТокенДоступа", "");
	Результат.Вставить("ТекстОтвета", "");
	
	ШаблоныОшибок = СтруктураШаблоновОшибокМЧД();
	ШаблоныОшибок.ТекстОшибкиПоУмолчанию =
		НСтр("ru = 'Не получен токен доступа при авторизации на сервере МЧД распределенного реестра'");
	ШаблоныОшибок.ШаблонОшибкиИзИсключения =
		НСтр("ru = 'Не удалось получить данные при авторизации на сервере МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиДляКодаСостояния =
		НСтр("ru = 'Не удалось получить данные при авторизации на сервере МЧД распределенного реестра: %1'");
	ШаблоныОшибок.ШаблонОшибкиИзОтвета =
		НСтр("ru = 'Ошибка при получении токена доступа при авторизации на сервере МЧД распределенного реестра. %1'");
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/invalid_grant",
		НСтр("ru = 'Некорректная авторизация на сервере МЧД распределенного реестра'"));
	ШаблоныОшибок.ШаблоныДляКодовОшибок.Вставить("/errors/unsupported_grant_type",
		НСтр("ru = 'Некорректный тип авторизации на сервере МЧД распределенного реестра'"));
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	РесурсНаСервере = СвойстваСервераМЧД.РесурсКорняAPI + ?(СвойстваСервераМЧД.ИспользоватьРасширенияAPI,
		"/token", "/vst-oauth2/oauth/token");

	ПараметрыРесурсаНаСервере = "";
	Если СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
		
		Аутентификация = ЭлектронныеДокументыСлужебный.ПараметрыАутентификацииНаСайте();
		
		Если Не ЗначениеЗаполнено(Аутентификация) Или Не ЗначениеЗаполнено(Аутентификация.Логин) Или Не ЗначениеЗаполнено(Аутентификация.Пароль) Тогда
			ТекстОшибкиПоУмолчанию =
			 	НСтр("ru = 'Авторизация на сервере МЧД распределенного реестра невозможна, так как не заданы логин и пароль авторизации на Портале 1С:ИТС'"); 
			СтруктураОтвета = Новый Структура("ТекстОшибкиПоУмолчанию", ТекстОшибкиПоУмолчанию);
			ВывестиИЗаписатьОшибкуМЧД(Неопределено, , СтруктураОтвета);
			Возврат Результат;
		КонецЕсли;
		
		БилетНаСайтПоддержки = ЭлектронныеДокументыСлужебный.БилетНаСайтПоддержки(Аутентификация, Ложь);
		
		СтруктураЗапроса = Новый Структура;
		
		Если ЗначениеЗаполнено(БилетНаСайтПоддержки) Тогда
			Тикет = КодироватьСтроку(БилетНаСайтПоддержки,
				СпособКодированияСтроки.КодировкаURL);   
			ПараметрыРесурсаНаСервере = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("?ticket=%1", Тикет);

		Иначе
			Логин = КодироватьСтроку(Аутентификация.Логин,
				СпособКодированияСтроки.КодировкаURL);
			Пароль = КодироватьСтроку(Аутентификация.Пароль,
				СпособКодированияСтроки.КодировкаURL);
			ПараметрыРесурсаНаСервере = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("?login=%1&password=%2", Логин, Пароль);

		КонецЕсли;
				
	КонецЕсли;
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
	ЗаголовкиHTTP.Вставить("Proxy-Connection", "Keep-Alive");
	ЗаголовкиHTTP.Вставить("Pragma", "no-cache");
	
	ДобавитьHTTPЗаголовокРежимаТестирования(ЗаголовкиHTTP);
	
	ЗапросHTTP = Новый HTTPЗапрос(РесурсНаСервере + ПараметрыРесурсаНаСервере, ЗаголовкиHTTP);
	Если НЕ СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("username", СвойстваСервераМЧД.Логин);
		СтруктураЗапроса.Вставить("password", СвойстваСервераМЧД.Пароль);
		СтруктураЗапроса.Вставить("grant_type", "password");
		
		ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла();
		ЗапросJSON = Новый ЗаписьJSON;
		ЗапросJSON.ОткрытьФайл(ИмяФайлаЗапроса, "utf-8");
		ЗаписатьJSON(ЗапросJSON, СтруктураЗапроса);
		ЗапросJSON.Закрыть();
		
		ЗапросHTTP.УстановитьИмяФайлаТела(ИмяФайлаЗапроса);
	КонецЕсли;
	
	Попытка
		Если СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
			ОтветHTTP = ПолучитьОтвет(СвойстваСервераМЧД, ЗапросHTTP);
		Иначе
			ОтветHTTP = ОтправитьЗапросДляОбработки(СвойстваСервераМЧД, ЗапросHTTP);
		КонецЕсли;
	Исключение
		Если НЕ СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
			УдалитьФайлы(ИмяФайлаЗапроса);
		КонецЕсли;
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок);
		Возврат Результат;
	КонецПопытки;
	
	Попытка
		Результат.ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстОтвета);
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("access_token") Тогда
			Результат.ТокенДоступа = СтруктураОтвета.access_token;
		Иначе
			Результат.ТокенДоступа = "";
		КонецЕсли;
	Исключение
		Если НЕ СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
			УдалитьФайлы(ИмяФайлаЗапроса);
		КонецЕсли;
		ШаблоныОшибок.ШаблонОшибкиИзИсключения =
			НСтр("ru = 'Не удалось разобрать ответ при получении данных доверенности с сервера МЧД: %1'");
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP);
		Возврат Результат;
	КонецПопытки;
	ШаблоныОшибок.ШаблонОшибкиИзИсключения = "";
	
	Если НЕ ЗначениеЗаполнено(Результат.ТокенДоступа) Тогда
		Если НЕ СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
			УдалитьФайлы(ИмяФайлаЗапроса);
		КонецЕсли;
		ВывестиИЗаписатьОшибкуМЧД(ШаблоныОшибок, ОтветHTTP, СтруктураОтвета);
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
		УдалитьФайлы(ИмяФайлаЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвойстваСервераМЧД()
	
	Результат = МашиночитаемыеДоверенностиПовтИсп.СвойстваСервераМЧД();
	
	НачалоПараметровАутентификации = Найти(Результат.АдресСервераБезАутентификации, "://");
	КонецПараметровАутентификации = Найти(Результат.АдресСервераБезАутентификации, "@");
	Если НачалоПараметровАутентификации <> 0 И КонецПараметровАутентификации <> 0 Тогда
		Результат.АдресСервераБезАутентификации =
			Лев(Результат.АдресСервераБезАутентификации, НачалоПараметровАутентификации + 2)
			+ Сред(Результат.АдресСервераБезАутентификации, КонецПараметровАутентификации + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеОшибкиHTTP(КодСостояния)
	
	Если КодСостояния < 300 Тогда
		Возврат "";
	ИначеЕсли КодСостояния = 300 Тогда
		Возврат НСтр("ru = 'Множественный выбор при отправке ответа сервера'");
	ИначеЕсли КодСостояния = 301 Тогда
		Возврат НСтр("ru = 'Ресурс перемещен'");
	ИначеЕсли КодСостояния = 302 Тогда
		Возврат НСтр("ru = 'Ресурс временно перемещен'");
	ИначеЕсли КодСостояния = 303 Тогда
		Возврат НСтр("ru = 'Ресурс перемещен на другой адрес'");
	ИначеЕсли КодСостояния = 304 Тогда
		Возврат НСтр("ru = 'Неожиданный ответ об отсутствии изменений страницы'");
	ИначеЕсли КодСостояния = 305 Тогда
		Возврат НСтр("ru = 'Для доступа к ресурсу требуется прокси'");
	ИначеЕсли КодСостояния = 306 Тогда
		Возврат НСтр("ru = 'Неиспользуемый код перенаправления запроса'");
	ИначеЕсли КодСостояния = 307 Тогда
		Возврат НСтр("ru = 'Временное перенаправление'");
	ИначеЕсли КодСостояния < 400 Тогда
		Возврат СтрШаблон(
			НСтр("ru = 'Ошибка по перенаправлению запроса с кодом %1'"),
			Формат(КодСостояния, "ЧДЦ=; ЧН=; ЧГ="));
	ИначеЕсли КодСостояния = 400 Тогда
		Возврат НСтр("ru = 'Неверный формат запроса'");
	ИначеЕсли КодСостояния = 401 Тогда
		Возврат НСтр("ru = 'Требуется аутентификация'");
	ИначеЕсли КодСостояния = 402 Тогда
		Возврат НСтр("ru = 'Требуется оплата'");
	ИначеЕсли КодСостояния = 403 Тогда
		Возврат НСтр("ru = 'Доступ к ресурсу запрещен'");
	ИначеЕсли КодСостояния = 404 Тогда
		Возврат НСтр("ru = 'Запрошенная страница не найдена'");
	ИначеЕсли КодСостояния = 405 Тогда
		Возврат НСтр("ru = 'Используемый метод запрещен'");
	ИначеЕсли КодСостояния = 406 Тогда
		Возврат НСтр("ru = 'Отсутствуют подходящие ответы'");
	ИначеЕсли КодСостояния = 407 Тогда
		Возврат НСтр("ru = 'Требуется аутентификация прокси'");
	ИначеЕсли КодСостояния = 408 Тогда
		Возврат НСтр("ru = 'Лимит времени сервера при ожидании запроса исчерпан'");
	ИначеЕсли КодСостояния = 409 Тогда
		Возврат НСтр("ru = 'Конфликт с текущим состоянием ресурса, требуется больше информации'");
	ИначеЕсли КодСостояния = 410 Тогда
		Возврат НСтр("ru = 'Ресурс более недоступен'");
	ИначеЕсли КодСостояния = 411 Тогда
		Возврат НСтр("ru = 'Требуется задание длины содержимого'");
	ИначеЕсли КодСостояния = 412 Тогда
		Возврат НСтр("ru = 'Ошибочные условия заголовочных полей'");
	ИначеЕсли КодСостояния = 413 Тогда
		Возврат НСтр("ru = 'Слишком большая длина запроса'");
	ИначеЕсли КодСостояния = 414 Тогда
		Возврат НСтр("ru = 'Запрошенный идентификатор слишком велик'");
	ИначеЕсли КодСостояния = 415 Тогда
		Возврат НСтр("ru = 'Неподдерживаемый тип данных запроса'");
	ИначеЕсли КодСостояния = 416 Тогда
		Возврат НСтр("ru = 'Запрошенный промежуток невыполним'");
	ИначеЕсли КодСостояния = 417 Тогда
		Возврат НСтр("ru = 'Несоответствие ожиданиям'");
	ИначеЕсли КодСостояния = 422 Тогда
		Возврат НСтр("ru = 'Необрабатываемый объект'");
	ИначеЕсли КодСостояния = 423 Тогда
		Возврат НСтр("ru = 'Заблокировано'");
	ИначеЕсли КодСостояния = 424 Тогда
		Возврат НСтр("ru = 'Сбой взаимосвязанного вызова'");
	ИначеЕсли КодСостояния = 449 Тогда
		Возврат НСтр("ru = 'Возврат запроса после необходимого действия'");
	ИначеЕсли КодСостояния < 500 Тогда
		Возврат СтрШаблон(
			НСтр("ru = 'Ошибка клиента с кодом %1'"),
			Формат(КодСостояния, "ЧДЦ=; ЧН=; ЧГ="));
	ИначеЕсли КодСостояния = 500 Тогда
		Возврат НСтр("ru = 'Внутренняя ошибка сервера'");
	ИначеЕсли КодСостояния = 501 Тогда
		Возврат НСтр("ru = 'Процесс для данного запроса не поддерживается сервером'");
	ИначеЕсли КодСостояния = 502 Тогда
		Возврат НСтр("ru = 'Gateway-сервер получил ошибочный ответ'");
	ИначеЕсли КодСостояния = 503 Тогда
		Возврат НСтр("ru = 'Сервер временно недоступен'");
	ИначеЕсли КодСостояния = 504 Тогда
		Возврат НСтр("ru = 'Превышено время ожидание ответа на запрос Gateway-сервера'");
	ИначеЕсли КодСостояния = 505 Тогда
		Возврат НСтр("ru = 'Версия HTTP не поддерживается сервером'");
	ИначеЕсли КодСостояния = 506 Тогда
		Возврат НСтр("ru = 'Вариантный тип содержит также вариант'");
	ИначеЕсли КодСостояния = 507 Тогда
		Возврат НСтр("ru = 'Переполнение хранилища'");
	ИначеЕсли КодСостояния = 510 Тогда
		Возврат НСтр("ru = 'Отсутствует поддержка расширений'");
	ИначеЕсли КодСостояния < 600 Тогда
		Возврат СтрШаблон(
			НСтр("ru = 'Ошибка сервера с кодом %1'"),
			Формат(КодСостояния, "ЧДЦ=; ЧН=; ЧГ="));
	ИначеЕсли КодСостояния = 999 Тогда
		Возврат НСтр("ru = 'Разрушительный сбой сервера'");
	Иначе
		Возврат СтрШаблон(
			НСтр("ru = 'Ошибка с кодом %1'"),
			Формат(КодСостояния, "ЧДЦ=; ЧН=; ЧГ="));
	КонецЕсли;

КонецФункции

Функция СтруктураШаблоновОшибокМЧД()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТекстОшибкиПоУмолчанию", 		"");
	Результат.Вставить("ШаблонОшибкиИзИсключения", 		"");
	Результат.Вставить("ШаблонОшибкиДляКодаСостояния", 	"");
	Результат.Вставить("ШаблонОшибкиИзОтвета", 			"");
	Результат.Вставить("ШаблоныДляКодовОшибок", 		Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

Функция ВывестиИЗаписатьОшибкуМЧД(
		ШаблоныОшибок,
		ОтветHTTP = Неопределено,
		СтруктураОтвета = Неопределено,
		РежимВыводаИЗаписи = "")
	
	ШаблоныОшибокВызова = СтруктураШаблоновОшибокМЧД();
	Если ШаблоныОшибок <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ШаблоныОшибокВызова, ШаблоныОшибок);
	КонецЕсли;
	
	КодОшибки = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("type"),
		СтруктураОтвета.type, "");
	ЗаголовокОшибки = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("title"),
		СтруктураОтвета.title, "");
	ТекстОшибки = ?(ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("detail"),
		СтруктураОтвета.detail, "");
	
	Если ЗначениеЗаполнено(КодОшибки) И ШаблоныОшибокВызова.ШаблоныДляКодовОшибок <> Неопределено
		И ЗначениеЗаполнено(ШаблоныОшибокВызова.ШаблоныДляКодовОшибок[КодОшибки]) Тогда
		
		ТекстОшибки = ШаблоныОшибокВызова.ШаблоныДляКодовОшибок[КодОшибки];
		
	ИначеЕсли ЗначениеЗаполнено(ЗаголовокОшибки) ИЛИ ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстОшибки = СтрШаблон(
			ШаблоныОшибокВызова.ШаблонОшибкиИзОтвета,
			ЗаголовокОшибки + ?(ЗначениеЗаполнено(ЗаголовокОшибки) И ЗначениеЗаполнено(ТекстОшибки), ": ", "") + ТекстОшибки);
		
	Иначе
		ТекстОшибки = ?(ОтветHTTP = Неопределено, "", ОписаниеОшибкиHTTP(ОтветHTTP.КодСостояния));
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = СтрШаблон(
				ШаблоныОшибокВызова.ШаблонОшибкиДляКодаСостояния,
				ТекстОшибки);
			
		ИначеЕсли ЗначениеЗаполнено(ШаблоныОшибокВызова.ШаблонОшибкиИзИсключения) Тогда
			ТекстОшибки = СтрШаблон(
				ШаблоныОшибокВызова.ШаблонОшибкиИзИсключения,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Иначе
			ТекстОшибки = ШаблоныОшибокВызова.ТекстОшибкиПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимВыводаИЗаписи <> "ТолькоЗаписатьВЖурналРегистрации" И НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Если РежимВыводаИЗаписи <> "ТолькоВывестиОшибку" Тогда
		ИмяСобытия = НСтр("ru = 'Машиночитаемые доверенности'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ИспользуетсяРежимТестирования()
	
	
	
	Возврат Ложь;
КонецФункции

// Параметры:
//  HTTPЗаголовки - Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Строка
Процедура ДобавитьHTTPЗаголовокРежимаТестирования(HTTPЗаголовки)
	
	Если Не ИспользуетсяРежимТестирования() Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваСервераМЧД = СвойстваСервераМЧД();
	
	Если Не СвойстваСервераМЧД.ИспользоватьРасширенияAPI Тогда
		Возврат;
	КонецЕсли;
	
	HTTPЗаголовки.Вставить(ИмяHTTPЗаголовкаРежимаТестирования(), ЗначениеHTTPЗаголовкаРежимаТестирования());
	
КонецПроцедуры

// Возвращаемое значение:
//  Строка - Имя HTTPЗаголовка режима тестирования
Функция ИмяHTTPЗаголовкаРежимаТестирования()
	Возврат "poaservertype";
КонецФункции

// Возвращаемое значение:
//  Строка - Значение HTTPЗаголовка режима тестирования
Функция ЗначениеHTTPЗаголовкаРежимаТестирования()
	Возврат "test";
КонецФункции

Функция СтатусыДействительнойДоверенности()
	
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано);
	Статусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ДатаНачалаДействияНеНаступила);
	Статусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ИстекСрокДействия);
	Статусы.Добавить(Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка());
	
	Возврат Статусы;
	
КонецФункции

// Полные данные доверенности на сервере МЧД.
// 
// Параметры:
//  Ссылка 	- СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций 	- ссылка на доверенность.
//  		- СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов	- ссылка на доверенность.
//  		- СправочникСсылка.МЧД003									- ссылка на доверенность.
//  Отказ - Булево - Отказ
// 
// Возвращаемое значение:
//  Неопределено, ДвоичныеДанные - Полные данные доверенности на сервере МЧД
Функция ПолныеДанныеДоверенностиНаСервереМЧД(Ссылка) Экспорт
	
	ДвоичныеДанные = Неопределено; 
	
	Если МашиночитаемыеДоверенностиКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Ссылка, "XMLфайлМЧД") Тогда
		XMLфайлМЧД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "XMLфайлМЧД");
		Если ТипЗнч(XMLфайлМЧД) <> Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные = XMLфайлМЧД.Получить();
		Иначе
			ДвоичныеДанные = XMLфайлМЧД;
		КонецЕсли;
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено И МашиночитаемыеДоверенностиКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Ссылка, "ФайлМЧД") Тогда
		ФайлМЧД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ФайлМЧД");
		Если ТипЗнч(ФайлМЧД) <> Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные = ФайлМЧД.Получить();
		Иначе
			ДвоичныеДанные = ФайлМЧД;
		КонецЕсли;
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда

		ДоверительИНН = ИННДоверителя(Ссылка);

		СведенияДоверенности = ПолучитьПолныеДанныеДоверенностиНаСервереМЧД(
			Ссылка.НомерДоверенности, ДоверительИНН);

		Если ЗначениеЗаполнено(СведенияДоверенности.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияДоверенности.ТекстОшибки);
			Возврат Неопределено;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СведенияДоверенности.ДанныеВыгрузки) Тогда
			Возврат Неопределено;
		КонецЕсли;

		ДвоичныеДанные = СведенияДоверенности.ДанныеВыгрузки;

		Если ДвоичныеДанные = Неопределено Тогда
			ТекстСообщения = НСтр("ru='Просмотр карточки МЧД невозможен. 
								  |Отсутствует прикрепленный xml файл доверенности. Доверенность
								  |должна быть подписана и отправлена или загружена из реестра.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецЕсли;

	КонецЕсли;

	Возврат ДвоичныеДанные;

КонецФункции

#Область ПроверкаПодписи

// Прочитать протокол проверки JSON.
// 
// Параметры:
//  ТекстJSON - Строка
// 
// Возвращаемое значение:
//  см. НовыйПротоколПроверкиПодписи
Функция ПрочитатьПротоколПроверкиJSON(ТекстJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПротоколПроверки = ПрочитатьJSON(ЧтениеJSON,, "ДатаПроверки");
	ЧтениеJSON.Закрыть();
	ПроверкаПодписи = НовыйПротоколПроверкиПодписи();
	ПроверкаПодписиДокумента = НовыйРезультатПроверки();
	ПроверкаМЧД = МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД();
	
	Если ПротоколПроверки.Свойство("ПроверкаМЧД") Тогда
		
		Для Каждого Проверка Из ПроверкаМЧД Цикл
			Если ТипЗнч(Проверка.Значение) = Тип("Структура")
				И НЕ ПротоколПроверки.ПроверкаМЧД.Свойство(Проверка.Ключ) Тогда
				ПроверкаМЧД[Проверка.Ключ] = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ПроверкаМЧД, ПротоколПроверки.ПроверкаМЧД);
		ЗаполнитьЗначенияСвойств(ПроверкаПодписиДокумента, ПротоколПроверки.ПроверкаПодписиДокумента); 
		ЗаполнитьЗначенияСвойств(ПроверкаПодписи, ПротоколПроверки,, "ПроверкаМЧД, ПроверкаПодписиДокумента");
	
	КонецЕсли;

	ПроверкаПодписи.ПроверкаПодписиДокумента = ПроверкаПодписиДокумента;
	ПроверкаПодписи.ПроверкаМЧД = ПроверкаМЧД;
	
	Возврат ПроверкаПодписи;
	
КонецФункции

// Проверяет доступность автопроверки полномочий для доверенности
// 
// Параметры:
//  СвойстваДоверенности - см. НовыеСвойстваДоверенности
// 
// Возвращаемое значение:
//  Булево
//  
Функция ВозможнаАвтопроверкаПолномочий(СвойстваДоверенности) Экспорт
	Возврат НЕ СвойстваДоверенности.ПолномочияОграничены
		ИЛИ ПравилоНастроено(СвойстваДоверенности.ПравилоПроверки)
		ИЛИ (СвойстваДоверенности.ПолномочияОграничены И СвойстваДоверенности.ПолномочияУказаныИзКлассификатора);
КонецФункции

// См. МашиночитаемыеДоверенностиКлиентСервер.НовыйРезультатПроверки
Функция НовыйРезультатПроверки() Экспорт
	Возврат МашиночитаемыеДоверенностиКлиентСервер.НовыйРезультатПроверки();
КонецФункции

// Новый протокол проверки подписи.
// 
// Возвращаемое значение:
//  Структура - Новый протокол проверки подписи:
// * ВерсияПротокола - Строка
// * ПроверкаПодписиДокумента - см. НовыйРезультатПроверки
// * ПроверкаМЧД - см. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
// * ОшибкиПроверкиПолномочий - Массив из см.НоваяОшибкаПроверкиПолномочий
Функция НовыйПротоколПроверкиПодписи() Экспорт
	Протокол = Новый Структура;
	Протокол.Вставить("ВерсияПротокола", "2.0");
	Протокол.Вставить("ПроверкаПодписиДокумента", НовыйРезультатПроверки());
	Протокол.Вставить("ПроверкаМЧД", МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД());
	Протокол.Вставить("ОшибкиПроверкиПолномочий", Новый Массив());
	Возврат Протокол;
КонецФункции

// Заполняет протокол проверки доверенности.
// 
// Параметры:
//  ПроверкаДоверенности - См. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
//  СведенияМЧД - См. НовыеСведенияМЧД
//  СведенияРодительскойМЧД - См. НовыеСведенияМЧД
//  ДатаПодписи - Дата
//  ПараметрыПроверки - См. НовыеПараметрыПроверкиПодписи
//
Процедура ЗаполнитьПротоколПроверкиРодительскойДоверенности(ПроверкаДоверенности,
	СведенияМЧД, СведенияРодительскойМЧД, ДатаПодписи, ПараметрыПроверки)
	
	ДатаПроверки = ТекущаяДатаСеанса();
	ДатаПодписиНачалоДня = НачалоДня(ДатаПодписи);
	
	ОрганизацияВДокументе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПроверки.ЭлектронныйДокумент, "Организация");
	
	ДополнительныеРеквизиты = Новый Структура("ИНН", СведенияМЧД.ИННДоверителяРодительскойДоверенности);
	ОрганизацияДоверителя = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект("Контрагенты", , ДополнительныеРеквизиты);
	Если Не ЗначениеЗаполнено(ОрганизацияДоверителя) Тогда
		ОрганизацияДоверителя = ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект("Организации", , ДополнительныеРеквизиты);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	РодительскиеДанныеПолучены = ПроверкаДоверенности.РодительскиеДанныеПолучены;
	РодительскиеДанныеПолучены.НомерДоверенности = 
		?(ЗначениеЗаполнено(РодительскиеДанныеПолучены.НомерДоверенности),
			РодительскиеДанныеПолучены.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
			
	Если Не РодительскиеДанныеПолучены.Выполнено Тогда
		
		РодительскиеДанныеПолучены.Выполнено = Истина;
		РодительскиеДанныеПолучены.ДатаПроверки = ДатаПроверки;
		РодительскиеДанныеПолучены.Успех = 
			ЗначениеЗаполнено(СведенияРодительскойМЧД.ДатаЗагрузкиИзРеестраРодительскихДанных)
			Или Не ЗначениеЗаполнено(СведенияРодительскойМЧД.СтатусВРеестреФНС);
	
		Если Не РодительскиеДанныеПолучены.Успех Тогда
			РодительскиеДанныеПолучены.Ошибка = 
				СтрШаблон(НСтр("ru = 'Не удалось соединиться с реестром МЧД для загрузки данных доверенности ""%1"".
								|Проверьте подпись вручную позже.'"),
					СведенияРодительскойМЧД.НомерДоверенности);
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ДействительнаВРеестре = ПроверкаДоверенности.РодительскаяДоверенностьДействительнаВРеестре;
	ДействительнаВРеестре.НомерДоверенности = 
		?(ЗначениеЗаполнено(ДействительнаВРеестре.НомерДоверенности),
			ДействительнаВРеестре.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
			
	Если Не ЗначениеЗаполнено(СведенияРодительскойМЧД.СтатусВРеестреФНС) Тогда
		ПроверкаДоверенности.РодительскаяДоверенностьДействительнаВРеестре = Неопределено;
	ИначеЕсли Не ДействительнаВРеестре.Выполнено Тогда
		
		ДействительнаВРеестре.Выполнено = Истина;
		ДействительнаВРеестре.ДатаПроверки = ДатаПроверки;
		ДействительнаВРеестре.Успех = 
			СтатусыДействительнойДоверенности().Найти(СведенияРодительскойМЧД.СтатусВРеестреФНС) <> Неопределено;
		
		Если Не ДействительнаВРеестре.Успех Тогда
			
			Если ЗначениеЗаполнено(СведенияРодительскойМЧД.ДатаОтзыва)
				И СведенияРодительскойМЧД.ДатаОтзыва < ДатаПодписиНачалоДня Тогда
					
				ДействительнаВРеестре.Ошибка = ДействительнаВРеестре.Ошибка + Символы.ПС
					+ СтрШаблон(НСтр("ru = 'Доверенность отозвана %1'"),
						Формат(СведенияРодительскойМЧД.ДатаОтзыва, "ДЛФ=D;"));
				
			Иначе
				
				ДействительнаВРеестре.Ошибка = 
					СтрШаблон(НСтр("ru = 'На данный момент ее текущий статус: %1'"),
						СведенияРодительскойМЧД.СтатусВРеестреФНС);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СоответствиеОрганизацииВДокументе = ПроверкаДоверенности.РодительскаяДоверенностьСоответствуетОрганизацииВДокументе;
	СоответствиеОрганизацииВДокументе.НомерДоверенности = 
		?(ЗначениеЗаполнено(СоответствиеОрганизацииВДокументе.НомерДоверенности),
			СоответствиеОрганизацииВДокументе.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
			
	Если Не СоответствиеОрганизацииВДокументе.Выполнено Тогда
		
		СоответствиеОрганизацииВДокументе.Выполнено = Истина;
		СоответствиеОрганизацииВДокументе.ДатаПроверки = ДатаПроверки;
		СоответствиеОрганизацииВДокументе.Успех = 
			СведенияРодительскойМЧД.ИННДоверителя = ПараметрыПроверки.ИННДоверителя
				Или СведенияРодительскойМЧД.ИННДоверителя = ПараметрыПроверки.СведенияМЧД.ИННДоверителяРодительскойДоверенности;
		
		Если Не СоответствиеОрганизацииВДокументе.Успех Тогда
	
			Если ЗначениеЗаполнено(ОрганизацияДоверителя) Тогда
				СоответствиеОрганизацииВДокументе.Ошибка = СоответствиеОрганизацииВДокументе.Ошибка
					+ СтрШаблон(НСтр("ru = 'В доверенности: %1
										   |В документе: %2'"),
					ОрганизацияДоверителя, ОрганизацияВДокументе);
			Иначе
				СоответствиеОрганизацииВДокументе.Ошибка = СоответствиеОрганизацииВДокументе.Ошибка
					+ СтрШаблон(НСтр("ru = 'ИНН в доверенности: %1
										   |ИНН в документе: %2'"),
					СведенияРодительскойМЧД.ИННДоверителя, ПараметрыПроверки.ИННДоверителя);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СоответствиеПредставителя = ПроверкаДоверенности.РодительскийПредставительСоответствуютДоверителюПередоверия;
	СоответствиеПредставителя.НомерДоверенности = 
		?(ЗначениеЗаполнено(СоответствиеПредставителя.НомерДоверенности),
			СоответствиеПредставителя.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
		
	Если Не СоответствиеПредставителя.Выполнено Тогда
		
		СоответствиеПредставителя.Выполнено = Истина;
		СоответствиеПредставителя.ДатаПроверки = ДатаПроверки;
		СоответствиеПредставителя.Успех =
			СведенияРодительскойМЧД.ИННПредставителей.Найти(СведенияМЧД.ИННДоверителя) <> Неопределено;
		
		Если Не СоответствиеПредставителя.Успех Тогда
			
			Если СведенияРодительскойМЧД.ИННПредставителей.Количество() = 1 Тогда
				
				СоответствиеПредставителя.Ошибка = 
					СтрШаблон(НСтр("ru = 'Представитель: ИНН %1
									|Доверитель: ИНН %2'"),
						СведенияРодительскойМЧД.ИННПредставителей[0], СведенияМЧД.ИННДоверителя);
					
			Иначе
				
				Представители = СтрСоединить(СведенияРодительскойМЧД.ИННПредставителей, ",");
				
				СоответствиеПредставителя.Ошибка = 
					СтрШаблон(НСтр("ru = 'Представители: ИНН %1
									|Доверитель: ИНН %2'"),
						Представители, СведенияМЧД.ИННДоверителя);
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПериодДействияРодителя = ПроверкаДоверенности.РодительскийПериодДействияСоответствуетДатеДокумента;
	ПериодДействияРодителя.НомерДоверенности = 
		?(ЗначениеЗаполнено(ПериодДействияРодителя.НомерДоверенности),
			ПериодДействияРодителя.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
	
	Если Не ПериодДействияРодителя.Выполнено Тогда
	
		ПериодДействияРодителя.Выполнено = Истина;
		ПериодДействияРодителя.ДатаПроверки = ДатаПроверки;
		ПериодДействияРодителя.Успех = ДатаПодписиНачалоДня >= НачалоДня(СведенияРодительскойМЧД.ДатаВыдачи)
			И ДатаПодписиНачалоДня <= НачалоДня(СведенияРодительскойМЧД.ДатаОкончания);
		
		Если Не ПериодДействияРодителя.Успех Тогда
			ПериодДействияРодителя.Ошибка =
				СтрШаблон(НСтр("ru = 'Срок действия: %1
								|Дата документа: %2'"),
					Формат(СведенияРодительскойМЧД.ДатаВыдачи, "ДЛФ=D;") + " - "
						+ Формат(СведенияРодительскойМЧД.ДатаОкончания, "ДЛФ=D;"),
					Формат(ДатаПодписиНачалоДня, "ДЛФ=D;"));
		КонецЕсли;
	
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПроверкаПраваПередоверия = ПроверкаДоверенности.РодительскаяДоверенностьМоглаПередоверять;
	ПроверкаПраваПередоверия.НомерДоверенности = 
		?(ЗначениеЗаполнено(ПроверкаПраваПередоверия.НомерДоверенности),
			ПроверкаПраваПередоверия.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
	
	Если Не ПроверкаПраваПередоверия.Выполнено Тогда
		
		ПроверкаПраваПередоверия.Выполнено = Истина;
		ПроверкаПраваПередоверия.ДатаПроверки = ДатаПроверки;
		ПроверкаПраваПередоверия.Успех = ПередовериеВозможно(СведенияРодительскойМЧД.ТипПередоверия);
		
		Если Не ПроверкаПраваПередоверия.Успех Тогда
			ПроверкаПраваПередоверия.Ошибка = НСтр("ru = 'Стоит признак: Без права передоверия'");
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПроверкаРодительскихПолномочий = ПроверкаДоверенности.РодительскиеПолномочияСоответствуютПолномочиямПередоверия;
	ПроверкаРодительскихПолномочий.НомерДоверенности = 
		?(ЗначениеЗаполнено(ПроверкаРодительскихПолномочий.НомерДоверенности),
			ПроверкаРодительскихПолномочий.НомерДоверенности + "," + СведенияРодительскойМЧД.НомерДоверенности,
			СведенияРодительскойМЧД.НомерДоверенности);
	
	Если Не ПроверкаРодительскихПолномочий.Выполнено Тогда
		ПроверкаРодительскихПолномочий.Выполнено = Истина;
		ПроверкаРодительскихПолномочий.ДатаПроверки = ДатаПроверки;
		ПроверкаРодительскихПолномочий.Успех = Не СведенияРодительскойМЧД.ПолномочияОграничены
			Или Не ЗначениеЗаполнено(ПараметрыПроверки.ЭлектронныйДокумент);
		
		Если Не ПроверкаРодительскихПолномочий.Успех Тогда
			Если СведенияРодительскойМЧД.ПолномочияУказаныИзКлассификатора
				Или ПравилоНастроено(СведенияРодительскойМЧД.ПравилоПроверки) Тогда
				
				РезультатПроверкиПолномочий = ПроверитьПолномочияДоверенности(
					СведенияРодительскойМЧД.Ссылка, ПараметрыПроверки.ЭлектронныйДокумент);
				
				ПроверкаРодительскихПолномочий.Успех = РезультатПроверкиПолномочий.Успех;
				ПроверкаРодительскихПолномочий.Ошибка = РезультатПроверкиПолномочий.ТекстОшибки;
				
			Иначе
				
				ПроверкаРодительскихПолномочий.Ошибка =
					МашиночитаемыеДоверенностиКлиентСервер.ТекстНеобходимостиРучнойПроверкиПолномочий();
					
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(СведенияРодительскойМЧД.РодительскиеДанныеМЧД) Тогда
		ЗаполнитьПротоколПроверкиРодительскойДоверенности(ПроверкаДоверенности,
			СведенияМЧД,
			СведенияРодительскойМЧД.РодительскиеДанныеМЧД,
			ДатаПодписи,
			ПараметрыПроверки);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет протокол проверки доверенности.
// 
// Параметры:
//  ПроверкаДоверенности - См. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
//  ПараметрыПроверки - См. НовыеПараметрыПроверкиПодписи
//  ИННПредставителя - Строка
//  ДатаПодписи - Дата
Процедура ЗаполнитьПротоколПроверкиДоверенности(ПроверкаДоверенности, ПараметрыПроверки, ИННПредставителя, ДатаПодписи)
	
	ПроверкаДоверенности.Выполнена = Истина;
	ДатаПроверки = ТекущаяДатаСеанса();
	СведенияМЧД = ПараметрыПроверки.СведенияМЧД;
	ДатаПроверки = СведенияМЧД.ДатаПолученияСведений;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	РодительскиеДанныеМЧД = СведенияМЧД.РодительскиеДанныеМЧД;
	Если Не ЗначениеЗаполнено(РодительскиеДанныеМЧД) Тогда
		ПроверкаДоверенности.РодительскиеДанныеПолучены = Неопределено;
		ПроверкаДоверенности.РодительскаяДоверенностьДействительнаВРеестре = Неопределено;
		ПроверкаДоверенности.РодительскаяДоверенностьСоответствуетОрганизацииВДокументе = Неопределено;
		ПроверкаДоверенности.РодительскийПредставительСоответствуютДоверителюПередоверия = Неопределено;
		ПроверкаДоверенности.РодительскийПериодДействияСоответствуетДатеДокумента = Неопределено;
		ПроверкаДоверенности.РодительскаяДоверенностьМоглаПередоверять = Неопределено;
		ПроверкаДоверенности.РодительскиеПолномочияСоответствуютПолномочиямПередоверия = Неопределено;
	Иначе
		ЗаполнитьПротоколПроверкиРодительскойДоверенности(ПроверкаДоверенности,
			СведенияМЧД, РодительскиеДанныеМЧД, ДатаПодписи, ПараметрыПроверки);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПроверкаПодписиМЧД = ПроверкаДоверенности.ПроверкаПодписиМЧД;
	ПроверкаПодписиМЧД.Выполнено = Истина;
	ПроверкаПодписиМЧД.ДатаПроверки = ДатаПроверки;
	ПроверкаПодписиМЧД.Успех = СведенияМЧД.Верна;
	Если НЕ ПроверкаПодписиМЧД.Успех Тогда
		ПроверкаПодписиМЧД.Ошибка = НСтр("ru='Подпись доверенности не верифицирована'");
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПроверкаОтзываМЧД = ПроверкаДоверенности.ПроверкаОтзываМЧД;
	ПроверкаОтзываМЧД.Выполнено = Истина;
	ПроверкаОтзываМЧД.ДатаПроверки = ДатаПроверки;
	ПроверкаОтзываМЧД.Успех = НЕ (СведенияМЧД.Отозвана И СведенияМЧД.ДатаОтзыва < ДатаПодписи);
	
	Если НЕ ПроверкаОтзываМЧД.Успех Тогда
		ПроверкаОтзываМЧД.Ошибка = СтрШаблон(НСтр("ru='Доверенность отозвана %1'"), СведенияМЧД.ДатаОтзыва);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	ПроверкаОператором = ПараметрыПроверки.ПроверкаОператором;
	Если ЗначениеЗаполнено(ПроверкаОператором) И ЗначениеЗаполнено(СведенияМЧД.СтатусВРеестреФНС) Тогда
		Проверка = ПроверкаДоверенности.ПроверкаОператором;
		Проверка.Выполнено = Истина;
		Проверка.ДатаПроверки = ДатаПроверки;
		Проверка.Успех = ПроверкаОператором.ДоверенностьДействительна;
		Если ПроверкаОператором.ДоверенностьДействительна Тогда
			Проверка.Ошибка = ПроверкаОператором.ДоверенностьДействительнаОшибка
		КонецЕсли; 
	Иначе
		ПроверкаДоверенности.ПроверкаОператором = Неопределено;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если НЕ ЗначениеЗаполнено(СведенияМЧД.СтатусВРеестреФНС) Тогда
		ПроверкаДоверенности.ПроверкаСтатусаВРеестреФНС = Неопределено
	Иначе
		
		ПроверкаСтатусаВРеестреФНС = ПроверкаДоверенности.ПроверкаСтатусаВРеестреФНС;
		ПроверкаСтатусаВРеестреФНС.Выполнено = Истина;
		ПроверкаСтатусаВРеестреФНС.ДатаПроверки = ДатаПроверки;
		ПроверкаСтатусаВРеестреФНС.Успех =
			СтатусыДействительнойДоверенности().Найти(СведенияМЧД.СтатусВРеестреФНС) <> Неопределено;

		Если ЗначениеЗаполнено(СведенияМЧД.ДатаОтзыва) 
			И СведенияМЧД.ДатаОтзыва > ДатаПодписи Тогда
			ПроверкаСтатусаВРеестреФНС.Успех = Истина;
		КонецЕсли;

		Если НЕ ПроверкаСтатусаВРеестреФНС.Успех Тогда
			ПроверкаСтатусаВРеестреФНС.Ошибка =
				СтрШаблон(НСтр("ru = 'Доверенность недействительна. Текущий статус: %1'"),
					СведенияМЧД.СтатусВРеестреФНС);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПараметрыПроверки.ТекстОшибки) Тогда
			ПроверкаСтатусаВРеестреФНС.Успех = Ложь;
			ПроверкаСтатусаВРеестреФНС.Ошибка = ПараметрыПроверки.ТекстОшибки;	
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПроверкаПолномочий = ПроверкаДоверенности.ПроверкаПолномочий;
	ПроверкаПолномочий.ДатаПроверки = ДатаПроверки;
	
	Если СведенияМЧД.СовместныеПолномочия Тогда
		
		ПроверкаПолномочий.Успех = Ложь;
		
		КодЯзыка = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
		ТекстОшибки = НСтр("ru = 'Доверенность содержит несколько представителей.'", КодЯзыка);
		ТекстОписания = НСтр("ru = 'Автоматическая проверка таких доверенностей не поддерживается в этой версии программы.'", КодЯзыка);
		ТекстРешения = НСтр("ru = 'Отметьте вручную или запросите у контрагента документ, подписанный другой доверенностью.'", КодЯзыка);
		ПроверкаПолномочий.Ошибка = СтрШаблон("%1 %2 %3", ТекстОшибки, ТекстОписания, ТекстРешения);
	Иначе
		ПроверкаПолномочий.Успех = НЕ ПараметрыПроверки.СведенияМЧД.ПолномочияОграничены
			ИЛИ НЕ ЗначениеЗаполнено(ПараметрыПроверки.ЭлектронныйДокумент);
	
		Если НЕ ПроверкаПолномочий.Успех Тогда
			Если ПараметрыПроверки.СведенияМЧД.ПолномочияУказаныИзКлассификатора
				Или ПравилоНастроено(ПараметрыПроверки.СведенияМЧД.ПравилоПроверки) Тогда
				
				РезультатПроверкиПолномочий = ПроверитьПолномочияДоверенности(
					ПараметрыПроверки.СведенияМЧД.Ссылка, ПараметрыПроверки.ЭлектронныйДокумент);
			
				ПроверкаПолномочий.Успех = РезультатПроверкиПолномочий.Успех;
				ПроверкаПолномочий.Ошибка = РезультатПроверкиПолномочий.ТекстОшибки;
				
			Иначе
				
				ПроверкаПолномочий.Ошибка =
					МашиночитаемыеДоверенностиКлиентСервер.ТекстНеобходимостиРучнойПроверкиПолномочий();
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	СопоставлениеДоверителя = ПроверкаДоверенности.СопоставлениеДоверителя;
	СопоставлениеДоверителя.Выполнено = Истина;
	СопоставлениеДоверителя.ДатаПроверки = ДатаПроверки;
	Если Не ЗначениеЗаполнено(ПараметрыПроверки.ИННДоверителя) Тогда
		СопоставлениеДоверителя.Успех = Ложь;				
		СопоставлениеДоверителя.Ошибка = ПараметрыПроверки.ТекстОшибки; 
	ИначеЕсли СведенияМЧД.ИННДоверителя = ПараметрыПроверки.ИННДоверителя
		Или (ЗначениеЗаполнено(ПроверкаДоверенности.РодительскаяДоверенностьСоответствуетОрганизацииВДокументе) 
			И ПроверкаДоверенности.РодительскаяДоверенностьСоответствуетОрганизацииВДокументе.Успех) Тогда
		СопоставлениеДоверителя.Успех = Истина;
	Иначе
		СопоставлениеДоверителя.Успех = Ложь;
		СопоставлениеДоверителя.Ошибка = 
			СтрШаблон(НСтр("ru = 'ИНН %1 доверителя не соответствует ИНН %2 в содержании электронного документа.'"),
				СведенияМЧД.ИННДоверителя, ПараметрыПроверки.ИННДоверителя);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				
	СопоставлениеПредставителя = ПроверкаДоверенности.СопоставлениеПредставителя;
	СопоставлениеПредставителя.Выполнено = Истина;
	СопоставлениеДоверителя.ДатаПроверки = ДатаПроверки;
	СопоставлениеПредставителя.Успех = Ложь;
	
	Если Не ЗначениеЗаполнено(ИННПредставителя) Тогда
		СопоставлениеПредставителя.Ошибка = ПараметрыПроверки.ТекстОшибки;
	КонецЕсли;
	
	Для Каждого ИННПредставителяИзСведенийМЧД Из СведенияМЧД.ИННПредставителей Цикл
		Если ИННПредставителяИзСведенийМЧД = ИННПредставителя Тогда
			СопоставлениеПредставителя.Успех = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не СопоставлениеПредставителя.Успех Тогда
		Если СведенияМЧД.ИННПредставителей.Количество() = 1 Тогда
			СопоставлениеПредставителя.Ошибка = СтрШаблон(
				НСтр("ru = 'ИНН %1 представителя по доверенности не соответствует ИНН %2 владельца электронной подписи.'"),
				ИННПредставителяИзСведенийМЧД, ИННПредставителя);
        Иначе
			СопоставлениеПредставителя.Ошибка = СтрШаблон(
				НСтр("ru = 'ИНН представителей по доверенности не соответствует ИНН %1 владельца электронной подписи.'"),
				ИННПредставителя);
		КонецЕсли;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ПроверкаПериодаДействия = ПроверкаДоверенности.ПроверкаПериодаДействия;
	ПроверкаПериодаДействия.Выполнено = Истина;
	ПроверкаПериодаДействия.ДатаПроверки = ДатаПроверки;
	ДатаПодписиНачалоДня = НачалоДня(ДатаПодписи);
	ПроверкаПериодаДействия.Успех = ДатаПодписиНачалоДня >= НачалоДня(СведенияМЧД.ДатаВыдачи)
									И ДатаПодписиНачалоДня <= НачалоДня(СведенияМЧД.ДатаОкончания);
	Если НЕ ПроверкаПериодаДействия.Успех Тогда
		ПроверкаПериодаДействия.Ошибка =
			НСтр("ru = 'Дата подписи документа не соответствует периоду действия доверенности.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикОбновления

// Удаляет устаревшие записи регистра "Результаты проверки МЧД оператором".
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//               - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
Процедура ОбработатьДанные_УдалитьЗаписиРегистраРезультатыПроверкиМЧДОператором(Доверенность)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РезультатыПроверкиМЧДОператором.ПодписанныйОбъект,
		|	РезультатыПроверкиМЧДОператором.Отпечаток
		|ИЗ
		|	РегистрСведений.МашиночитаемыеДоверенностиЭД КАК МашиночитаемыеДоверенностиЭД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РезультатыПроверкиМЧДОператором КАК РезультатыПроверкиМЧДОператором
		|		ПО МашиночитаемыеДоверенностиЭД.ЭлектронныйДокумент = РезультатыПроверкиМЧДОператором.ПодписанныйОбъект
		|ГДЕ
		|	МашиночитаемыеДоверенностиЭД.МЧД = &МЧД";
	
	Запрос.УстановитьПараметр("МЧД", Доверенность);
	ОбработатьДанные_УдалитьЗаписиРегистра(Запрос, РегистрыСведений.РезультатыПроверкиМЧДОператором);
	
КонецПроцедуры

// Удаляет устаревшие записи регистра "Машиночитаемые доверенности электронных документов".
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//               - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
Процедура ОбработатьДанные_УдалитьЗаписиРегистраМашиночитаемыеДоверенностиЭД(Доверенность)
	
КонецПроцедуры

// Удаляет устаревшие записи регистра "Электронные подписи по МЧД".
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//               - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
Процедура ОбработатьДанные_УдалитьЗаписиРегистраЭлектронныеПодписиПоМЧД(Доверенность)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект,
		|	ЭлектронныеПодписиПоМЧД.ХешПодписи
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиПоМЧД КАК ЭлектронныеПодписиПоМЧД
		|ГДЕ
		|	ЭлектронныеПодписиПоМЧД.Доверенность = &Доверенность";
	
	Запрос.УстановитьПараметр("Доверенность", Доверенность);
	ОбработатьДанные_УдалитьЗаписиРегистра(Запрос, РегистрыСведений.ЭлектронныеПодписиПоМЧД);
	
КонецПроцедуры

// Проверить необходимость удаления доверенности.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//               - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  Удалить - Булево
Процедура ОбработатьДанные_ПроверитьНеобходимостьУдаленияДоверенности(Доверенность, Удалить)
	
	Если Не ЗначениеЗаполнено(Доверенность.ДатаСоздания) Тогда
		Удалить = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Удаляет набор записей регистра сведений, полученный запросом.
// 
// Параметры:
//  Запрос - Запрос - текст запроса должен содержать все измерения регистра в выбираемых полях.
//  РегистрСведенийМенеджер - РегистрСведенийМенеджер.РезультатыПроверкиМЧДОператором
//                          - РегистрСведенийМенеджер.ЭлектронныеПодписиПоМЧД
Процедура ОбработатьДанные_УдалитьЗаписиРегистра(Запрос, РегистрСведенийМенеджер)
		
КонецПроцедуры

// Создает правило проверки полномочий.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
Процедура ОбработатьДанные_СоздатьПравилоПроверкиПолномочий(Доверенность)
	РеквизитыМЧД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Доверенность,
		"УдалитьСкриптПроверкиПолномочий, ПолномочияОграничены");
	
	Если НЕ РеквизитыМЧД.ПолномочияОграничены ИЛИ НЕ ЗначениеЗаполнено(РеквизитыМЧД.УдалитьСкриптПроверкиПолномочий)
		ИЛИ ЗначениеЗаполнено(РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки(Доверенность)) Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоОбъект = Справочники.ПравилаПроверкиПолномочийМЧД.СоздатьЭлемент();
	ПравилоОбъект.Скрипт = РеквизитыМЧД.УдалитьСкриптПроверкиПолномочий;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПравилоОбъект);
	
	НаборЗаписей = РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Доверенность = Доверенность;
	НоваяЗапись.ПравилоПроверки = ПравилоОбъект.Ссылка;
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

// Выполняет перенос данных о представителях из реквизита справочника в табличную часть.
// 
// Параметры:
//  ОбъектМЧД - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//  			 - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//  Записать - Булево
Процедура ОбработатьДанные_ЗаполнитьТаблицуПредставителей(ОбъектМЧД, Записать)
		
	ДвоичныеДанныеДоверенности = ОбъектМЧД.XMLфайлМЧД.Получить();
	
	ДанныеИзФайлаОбмена = ДанныеИзФайлаОбмена(ДвоичныеДанныеДоверенности);
	
	Если Не ДанныеИзФайлаОбмена.Успех Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДоверенности = ДанныеИзФайлаОбмена.ДанныеДоверенности;
	
	Если ТипЗнч(ОбъектМЧД) = Тип("СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций") Тогда
	
		Если ДанныеДоверенности.Представители.Количество() > 0 Тогда
		
			Для Каждого Представитель Из ДанныеДоверенности.Представители Цикл
			
				СведенияОПредставителеМЧД = 
					Справочники.МашиночитаемыеДоверенностиОрганизаций.СведенияОПредставителеПоДаннымМЧД(Представитель);
			
				НоваяСтрокаПредставителей = ОбъектМЧД.Представители.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПредставителей, СведенияОПредставителеМЧД); 
			
			КонецЦикла;
			
			Записать = Истина;
			
		КонецЕсли;
				
	ИначеЕсли ТипЗнч(ОбъектМЧД) = Тип("СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов") Тогда

		Если ДанныеДоверенности.Представители.Количество() > 0 Тогда	
			Для Каждого СведенияОПредставителе Из ДанныеДоверенности.Представители Цикл
				
				НоваяСтрокаПредставителей = ОбъектМЧД.Представители.Добавить();
				Если СведенияОПредставителе.ТипУполномоченногоПредставителя = "ЮЛ"
					ИЛИ СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИП" Тогда
					НоваяСтрокаПредставителей.Представитель = СведенияОПредставителе.ПредставительЮЛ_НаимОрг;
					НоваяСтрокаПредставителей.ПредставительИНН = СведенияОПредставителе.ПредставительЮЛ_ИНН;
				КонецЕсли;
				
				Если СведенияОПредставителе.ТипУполномоченногоПредставителя = "ФЛ" Тогда
					НоваяСтрокаПредставителей.Представитель = ПолучитьПредставлениеФИО(СведенияОПредставителе);
					НоваяСтрокаПредставителей.ПредставительИНН = СведенияОПредставителе.ПредставительФЛ_ИНН;
				КонецЕсли;
				
			КонецЦикла;
			Записать = Истина;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

// Указывает вариант заполнения полномочий
// 
// Параметры:
//  Объект   - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//  	     - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//  	     - СправочникОбъект.МЧД003
//  Записать - Булево
Процедура ОбработатьДанные_ЗаполнитьВариантУказанияПолномочий(Объект, Записать)
	
	Если Не ЗначениеЗаполнено(Объект.ВариантЗаполненияПолномочий) Тогда
		
		Объект.ВариантЗаполненияПолномочий = Перечисления.ВариантыЗаполненияПолномочийМЧД.Текст;
		Записать = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ВариантЗаполненияПолномочий = Перечисления.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС Тогда
		
		Попытка
			ДвоичныеДанныеМЧД = Объект.XMLфайлМЧД.Получить();
			ВерсияФорматаМЧД = ВерсияФорматаФайлаМЧД(ДвоичныеДанныеМЧД);
		Исключение
			ВерсияФорматаМЧД = "";
		КонецПопытки;
		
		Если Не ФорматМЧДПоддерживаетКлассификаторПолномочий(ВерсияФорматаМЧД) Тогда
			
			Объект.ВариантЗаполненияПолномочий = Перечисления.ВариантыЗаполненияПолномочийМЧД.Текст;
			Записать = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет поле ХешФайла по данным файла доверенности. ХешФайла используется как натуральный ключ в журнале МЧД
// 
// Параметры:
//  Объект - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//         - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//  Записать - Булево
Процедура ОбработатьДанные_ЗаполнитьХешФайла(Объект, Записать)
	ДанныеДоверенности = Объект.XMLфайлМЧД.Получить();
	Если ТипЗнч(ДанныеДоверенности) = Тип("ДвоичныеДанные") Тогда
		Объект.ХешФайла = КонтрольнаяСуммаСтрокой(ДанныеДоверенности, ХешФункция.SHA256);
		Записать = Истина;
	КонецЕсли;
КонецПроцедуры

// Добавляет доверенности в журнал МЧД
// 
// Параметры:
//  Объект - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//         - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
Процедура ОбработатьДанные_ЗаписатьВЖурналМЧД(Объект)
	Объект.ЗаписатьВЖурнал(Ложь);
КонецПроцедуры

// Возвращает информацию о возможности выполнить преобразование МЧД под работу в новом формате,
// записывает в журнал регистрации информацию о причине необработки МЧД
// 
// Параметры:
//  Объект - СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций
//         - СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов
//
// Возвращаемое значение:
//  Булево
Функция ОбработатьДанные_ВозможноВыполнитьОбработкуМЧД(Объект)

	Результат = Истина;
	
	ШаблонСообщения = НСтр("ru = 'Не удалось обработать машиночитаемую доверенность ЭДО: %1 по причине: %2'");
	МетаданныеОбъекта = Объект.Метаданные();
	МассивОшибок = Новый Массив;
	
	ДоверенностьНеПодписана = Не Объект.Подписана;
	НеЗаполненДоверитель = Ложь;
	НеЗаполненПредставитель = Ложь;
	ОшибкаВСодержимом = Ложь;
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.МашиночитаемыеДоверенностиОрганизаций") Тогда
		НеЗаполненДоверитель = ПустаяСтрока(Объект.ДоверительЮЛ_ИНН) И ПустаяСтрока(Объект.ДоверительФЛ_ИНН);
		НеЗаполненПредставитель = ПустаяСтрока(Объект.УдалитьПредставительЮЛ_ИНН) 
			И ПустаяСтрока(Объект.УдалитьПредставительФЛ_ИНН);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.МашиночитаемыеДоверенностиКонтрагентов") Тогда
		НеЗаполненДоверитель = ПустаяСтрока(Объект.ДоверительИНН);
		НеЗаполненПредставитель = ПустаяСтрока(Объект.УдалитьПредставительИНН);
	КонецЕсли;
	
	Попытка 
		ДвоичныеДанныеМЧД = Объект.XMLфайлМЧД.Получить();
		ВерсияФорматаФайлаМЧД(ДвоичныеДанныеМЧД);
	Исключение
		ОшибкаВСодержимом = Истина;
	КонецПопытки;

	Если ДоверенностьНеПодписана Тогда
		МассивОшибок.Добавить(НСтр("ru='Доверенность не подписана'", "ru"));
	КонецЕсли;
	Если НеЗаполненДоверитель Тогда
		МассивОшибок.Добавить(НСтр("ru='Не заполнен доверитель'", "ru"));
	КонецЕсли;
	Если НеЗаполненПредставитель Тогда
		МассивОшибок.Добавить(НСтр("ru='Не заполнен представитель'", "ru"));
	КонецЕсли;
	Если ОшибкаВСодержимом Тогда
		МассивОшибок.Добавить(НСтр("ru='Ошибка в содержимом XML доверенности'", "ru"));
	КонецЕсли;
	
	Если МассивОшибок.Количество() Тогда
		Результат = Ложь;
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Объект.Ссылка, СтрСоединить(МассивОшибок, ", "));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Вызывается после подписания доверенности.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  ДанныеВыгрузки - ДвоичныеДанные - доверенность в формате xml.
//  СвойстваПодписи - Структура - одноименная структура, полученная в результате выполнения
//                    метода см. ЭлектроннаяПодписьКлиент.Подписать.
//  ТребуетсяПроверкаМЧДНаКлиенте - Булево - Истина, если требуется проверить МЧД на клиенте.
//
Процедура ВыполнитьДействияПослеПодписания(Доверенность, ДанныеВыгрузки, СвойстваПодписи, 
		ТребуетсяПроверкаМЧДНаКлиенте = Ложь) Экспорт
	
	ИмяФайлаМЧД = ПолучитьИмяФайлаМЧД(Доверенность);
	НачатьТранзакцию();
	
	Попытка
		
		ОбъектДоверенность = Доверенность.ПолучитьОбъект();
		Если Не ТипЗнч(ОбъектДоверенность) = Тип("СправочникОбъект.МЧД003") Тогда
			ОбъектДоверенность.ИмяФайлаВыгрузка = ИмяФайлаМЧД + ".xml";
			ОбъектДоверенность.XMLфайлМЧД = Новый ХранилищеЗначения(ДанныеВыгрузки, Новый СжатиеДанных(9));
			ОбъектДоверенность.ДатаПодписания = СвойстваПодписи.ДатаПодписи;
		КонецЕсли;
		
		ДанныеДляПроверки = МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД();
		ДанныеДляПроверки.ДанныеДоверенности = ДанныеВыгрузки;
		ДанныеДляПроверки.ДанныеПодписи = СвойстваПодписи.Подпись;
		ЗаполнитьПодписанаВерна(ОбъектДоверенность, ДанныеДляПроверки, ТребуетсяПроверкаМЧДНаКлиенте);
		Если ОбъектДоверенность.Модифицированность() Тогда
			ОбъектДоверенность.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		ОбъектДоверенность.Разблокировать();
		
	Исключение
		
		ОтменитьТранзакцию();
		Операция = НСтр("ru = 'Подписание доверенности'");
		ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Не удалось записать данные доверенности. Подробности в журнале регистрации'");
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения, Доверенность);
			
	КонецПопытки;
	
КонецПроцедуры

// Возвращает номера актуальных доверенностей по данным доверителя и представителя c ИНН доверителей.
// 
// Параметры:
//  ДоверительИНН - Строка
//  ПредставительИНН - Строка
//  ДействительныеНаДату - Дата
//  ЭлектронныйДокумент - Неопределено
//  					- ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  ПодобратьМЧДКонтрагента - Булево
// 
// Возвращаемое значение:
//  Структура:
//  * НомераМЧДСИННДоверителей - Соответствие Из КлючИЗначение:
//	 ** Ключ - Строка - номер МЧД
//	 ** Значение - Структура:
//	  *** ИННДоверителя - Строка
//	  *** ИННДоверителяРодительскойДоверенности - Строка
//  * ОшибкиПроверкиПолномочий - Массив из см. НоваяОшибкаПроверкиПолномочий
//
Функция НомераДоверенностейСИННДоверителейПоУчастникамB2B(ДоверительИНН, ПредставительИНН, ДействительныеНаДату,
	ЭлектронныйДокумент = Неопределено, ПодобратьМЧДКонтрагента = Истина)
	
	Запрос = Новый Запрос;
	Если ПодобратьМЧДКонтрагента Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка КАК Ссылка,
		|	МашиночитаемыеДоверенностиКонтрагентов.Представление КАК Представление,
		|	МашиночитаемыеДоверенностиКонтрагентов.НомерДоверенности КАК НомерДоверенности,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаВыдачи КАК ДатаВыдачи,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаОкончания КАК ДатаОкончания,
		|	МашиночитаемыеДоверенностиКонтрагентов.СтатусВРеестреФНС КАК СтатусВРеестреФНС,
		|	МашиночитаемыеДоверенностиКонтрагентов.Верна КАК Верна,
		|	МашиночитаемыеДоверенностиКонтрагентов.Отозвана КАК Отозвана,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДатаОтзыва КАК ДатаОтзыва,
		|	МашиночитаемыеДоверенностиКонтрагентов.ПолномочияОграничены КАК ПолномочияОграничены,
		|	МашиночитаемыеДоверенностиКонтрагентов.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС) КАК
		|		ПолномочияУказаныИзКлассификатора,
		|	ЕСТЬNULL(ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки,
		|		ЗНАЧЕНИЕ(Справочник.ПравилаПроверкиПолномочийМЧД.ПустаяСсылка)) КАК ПравилоПроверки,
		|	МашиночитаемыеДоверенностиКонтрагентов.ДоверительИНН КАК ИННДоверителя,
		|	МашиночитаемыеДоверенностиКонтрагентов.ИННДоверителяРодительскойДоверенности КАК
		|		ИННДоверителяРодительскойДоверенности
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК МашиночитаемыеДоверенностиКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
		|		ПО (ПравилаПроверкиПолномочийПоМЧД.Доверенность = МашиночитаемыеДоверенностиКонтрагентов.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенностиКонтрагентов.Представители КАК
		|			МашиночитаемыеДоверенностиКонтрагентовПредставители
		|		ПО (МашиночитаемыеДоверенностиКонтрагентовПредставители.Ссылка = МашиночитаемыеДоверенностиКонтрагентов.Ссылка)
		|		И (МашиночитаемыеДоверенностиКонтрагентов.ДоверительИНН = &ДоверительИНН
		|		ИЛИ МашиночитаемыеДоверенностиКонтрагентов.ИННДоверителяРодительскойДоверенности = &ДоверительИНН)
		|		И (МашиночитаемыеДоверенностиКонтрагентовПредставители.ПредставительИНН = &ПредставительИНН)
		|		И (НЕ МашиночитаемыеДоверенностиКонтрагентов.ПометкаУдаления)
		|ИТОГИ
		|	МАКСИМУМ(ПравилоПроверки)
		|ПО
		|	Ссылка";
		
	Иначе	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиОрганизаций.Ссылка КАК Ссылка,
		|	МашиночитаемыеДоверенностиОрганизаций.Представление КАК Представление,
		|	МашиночитаемыеДоверенностиОрганизаций.НомерДоверенности КАК НомерДоверенности,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаВыдачи КАК ДатаВыдачи,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаОкончания КАК ДатаОкончания,
		|	МашиночитаемыеДоверенностиОрганизаций.СтатусВРеестреФНС КАК СтатусВРеестреФНС,
		|	МашиночитаемыеДоверенностиОрганизаций.Верна КАК Верна,
		|	МашиночитаемыеДоверенностиОрганизаций.Отозвана КАК Отозвана,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаОтзыва КАК ДатаОтзыва,
		|	МашиночитаемыеДоверенностиОрганизаций.ПолномочияОграничены КАК ПолномочияОграничены,
		|	МашиночитаемыеДоверенностиОрганизаций.ВариантЗаполненияПолномочий = ЗНАЧЕНИЕ(Перечисление.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС) КАК
		|		ПолномочияУказаныИзКлассификатора,
		|	ЕСТЬNULL(ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки,
		|		ЗНАЧЕНИЕ(Справочник.ПравилаПроверкиПолномочийМЧД.ПустаяСсылка)) КАК ПравилоПроверки,
		|	МашиночитаемыеДоверенностиОрганизаций.ДоверительЮЛ_ИНН КАК ДоверительЮЛ_ИНН,
		|	МашиночитаемыеДоверенностиОрганизаций.ДоверительФЛ_ИНН КАК ДоверительФЛ_ИНН,
		|	МашиночитаемыеДоверенностиОрганизаций.ИННДоверителяРодительскойДоверенности КАК
		|		ИННДоверителяРодительскойДоверенности,
		|	МашиночитаемыеДоверенностиОрганизаций.XMLфайлМЧД КАК XMLфайлМЧД
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаПроверкиПолномочийПоМЧД КАК ПравилаПроверкиПолномочийПоМЧД
		|		ПО (ПравилаПроверкиПолномочийПоМЧД.Доверенность = МашиночитаемыеДоверенностиОрганизаций.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенностиОрганизаций.Представители КАК
		|			МашиночитаемыеДоверенностиОрганизацийПредставители
		|		ПО (МашиночитаемыеДоверенностиОрганизацийПредставители.Ссылка = МашиночитаемыеДоверенностиОрганизаций.Ссылка)
		|		И (МашиночитаемыеДоверенностиОрганизаций.ДоверительЮЛ_ИНН = &ДоверительИНН
		|		ИЛИ МашиночитаемыеДоверенностиОрганизаций.ДоверительФЛ_ИНН = &ДоверительИНН
		|		ИЛИ МашиночитаемыеДоверенностиОрганизаций.ИННДоверителяРодительскойДоверенности = &ДоверительИНН)
		|		И (МашиночитаемыеДоверенностиОрганизацийПредставители.ЮЛ_ИНН = &ПредставительИНН
		|		ИЛИ МашиночитаемыеДоверенностиОрганизацийПредставители.ФЛ_ИНН = &ПредставительИНН)
		|		И (НЕ МашиночитаемыеДоверенностиОрганизаций.ПометкаУдаления)
		|ИТОГИ
		|	МАКСИМУМ(ПравилоПроверки)
		|ПО
		|	Ссылка";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ДоверительИНН", ДоверительИНН);
	Запрос.УстановитьПараметр("ПредставительИНН", ПредставительИНН);
	
	НомераМЧДСИННДоверителей = Новый Соответствие();
	Ошибки = Новый Массив();
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваДоверенности = НовыеСвойстваДоверенности();
		ЗаполнитьЗначенияСвойств(СвойстваДоверенности, Выборка);
		
		Если Не ДоверенностьДействительнаПоСвойствам(СвойстваДоверенности, ДействительныеНаДату) Тогда
			Продолжить;
		КонецЕсли;
			
		ВозможнаАвтопроверкаПолномочий = ВозможнаАвтопроверкаПолномочий(СвойстваДоверенности);
		Если НЕ ВозможнаАвтопроверкаПолномочий Тогда
			Ошибка = НоваяОшибкаПроверкиПолномочий();
			Ошибка.Доверенность = Выборка.Представление;
			Ошибка.НомерДоверенности = Выборка.НомерДоверенности;
			Ошибка.ТекстОшибки = ТекстОшибкиНеНастроенаАвтопроверка();
			Ошибки.Добавить(Ошибка);
			Продолжить;
		КонецЕсли;
			
		Если Выборка.ПолномочияОграничены И ЭлектронныйДокумент <> Неопределено Тогда
			
			РезультатПроверки = ПроверитьПолномочияДоверенности(Выборка.Ссылка, ЭлектронныйДокумент);
			Если НЕ РезультатПроверки.Успех Тогда
				Ошибка = НоваяОшибкаПроверкиПолномочий();
				Ошибка.Доверенность = Выборка.Представление;
				Ошибка.НомерДоверенности = Выборка.НомерДоверенности;
				Ошибка.ТекстОшибки = РезультатПроверки.ТекстОшибки;
				Ошибки.Добавить(Ошибка);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИННДоверителей = Новый Структура("ИННДоверителя, ИННДоверителяРодительскойДоверенности");
		ИННДоверителей.ИННДоверителяРодительскойДоверенности = Выборка.ИННДоверителяРодительскойДоверенности;
		
		Если ПодобратьМЧДКонтрагента Тогда
			ИННДоверителей.ИННДоверителя = Выборка.ИННДоверителя;
		Иначе
			ДвоичныеДанныеДоверенности = Выборка.XMLфайлМЧД.Получить();
			Если ДвоичныеДанныеДоверенности <> Неопределено Тогда
				ДанныеДоверителей = ИННКППДоверителей(ДвоичныеДанныеДоверенности);
				Если ДанныеДоверителей.ТипДоверителя = "ЮЛ"
					Или ДанныеДоверителей.ТипДоверителя = "ИО" Тогда
					ИННДоверителей.ИННДоверителя = ДанныеДоверителей.ИННЮЛ;
				Иначе
					ИННДоверителей.ИННДоверителя = ДанныеДоверителей.ИННФЛ;
				КонецЕсли;
			Иначе
				ИННДоверителей.ИННДоверителя = ?(ЗначениеЗаполнено(Выборка.ДоверительЮЛ_ИНН), 
					Выборка.ДоверительЮЛ_ИНН, Выборка.ДоверительФЛ_ИНН);
			КонецЕсли;
		КонецЕсли;
		
		НомераМЧДСИННДоверителей.Вставить(Выборка.НомерДоверенности, ИННДоверителей);
		
	КонецЦикла;
	
	Возврат Новый Структура("НомераМЧДСИННДоверителей, ОшибкиПроверкиПолномочий", НомераМЧДСИННДоверителей, Ошибки);
	
КонецФункции

// Возвращает ИНН доверителя физ. лица, ИНН доверителя юр.лица, КПП доверителя юр.лица.
// 
// Параметры:
//  ДанныеДоверенности - ДвоичныеДанные - доверенность в формате xml.
// 
// Возвращаемое значение:
//  Структура:
//    * ИННФЛ - Строка
//            - Неопределено
//    * ИННЮЛ - Строка
//            - Неопределено
//    * КПП - Строка - заполнено только для ЮЛ, ИО
//    * ТипДоверителя - Строка - принимает значения ЮЛ, ИО, ИП, ФЛ
Функция ИННКППДоверителей(ДанныеДоверенности)
	
	Если ВерсияФорматаФайлаМЧД(ДанныеДоверенности) = ФорматМЧД_2022() Тогда
		Возврат ИННКППДоверителейВУтвержденномФормате(ДанныеДоверенности);
	ИначеЕсли ВерсияФорматаФайлаМЧД(ДанныеДоверенности) = ФорматМЧД_2022_Версия_002() Тогда
		Возврат ИННКППДоверителейВУтвержденномФормате_Версия_002(ДанныеДоверенности);
	ИначеЕсли ВерсияФорматаФайлаМЧД(ДанныеДоверенности) = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
		Возврат ИННКППДоверителейВФормате_003(ДанныеДоверенности);		
	Иначе
		Возврат ИННКППДоверителейВПилотномФормате(ДанныеДоверенности);	
	КонецЕсли;
		
КонецФункции

// Возвращает ИНН доверителя физ. лица, ИНН доверителя юр.лица, КПП доверителя юр. лица.
// 
// Параметры:
//  ДанныеДоверенности - ДвоичныеДанные - доверенность в пилотном формате xml.
// 
// Возвращаемое значение:
//  Структура:
//    * ИННФЛ - Строка
//            - Неопределено
//    * ИННЮЛ - Строка
//            - Неопределено
//    * КПП - Строка - заполнено только для ЮЛ, ИО
//    * ТипДоверителя - Строка - принимает значения ЮЛ, ИО, ИП
Функция ИННКППДоверителейВПилотномФормате(ДанныеДоверенности)
	
	Поток = ДанныеДоверенности.ОткрытьПотокДляЧтения();
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(Поток);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "СвДоверит"
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Возврат НайтиИННКППДоверителей(ЧтениеXML);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	Поток.Закрыть();
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает ИНН доверителя физ. лица, ИНН доверителя юр.лица, КПП доверителя юр.лица.
// 
// Параметры:
//  ДанныеДоверенности - ДвоичныеДанные - доверенность в утвержденном формате xml.
// 
// Возвращаемое значение:
//  Структура:
//    * ИННФЛ - Строка
//            - Неопределено
//    * ИННЮЛ - Строка
//            - Неопределено
//    * КПП - Строка - заполнено только для ЮЛ, ИО
//    * ТипДоверителя - Строка - принимает значения ЮЛ, ИО, ИП, ФЛ
Функция ИННКППДоверителейВУтвержденномФормате(ДанныеДоверенности)
	
	Результат = Новый Структура;
	Результат.Вставить("ИННФЛ", "");
	Результат.Вставить("ИННЮЛ", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ТипДоверителя", "");
	
	Доверенность = ДанныеИзФайлаОбменаВУтвержденномФормате(ДанныеДоверенности).ДанныеДоверенности;
	Результат.ТипДоверителя = Доверенность.ТипОрганизации;
	
	Если Доверенность.ТипОрганизации = "ЮЛ" Тогда
		Результат.ИННФЛ = Доверенность.ЛицоБезДовФЛ_ИНН;
		Результат.ИННЮЛ = Доверенность.ДоверительЮЛ_ИНН;
		Результат.КПП = Доверенность.ДоверительЮЛ_КПП;
	ИначеЕсли Доверенность.ТипОрганизации = "ИО" Тогда
		Результат.ИННФЛ = Доверенность.ДоверительФЛ_ИНН;
		Результат.ИННЮЛ = Доверенность.ДоверительЮЛ_ИНН;
		Результат.КПП = Доверенность.ДоверительЮЛ_КПП;
	ИначеЕсли Доверенность.ТипОрганизации = "ИП" Тогда
		Результат.ИННФЛ = Доверенность.ДоверительФЛ_ИНН;
		Результат.ИННЮЛ = Доверенность.ДоверительЮЛ_ИНН;
	ИначеЕсли Доверенность.ТипОрганизации = "ФЛ" Тогда
		Результат.ИННФЛ = Доверенность.ДоверительФЛ_ИНН;
		Результат.ИННЮЛ = Результат.ИННФЛ;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает ИНН доверителя физ. лица, ИНН доверителя юр.лица., КПП доверителя юр.лица формата версии 002
// 
// Параметры:
//  ДанныеДоверенности - ДвоичныеДанные - доверенность в утвержденном формате xml.
// 
// Возвращаемое значение:
//  Структура:
//    * ИННФЛ - Строка
//            - Неопределено
//    * ИННЮЛ - Строка
//            - Неопределено
//    * КПП - Строка - заполнено только для ЮЛ, ИО
//    * ТипДоверителя - Строка - принимает значения ЮЛ, ИО, ИП, ФЛ
Функция ИННКППДоверителейВУтвержденномФормате_Версия_002(ДанныеДоверенности)
	
	Результат = Новый Структура;
	Результат.Вставить("ИННФЛ", "");
	Результат.Вставить("ИННЮЛ", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ТипДоверителя", "");
	
	Доверенность = ДанныеИзФайлаОбменаВУтвержденномФорматеВерсия002(ДанныеДоверенности).ДанныеДоверенности;
	Результат.ТипДоверителя = Доверенность.ТипОрганизации;
	
	Если Доверенность.ТипОрганизации = "ЮЛ" Тогда
		Результат.ИННФЛ = Доверенность.ЛицоБезДовФЛ_ИНН;
		Результат.ИННЮЛ = Доверенность.ДоверительЮЛ_ИНН;
		Результат.КПП = Доверенность.ДоверительЮЛ_КПП;
	ИначеЕсли Доверенность.ТипОрганизации = "ИО" Тогда
		Результат.ИННФЛ = Доверенность.ДоверительФЛ_ИНН;
		Результат.ИННЮЛ = Доверенность.ДоверительЮЛ_ИНН;
		Результат.КПП = Доверенность.ДоверительЮЛ_КПП;
	ИначеЕсли Доверенность.ТипОрганизации = "ИП" Тогда
		Результат.ИННФЛ = Доверенность.ДоверительФЛ_ИНН;
		Результат.ИННЮЛ = Доверенность.ДоверительЮЛ_ИНН;
	ИначеЕсли Доверенность.ТипОрганизации = "ФЛ" Тогда
		Результат.ИННФЛ = Доверенность.ДоверительФЛ_ИНН;
		Результат.ИННЮЛ = Результат.ИННФЛ;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает значение атрибутов ИННФЛ, ИННЮЛ.
// 
// Параметры:
//  ЧтениеXML - ЧтениеXML
// 
// Возвращаемое значение:
//  Структура:
//    * ИННФЛ - Строка, 
//            - Неопределено
//    * ИННЮЛ - Строка
//            - Неопределено
//    * КПП - Строка - заполнено только для ЮЛ, ИО
//    * ТипДоверителя - Строка - принимает значения ЮЛ, ИО, ИП
Функция НайтиИННКППДоверителей(ЧтениеXML) 
	
	Результат = Новый Структура;
	Результат.Вставить("ИННФЛ", "");
	Результат.Вставить("ИННЮЛ", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ТипДоверителя", "");
	
	КлассификаторДаНет = Новый ФиксированнаяСтруктура("Нет, Да", "0", "1");
	
	СведенияОДоверителе = "";
	Пока ЧтениеXML.Прочитать() Цикл
		
		ЭтоСведенияОДоверителе = ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И (ЧтениеXML.Имя = "РосОргДовер" Или ЧтениеXML.Имя = "ИнОргДовер" Или ЧтениеXML.Имя = "ФЛДовер");
			
		Если ЭтоСведенияОДоверителе Тогда
			СведенияОДоверителе = ЧтениеXML.Имя;
		КонецЕсли;
		
		Если СведенияОДоверителе = "РосОргДовер" Тогда
			
			ИННЮЛ = ЧтениеXML.ЗначениеАтрибута("ИННЮЛ");
			КПП = ?(ЗначениеЗаполнено(ЧтениеXML.ЗначениеАтрибута("КПП")), ЧтениеXML.ЗначениеАтрибута("КПП"), "");
			
			Если ЧтениеXML.ЗначениеАтрибута("ЕИОИП") = КлассификаторДаНет.Да Тогда
				ИННФЛ = ЗначениеАтрибутаУзла(ЧтениеXML, "СвИП", "ИННФЛ");
			Иначе
				ИННФЛ = ЗначениеАтрибутаУзла(ЧтениеXML, "СвФЛ", "ИННФЛ");
			КонецЕсли;
			
			ТипДоверителя = "ЮЛ";
			
		ИначеЕсли СведенияОДоверителе = "ИнОргДовер" Тогда
			
			ИННЮЛ = ЧтениеXML.ЗначениеАтрибута("ИННЮЛ");
			КПП = ?(ЗначениеЗаполнено(ЧтениеXML.ЗначениеАтрибута("КПП")), ЧтениеXML.ЗначениеАтрибута("КПП"), "");
			ИННФЛ = ЗначениеАтрибутаУзла(ЧтениеXML, "СвРукОП", "ИННФЛ");
			ТипДоверителя = "ИО";
			
		ИначеЕсли СведенияОДоверителе = "ФЛДовер" Тогда
			
			ИННФЛ = ЧтениеXML.ЗначениеАтрибута("ИННФЛ");
			ИННЮЛ = ИННФЛ;
			КПП = "";
			ТипДоверителя = "ИП";
			
		КонецЕсли;
		
		Если ЭтоСведенияОДоверителе Тогда
			Результат.ИННФЛ = ИННФЛ;
			Результат.ИННЮЛ = ИННЮЛ;
			Результат.КПП = КПП;
			Результат.ТипДоверителя = ТипДоверителя;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат выгрузки неподписанной доверенности.
// 
// Параметры:
//  РезультатВыгрузки - Структура:
// * ОписаниеФайла - см. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
// * Ошибка - Булево
// * ТекстОшибки - Строка
// 
// Возвращаемое значение:
//  Структура:
// * ОписаниеФайла - см. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
// * Ошибка - Булево
// * ТекстОшибки - Строка
Функция РезультатВыгрузкиНеподписаннойДоверенности(РезультатВыгрузки)
	
	РезультатВыгрузки.Ошибка = Истина;
	РезультатВыгрузки.ТекстОшибки = НСтр("ru = 'Выгружать в файл можно только подписанные доверенности. Подпишите и повторите выгрузку.'");
	Возврат РезультатВыгрузки;
	
КонецФункции

// Возвращает количество видов полномочий представителя МЧД.
// 
// Возвращаемое значение:
//  Число
Функция КоличествоВидовПолномочийПредставителя()
	
	Возврат 25;
	
КонецФункции

#Область ПроверкаДоверенности

// Выполняет запись результатов ручной проверки подписи по МЧД
// 
// Параметры:
//  ЭлектронныйДокумент - СправочникСсылка.ЭДПрисоединенныеФайлы
// 
Процедура ЗаписатьРезультатыРучнойПроверкиПодписейПоДокументу(ЭлектронныйДокумент) Экспорт

	РеквизитыЭД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент, "ВидЭД, ТипЭлементаВерсииЭД");
	Если ЭлектронныеДокументыСлужебный.ЭтоТитулФНС(РеквизитыЭД) Тогда
		Подписи = ЭлектронныеДокументыСлужебный.ЭлектронныеПодписиДвухТитулов(ЭлектронныйДокумент);
	Иначе
		Подписи = ЭлектронныеДокументыСлужебный.УстановленныеПодписи(ЭлектронныйДокумент);
    КонецЕсли;
	
	Для Каждого Подпись Из Подписи Цикл
		Если Подпись.СвойстваПодписи.ВходящаяПодпись И Подпись.ЭтоПодписьПоДоверенности Тогда
			
			ПроверкаВыполненаВручную = 
				МашиночитаемыеДоверенностиКлиентСервер.ПроверкаДоверенностиВыполненаВручную(
					Подпись.РезультатПроверкиПоМЧД);
			
			Если Не ПроверкаВыполненаВручную Тогда
				
				ПодписьПоДоверенностиВерна = Подпись.РезультатПроверкиПоМЧД.ПодписьВерна;
				
				Если ЗначениеЗаполнено(Подпись.РезультатПроверкиПоМЧД.ПротоколПроверки) Тогда		
					
					ПроверкаПолномочийБезОшибок = 
						Подпись.РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаМЧД.ПроверкаПолномочий.Успех;
											
					Если ПроверкаПолномочийБезОшибок Тогда
						
						ДоверенностьПроверенаУспешно = 
							МашиночитаемыеДоверенностиКлиентСервер.ДоверенностьПроверенаУспешно(
								Подпись.РезультатПроверкиПоМЧД.ПротоколПроверки.ПроверкаМЧД);
						
						Если Не ДоверенностьПроверенаУспешно Тогда
							ЗаписатьРезультатРучнойПроверкиПодписи(Подпись);	
						ИначеЕсли Не ПодписьПоДоверенностиВерна Тогда
							ЗаписатьРезультатРучнойПроверкиПодписи(Подпись);
						КонецЕсли;
						
					ИначеЕсли Не Подпись.РезультатПроверкиПоМЧД.ПроверкаВыполнена Тогда
						ЗаписатьРезультатРучнойПроверкиПодписи(Подпись);	
					КонецЕсли;
					
				ИначеЕсли Не ПодписьПоДоверенностиВерна Тогда
					ЗаписатьРезультатРучнойПроверкиПодписи(Подпись);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Проверяет корректность оформления доверенности.
// 
// Параметры:
//  ДанныеДляПроверки - см. МашиночитаемыеДоверенностиКлиентСервер.НовыеДанныеДляПроверкиМЧД
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  См. РезультатПроверкиДоверенности
Функция ПроверитьДоверенность(ДанныеДляПроверки, КонтекстДиагностики = Неопределено) Экспорт
	
	СвойстваПодписи = Новый Структура;
	СвойстваПодписи.Вставить("Сертификат", Неопределено);
	СвойстваПодписи.Вставить("ПодписьВерна", Ложь);
	
	РезультатПроверкиПодписи =  Новый Структура;
	РезультатПроверкиПодписи.Вставить("ОписаниеОшибки", "");
	РезультатПроверкиПодписи.Вставить("СвойстваПодписи", СвойстваПодписи);

	Попытка
		МенеджерКриптографии = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьМенеджерКриптографии();
	Исключение
		ШаблонРезультата = НСтр("ru = '%1
		|%2'");
		ТекстОшибки = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьСообщениеОбОшибке("110");
		РезультатТеста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонРезультата,
								ТекстОшибки,
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
								
		МенеджерКриптографии = Неопределено;
		РезультатПроверкиПодписи.СвойстваПодписи.ПодписьВерна = Ложь;
		РезультатПроверкиПодписи.ОписаниеОшибки = РезультатТеста;
	КонецПопытки;

	Если МенеджерКриптографии <> Неопределено Тогда
		Попытка
			Сертификат = Неопределено;
			МенеджерКриптографии.ПроверитьПодпись(
				ДанныеДляПроверки.ДанныеДоверенности, ДанныеДляПроверки.ДанныеПодписи, Сертификат);   
				
			Если Сертификат <> Неопределено Тогда
				РезультатПроверкиПодписи.СвойстваПодписи.Сертификат = Сертификат.Выгрузить();	
			КонецЕсли;
			РезультатПроверкиПодписи.СвойстваПодписи.ПодписьВерна = Истина;	
		Исключение
			
			ШаблонРезультата = НСтр("ru = '%1
			|%2'");
			ТекстОшибки = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьСообщениеОбОшибке("114");
			РезультатТеста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ШаблонРезультата,
									ТекстОшибки,
									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			
									
			РезультатПроверкиПодписи.СвойстваПодписи.ПодписьВерна = Ложь;
			РезультатПроверкиПодписи.ОписаниеОшибки = РезультатТеста;
		КонецПопытки;
	КонецЕсли;	
	
	Возврат РезультатПроверкиДоверенности(ДанныеДляПроверки.ДанныеДоверенности, РезультатПроверкиПодписи,
		КонтекстДиагностики);
	
КонецФункции

// Возвращает результат проверки доверенности.
// 
// Параметры:
//  ДанныеДоверенности - ДвоичныеДанные
//  РезультатПроверкиПодписи - см. КриптографияБЭДКлиентСервер.НовыйРезультатПроверкиПодписи
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Структура:
//    * Результат - Булево - Истина, если доверенность оформлена верно.
//    * ТекстОшибки - Строка - свойство заполнено, если Результат - Ложь.
//    * КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Функция РезультатПроверкиДоверенности(ДанныеДоверенности, РезультатПроверкиПодписи, КонтекстДиагностики) Экспорт
	
	РезультатПроверки = Новый Структура("Результат, ТекстОшибки, КонтекстДиагностики", Ложь, "", КонтекстДиагностики);
	
	ИННПодписантаФЛ = "";
	ИННПодписантаЮЛ = "";
	Сертификат = Неопределено;
	СвойстваСубъектаСертификата = Неопределено;
	Ошибки = Новый Массив;
	
	ДанныеДоверителей = ИННКППДоверителей(ДанныеДоверенности);
	
	ИННДоверителяФЛ = ДанныеДоверителей.ИННФЛ;
	ИННДоверителяЮЛ = ДанныеДоверителей.ИННЮЛ;
	
	СНИЛСПодписанта = "";
	СНИЛСДоверителяФЛ = "";
	
	СвойстваПодписи = РезультатПроверкиПодписи.СвойстваПодписи;
	Если СвойстваПодписи.Сертификат <> Неопределено Тогда
		Сертификат = Новый СертификатКриптографии(СвойстваПодписи.Сертификат);
		СвойстваСубъектаСертификата = СвойстваСубъектаСертификата(Сертификат, Ложь);
		
		Если ЗначениеЗаполнено(СвойстваСубъектаСертификата.ИННЮЛ) Тогда
			ИННПодписантаЮЛ = СвойстваСубъектаСертификата.ИННЮЛ;
			ИННПодписантаФЛ = СвойстваСубъектаСертификата.ИНН;
		Иначе
			ИННПодписантаЮЛ = Прав(СвойстваСубъектаСертификата.ИНН, 10);
		КонецЕсли;
		
		СНИЛСПодписанта = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" -", СвойстваСубъектаСертификата.СНИЛС, "");
		
	КонецЕсли;
	
	ПодписьВерна = РезультатПроверкиПодписи.СвойстваПодписи.ПодписьВерна;
	Если РезультатПроверкиПодписи.ОписаниеОшибки = "" Тогда
		СертификатДействителен = Истина;
	Иначе
		СертификатДействителен = Ложь;
		Ошибки.Добавить(РезультатПроверкиПодписи.ОписаниеОшибки);
	КонецЕсли;
	
	РезультатЧтения = ОбъектXDTOМЧД(ДанныеДоверенности);
	ВерсияФормата = ВерсияФорматаОбъектаМЧД(РезультатЧтения.ОбъектМЧД);
	СНИЛСДоверителяФЛ = СНИЛСФизическогоЛицаДоверителя(РезультатЧтения.ОбъектМЧД);
		
	Если ЭлектронныеДокументыВнутренний.ЗначениеСвойстваXDTO(РезультатЧтения.ОбъектМЧД, "Документ.Передов") <> Неопределено Тогда
		ДоверенностьПодписанаДоверителем = Истина;
	ИначеЕсли ЗначениеЗаполнено(ИННДоверителяФЛ) Тогда
		ДоверенностьПодписанаДоверителем = (ИННПодписантаФЛ = ИННДоверителяФЛ);
	ИначеЕсли ЗначениеЗаполнено(СНИЛСДоверителяФЛ) Тогда
		ДоверенностьПодписанаДоверителем = (СНИЛСПодписанта = СНИЛСДоверителяФЛ);
	Иначе
		ДоверенностьПодписанаДоверителем = Ложь;
	КонецЕсли;
	
	СертификатПодписантаНеСодержитИННФизЛица = НЕ ЗначениеЗаполнено(ИННПодписантаФЛ); // выпускались по 21.09.2021
	Если (Не ДоверенностьПодписанаДоверителем
			И ЗначениеЗаполнено(ИННПодписантаФЛ)
			И ЗначениеЗаполнено(ИННДоверителяФЛ))
		Или Не (СертификатПодписантаНеСодержитИННФизЛица 
					ИЛИ ДоверенностьПодписанаДоверителем) Тогда
		ТекстОшибки = 
			НСтр("ru = 'Доверенность подписана лицом, которое не является доверителем по данной доверенности.'");
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	ДоверенностьВыданаГосОрганомУЦ = ЭтоИННГосОрганаЯвляющегосяУдостоверяющимЦентром(ИННДоверителяЮЛ);
	ЭтоДоверенностьОтИП = ИННДоверителяФЛ = ИННДоверителяЮЛ ИЛИ НЕ ЗначениеЗаполнено(ИННДоверителяЮЛ);
	ДоверительЯвляетсяУполномоченнымПредставителемОрганизации =
		ЭтоДоверенностьОтИП
		ИЛИ (ИННПодписантаЮЛ = ИННДоверителяЮЛ)
		Или (ДоверенностьВыданаГосОрганомУЦ
			И ЭтоСертификатДолжностногоЛицаГосОрганаУЦ(Сертификат));
		
	Если Не ДоверительЯвляетсяУполномоченнымПредставителемОрганизации Тогда
		ТекстОшибки = НСтр("ru = 'Доверенность подписана лицом, которое не является уполномоченным представителем организации.'");
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	РезультатПроверки.ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
	
	РезультатПроверки.Результат = ПодписьВерна
		И СертификатДействителен
		И (СертификатПодписантаНеСодержитИННФизЛица
			ИЛИ ДоверенностьПодписанаДоверителем)
		И ДоверительЯвляетсяУполномоченнымПредставителемОрганизации
		И ЗначениеЗаполнено(ВерсияФормата);
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти

// Параметры:
//  СведенияМЧД - СправочникОбъект.МЧД003
//              - Структура:
//              	* ПередовериеРазрешено - Булево
//              	* ДатаПрекращения      - Дата
//              	* СрокДействия		   - Дата              	
//					* СтатусВРеестреФНС    - ПеречислениеСсылка.СтатусыМашиночитаемойДоверенностиВРеестреФНС
//					* Верна                - Булево
//					* Подписана            - Булево
//
// Возвращаемое значение:
//  Булево
// 
Функция ПередовериеРазрешено(СведенияМЧД) Экспорт
	
	Возврат ИмеетсяПравоИзмененияМЧД() 
		И СведенияМЧД.ПередовериеРазрешено 
		И Не МашиночитаемыеДоверенностиКлиентСервер.ДоверенностьОтозвана(СведенияМЧД)
		И СведенияМЧД.СрокДействия > ТекущаяДатаСеанса() 
		И СведенияМЧД.СтатусВРеестреФНС = Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Зарегистрировано
			Или (СведенияМЧД.Верна И СведенияМЧД.Подписана И Не ЗначениеЗаполнено(СведенияМЧД.СтатусВРеестреФНС));
	
КонецФункции

// Параметры:
//  ДанныеДоверенностиXDTO - ОбъектXDTO
// 
// Возвращаемое значение:
//  Строка
Функция СНИЛСФизическогоЛицаДоверителя(ДанныеДоверенностиXDTO)
	
	ВерсияФормата = ВерсияФорматаОбъектаМЧД(ДанныеДоверенностиXDTO);
	Если ВерсияФормата = МашиночитаемыеДоверенностиКлиентСервер.ФорматМЧД_003() Тогда
		СНИЛСДоверителяФЛ = Справочники.МЧД003.СНИЛСЛицДействующихБезДоверенности(ДанныеДоверенностиXDTO);
	Иначе
		СНИЛСДоверителяФЛ = Справочники.МашиночитаемыеДоверенностиОрганизаций.СНИЛСДоверителя(ДанныеДоверенностиXDTO);
	КонецЕсли;
	
	СНИЛСДоверителя = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("- ", СНИЛСДоверителяФЛ, "");
	
	Возврат СНИЛСДоверителя;
	
КонецФункции

// Определяет видимость команд МЧД При получении данных динамического списка и кеширует значение в данных строки
// 
// Параметры:
//  Строки - СтрокиДинамическогоСписка
//
Процедура ОпределитьВидимостьКомандМЧДПриПолученииДанныхСпискаНаСервере(Строки) Экспорт
	Если Не ЗначениеЗаполнено(Строки) Тогда
		Возврат;
	КонецЕсли;
	ДатаПроверки = ТекущаяДатаСеанса();
	Доверенности = Новый Массив(Строки.Количество());
	Индекс = 0;
	Для Каждого ОписаниеСтрокиДинамическогоСписка Из Строки Цикл
		Доверенности[Индекс] = ОписаниеСтрокиДинамическогоСписка.Значение.Данные.Ссылка;
		Индекс = Индекс + 1;
	КонецЦикла;
	РезультатПроверки = ДоверенностиДействительны(Доверенности, ДатаПроверки);
	Для Каждого ОписаниеСтрокиДинамическогоСписка Из Строки Цикл
		ДанныеСтроки = ОписаниеСтрокиДинамическогоСписка.Значение.Данные;
		ВидимостьКомандМЧД = Новый Соответствие;
		ВидимостьКомандМЧД.Вставить("ОтменаДоверенности", РезультатПроверки[ДанныеСтроки.Ссылка]);
		ДанныеСтроки["ВидимостьКомандМЧД"] = ВидимостьКомандМЧД;
	КонецЦикла;
КонецПроцедуры

// Проверяет, является ли файл с данным расширением файлом подписи.
// 
// Параметры:
//  РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоРасширениеФайлаПодписи(РасширениеФайла)
	
	Возврат РасширенияФайловПодписи().Найти(РасширениеФайла) <> Неопределено;
	
КонецФункции

// Возвращает расширения файлов подписи.
// 
// Возвращаемое значение:
//  Массив из Строка 
Функция РасширенияФайловПодписи()
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("p7s");
	МассивРасширений.Добавить("sig");
	МассивРасширений.Добавить("sign");
	МассивРасширений.Добавить("sgn");
	
	Возврат МассивРасширений;
	
КонецФункции

// Проверяет настройку правила проверки полномочий МЧД
// 
// Параметры:
//  Правило - СправочникСсылка.ПравилаПроверкиПолномочийМЧД
// 
// Возвращаемое значение:
//  Булево
Функция ПравилоНастроено(Правило) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Правило) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "ПравилоНастроено") = Истина;
	
КонецФункции

// Обрабатывает ошибку некорректных правил проверки.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций, СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов - Доверенность
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Электронный документ
//  ПравилоПроверки - Неопределено, СправочникСсылка.ПравилаПроверкиПолномочийМЧД - Правило проверки
Процедура ВывестиОшибкуНекорректныхПравилПроверки(Доверенность, ЭлектронныйДокумент, ПравилоПроверки = Неопределено)
	
	ТекстОшибки = НСтр("ru = 'Не настроены правила проверки полномочий доверенности'");
	Если ЗначениеЗаполнено(ПравилоПроверки) Тогда
		ТекстОшибки = НСтр("ru = 'Правила проверки полномочий настроены некорректно'");
	КонецЕсли;
	ВидОперации = НСтр("ru = 'Проверка полномочий доверенности.'");
	ШаблонСообщения =
		Нстр("ru = 'Ошибка при проверке полномочий доверенности: %1 для документа: %2'");
	Сообщение = СтрШаблон(ШаблонСообщения, Доверенность, ЭлектронныйДокумент);
	ПодробныйТекстОшибки = Сообщение + Символы.ПС + ТекстОшибки; 	
	ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, Сообщение);
	
КонецПроцедуры

// Параметры:
//  Доверенность - ОпределяемыйТип.МашиночитаемаяДоверенность
// 
// Возвращаемое значение:
//  см. НовыеДанныеМашиночитаемыхПолномочий
//
Функция МашиночитаемыеПолномочияДоверенности(Доверенность)
	
	ТипДоверенности = ТипЗнч(Доверенность);
	
	Если ТипДоверенности = Тип("СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов") 
		ИЛИ ТипДоверенности = Тип("СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций") Тогда
		
		Результат =
			Справочники.МашиночитаемыеДоверенностиОрганизаций.МашиночитаемыеПолномочияДоверенности(Доверенность);
		
	ИначеЕсли ТипДоверенности = Тип("СправочникСсылка.МЧД003") Тогда
		
		Результат =
			Справочники.МЧД003.МашиночитаемыеПолномочияДоверенности(Доверенность);
			
	Иначе
		
		Результат = НовыеДанныеМашиночитаемыхПолномочий();
		Результат.ТекстОшибки = НСтр("ru = 'Проверка полномочий завершилась с ошибкой.
		|Получение данных о полномочиях не поддерживается для данного типа метаданных.'");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * ТекстОшибки - Строка
// * Полномочия - Неопределено
//              - Массив из см. НовыеПолномочияПредставителя
//              - Массив из см. Справочники.МЧД003.НовыеДанныеМашиночитаемогоПолномочия
//
Функция НовыеДанныеМашиночитаемыхПолномочий() Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("ТекстОшибки", "");
	Данные.Вставить("Полномочия", Неопределено);
	
	Возврат Данные;
	
КонецФункции

// Проверяет право настройки правил проверки полномочий.
// Параметры:
// МетаданныеМЧД - ОбъектМетаданных
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьПравоНастройкиПравилПроверкиПолномочий(МетаданныеМЧД = Неопределено) Экспорт
	
	Возврат (МетаданныеМЧД = Метаданные.Справочники.МашиночитаемыеДоверенностиКонтрагентов
		ИЛИ МетаданныеМЧД = Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций
		ИЛИ МетаданныеМЧД = Метаданные.Справочники.МЧД003)
		И ПравоДоступа("Изменение", МетаданныеМЧД);
	
КонецФункции

// Возвращает признак, указаны ли полномочия доверенности из классификатора.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  			 - СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов
//  			 - СправочникСсылка.МЧД003
//  ВариантЗаполненияПолномочий - ПеречислениеСсылка.ВариантыЗаполненияПолномочийМЧД
// 
// Возвращаемое значение:
//  Булево - Истина, если полномочия из классификатора
//
Функция ПолномочияМЧДУказаныИзКлассификатора(Доверенность = Неопределено, ВариантЗаполненияПолномочий = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Доверенность) И Не ЗначениеЗаполнено(ВариантЗаполненияПолномочий) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВариантЗаполненияПолномочий = Неопределено Тогда
		
		ВариантЗаполненияПолномочий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Доверенность, "ВариантЗаполненияПолномочий");
	
	КонецЕсли;
	
	Возврат ВариантЗаполненияПолномочий = Перечисления.ВариантыЗаполненияПолномочийМЧД.КлассификаторФНС;
	
КонецФункции

// При получении данных на сервере.
// 
// Параметры:
//  ИмяЭлемента - Строка
//  Настройки - НастройкиКомпоновкиДанных
//  Строки - Соответствие Из КлючИЗначение:
//	* Ключ - Произвольный
//	* Значение - СтрокаДинамическогоСписка
//
Процедура ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	СтрСоединитель = " " + НСтр("ru = 'и еще'") + " ";
	
	Для Каждого СтрокаТаблицы Из Строки Цикл
		
		Если СтрокаТаблицы.Значение.Данные.Количество > 1 Тогда
			СтрокаТаблицы.Значение.Данные.Представитель = СтрокаТаблицы.Значение.Данные.Представитель 
				+ СтрСоединитель
				+ Строка(СтрокаТаблицы.Значение.Данные.Количество - 1);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

// Формирует набор цветов фона.
// 
// Возвращаемое значение:
//  Структура - набор цветов:
// * ВниманиеМЧД - Цвет
// * ДействительнаяМЧД - Цвет
// * НедействительнаяМЧД - Цвет
//
Функция ЦветаФона() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ВниманиеМЧД", ЦветаСтиля.ЦветФонаВниманиеМЧД);
	Результат.Вставить("ДействительнаяМЧД", ЦветаСтиля.ЦветФонаДействительнаяМЧД);
	Результат.Вставить("НедействительнаяМЧД", ЦветаСтиля.ЦветФонаНедействительнаяМЧД);
			
	Возврат Результат;
	
КонецФункции

// Выполняет проверку оператором переданного типа МЧД.
//
// Параметры:
//  Оператор - Строка - Идентификатор оператора
//  ТипДоверенности - Тип - один из типов, входящих в состав определяемого типа МашиночитаемаяДоверенность
//
// Возвращаемое значение:
//  Булево - Истина, если тип доверенности поддержан оператором
//
Функция ТипПоддержанОператором(Оператор, ТипДоверенности) Экспорт
	
	Если ПустаяСтрока(Оператор) Или Не ЗначениеЗаполнено(ТипДоверенности) Или ТипДоверенности = Тип("Неопределено") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыОператораЭДО = ЭлектронныеДокументыСлужебный.РеквизитыОператораЭДО(Оператор);
	Если РеквизитыОператораЭДО = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	

	СоответствиеТиповМЧД = СоответствиеДанныхСервисаНастроекЭДОИТиповМЧД();
	
	ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД = РеквизитыОператораЭДО.ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД;   
	
	ПоддерживаемыеТипыМЧД = СтрРазделить(ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД, ";");
	Если ПоддерживаемыеТипыМЧД.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого ТипМЧД Из ПоддерживаемыеТипыМЧД Цикл
		Если ТипДоверенности = СоответствиеТиповМЧД.Получить(ТипМЧД) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	МассивПоддержанныхТиповМЧД = Новый Массив;
	Для Каждого ПоддержаныйТип Из ПоддерживаемыеТипыМЧД Цикл
		МассивПоддержанныхТиповМЧД.Добавить(ПоддержаныйТип);
	КонецЦикла;
	ВидОперации = НСтр("ru = 'Проверка поддержки оператором регистрации с использованием машиночитаемой доверенности'");
	ТекстОшибкиШаблон = 
		НСтр("ru = 'Оператором ""%1"" в данный момент не поддержана регистрация учётных записей
		|представителей с использованием машиночитаемых доверенностей выбранной версии.
		|Необходимо выбрать машиночитаемую доверенность версии %2.
		|В случае её отсутствия, требуемую машиночитаемую доверенность можно
		|зарегистрировать на сайте ФНС и загрузить её в программу из реестра ФНС.'");
	ТекстОшибки = СтрШаблон(ТекстОшибкиШаблон, РеквизитыОператораЭДО.Представление,
		СтрСоединить(МассивПоддержанныхТиповМЧД, ", "));
	ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, ТекстОшибки, ТекстОшибки);
	
	Возврат Ложь;
	
КонецФункции

// Формирует фиксированное соответствие, связывающее строковые типы МЧД,
// используемые в json-файлах, публикуемых в сервисе настроек ЭДО, с типами справочников МЧД.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие Из КлючИЗначение:
//	 * Ключ - Строка
//	 * Значение - Тип - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//	 			- Тип - СправочникСсылка.МЧД003
//
Функция СоответствиеДанныхСервисаНастроекЭДОИТиповМЧД() Экспорт
	
	Результат = Новый Соответствие();
	Результат.Вставить("002", Тип("СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций"));
	Результат.Вставить("003", Тип("СправочникСсылка.МЧД003"));
			
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Возвращает текст декорации информации о дополнительной проверке полномочий для форм классификаторов полномочий ФНС.
// 
// Возвращаемое значение:
//  Строка - Текст декорации
Функция ТекстДекорацииИнформацииОДополнительнойПроверкеПолномочий() Экспорт
	Возврат НСтр("ru = 'Дополнительные правила проверки полномочий позволяют расширить перечень разрешенных действий, которые определены автоматическими правилами.'");
КонецФункции

Функция ПолучитьИмяФайлаВыгрузки(СсылкаНаДоверенность)
	
	Если ЭтоМЧД003(СсылкаНаДоверенность) Тогда
		ИмяФайлаВыгрузки = Справочники.МЧД003.ПолучитьИмяФайлаМЧД(СсылкаНаДоверенность);
	Иначе	
		ИмяФайлаВыгрузки = Справочники.МашиночитаемыеДоверенностиОрганизаций.ПолучитьИмяФайлаМЧД(СсылкаНаДоверенность);
	КонецЕсли;
	
	Возврат ИмяФайлаВыгрузки;
	
КонецФункции

Процедура ЗаписатьМЧД(РезультатРегистрации, СсылкаНаДоверенность)
	
	Если ЗначениеЗаполнено(РезультатРегистрации.ИдентификаторТранзакции) И ЭтоМЧД003(СсылкаНаДоверенность) Тогда
		МЧД = СсылкаНаДоверенность.ПолучитьОбъект();
		МЧД.ИдентификаторТранзакции = РезультатРегистрации.ИдентификаторТранзакции;
		МЧД.СтатусВРеестреФНС = ПредопределенноеЗначение(
			"Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отправлено");
		МЧД.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ИНН доверителя физ. лица, ИНН доверителя юр.лица, КПП доверителя юр. лица.
// 
// Параметры:
//  ДанныеДоверенности - ДвоичныеДанные - доверенность в пилотном формате xml.
// 
// Возвращаемое значение:
//  Структура:
//    * ИННФЛ - Строка
//            - Неопределено
//    * ИННЮЛ - Строка
//            - Неопределено
//    * КПП - Строка - заполнено только для ЮЛ, ИО
//    * ТипДоверителя - Строка - принимает значения ЮЛ, ИО, ИП
Функция ИННКППДоверителейВФормате_003(ДанныеДоверенности)
	
	Поток = ДанныеДоверенности.ОткрытьПотокДляЧтения();
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(Поток);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если (ЧтениеXML.Имя = "СвДоверит"
				Или ЧтениеXML.Имя = "СвПередПолн")
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Возврат НайтиИННКППДоверителей(ЧтениеXML);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	Поток.Закрыть();
	
	Возврат Неопределено;
	
КонецФункции

// Извлекает из XML файла доверенности поля, необходимые для запроса сведений о родительской доверенности из
// распределенного реестра. 
// 
// Параметры:
//  ДвоичныеДанныеДоверенности - ДвоичныеДанные
// 
// Возвращаемое значение:
//  - Неопределено
//  - Структура:
//		* НомерДоверенности - Строка
//		* ИННДоверителя - Строка
//
Функция ПараметрыДляЗапросаРодительскойДоверенности(ДвоичныеДанныеДоверенности)
	
	Отказ = Ложь;
	ОткрытыеРесурсы = Новый Массив; // Массив Из ЧтениеXML, ЗаписьXML
	
	ПараметрыЗапроса = Новый Структура("НомерДоверенности, ИННДоверителя", "", "");
	
	Правило = Обработки.ЭлектронныеДокументы.ПолучитьМакет(
		"ПравилоИзвлеченияСведенийРодительскойДоверенностиДляЗапросаКРеестру").ПолучитьТекст();
	
	ЧтениеДоверености = Новый ЧтениеXML;
	ОткрытыеРесурсы.Добавить(ЧтениеДоверености);
	ЧтениеДоверености.ОткрытьПоток(ДвоичныеДанныеДоверенности.ОткрытьПотокДляЧтения());
	
	ЗаписьСтруктуры = Новый ЗаписьXML;
	ОткрытыеРесурсы.Добавить(ЗаписьСтруктуры);
	ЗаписьСтруктуры.УстановитьСтроку();
	
	Преобразователь = Новый ПреобразованиеXSL;
	Преобразователь.ЗагрузитьИзСтроки(Правило);
	
	Попытка
		Преобразователь.Преобразовать(ЧтениеДоверености, ЗаписьСтруктуры);
		XMLСтрокаСтруктуры = ЗаписьСтруктуры.Закрыть();
		
		ЧтениеСтруктуры = Новый ЧтениеXML;
		ЧтениеСтруктуры.ОткрытьПоток(ПолучитьДвоичныеДанныеИзСтроки(XMLСтрокаСтруктуры).ОткрытьПотокДляЧтения());
		ОткрытыеРесурсы.Добавить(ЧтениеСтруктуры);
		СтруктураИзПравил = СериализаторXDTO.ПрочитатьXML(ЧтениеСтруктуры, Тип("Структура"));
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Если Не Отказ Тогда
		НомерДоверенности = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(СтруктураИзПравил, "НомерДоверенности");
		ИННДоверителя = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(СтруктураИзПравил, "ИННДоверителя");
		Если ЗначениеЗаполнено(НомерДоверенности) И ЗначениеЗаполнено(ИННДоверителя) Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, СтруктураИзПравил);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого РесурсКЗакрытию Из ОткрытыеРесурсы Цикл
		РесурсКЗакрытию.Закрыть();
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПараметрыЗапроса;
	КонецЕсли;
	
КонецФункции

#Область ПредставлениеСубъектовДоверенностей

// Параметры:
//  Данные - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовоеЮридическоеЛицо
//  
// Возвращаемое значение:
//  Строка
Функция ПредставлениеЮридическогоЛица(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "ИНН, КПП");
	Шаблон = НСтр("ru='[Наименование] ИНН: [ИНН] КПП: [КПП]';");
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

// Параметры:
//  Данные - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовыйИндивидуальныйПредприниматель
//  
// Возвращаемое значение:
//  Строка
Функция ПредставлениеИндивидуальногоПредпринимателя(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "ИНН, СНИЛС");
	Шаблон = НСтр("ru='[Наименование] ИНН: [ИНН] СНИЛС: [СНИЛС]';");
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

// Параметры:
//  Данные - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовоеФизическоеЛицо
//  
// Возвращаемое значение:
//  Строка
Функция ПредставлениеФизическогоЛица(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "ИНН, СНИЛС");
	Шаблон = НСтр("ru='[ФИО] ИНН: [ИНН] СНИЛС: [СНИЛС]';");
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

// Параметры:
//  Данные - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НоваяИностраннаяОрганизация
//  
// Возвращаемое значение:
//  Строка
Функция ПредставлениеИностраннойОрганизации(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "ИНН, КПП");
	Шаблон = НСтр("ru='[Наименование] ИНН: [ИНН] КПП: [КПП]';");
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

// Параметры:
//  Структура - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовоеЮридическоеЛицо
//            - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НоваяИностраннаяОрганизация
//            - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовыйИндивидуальныйПредприниматель
//            - См. РегистрыСведений.ЖурналМашиночитаемыхДоверенностей.НовоеФизическоеЛицо 
//  КлючиСтрокой - Строка
Процедура ЗаполнитьПустыеПоля(Структура, КлючиСтрокой)
	
	Ключи = СтрРазделить(КлючиСтрокой, ", ", Ложь);
	Для Каждого Ключ Из Ключи Цикл
		Если Не ЗначениеЗаполнено(Структура[Ключ]) Тогда
			Структура[Ключ] = " -- ";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КлассификаторыПолномочийФНС 

//Возвращает соответствие видов эд между БЭД 1.9 и БЭД 1.1
Функция СоответствиеВидовЭД()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("АктВзаимозачета", "ПроизвольныйЭД");
	Результат.Вставить("АктСверки", "ПроизвольныйЭД");
	Результат.Вставить("Ведомость", "	ПроизвольныйЭД");
	Результат.Вставить("ГарантийноеПисьмо", "ПроизвольныйЭД");
	Результат.Вставить("Уведомление", "ПроизвольныйЭД");
	Результат.Вставить("Спецификация", "ПроизвольныйЭД");
	Результат.Вставить("СоглашениеОбЭДО", "ПроизвольныйЭД");
	Результат.Вставить("Договор", "ПроизвольныйЭД");
	Результат.Вставить("ДоговорнойДокумент", "ПроизвольныйЭД");
	Результат.Вставить("ДополнительноеСоглашение", "ПроизвольныйЭД");
	
	Результат.Вставить("КС11", "ПроизвольныйЭД");
	Результат.Вставить("КС2", "ПроизвольныйЭД");
	Результат.Вставить("КС3", "ПроизвольныйЭД");
	Результат.Вставить("Отчет", "ПроизвольныйЭД");
	
	Результат.Вставить("Прочее", "ПроизвольныйЭД");
	Результат.Вставить("УКД", "КорректировочныйСчетФактура");
	Результат.Вставить("УПД", "СчетФактура");
	Результат.Вставить("ТоварнаяНакладная", "ТОРГ12Продавец");
	Результат.Вставить("ПодтверждениеОператораЭДО", "Подтверждение");
	
	Возврат Результат;
	
КонецФункции

Функция НайтиВидЭДПоЗначению(Значение)
	
	МетаданныеЗначенияВидЭД = Метаданные.Перечисления.ВидыЭД.ЗначенияПеречисления.Найти(Значение);	
	
	Если МетаданныеЗначенияВидЭД = Неопределено Тогда
		СоответствиеВидовЭД = СоответствиеВидовЭД();
		Значение = СоответствиеВидовЭД[Значение];
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Возврат Неопределено;
		КонецЕсли;		
		МетаданныеЗначенияВидЭД = Метаданные.Перечисления.ВидыЭД.ЗначенияПеречисления.Найти(Значение);	
	КонецЕсли;
	
	Если Не МетаданныеЗначенияВидЭД = Неопределено Тогда
		Возврат Перечисления.ВидыЭД[Значение];	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Типы получаемых данных.
// 
// Возвращаемое значение:
//  Структура - описание типов:
//   * Булево - ОписаниеТипов
//   * Число - ОписаниеТипов
//   * Дата - ОписаниеТипов
//   * Строка - ОписаниеТипов
//   * Структура - ОписаниеТипов
//   * Массив - - ОписаниеТипов
//   * Таблица - ОписаниеТипов
//   * СпособыОбменаЭД - - ОписаниеТипов
//   * ВидЭД - ОписаниеТипов
Функция Типы() Экспорт
	
	СоответствиеСправочников = Новый Соответствие;
	ЭлектронныеДокументыПереопределяемый.ПолучитьСоответствиеСправочников(СоответствиеСправочников);
	
	Результат = Новый Структура;
	Результат.Вставить("Булево"         , Новый ОписаниеТипов("Булево"));
	Результат.Вставить("Число"          , Новый ОписаниеТипов("Число"));
	Результат.Вставить("Дата"           , Новый ОписаниеТипов("Дата"));
	Результат.Вставить("Строка"         , Новый ОписаниеТипов("Строка"));
	Результат.Вставить("Структура"      , Новый ОписаниеТипов("Структура"));
	Результат.Вставить("Массив"         , Новый ОписаниеТипов("Массив"));
	Результат.Вставить("Таблица"        , Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Вставить("СпособыОбменаЭД", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыОбменаЭД"));
	Результат.Вставить("ВидЭД"          , Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЭД"));
	
	Результат.Вставить("Организация"    , Новый ОписаниеТипов("СправочникСсылка."+
		ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("Организации")));
	Результат.Вставить("КонтрагентБЭД"  , Новый ОписаниеТипов("СправочникСсылка."+
		ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("Контрагенты")));
	Результат.Вставить("ФизическоеЛицо" , Новый ОписаниеТипов("СправочникСсылка."+
		ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("ФизЛица")));
	
	Возврат Результат;
	
КонецФункции

// Параметры синхронизации классификатора ФНС (МЧД 002).
// 
// Возвращаемое значение:
//  Структура - Параметры операции обновления классификатора:
// * ТипСинхронизации        - ПеречислениеСсылка.ТипыСинхронизацииСервисаНастроекЭДО
// * ДатаПоследнегоИзменения - Дата
// * КонтекстДиагностики     - Неопределено
//
Функция ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД002() Экспорт
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ТипСинхронизации",        Перечисления.ТипыСинхронизацииСервисаНастроекЭДО.ОбновлениеКлассификатораПолномочийФНСМЧД002);
	ПараметрыОперации.Вставить("ДатаПоследнегоИзменения", Дата(1, 1, 1));
	ПараметрыОперации.Вставить("КонтекстДиагностики",     Неопределено);
	
	Возврат ПараметрыОперации;
	
КонецФункции

// Параметры синхронизации классификатора ФНС (МЧД 003).
// 
// Возвращаемое значение:
//  Структура - Параметры операции обновления классификатора:
// * ТипСинхронизации        - ПеречислениеСсылка.ТипыСинхронизацииСервисаНастроекЭДО
// * ДатаПоследнегоИзменения - Дата
// * КонтекстДиагностики     - Неопределено
//
Функция ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД003() Экспорт
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ТипСинхронизации",        Перечисления.ТипыСинхронизацииСервисаНастроекЭДО.ОбновлениеКлассификатораПолномочийФНСМЧД003);
	ПараметрыОперации.Вставить("ДатаПоследнегоИзменения", Дата(1, 1, 1));
	ПараметрыОперации.Вставить("КонтекстДиагностики",     Неопределено);
	
	Возврат ПараметрыОперации;
	
КонецФункции

// Конвертирует данные в формате JSON в значение 
// 
// Параметры:
// 	Данные - Строка
// 	       - ДвоичныеДанные
// 	       - Поток
// 	       - ПотокВПамяти
// 	       - ФайловыйПоток
// 	ПрочитатьВСоответствие - Булево - см. синтакс-помощник к методу ПрочитатьJSON
// Возвращаемое значение:
// 	- Структура
// 	- Соответствие
Функция JSONЗначение(Данные, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		ЧтениеJSON.УстановитьСтроку(Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда 
		Поток = Данные.ОткрытьПотокДляЧтения();
		ЧтениеJSON.ОткрытьПоток(Поток);
	ИначеЕсли ТипЗнч(Данные) = Тип("Поток") Или ТипЗнч(Данные) = Тип("ПотокВПамяти")
		Или ТипЗнч(Данные) = Тип("ФайловыйПоток") Тогда 
		ЧтениеJSON.ОткрытьПоток(Данные);
	КонецЕсли;
	
	Значение = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	
	ЧтениеJSON.Закрыть();
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Поток.Закрыть();
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ОбъектИзJSON(ПараметрыКоманды, Знач ДвоичныеДанные, Отказ, КонтекстДиагностики = Неопределено,
	ПрочитатьВСоответствие = Ложь) Экспорт
	
	Попытка
		ПолученныеДанные = JSONЗначение(ДвоичныеДанные, ПрочитатьВСоответствие);
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Возврат ПолученныеДанные;
КонецФункции


// Преобразует дату из тестового формата json с проверкой на отсутствие даты.
//
// Параметры:
//  Строка          - Строка         - Строка Json
//  ФорматДаты  - ФорматДатыJson - Формат даты в строке JSON
//
// Возвращаемое значение:
//   Дата   - прочитанная Дата
//
Функция ДатаИзJsonСПроверкой(Строка, ФорматДаты)
	
	Результат = Дата(1,1,1);
	
	Если ЗначениеЗаполнено(Строка) Тогда
		Результат = ПрочитатьДатуJSON(Строка , ФорматДаты);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные классификатора полномочий ФНС (МЧД 002).
// 
// Параметры:
//  ПолученныеДанные - Структура
//                   - ДвоичныеДанные
//  Отказ - Булево
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  
// Возвращаемое значение:
//  Структура:
//   * ДатаПоследнегоИзменения - Дата
//   * КлассификаторПолномочийФНСМЧД002 - ТаблицаЗначений:
//    ** КодКлассификатора - Строка
//    ** Наименование      - Строка
//    ** Полномочие        - Строка
//    ** ТипОтношений      - Строка
//    ** ДатаИзменения     - Дата
//    ** Скрипт            - Строка
//    ** НастройкиПроверки - ТаблицаЗначений:
//     *** ИмяПоляДанных     - Строка
//     *** НачальноеЗначение - Булево
//                           - Число
//     *** КонечноеЗначение  - Булево
//                           - Число
//     *** Список            - ТаблицаЗначений:
//      **** ЗначениеПоляПрикладнойТипДокумента - Строка
//      **** ЗначениеПоляТипДокумента           - Строка
//
Функция ОбработкаРезультатаКлассификаторПолномочийФНС_МЧД002(Знач ПолученныеДанные, Отказ = Ложь,
		КонтекстДиагностики = Неопределено) Экспорт
	
	Если ТипЗнч(ПолученныеДанные) = Тип("ДвоичныеДанные") Тогда
		ПолученныеДанные = ОбъектИзJSON(Неопределено, ПолученныеДанные, Отказ);
			
		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Полномочия = Новый ТаблицаЗначений;
	
	ТипСтрока255 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255));
	ТипСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	
	Полномочия.Колонки.Добавить("КодКлассификатора", ТипСтрока255);
	Полномочия.Колонки.Добавить("Наименование",      ТипСтрока150);
	Полномочия.Колонки.Добавить("Полномочие",        Типы().Строка);
	Полномочия.Колонки.Добавить("ТипОтношений",      Типы().Строка);
	Полномочия.Колонки.Добавить("ДатаИзменения",     Типы().Дата);
	Полномочия.Колонки.Добавить("Скрипт",            Типы().Строка);
	Полномочия.Колонки.Добавить("НастройкиПроверки", Типы().Таблица);
	
	МассивТиповБулевоЧисло = Новый Массив;
	МассивТиповБулевоЧисло.Добавить(Тип("Булево"));
	МассивТиповБулевоЧисло.Добавить(Тип("Число"));
	ТипБулевоЧисло = Новый ОписаниеТипов(МассивТиповБулевоЧисло);
	
	НастройкиПроверки = Новый ТаблицаЗначений;

	НастройкиПроверки.Колонки.Добавить("ИмяПоляДанных",     Типы().Строка);
	НастройкиПроверки.Колонки.Добавить("НачальноеЗначение", ТипБулевоЧисло);
	НастройкиПроверки.Колонки.Добавить("КонечноеЗначение",  ТипБулевоЧисло);
	НастройкиПроверки.Колонки.Добавить("Список",            Типы().Таблица);
	
	СписокНастройки = Новый ТаблицаЗначений;
	СписокНастройки.Колонки.Добавить("ЗначениеПоляПрикладнойТипДокумента", Типы().Строка);
	СписокНастройки.Колонки.Добавить("ЗначениеПоляТипДокумента",           Типы().Строка);
	
	МаксимальнаяДопустимаяДлинаКодаВНаименовании = 147;
	
	ШаблонСокращенногоНаименования = ("%1...");
	
	Для Каждого ЭлементДанных Из ПолученныеДанные.elements Цикл
		
		НоваяСтрока = Полномочия.Добавить();
		НоваяСтрока.КодКлассификатора = ЭлементДанных.code;
		
		Если СтрДлина(ЭлементДанных.code) <= МаксимальнаяДопустимаяДлинаКодаВНаименовании Тогда
			НоваяСтрока.Наименование = ЭлементДанных.code;
		Иначе
			НоваяСтрока.Наименование = СтрШаблон(ШаблонСокращенногоНаименования, Лев(ЭлементДанных.code, 147));
		КонецЕсли;
		
		НоваяСтрока.Полномочие        = ЭлементДанных.description;
		НоваяСтрока.ТипОтношений      = ЭлементДанных.type;
		НоваяСтрока.ДатаИзменения     = ДатаИзJsonСПроверкой(ЭлементДанных.lastChangeDate, ФорматДатыJSON.ISO);
		НоваяСтрока.Скрипт            = ЭлементДанных.script;
		
		НастройкиПроверки.Очистить();
		
		Для Каждого ЭлементПравил Из ЭлементДанных.rules Цикл
			
			НовоеПравило = НастройкиПроверки.Добавить();
			НовоеПравило.ИмяПоляДанных     = ЭлементПравил.fieldName;
			НовоеПравило.НачальноеЗначение = ЭлементПравил.startValue;
			НовоеПравило.КонечноеЗначение  = ЭлементПравил.endValue;
			
			СписокНастройки.Очистить();
			
			Для Каждого ЭлементСписка Из ЭлементПравил.list Цикл
				
				НовыйЭлементСписка = СписокНастройки.Добавить();
				НовыйЭлементСписка.ЗначениеПоляПрикладнойТипДокумента = ЭлементСписка.appDocTypeValue;
				НовыйЭлементСписка.ЗначениеПоляТипДокумента           = ЭлементСписка.docTypeValue;
				
			КонецЦикла;
			
			НовоеПравило.Список = СписокНастройки.Скопировать();
			
		КонецЦикла;
		
		НоваяСтрока.НастройкиПроверки = НастройкиПроверки.Скопировать();
		
	КонецЦикла;
	
	ДатаПоследнегоИзменения = ДатаИзJsonСПроверкой(ПолученныеДанные.lastChangeDate, ФорматДатыJSON.ISO);
	
	Возврат Новый Структура("ДатаПоследнегоИзменения, КлассификаторПолномочийФНСМЧД002",
		ДатаПоследнегоИзменения, Полномочия);
		
КонецФункции

// Возвращает данные классификатора полномочий ФНС (МЧД 003).
// 
// Параметры:
//  ПолученныеДанные - Структура
//                   - ДвоичныеДанные
//  Отказ - Булево
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  
// Возвращаемое значение:
//  Структура:
//   * ДатаПоследнегоИзменения - Дата
//   * КлассификаторПолномочийФНСМЧД003 - ТаблицаЗначений:
//    ** КодКлассификатора - Строка
//    ** Наименование      - Строка
//    ** Полномочие        - Строка
//    ** Мнемоника         - Строка
//    ** Родитель          - Строка
//    ** УИДРодителя       - УникальныйИдентификатор
//    ** ТипОтношений      - Строка
//    ** ДатаИзменения     - Дата
//    ** Скрипт            - Строка
//    ** НастройкиПроверки - ТаблицаЗначений:
//     *** ИмяПоляДанных     - Строка
//     *** НачальноеЗначение - Булево
//                           - Число
//     *** КонечноеЗначение  - Булево
//                           - Число
//     *** Список            - ТаблицаЗначений:
//      **** ЗначениеПоляПрикладнойТипДокумента - Строка
//      **** ЗначениеПоляТипДокумента           - Строка
//
Функция ОбработкаРезультатаКлассификаторПолномочийФНС_МЧД003(Знач ПолученныеДанные, Отказ = Ложь,
		КонтекстДиагностики = Неопределено) Экспорт
	
	Если ТипЗнч(ПолученныеДанные) = Тип("ДвоичныеДанные") Тогда
		ПолученныеДанные = ОбъектИзJSON(Неопределено, ПолученныеДанные, Отказ);
			
		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Полномочия = Новый ТаблицаЗначений;
	
	ТипСтрока255 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255));
	ТипСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	
	Полномочия.Колонки.Добавить("КодКлассификатора", ТипСтрока255);
	Полномочия.Колонки.Добавить("Наименование",      ТипСтрока150);
	Полномочия.Колонки.Добавить("Полномочие",        Типы().Строка);
	Полномочия.Колонки.Добавить("Мнемоника",         ТипСтрока255);
	Полномочия.Колонки.Добавить("Родитель",          Типы().Строка);
	Полномочия.Колонки.Добавить("УИДРодителя",       Новый ОписаниеТипов("УникальныйИдентификатор"));
	Полномочия.Колонки.Добавить("ТипОтношений",      Типы().Строка);
	Полномочия.Колонки.Добавить("ДатаИзменения",     Типы().Дата);
	Полномочия.Колонки.Добавить("Скрипт",            Типы().Строка);
	Полномочия.Колонки.Добавить("НастройкиПроверки", Типы().Таблица);
	
	МассивТиповБулевоЧисло = Новый Массив;
	МассивТиповБулевоЧисло.Добавить(Тип("Булево"));
	МассивТиповБулевоЧисло.Добавить(Тип("Число"));
	ТипБулевоЧисло = Новый ОписаниеТипов(МассивТиповБулевоЧисло);
	
	НастройкиПроверки = Новый ТаблицаЗначений;

	НастройкиПроверки.Колонки.Добавить("ИмяПоляДанных",     Типы().Строка);
	НастройкиПроверки.Колонки.Добавить("НачальноеЗначение", ТипБулевоЧисло);
	НастройкиПроверки.Колонки.Добавить("КонечноеЗначение",  ТипБулевоЧисло);
	НастройкиПроверки.Колонки.Добавить("Список",            Типы().Таблица);
	
	СписокНастройки = Новый ТаблицаЗначений;
	СписокНастройки.Колонки.Добавить("ЗначениеПоляПрикладнойТипДокумента", Типы().Строка);
	СписокНастройки.Колонки.Добавить("ЗначениеПоляТипДокумента",           Типы().Строка);
	
	МаксимальнаяДопустимаяДлинаКодаВНаименовании = 147;
	
	ШаблонСокращенногоНаименования = ("%1...");
	
	Для Каждого ЭлементДанных Из ПолученныеДанные.elements Цикл
		
		НоваяСтрока = Полномочия.Добавить();
		НоваяСтрока.КодКлассификатора = ЭлементДанных.code;
		
		Если СтрДлина(ЭлементДанных.code) <= МаксимальнаяДопустимаяДлинаКодаВНаименовании Тогда
			НоваяСтрока.Наименование = ЭлементДанных.code;
		Иначе
			НоваяСтрока.Наименование = СтрШаблон(ШаблонСокращенногоНаименования, Лев(ЭлементДанных.code, 147));
		КонецЕсли;
		
		НоваяСтрока.Полномочие        = ЭлементДанных.description;
		НоваяСтрока.Родитель          = ЭлементДанных.parent;
		НоваяСтрока.Мнемоника         = ЭлементДанных.mnemonics;
		НоваяСтрока.УИДРодителя       = Новый УникальныйИдентификатор(ЭлементДанных.parentUUID);
		НоваяСтрока.ТипОтношений      = ЭлементДанных.type;
		НоваяСтрока.ДатаИзменения     = ДатаИзJsonСПроверкой(ЭлементДанных.lastChangeDate, ФорматДатыJSON.ISO);
		НоваяСтрока.Скрипт            = ЭлементДанных.script;
		
		НастройкиПроверки.Очистить();
		
		Для Каждого ЭлементПравил Из ЭлементДанных.rules Цикл
			
			НовоеПравило = НастройкиПроверки.Добавить();
			НовоеПравило.ИмяПоляДанных     = ЭлементПравил.fieldName;
			НовоеПравило.НачальноеЗначение = ЭлементПравил.startValue;
			НовоеПравило.КонечноеЗначение  = ЭлементПравил.endValue;
			
			СписокНастройки.Очистить();
			
			Для Каждого ЭлементСписка Из ЭлементПравил.list Цикл
				
				НовыйЭлементСписка = СписокНастройки.Добавить();
				НовыйЭлементСписка.ЗначениеПоляПрикладнойТипДокумента = ЭлементСписка.appDocTypeValue;
				НовыйЭлементСписка.ЗначениеПоляТипДокумента           = ЭлементСписка.docTypeValue;
				
			КонецЦикла;
			
			НовоеПравило.Список = СписокНастройки.Скопировать();
			
		КонецЦикла;
		
		НоваяСтрока.НастройкиПроверки = НастройкиПроверки.Скопировать();
		
	КонецЦикла;
	
	ДатаПоследнегоИзменения = ДатаИзJsonСПроверкой(ПолученныеДанные.lastChangeDate, ФорматДатыJSON.ISO);
	
	Возврат Новый Структура("ДатаПоследнегоИзменения, КлассификаторПолномочийФНСМЧД003",
		ДатаПоследнегоИзменения, Полномочия);
		
КонецФункции

// Получает классификатор полномочий ФНС (МЧД 002).
// 
// Параметры:
//  КонтекстДиагностики          - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ПолучатьНеобработанныеДанные - Булево - при установленном флаге будут получены
//  
// Возвращаемое значение:
//  - Неопределено   - не удалось получить данные.
//  - ДвоичныеДанные - необработанные данные
//  - См. ОбработкаРезультатаКлассификаторПолномочийФНС_МЧД002
//
Функция ПолучитьКлассификаторПолномочийФНС_МЧД002(ПолучатьНеобработанныеДанные = Ложь) Экспорт
	
	ПараметрыОперации = Новый Структура("Наименование",
		НСтр("ru = 'Получение данных классификатора полномочий ФНС (МЧД 002)'"));
	
	Путь  = "/mchd/rights_classifier/AuthorityClassifier_M4D_002.json";
	ДанныеФайла = ЭлектронныеДокументыСлужебный.ДанныеФайлаОблачногоХранилищаНастроек(Путь, ПараметрыОперации.Наименование);
	
	Если ДанныеФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если ПолучатьНеобработанныеДанные Тогда
		Возврат ДанныеФайла;
	Иначе
		ПолученныеДанные = ОбъектИзJSON(ПараметрыОперации, ДанныеФайла, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОбработкаРезультатаКлассификаторПолномочийФНС_МЧД002(ПолученныеДанные, Отказ);
	
	Возврат Результат;
	
КонецФункции

// Получает классификатор полномочий ФНС (МЧД 003).
// 
// Параметры:
//  КонтекстДиагностики          - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ПолучатьНеобработанныеДанные - Булево - при установленном флаге будут получены
//  
// Возвращаемое значение:
//  - Неопределено - не удалось получить данные.
//  - ДвоичныеДанные - необработанные данные
//  - См. ОбработкаРезультатаКлассификаторПолномочийФНС_МЧД003
//
Функция ПолучитьКлассификаторПолномочийФНС_МЧД003(ПолучатьНеобработанныеДанные = Ложь) Экспорт
	
	ПараметрыОперации = Новый Структура("Наименование",
		НСтр("ru = 'Получение данных классификатора полномочий ФНС (МЧД 003)'"));
	
	Путь  = "/mchd/rights_classifier/AuthorityClassifier_M4D_003.json";
	ДанныеФайла = ЭлектронныеДокументыСлужебный.ДанныеФайлаОблачногоХранилищаНастроек(Путь, ПараметрыОперации.Наименование);
	
	Если ДанныеФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если ПолучатьНеобработанныеДанные Тогда
		Возврат ДанныеФайла;
	Иначе
		ПолученныеДанные = ОбъектИзJSON(ПараметрыОперации, ДанныеФайла, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОбработкаРезультатаКлассификаторПолномочийФНС_МЧД003(ПолученныеДанные, Отказ);
	
	Возврат Результат;
	
КонецФункции

// Заполнить параметры синхронизации классификатора ФНС (МЧД 002).
// 
// Возвращаемое значение:
//  см. ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД002
//
Функция ЗаполнитьПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД002() Экспорт

	ПараметрыОперации = ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД002();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияСинхронизацииСервисНастроекЭДО.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииСервисНастроекЭДО КАК СостоянияСинхронизацииСервисНастроекЭДО
		|ГДЕ
		|	СостоянияСинхронизацииСервисНастроекЭДО.ТипСинхронизации =
		|		ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСервисаНастроекЭДО.ОбновлениеКлассификатораПолномочийФНСМЧД002)";
		
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыОперации.ДатаПоследнегоИзменения = ВыборкаДетальныеЗаписи.ДатаПоследнегоИзменения;
		
	КонецЦикла;
	
	Возврат ПараметрыОперации;
	
КонецФункции

// Заполнить параметры синхронизации классификатора ФНС (МЧД 003).
// 
// Возвращаемое значение:
//  см. ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД003
//
Функция ЗаполнитьПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД003() Экспорт
	
	ПараметрыОперации = ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД003();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияСинхронизацииСервисНастроекЭДО.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииСервисНастроекЭДО КАК СостоянияСинхронизацииСервисНастроекЭДО
		|ГДЕ
		|	СостоянияСинхронизацииСервисНастроекЭДО.ТипСинхронизации =
		|		ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСервисаНастроекЭДО.ОбновлениеКлассификатораПолномочийФНСМЧД003)";
		
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыОперации.ДатаПоследнегоИзменения = ВыборкаДетальныеЗаписи.ДатаПоследнегоИзменения;
		
	КонецЦикла;
	
	Возврат ПараметрыОперации;
	
КонецФункции

// Синхронизировать классификатор полномочий ФНС (МЧД 002).
// 
// Параметры:
//  ПараметрыОперации - см. ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД002
//  АдресРезультата   - Строка - 
Процедура СинхронизироватьКлассификаторПолномочийФНС_МЧД002(ПараметрыОперации, АдресРезультата = Неопределено) Экспорт
	
	ДанныеКлассификатора = ПолучитьКлассификаторПолномочийФНС_МЧД002();
	Если ДанныеКлассификатора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		ОбновитьКлассификаторПолномочийФНС_МЧД002(ДанныеКлассификатора,
			ПараметрыОперации.ДатаПоследнегоИзменения);
		ЭлектронныеДокументыСлужебный.ИзменитьСостояниеСинхронизации(ПараметрыОперации.ТипСинхронизации,
			ДанныеКлассификатора.ДатаПоследнегоИзменения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Синхронизация классификатора полномочий ФНС (МЧД 002) из сервиса настроек'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Синхронизировать классификатор полномочий ФНС (МЧД 003).
// 
// Параметры:
//  ПараметрыОперации - см. ПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД003
//  АдресРезультата   - Строка - 
Процедура СинхронизироватьКлассификаторПолномочийФНС_МЧД003(ПараметрыОперации, АдресРезультата = Неопределено) Экспорт
	
	ДанныеКлассификатора = ПолучитьКлассификаторПолномочийФНС_МЧД003();
	Если ДанныеКлассификатора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		ОбновитьКлассификаторПолномочийФНС_МЧД003(ДанныеКлассификатора,
			ПараметрыОперации.ДатаПоследнегоИзменения);
		ЭлектронныеДокументыСлужебный.ИзменитьСостояниеСинхронизации(ПараметрыОперации.ТипСинхронизации,
			ДанныеКлассификатора.ДатаПоследнегоИзменения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Синхронизация классификатора полномочий ФНС (МЧД 003) из сервиса настроек'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Адаптация

Функция ДобавитьПространствоИмен(Знач ДанныеXML, Знач ПространствоИмен, Знач Кодировка = "windows-1251") Экспорт
	
	ПотокЧтения = ДанныеXML.ОткрытьПотокДляЧтения();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ПотокЧтения, , , Кодировка);
	
	ПостроительDOM = Новый ПостроительDOM();
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Если ДокументDOM.ЭлементДокумента.URIПространстваИмен <> ПространствоИмен Тогда
		ДокументDOM.ЭлементДокумента.УстановитьСоответствиеПространстваИмен("", ПространствоИмен);
	КонецЕсли;
	
	ПотокЗаписи = Новый ПотокВПамяти();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьПоток(ПотокЗаписи, Кодировка);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	ЗаписьXML.Закрыть();
	
	ДвоичныеДанные = ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция ОбъектXDTOИзДанныхXML(Знач ДанныеXML, Знач ПространствоИмен, Знач ИмяТипа, Знач Кодировка = "windows-1251") Экспорт
	
	ПотокЧтения = ДанныеXML.ОткрытьПотокДляЧтения();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ПотокЧтения, , , Кодировка);
	
	ТипЗначения = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипЗначения);
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ПодготовитьСтроку(СтрокаИзСертификата)
	Возврат СокрЛП(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(СтрокаИзСертификата));
КонецФункции

Процедура ЗаполнитьИНН(Свойства, Данные)
	
	ИННЮЛ = Неопределено;
	ИНН = Неопределено;
	
	Если Данные.Свойство("INN") Тогда
		ИНН = Данные.INN;
	ИначеЕсли Данные.Свойство("OID1_2_643_3_131_1_1") Тогда
		ИНН = ПодготовитьСтроку(Данные.OID1_2_643_3_131_1_1);
	КонецЕсли;
	
	Если Данные.Свойство("INNLE") Тогда
		ИННЮЛ = Данные.INNLE;
	ИначеЕсли Данные.Свойство("OID1_2_643_100_4")
			И СтрДлина(Данные.OID1_2_643_100_4) = 10 Тогда
		ИННЮЛ = ПодготовитьСтроку(Данные.OID1_2_643_100_4);
	ИначеЕсли Данные.Свойство("_1_2_643_100_4") Тогда
		ИННЮЛ = ПодготовитьСтроку(Данные._1_2_643_100_4);
	КонецЕсли;
		
	Свойства.ИННЮЛ = ИННЮЛ;
	Свойства.ИНН = ИНН;
	
КонецПроцедуры

Функция СвойстваСубъектаСертификата(Сертификат, ПреобразоватьИННПоИННЮЛ = Истина) Экспорт
	
	Субъект = Сертификат.Субъект;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("Страна");
	Свойства.Вставить("Регион");
	Свойства.Вставить("НаселенныйПункт");
	Свойства.Вставить("Улица");
	Свойства.Вставить("Организация");
	Свойства.Вставить("Подразделение");
	Свойства.Вставить("ЭлектроннаяПочта");
	Свойства.Вставить("Фамилия");
	Свойства.Вставить("Имя");
	
	Если Субъект.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.CN);
	КонецЕсли;
	
	Если Субъект.Свойство("C") Тогда
		Свойства.Страна = ПодготовитьСтроку(Субъект.C);
	КонецЕсли;
	
	Если Субъект.Свойство("ST") Тогда
		Свойства.Регион = ПодготовитьСтроку(Субъект.ST);
	КонецЕсли;
	
	Если Субъект.Свойство("L") Тогда
		Свойства.НаселенныйПункт = ПодготовитьСтроку(Субъект.L);
	КонецЕсли;
	
	Если Субъект.Свойство("Street") Тогда
		Свойства.Улица = ПодготовитьСтроку(Субъект.Street);
	КонецЕсли;
	
	Если Субъект.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Субъект.O);
	КонецЕсли;
	
	Если Субъект.Свойство("OU") Тогда
		Свойства.Подразделение = ПодготовитьСтроку(Субъект.OU);
	КонецЕсли;
	
	Если Субъект.Свойство("E") Тогда
		Свойства.ЭлектроннаяПочта = ПодготовитьСтроку(Субъект.E);
	КонецЕсли;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОГРН");
	Свойства.Вставить("ОГРНИП");
	Свойства.Вставить("СНИЛС");
	Свойства.Вставить("ИНН");
	Свойства.Вставить("Фамилия");
	Свойства.Вставить("Имя");
	Свойства.Вставить("Отчество");
	Свойства.Вставить("Должность");
	Свойства.Вставить("Организация");
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("ИННЮЛ");
	
	Если Субъект.Свойство("OGRN")Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Субъект.OGRN);
		
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_1") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Субъект.OID1_2_643_100_1);
	КонецЕсли;
	
	Если Субъект.Свойство("OGRNIP") Тогда
		Свойства.ОГРНИП = ПодготовитьСтроку(Субъект.OGRNIP);
		
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_5") Тогда
		Свойства.ОГРНИП = ПодготовитьСтроку(Субъект.OID1_2_643_100_5);
	КонецЕсли;
	
	Если Субъект.Свойство("SNILS") Тогда
		Свойства.СНИЛС = ПодготовитьСтроку(Субъект.SNILS);
		
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_3") Тогда
		Свойства.СНИЛС = ПодготовитьСтроку(Субъект.OID1_2_643_100_3);
	КонецЕсли;
	
	ЗаполнитьИНН(Свойства, Субъект);
	
	Если Субъект.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.CN);
	КонецЕсли;
	
	Если Субъект.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Субъект.O);
	КонецЕсли;
	
	Если Субъект.Свойство("SN") Тогда // Наличие фамилии (обычно для должностного лица).
		
		// Извлечение ФИО из поля SN и GN.
		Свойства.Фамилия = ПодготовитьСтроку(Субъект.SN);
		
		Если Субъект.Свойство("GN") Тогда
			Отчество = ПодготовитьСтроку(Субъект.GN);
			Позиция = Найти(Отчество, " ");
			Если Позиция = 0 Тогда
				Свойства.Имя = Отчество;
			Иначе
				Свойства.Имя = Лев(Отчество, Позиция - 1);
				Свойства.Отчество = ПодготовитьСтроку(Сред(Отчество, Позиция + 1));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Свойства.ОГРНИП)    // Признак индивидуального предпринимателя.
	      Или Субъект.Свойство("T")                 // Признак должностного лица.
	      Или Субъект.Свойство("OID2_5_4_12")       // Признак должностного лица.
	      Или ЗначениеЗаполнено(Свойства.СНИЛС)     // Признак физического лица.
	      Или ЭлектронныеДокументыВнутренний.ЭтоИННФизЛица(Свойства.ИНН) И НЕ ЗначениеЗаполнено(Свойства.ИННЮЛ) Тогда // Признак физического лица.
		
		Если Свойства.ОбщееИмя <> Свойства.Организация
			   И Не (Субъект.Свойство("T")           И Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.T))
			   И Не (Субъект.Свойство("OID2_5_4_12") И Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.OID2_5_4_12)) Тогда
				
				// Извлечение ФИО из поля CN.
				Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Свойства.ОбщееИмя, " ", Ложь);
				
				Если Массив.Количество() < 4 Тогда
					Если Массив.Количество() > 0 Тогда
						Свойства.Фамилия = СокрЛП(Массив[0]);
					КонецЕсли;
					Если Массив.Количество() > 1 Тогда
						Свойства.Имя = СокрЛП(Массив[1]);
					КонецЕсли;
					Если Массив.Количество() > 2 Тогда
						Свойства.Отчество = СокрЛП(Массив[2]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.Фамилия) Или ЗначениеЗаполнено(Свойства.Имя) Тогда
		Если Субъект.Свойство("T") Тогда
			Свойства.Должность = ПодготовитьСтроку(Субъект.T);
			
		ИначеЕсли Субъект.Свойство("OID2_5_4_12") Тогда
			Свойства.Должность = ПодготовитьСтроку(Субъект.OID2_5_4_12);
		КонецЕсли;
	КонецЕсли; 
	
	Если ПреобразоватьИННПоИННЮЛ Тогда
		ЗаполнитьВСвойствахСертификатаИННПоИННЮЛ(Свойства);
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

Функция СвойстваСертификатов(Сертификаты) Экспорт
	
	СвойстваСертификатов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Сертификаты,
		//"Ссылка, Отозван, Отпечаток, ДействителенДо, КемВыдан, Наименование, Программа, ФайлСертификата, Фамилия, Имя, Отчество, Должность, Организация, Пользователь, КомуВыдан, Фирма");
		"Ссылка, Отозван, Отпечаток, ДатаОкончания, Наименование, ФайлСертификата, Фамилия, Имя, Отчество, ДолжностьПоСертификату, Организация");
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Для Каждого Свойство Из СвойстваСертификатов Цикл
		Если Свойство.Значение.ДатаОкончания >= ТекущаяДата Тогда
			СрокДействияВДнях = Окр((Свойство.Значение.ДатаОкончания - ТекущаяДата) / (60 * 60 * 24));
		Иначе
			СрокДействияВДнях = - 1;
		КонецЕсли;
		Свойство.Значение.Вставить("СрокДействияВДнях", СрокДействияВДнях);
		Свойство.Значение.Вставить("ВыбранныйСертификат", Свойство.Ключ);
		Свойство.Значение.Вставить("ПарольПолучен", Ложь);
		Свойство.Значение.Вставить("ПарольПользователя", Неопределено);
		
		Свойство.Значение.Вставить("ДанныеСертификата", Свойство.Значение.ФайлСертификата.Получить());
		
		Свойство.Значение.Вставить("Комментарий", "");//Необходим в методах БСП
	КонецЦикла;
	
	Возврат СвойстваСертификатов;
	
КонецФункции

Функция СвойстваСубъектаСертификатаПоСсылке(Сертификат) Экспорт
	
	Если ТипЗнч(Сертификат) = Тип("ДвоичныеДанные") Тогда
		ДанныеСертификата = Сертификат;
	Иначе
		ДанныеСертификата = ЭлектронныеДокументыСлужебный.ДвоичныеДанныеСертификата(Сертификат);
	КонецЕсли;
	СертификатКриптографии = Новый СертификатКриптографии(ДанныеСертификата);
	
	Возврат СвойстваСубъектаСертификата(СертификатКриптографии);
	
КонецФункции

Функция СвойстваИздателяСертификата(Сертификат) Экспорт
	
	Издатель = Сертификат.Издатель;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("Страна");
	Свойства.Вставить("Регион");
	Свойства.Вставить("НаселенныйПункт");
	Свойства.Вставить("Улица");
	Свойства.Вставить("Организация");
	Свойства.Вставить("Подразделение");
	Свойства.Вставить("ЭлектроннаяПочта");
	
	Если Издатель.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Издатель.CN);
	КонецЕсли;
	
	Если Издатель.Свойство("C") Тогда
		Свойства.Страна = ПодготовитьСтроку(Издатель.C);
	КонецЕсли;
	
	Если Издатель.Свойство("ST") Тогда
		Свойства.Регион = ПодготовитьСтроку(Издатель.ST);
	КонецЕсли;
	
	Если Издатель.Свойство("L") Тогда
		Свойства.НаселенныйПункт = ПодготовитьСтроку(Издатель.L);
	КонецЕсли;
	
	Если Издатель.Свойство("Street") Тогда
		Свойства.Улица = ПодготовитьСтроку(Издатель.Street);
	КонецЕсли;
	
	Если Издатель.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Издатель.O);
	КонецЕсли;
	
	Если Издатель.Свойство("OU") Тогда
		Свойства.Подразделение = ПодготовитьСтроку(Издатель.OU);
	КонецЕсли;
	
	Если Издатель.Свойство("E") Тогда
		Свойства.ЭлектроннаяПочта = ПодготовитьСтроку(Издатель.E);
	КонецЕсли;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОГРН");
	Свойства.Вставить("ИНН");
	Свойства.Вставить("ИННЮЛ");
	
	Если Издатель.Свойство("OGRN") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Издатель.OGRN);
		
	ИначеЕсли Издатель.Свойство("OID1_2_643_100_1") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Издатель.OID1_2_643_100_1);
	КонецЕсли;
	
	ЗаполнитьИНН(Свойства, Издатель);
	
	ЗаполнитьВСвойствахСертификатаИННПоИННЮЛ(Свойства);
	
	Возврат Свойства;
	
КонецФункции

Процедура ЗаполнитьВСвойствахСертификатаИННПоИННЮЛ(Свойства) Экспорт
		
	ИНН = МашиночитаемыеДоверенностиКлиентСервер.СвойствоСтруктуры(Свойства, "ИННЮЛ", "");
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		ИНН = Свойства.ИНН;
	КонецЕсли;
	
	// Удаляем незначащие символы, если это ИНН юридического лица
	Если СтрДлина(ИНН) = 12 И Лев(ИНН, 2) = "00" Тогда
		ИНН = Прав(ИНН, 10);
	КонецЕсли;
	
	Свойства.ИНН = ИНН;
	
КонецПроцедуры

Функция ДанныеСтраныМира(Знач КодСтраны = Неопределено, Знач Наименование = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КодСтраны) Тогда
		Возврат ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", КодСтраны);
	ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда
		ДополнительныеРеквизиты = Новый Структура;
		ДополнительныеРеквизиты.Вставить("Наименование", Наименование);

		Возврат ЭлектронныеДокументыПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", "",ДополнительныеРеквизиты);
	КонецЕсли;
	
	КлассификаторСтранМира = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("СтраныМира");
	Возврат Справочники[КлассификаторСтранМира].ПустаяСсылка();
	
КонецФункции

Функция КодировкаИзОбъявленияXML(ДвоичныеДанные) Экспорт
	
	БуферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	ПотокВПамяти = Новый ПотокВПамяти(БуферДвоичныхДанных);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ПотокВПамяти);
	Попытка
		ЧтениеXML.ПерейтиКСодержимому();
		КодировкаXML = ЧтениеXML.КодировкаXML;
	Исключение
		КодировкаXML = "";
	КонецПопытки;
	ЧтениеXML.Закрыть();
	ПотокВПамяти.Закрыть();
	
	Возврат КодировкаXML;
	
КонецФункции

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 в %2'"), ТекстИсключения, КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПараметр(Знач ИмяПроцедурыИлиФункции, Знач ИмяПараметра, Знач ЗначениеПараметра, 
	Знач ОжидаемыеТипы, Знач ОжидаемыеТипыСвойств = Неопределено) Экспорт
	
	Контекст = "ОбщегоНазначенияКлиентСервер.ПроверитьПараметр";
	Проверить(ТипЗнч(ИмяПроцедурыИлиФункции) = Тип("Строка"), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПроцедурыИлиФункции"), 
		Контекст);
	Проверить(ТипЗнч(ИмяПараметра) = Тип("Строка"), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПараметра"), 
			Контекст);
	
	ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеПараметра, ОжидаемыеТипы);
	Проверить(ЭтоКорректныйТип <> Неопределено, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ОжидаемыеТипы"),
		Контекст);
	Проверить(ЭтоКорректныйТип,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось: %3; передано значение: %4 (тип %5).'"),
			ИмяПараметра, ИмяПроцедурыИлиФункции, ПредставлениеТипов(ОжидаемыеТипы), 
			?(ЗначениеПараметра <> Неопределено, ЗначениеПараметра, НСтр("ru = 'Неопределено'")),
		ТипЗнч(ЗначениеПараметра)));
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ОжидаемыеТипыСвойств <> Неопределено Тогда
		
		Проверить(ТипЗнч(ОжидаемыеТипыСвойств) = Тип("Структура"), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПроцедурыИлиФункции"),
			Контекст);
		
		Для каждого Свойство Из ОжидаемыеТипыСвойств Цикл
			
			ОжидаемоеИмяСвойства = Свойство.Ключ;
			ОжидаемыйТипСвойства = Свойство.Значение;
			ЗначениеСвойства = Неопределено;
			
			Проверить(ЗначениеПараметра.Свойство(ОжидаемоеИмяСвойства, ЗначениеСвойства), 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение параметра %1 (Структура) в %2. 
					           |В структуре ожидалось свойство %3 (тип %4).'"), 
					ИмяПараметра, ИмяПроцедурыИлиФункции, ОжидаемоеИмяСвойства, ОжидаемыйТипСвойства));
			
			ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеСвойства, ОжидаемыйТипСвойства);
			Проверить(ЭтоКорректныйТип, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение свойства %1 в параметре %2 (Структура) в %3. 
					           |Ожидалось: %4; передано значение: %5 (тип %6).'"), 
					ОжидаемоеИмяСвойства, ИмяПараметра,	ИмяПроцедурыИлиФункции,
					ПредставлениеТипов(ОжидаемыеТипы), 
					?(ЗначениеСвойства <> Неопределено, ЗначениеСвойства, НСтр("ru = 'Неопределено'")),
				ТипЗнч(ЗначениеСвойства)));
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеОжидаемогоТипа(Значение, ОжидаемыеТипы)
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗнч(ОжидаемыеТипы) = Тип("ОписаниеТипов") Тогда
		Возврат ОжидаемыеТипы.Типы().Найти(ТипЗначения) <> Неопределено;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Тип") Тогда
		Возврат ТипЗначения = ОжидаемыеТипы;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Массив") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив") Тогда
		Возврат ОжидаемыеТипы.Найти(ТипЗначения) <> Неопределено;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		Возврат ОжидаемыеТипы.Получить(ТипЗначения) <> Неопределено;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеТипов(ОжидаемыеТипы)
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = "";
		Индекс = 0;
		Для Каждого Элемент Из ОжидаемыеТипы Цикл
			
			Если ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
				Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда 
				
				Тип = Элемент.Ключ;
			Иначе 
				Тип = Элемент;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ", ";
			КонецЕсли;
			
			Результат = Результат + ПредставлениеТипа(Тип);
			Индекс = Индекс + 1;
			Если Индекс > 10 Тогда
				Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1,... (всего %2 типов)'"), 
					Результат, 
					ОжидаемыеТипы.Количество());
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе 
		Возврат ПредставлениеТипа(ОжидаемыеТипы);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеТипа(Тип)
	
	Если Тип = Неопределено Тогда
		
		Возврат "Неопределено";
		
	ИначеЕсли ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1,... (всего %2 типов)'"),
					Лев(ТипСтрокой, 150),
					Тип.Типы().Количество()), 
				ТипСтрокой);
		
	Иначе
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				Лев(ТипСтрокой, 150) + "...", 
				ТипСтрокой);
		
	КонецЕсли;
	
КонецФункции

Функция ДвоичныеДанныеИзДанных(Данные, ИмяФункции)
	
	ОжидаемыеТипы = Новый Массив;
	ОжидаемыеТипы.Добавить(Тип("ДвоичныеДанные"));
	ОжидаемыеТипы.Добавить(Тип("Строка"));
	ПроверитьПараметр(
		ИмяФункции,
		"Данные", Данные, ОжидаемыеТипы);
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		Если ЭтоАдресВременногоХранилища(Данные) Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(Данные);
		Иначе
			Проверить(Ложь,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимый адрес временного хранилища в параметре Данные:
					           |%1'") + Символы.ПС, Данные),
				ИмяФункции);
		КонецЕсли;
		Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
			Проверить(Ложь,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимый тип значения ""%1""
					           |по адресу временного хранилища, указанному в параметре Данные'") + Символы.ПС,
					Строка(ТипЗнч(ДвоичныеДанные))),
				ИмяФункции);
		КонецЕсли;
	Иначе
		ДвоичныеДанные = Данные;
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
	
КонецФункции

//Чтение даты

Функция ПрочитатьДатуПодписанияИзБуфера(Буфер, Смещение)
	
	ТипДаты = ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер.Прочитать(Смещение, 2));
	Если ТипДаты = "170D" Тогда // UTCTime
		БуферДаты = Буфер.Прочитать(Смещение + 2, 12);
		ПредставлениеДаты = "20" + ПолучитьСтрокуИзБуфераДвоичныхДанных(БуферДаты);
	Иначе // GeneralizedTime
		БуферДаты = Буфер.Прочитать(Смещение + 2, 14);
		ПредставлениеДаты = ПолучитьСтрокуИзБуфераДвоичныхДанных(БуферДаты);
	КонецЕсли;

	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	ДатаПодписания = ОписаниеТипа.ПривестиЗначение(ПредставлениеДаты);
	Возврат ДатаПодписания;

	
КонецФункции

Функция ПобитовыйСдвигВправо82(Оп, Смещение)

	Возврат Цел(Оп/Pow(2, Смещение));
	
КонецФункции

Процедура ПропуститьНачалоБлокаИлиБлок(АнализДанных, НачалоБлока,
			ТребуемыйКлассДанных, ТребуемыйТипДанных, ОбязательныйБлок)
	
	Если АнализДанных.Родители.Количество() > 0
	   И АнализДанных.Смещение >= АнализДанных.Родители[0].СмещениеСледующего Тогда
	
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	СмещениеБлока = АнализДанных.Смещение;
	Байт = ПрочитатьБайт(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	КлассДанных = ПобитовыйСдвигВправо82(Байт, 6);
	ТипДанных = Байт - КлассДанных * 64;
	ЕстьВложения = Ложь;
	
	Если ТипДанных > 31 Тогда
		ЕстьВложения = Истина;
		ТипДанных = ТипДанных - 32;
	КонецЕсли;
	
	Если ТипДанных > 30 Тогда
		ТипДанных = ПрочитатьПотоковоеЦелое(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуемыйКлассДанных <> Неопределено
	   И ТребуемыйКлассДанных <> КлассДанных
	 Или ТребуемыйТипДанных <> Неопределено
	   И ТребуемыйТипДанных <> ТипДанных Тогда
	
		Если ОбязательныйБлок Тогда
			ПриОшибкеСтруктурыДанных(АнализДанных);
		Иначе
			АнализДанных.Смещение = СмещениеБлока;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РазмерДанных = ПрочитатьРазмерДанных(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если НачалоБлока Или ЕстьВложения И РазмерДанных = 0 Тогда
		Если РазмерДанных = 0 Тогда
			Если АнализДанных.Родители.Количество() = 0 Тогда
				Если Не КонецБлокаНеопределеннойДлины(АнализДанных, Истина) Тогда
					ПриОшибкеКодированияASN1(АнализДанных);
					Возврат;
				КонецЕсли;
				СмещениеСледующего = АнализДанных.Буфер.Размер - 2;
				РазмерДанных = СмещениеСледующего - АнализДанных.Смещение;
			Иначе
				// Для блока неопределенной длины СмещениеСледующего - это только граница.
				СмещениеСледующего = АнализДанных.Родители[0].СмещениеСледующего;
			КонецЕсли;
		Иначе
			СмещениеСледующего = АнализДанных.Смещение + РазмерДанных;
			Если АнализДанных.Родители.Количество() = 0
			   И СмещениеСледующего <> АнализДанных.Буфер.Размер Тогда
				
				ПриОшибкеКодированияASN1(АнализДанных);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ТекущийБлок = Новый Структура("ЕстьВложения, СмещениеСледующего, РазмерДанных",
			ЕстьВложения, СмещениеСледующего, РазмерДанных);
		АнализДанных.Родители.Вставить(0, ТекущийБлок);
		Если Не НачалоБлока Тогда
			ПропуститьРодительскийБлок(АнализДанных);
		КонецЕсли;
	Иначе
		Если РазмерДанных = 0 Тогда
			ПрочитатьКонецБлокаБезВложенийНеопределеннойДлины(АнализДанных);
		Иначе
			ПрочитатьБайт(АнализДанных, РазмерДанных);
		КонецЕсли;
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОшибкеСтруктурыДанных(АнализДанных) Экспорт
	
	АнализДанных.ЭтоОшибкаСтруктурыДанных = Истина;
	АнализДанных.ЕстьОшибка = Истина;
	
КонецПроцедуры

Процедура ПропуститьБлок(АнализДанных, КлассДанных = Неопределено, ТипДанных = Неопределено, ОбязательныйБлок = Истина) Экспорт
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() = 0
	 Или Не АнализДанных.Родители[0].ЕстьВложения Тогда
		
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	ПропуститьНачалоБлокаИлиБлок(АнализДанных, Ложь, КлассДанных, ТипДанных, ОбязательныйБлок)
	
КонецПроцедуры

Процедура ПриОшибкеКодированияASN1(АнализДанных)
	
	АнализДанных.ЭтоОшибкаКодированияASN1 = Истина;
	АнализДанных.ЕстьОшибка = Истина;
	
КонецПроцедуры

Процедура ПроверитьДанныеБлока(АнализДанных, СтрокаДанных)
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() = 0 Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	РазмерДанных = АнализДанных.Родители[0].РазмерДанных;
	Если РазмерДанных = 0 Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	Буфер = АнализДанных.Буфер.Прочитать(АнализДанных.Смещение, РазмерДанных); // БуферДвоичныхДанных
	
	Если Буфер.Размер <> РазмерДанных Тогда
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат;
	КонецЕсли;
	АнализДанных.Смещение = АнализДанных.Смещение + РазмерДанных;
	
	СтрокаБуфера = ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер);
	Если СтрокаДанных <> СтрокаБуфера Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция КонецБлокаНеопределеннойДлины(АнализДанных, ОбщийБлок = Ложь)
	
	Буфер = АнализДанных.Буфер;
	
	Если ОбщийБлок Тогда
		Смещение = Буфер.Размер - 2;
		Если Смещение < 2 Тогда
			ПриОшибкеКодированияASN1(АнализДанных);
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Смещение = АнализДанных.Смещение;
		Если Смещение + 2 > АнализДанных.Родители[0].СмещениеСледующего Тогда
			ПриОшибкеКодированияASN1(АнализДанных);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Буфер[Смещение] = 0 И Буфер[Смещение + 1] = 0;
	
КонецФункции

Процедура ПрочитатьКонецБлокаБезВложенийНеопределеннойДлины(АнализДанных)
	
	ПредыдущийБайт = -1;
	Байт = -1;
	
	Пока Истина Цикл
		ПредыдущийБайт = Байт;
		Байт = ПрочитатьБайт(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
		Если Байт = 0 И ПредыдущийБайт = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПрочитатьПотоковоеЦелое(АнализДанных) Экспорт
	
	Целое = 0;
	Для Счетчик = 1 По 9 Цикл
		Байт = ПрочитатьБайт(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Байт < 128 Тогда
			Целое = Целое * 128 + Байт;
			Прервать;
		Иначе
			Целое = Целое * 128 + (Байт - 128);
		КонецЕсли;
	КонецЦикла;
	
	Если Счетчик > 8 Тогда
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Целое;
	
КонецФункции

Функция ПрочитатьРазмерДанных(АнализДанных)
	
	Байт = ПрочитатьБайт(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Байт < 128 Тогда
		Возврат Байт;
	КонецЕсли;
	
	КоличествоБайт = Байт - 128;
	Если КоличествоБайт = 0 Или КоличествоБайт > 8 Тогда
		Если Байт = 128 Тогда
			Возврат 0; // Блок неопределенной длины.
		КонецЕсли;
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	
	Целое = 0;
	Для Счетчик = 1 По КоличествоБайт Цикл
		Байт = ПрочитатьБайт(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат Неопределено;
		КонецЕсли;
		Целое = Целое * 256 + Байт;
	КонецЦикла;
	
	Возврат Целое;
	
КонецФункции

Функция ПрочитатьБайт(АнализДанных, КоличествоРаз = 1)
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если АнализДанных.Смещение + КоличествоРаз <= АнализДанных.Буфер.Размер Тогда
		Байт = АнализДанных.Буфер.Получить(АнализДанных.Смещение + КоличествоРаз - 1);
		АнализДанных.Смещение = АнализДанных.Смещение + КоличествоРаз;
	Иначе
		Байт = Неопределено;
		ПриОшибкеКодированияASN1(АнализДанных);
	КонецЕсли;
	
	Возврат Байт;
	
КонецФункции

Процедура ПропуститьНачалоБлока(АнализДанных, КлассДанных = Неопределено, ТипДанных = Неопределено) Экспорт
	
	ПропуститьНачалоБлокаИлиБлок(АнализДанных, Истина, КлассДанных, ТипДанных, Истина)
	
КонецПроцедуры

Процедура ПропуститьРодительскийБлок(АнализДанных) Экспорт
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() < 2
	 Или Не АнализДанных.Родители[1].ЕстьВложения Тогда
		
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители[0].РазмерДанных > 0 Тогда
		ОсталосьБайт = АнализДанных.Родители[0].СмещениеСледующего - АнализДанных.Смещение;
		
		Если ОсталосьБайт > 0 Тогда
			ПрочитатьБайт(АнализДанных, ОсталосьБайт);
			Если АнализДанных.ЕстьОшибка Тогда
				Возврат;
			КонецЕсли;
		ИначеЕсли ОсталосьБайт < 0 Тогда
			ПриОшибкеКодированияASN1(АнализДанных);
			Возврат;
		КонецЕсли;
	Иначе
		Пока Истина Цикл
			Если КонецБлокаНеопределеннойДлины(АнализДанных) Тогда
				Если АнализДанных.ЕстьОшибка Тогда
					Возврат;
				КонецЕсли;
				АнализДанных.Смещение = АнализДанных.Смещение + 2;
				Прервать;
			КонецЕсли;
			ПропуститьБлок(АнализДанных);
		КонецЦикла;
	КонецЕсли;
	
	АнализДанных.Родители.Удалить(0);
	
КонецПроцедуры

Функция ДатаПодписанияУниверсальная(Данные) Экспорт
	
	ДвоичныеДанные = ДвоичныеДанныеИзДанных(Данные,
		"ЭлектроннаяПодписьСлужебныйКлиентСервер.АлгоритмПодписи");
	
	АнализДанных = НовыйАнализДанных(ДвоичныеДанные);
		
	// SEQUENCE (PKCS #7 ContentInfo).
	ПропуститьНачалоБлока(АнализДанных, 0, 16);
		// OBJECT IDENTIFIER (contentType).
		ПропуститьНачалоБлока(АнализДанных, 0, 6);
			// 1.2.840.113549.1.7.2 signedData (PKCS #7).
			ПроверитьДанныеБлока(АнализДанных, "2A864886F70D010702");
			ПропуститьРодительскийБлок(АнализДанных);
		// [0]CS             (content [0] EXPLICIT ANY DEFINED BY contentType OPTIONAL).
		ПропуститьНачалоБлока(АнализДанных, 2, 0);
			// SEQUENCE (content SignedData).
			ПропуститьНачалоБлока(АнализДанных, 0, 16);
				// INTEGER  (version          Version).
				ПропуститьБлок(АнализДанных, 0, 2);
				// SET      (digestAlgorithms DigestAlgorithmIdentifiers).
				ПропуститьБлок(АнализДанных, 0, 17);
				// SEQUENCE (contentInfo      ContentInfo).
				ПропуститьБлок(АнализДанных, 0, 16);
				// [0]CS    (certificates     [0] IMPLICIT ExtendedCertificatesAndCertificates OPTIONAL).
				ПропуститьБлок(АнализДанных, 2, 0, Ложь);
				// [1]CS    (crls             [1] IMPLICIT CertificateRevocationLists OPTIONAL).
				ПропуститьБлок(АнализДанных, 2, 1, Ложь);
				// SET      (signerInfos      SET OF SignerInfo).
				ПропуститьНачалоБлока(АнализДанных, 0, 17);
					// SEQUENCE (signerInfo SignerInfo).
					ПропуститьНачалоБлока(АнализДанных, 0, 16);
						// INTEGER  (version                   Version).
						ПропуститьБлок(АнализДанных, 0, 2);
						// SEQUENCE (issuerAndSerialNumber     IssuerAndSerialNumber).
						ПропуститьБлок(АнализДанных, 0, 16);
						// SEQUENCE (digestAlgorithm           DigestAlgorithmIdentifier).
						ПропуститьБлок(АнализДанных, 0, 16);
						// [0]CS    (authenticatedAttributes   [0] IMPLICIT Attributes OPTIONAL).
						ПропуститьНачалоБлока(АнализДанных, 2, 0);

	Если АнализДанных.ЕстьОшибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СмещениеСледующего = АнализДанных.Родители[0].СмещениеСледующего;
	Пока АнализДанных.Смещение < СмещениеСледующего Цикл
		
		// SEQUENCE (Attributes).
		ПропуститьНачалоБлока(АнализДанных, 0, 16);
		
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат Неопределено;
		КонецЕсли; 
		
		// OBJECT IDENTIFIER
		ПропуститьНачалоБлока(АнализДанных, 0, 6);
		
		РазмерДанных = АнализДанных.Родители[0].РазмерДанных;
		Если РазмерДанных = 0 Тогда
			ПриОшибкеСтруктурыДанных(АнализДанных);
			Возврат Неопределено;
		КонецЕсли;
			
		Если РазмерДанных = 9 Тогда
			Буфер = АнализДанных.Буфер.Прочитать(АнализДанных.Смещение, РазмерДанных); // БуферДвоичныхДанных
			СтрокаБуфера = ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер);
			Если СтрокаБуфера = "2A864886F70D010905" Тогда // 1.2.840.113549.1.9.5 signingTime
				
				ДатаПодписания = ПрочитатьДатуПодписанияИзБуфера(АнализДанных.Буфер, АнализДанных.Смещение + 11);
				
				Если ЗначениеЗаполнено(ДатаПодписания) Тогда
					Возврат ДатаПодписания;
				Иначе
					Возврат Неопределено;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; 	

		ПропуститьРодительскийБлок(АнализДанных); // OBJECT IDENTIFIER
		ПропуститьРодительскийБлок(АнализДанных); // SEQUENCE
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции  

Функция ДатаПодписания(Подпись, ПривестиКЧасовомуПоясуСеанса = Истина) Экспорт
	
	ДатаПодписания = ДатаПодписанияУниверсальная(Подпись);
	
	Если ДатаПодписания = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПривестиКЧасовомуПоясуСеанса Тогда
		ДатаПодписания = МестноеВремя(ДатаПодписания, ЧасовойПоясСеанса());
	КонецЕсли;
	
	Возврат ДатаПодписания;
	
КонецФункции
           
Функция НовыйАнализДанных(ДвоичныеДанные) Экспорт
		
	АнализДанных = Новый Структура;
	АнализДанных.Вставить("ЕстьОшибка", Ложь);
	АнализДанных.Вставить("ЭтоОшибкаКодированияASN1", Ложь); // Возможно данные повреждены.
	АнализДанных.Вставить("ЭтоОшибкаСтруктурыДанных", Ложь); // Не найден ожидаемый элемент данных.
	АнализДанных.Вставить("Смещение", 0);
	АнализДанных.Вставить("Родители", Новый Массив);
	АнализДанных.Вставить("Буфер", ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные));
	
	Возврат АнализДанных;
	
КонецФункции
//конец чтение даты 

Функция ОписаниеHTTPСоединения(URL, Таймаут) Экспорт
	
	СтруктураURI = ПолучениеФайловИзИнтернетаКлиентСервер.СтруктураURI(URL);
	
	НастройкиСоединения = Новый Структура;
	НастройкиСоединения.Вставить("Адрес", URL);
	HTTPСоединение = ЭлектронныеДокументыСлужебный.ПолучитьСоединение(НастройкиСоединения);
	
	ОписаниеСоединения = Новый Структура;
	ОписаниеСоединения.Вставить("HTTPСоединение", HTTPСоединение);
	ОписаниеСоединения.Вставить("СтруктураURI", СтруктураURI);
	
	Возврат ОписаниеСоединения;
	
КонецФункции   

// Возвращает параметры вызова HTTPМетода.
// Для использования в ИнтернетСоединениеБЭД.ВызватьHTTPМетод.
// 
// Возвращаемое значение:
//  Структура:
// * МаскируемыеПараметрыПриЛогировании - Массив из Строка - содержит имена параметров, которые будут замаскированы при
// записи ошибки в журнал регистрации с целью скрытия секретных данных, напр. /API/SendRequest?login=1c&password=***.
Функция НовыеПараметрыВызоваHTTPМетода() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("МаскируемыеПараметрыПриЛогировании", Новый Массив);
	
	Возврат Параметры;
	
КонецФункции

// Отправляет данные на указанный адрес для обработки с использованием указанного HTTP-метода.
// 
// Параметры:
// 	ОписаниеСоединения - см. ОписаниеHTTPСоединения
// 	HTTPЗапрос - HTTPЗапрос
// 	Метод - Строка - см. HTTPМетоды
// 	ВидОперации - Строка - используется для уточнения ошибки при выполнении метода.
// 	КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 	ПараметрыВызова - см. НовыеПараметрыВызоваHTTPМетода
// Возвращаемое значение:
// 	Структура - Описание:
// * Успех - Булево - если Истина - вызов метода выполнен успешно.
// * Ответ -  HTTPОтвет, Неопределено - объект, полученный в результате вызова метода.
//            Принимает значение Неопределено, если Успех - Ложь.
Функция ВызватьHTTPМетод(ОписаниеСоединения, HTTPЗапрос, Метод, ВидОперации, КонтекстДиагностики = Неопределено,
	ПараметрыВызова = Неопределено) Экспорт
	
	Если ПараметрыВызова = Неопределено Тогда
		ПараметрыВызова = НовыеПараметрыВызоваHTTPМетода();
	КонецЕсли;
	
	РезультатВызова = Новый Структура;
	РезультатВызова.Вставить("Успех", Ложь);
	РезультатВызова.Вставить("Ответ", Неопределено);
	
	Попытка
		Ответ = ОписаниеСоединения.HTTPСоединение.ВызватьHTTPМетод(Метод, HTTPЗапрос);
		РезультатВызова.Ответ = Ответ;
		РезультатВызова.Успех = Истина;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ВидОшибки = НСтр("ru = 'Ошибка интернет-соединения'");
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(ВидОперации, КраткоеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат РезультатВызова;
	
КонецФункции

Функция НовоеОписаниеФайла() Экспорт
	
	ОписаниеФайла = Новый Структура;
	
	ОписаниеФайла.Вставить("ИмяФайла", "");
	ОписаниеФайла.Вставить("ДвоичныеДанные", Неопределено);
	
	Возврат ОписаниеФайла;
		
КонецФункции  

Функция JSONСтрока(Значение, ПараметрыЗаписи = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Возвращает хеш-сумму подписи.
// 
// Параметры:
//  Подпись - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Строка - хеш-сумма
Функция ХешПодписи(Подпись) Экспорт
	Возврат КонтрольнаяСуммаСтрокой(Подпись, ХешФункция.MD5);	
КонецФункции

// Вычисляет контрольную сумму для произвольных данных по указанному алгоритму.
//
// Параметры:
//  Данные   - Произвольный - любое сериализуемое значение.
//  Алгоритм - ХешФункция   - алгоритм расчета контрольной суммы. По умолчанию, MD5.
// 
// Возвращаемое значение:
//  Строка - контрольная сумма строкой без пробелов (например 32 символа).
//
Функция КонтрольнаяСуммаСтрокой(Знач Данные, Знач Алгоритм = Неопределено) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Алгоритм = ХешФункция.MD5;
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(Алгоритм);
	Если ТипЗнч(Данные) <> Тип("Строка") И ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		Данные = ЗначениеВСтрокуXML(Данные);
	КонецЕсли;
	ХешированиеДанных.Добавить(Данные);
	
	Если ТипЗнч(ХешированиеДанных.ХешСумма) = Тип("ДвоичныеДанные") Тогда 
		Результат = СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	ИначеЕсли ТипЗнч(ХешированиеДанных.ХешСумма) = Тип("Число") Тогда
		Результат = Формат(ХешированиеДанных.ХешСумма, "ЧГ=");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Возвращает ИНН субъекта сертификата без лидирующих нолей.
//
// Параметры:
//  Сертификат - СертификатКриптографии
//
// Возвращаемое значение:
//  Строка - ИНН субъекта сертификата без лидирующих нолей.
//
Функция ИННСубъектаСертификата(СертификатКриптографии) Экспорт
	
	СвойстваСубъекта = СвойстваСубъектаСертификата(СертификатКриптографии);
	Возврат СвойстваСубъекта.ИНН;
	
КонецФункции
	
Функция ПредставлениеВладельцаСертификата(Сертификат, ВладелецПодписи) Экспорт
	
	Субъект = СвойстваСубъектаСертификата(Сертификат);
	ВладелецСертификата = "";
	Если ЗначениеЗаполнено(Субъект.Фамилия) И ЗначениеЗаполнено(Субъект.Имя) Тогда
		ВладелецСертификата = Субъект.Фамилия + " " + Субъект.Имя;
	ИначеЕсли ЗначениеЗаполнено(Субъект.Фамилия) Тогда
		ВладелецСертификата = Субъект.Фамилия;
	ИначеЕсли ЗначениеЗаполнено(Субъект.Имя) Тогда
		ВладелецСертификата = Субъект.Имя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Субъект.Отчество) Тогда
		ВладелецСертификата = ВладелецСертификата + " " + Субъект.Отчество;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецСертификата) И ЗначениеЗаполнено(Субъект.Должность)Тогда
		ВладелецСертификата = ВладелецСертификата + ", " + Субъект.Должность;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВладелецСертификата) Тогда
		ВладелецСертификата = ВладелецПодписи;
	КонецЕсли;
	
	Возврат ВладелецСертификата;
	
КонецФункции	

// Получает свойства субъекта сертификатов электронной подписи.
//
// Параметры:
//  Сертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//   * Значение - См. ЭлектроннаяПодпись.СвойстваСубъектаСертификата
//
Функция СвойстваСубъектаСертификатовПоСсылке(Сертификаты) Экспорт
	
	Результат = Новый Соответствие;
	Для Каждого КлючИЗначение Из СвойстваСертификатов(Сертификаты) Цикл
		СертификатКриптографии = Новый СертификатКриптографии(КлючИЗначение.Значение.ДанныеСертификата);
		СвойстваСубъекта = СвойстваСубъектаСертификата(СертификатКриптографии);
		Результат.Вставить(КлючИЗначение.Ключ, СвойстваСубъекта);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает свойства издателя сертификата электронной подписи.
//
// Параметры:
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//
// Возвращаемое значение:
//  См. ЭлектроннаяПодпись.СвойстваИздателяСертификата
//
Функция СвойстваИздателяСертификатаПоСсылке(Сертификат) Экспорт
	
	Сертификаты = МашиночитаемыеДоверенностиКлиентСервер.ЗначениеВМассиве(Сертификат);
	ДанныеСертификата = СвойстваСертификатов(Сертификаты)[Сертификат].ДанныеСертификата;
	СертификатКриптографии = Новый СертификатКриптографии(ДанныеСертификата);
	
	Возврат СвойстваИздателяСертификата(СертификатКриптографии);
	
КонецФункции

// Получает свойства издателя сертификатов электронной подписи.
//
// Параметры:
//  Сертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//   * Значение - См. ЭлектроннаяПодпись.СвойстваИздателяСертификата
//
Функция СвойстваИздателяСертификатовПоСсылке(Сертификаты) Экспорт
	
	Результат = Новый Соответствие;
	Для Каждого КлючИЗначение Из СвойстваСертификатов(Сертификаты) Цикл
		СертификатКриптографии = Новый СертификатКриптографии(КлючИЗначение.Значение.ДанныеСертификата);
		СвойстваСубъекта = СвойстваИздателяСертификата(СертификатКриптографии);
		Результат.Вставить(КлючИЗначение.Ключ, СвойстваСубъекта);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементыСтиля() Экспорт
	
	НаборЭлементовСтиля = Новый Структура;
	Для каждого ЭлементСтиля Из Метаданные.ЭлементыСтиля Цикл
		НаборЭлементовСтиля.Вставить(ЭлементСтиля.Имя, ЭлементСтиля.Значение);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(НаборЭлементовСтиля);
	
КонецФункции

// Форматирует строку в соответствии с заданным шаблоном.
// Возможные значения тегов в шаблоне:
// - <span style="Имя свойства: Имя элемента стиля">Строка</span> - оформляет текст описанными
//      в атрибуте style элементами стиля.
// - <b> Строка </b> - выделяет строку элементом стиля ВажнаяНадписьШрифт,
//      который соответствует полужирному шрифту.
// - <a href="Ссылка">Строка</a> - добавляет гиперссылку.
// - <img src="Календарь"> - добавляет картинку из библиотеки картинок.
// Атрибут style применяется для оформления текста. Атрибут может быть использован для тегов span и a.
// Вначале следует имя стилевого свойства, затем через двоеточие имя элемента стиля.
// Стилевые свойства:
//  - color - Определяет цвет текста. Например, color: ГиперссылкаЦвет;
//  - background-color - Определяет цвет фона у текста. Например, background-color: ИтогиФонГруппы;
//  - font - Определяет шрифт текста.Например, font: ОсновнойЭлементСписка.
// Стилевые свойства разделяются точкой с запятой. Например, style="color: ГиперссылкаЦвет; font: ОсновнойЭлементСписка"
// Вложенные теги не поддерживаются.
//
// Параметры:
//  ШаблонСтроки - Строка - строка, содержащая теги форматирования.
//  Параметр<n>  - Строка - значение подставляемого параметра.
//
// Возвращаемое значение:
//  ФорматированнаяСтрока - преобразованная строка.
//
// Пример:
//  1. СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru='
//       <span style=""color: ЗаблокированныйРеквизитЦвет; font: ВажнаяНадписьШрифт"">Минимальная</span> версия программы <b>1.1</b>. 
//       <a href = ""Обновление"">Обновите</a> программу.'"));
//  2. СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru='Режим: <img src=""РедактироватьВДиалоге"">
//       <a style=""color: ИзмененноеЗначениеРеквизитаЦвет; background-color: ИзмененноеЗначениеРеквизитаФон""
//       href=""e1cib/command/Обработка.Редактор"">Редактирование</a>'"));
//  3. СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru='Текущая дата <img src=""Календарь"">
//       <span style=""font:ВажнаяНадписьШрифт"">%1</span>'"), ТекущаяДатаСеанса());
//
Функция ФорматированнаяСтрока(Знач ШаблонСтроки, Знач Параметр1 = Неопределено, Знач Параметр2 = Неопределено,
	Знач Параметр3 = Неопределено, Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено) Экспорт
	
	ЭлементыСтиля = ЭлементыСтиля();
	Возврат МашиночитаемыеДоверенностиКлиентСервер.СформироватьФорматированнуюСтроку(ШаблонСтроки, ЭлементыСтиля, Параметр1, Параметр2, Параметр3, Параметр4, Параметр5);
	
КонецФункции

Функция ЗапросКоличестваПодписанныхЭлектронныхДокументовПоМЧД(Доверенность)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект) КАК Количество
	|ИЗ
	|	РегистрСведений.ЭлектронныеПодписиПоМЧД КАК ЭлектронныеПодписиПоМЧД
	|ГДЕ
	|	ЭлектронныеПодписиПоМЧД.Доверенность = &Доверенность";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Доверенность", Доверенность);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
			
КонецФункции

// Возвращает количество подписанных электронных документов доверенностью.
//
// Параметры:
//  Доверенность - СправочникСсылка - ссылка на элемент справочника машиночитаемых доверенностей.
//
// Возвращаемое значение:
//  Число - число текущих документов, соответствующих переданным параметрам. 
//
Функция КоличествоПодписанныхЭлектронныхДокументовПоМЧД(Знач Доверенность) Экспорт
	
	Запрос = ЗапросКоличестваПодписанныхЭлектронныхДокументовПоМЧД(Доверенность);
	
	Количество = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	КонецЕсли;
	
	Возврат Количество;

КонецФункции

// Возвращает пустое описание данных доверенности.
// 
// Возвращаемое значение:
//  Структура:
// * НомерДоверенности - Строка
// * ДоверительИНН - Строка
// * СсылкаНаРеестр - Строка
// * Доверенность - см. РаботаСФайламиБЭД.НовоеОписаниеФайла
// * Подпись - см. РаботаСФайламиБЭД.НовоеОписаниеФайла
// * ДатаВыдачи - Дата
// * ДатаОкончания - Дата
// * ЭтоФайловаяДоверенность - Булево
Функция НовоеОписаниеДанныхДоверенностиДляКонтейнера() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НомерДоверенности", "");
	Результат.Вставить("ДоверительИНН", "");
	Результат.Вставить("СсылкаНаРеестр", "");
	Результат.Вставить("Доверенность", НовоеОписаниеФайла());
	Результат.Вставить("Подпись", НовоеОписаниеФайла());
	Результат.Вставить("ДатаВыдачи", Дата(1, 1, 1));
	Результат.Вставить("ДатаОкончания", Дата(1, 1, 1));
	Результат.Вставить("ЭтоФайловаяДоверенность", Ложь);
	
	Возврат Результат;
	
КонецФункции    

// Записывает в константу адрес сервера.
// 
// Параметры:
//  СтруктураАдреса - см. МашиночитаемыеДоверенности.СтруктураАдресаСервераМЧД
//  
Процедура ЗаписатьАдресРеестраМЧД(СтруктураАдреса) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураАдреса);
	АдресСервераСтрокой = ЗаписьJSON.Закрыть();
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.АдресРеестраМЧД.Установить(АдресСервераСтрокой);
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Читает из константы адрес сервера МЧД
// 
// Возвращаемое значение:
//  см. МашиночитаемыеДоверенности.СтруктураАдресаСервераМЧД
//  
Функция ПрочитатьАдресРеестраМЧД() Экспорт

	СтруктураАдреса = МашиночитаемыеДоверенности.СтруктураАдресаСервераМЧД();
	АдресСервера = Константы.АдресРеестраМЧД.Получить();
	
	Если ПустаяСтрока(АдресСервера) Тогда
		ЗаписатьАдресРеестраМЧД(СтруктураАдреса);
	Иначе
		
		Попытка
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(АдресСервера);
			РезультатЧтения = ПрочитатьJSON(ЧтениеJSON);
			 			 
			Для Каждого ЭлементСтруктуры Из СтруктураАдреса Цикл
				ИмяПоля = ЭлементСтруктуры.Ключ;
				Если РезультатЧтения.Свойство(ИмяПоля) Тогда
					СтруктураАдреса[ИмяПоля] = РезультатЧтения[ИмяПоля];
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Чтение настроек сервера МЧД'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;

	Возврат СтруктураАдреса;
	
КонецФункции

// Исправляет значение полей архива для возможности чтения на Linux
//
// Параметры:
//  ДанныеАрхива - ДвоичныеДанные - данные zip архива.
//  
// Возвращаемое значение:
// - ДвоичныеДанные - исправленный архив
// - Строка - описание ошибки, если таковая происходит при чтении архива
//
Функция ИсправитьСигнатуруАрхиваДляЧтенияВLinux(ДанныеАрхива) Экспорт
	
	// Значение поля "ВнутренниеАтрибуты" для архива (число 16 бит без знака)
	ЗначениеВнутреннихАтрибутов = 0;
	// Значение поля "ВнешниеАтрибуты" для архива (число 32 бита)
	ЗначениеВнешнихАтрибутов = 2176843776;
	
	Если ТипЗнч(ДанныеАрхива) <> Тип("ДвоичныеДанные") Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для двоичных данных архива.'"),
			Строка(ТипЗнч(ДанныеАрхива)));
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Попытка
		Поток = ДанныеАрхива.ОткрытьПотокДляЧтения();
		ПотокРезультата = Новый ПотокВПамяти;
		
		ПозицияНачалаБлока = 0;
		
		ТекущаяСигнатура = ПрочитатьНатуральноеЧислоИзПотока(Поток, 4);
		ЗаписатьНатуральноеЧислоВПоток(ПотокРезультата, ТекущаяСигнатура, 4);
		
		Если ТекущаяСигнатура <> 67324752 Тогда
			ВызватьИсключение НСтр("ru = 'Неверная сигнатура архива:'") + Строка(ТекущаяСигнатура);
		КонецЕсли;
	
	
		МассивФайлов = Новый Массив;
	
		Пока Истина Цикл
			// Заголовок файла архива:
			// (1) Минимальная версия: 2 байта
			// (2) Регистр флагов: 2 байта
			// (3) Метод сжатия: 2 байта
			// (4) Время модификации файла: 2 байта
			// (5) Дата модификации файла: 2 байта
			// (6) Контрольная сумма: 4 байта
			// (7) Сжатый размер: 4 байта
			// (8) Несжатый размер: 4 байта
			// (9) Длина имени файла: 2 байта
			// (10) Длина поля дополнительных данных: 2 байта
		
			БуферЗаголовка = ПрочитатьБуферИзПотока(Поток, 26);
		
			Попытка
				// Минимальная версия
				МинимальнаяВерсия = БуферЗаголовка.ПрочитатьЦелое16(0, ПорядокБайтов.LittleEndian);
				// Регистр флагов
				РегистрФлагов = БуферЗаголовка.ПрочитатьЦелое16(2, ПорядокБайтов.LittleEndian);
				// Метод сжатия
				МетодСжатия = БуферЗаголовка.ПрочитатьЦелое16(4, ПорядокБайтов.LittleEndian);
				// Время модификации файла
				ВремяМодификацииФайла = БуферЗаголовка.ПрочитатьЦелое16(6, ПорядокБайтов.LittleEndian);
				// Дата модификации файла
				ДатаМодификацииФайла = БуферЗаголовка.ПрочитатьЦелое16(8, ПорядокБайтов.LittleEndian);
				// Контрольная сумма файла
				КонтрольнаяСумма = БуферЗаголовка.ПрочитатьЦелое32(10, ПорядокБайтов.LittleEndian);
				// Сжатый размер
				СжатыйРазмер = БуферЗаголовка.ПрочитатьЦелое32(14, ПорядокБайтов.LittleEndian);
				// Несжатый размер
				НесжатыйРазмер = БуферЗаголовка.ПрочитатьЦелое32(18, ПорядокБайтов.LittleEndian);
				// Длина имени файла
				ДлинаИмениФайла = БуферЗаголовка.ПрочитатьЦелое16(22, ПорядокБайтов.LittleEndian);
				// Длина дополнительных данных
				ДлинаДополнительныхДанных = БуферЗаголовка.ПрочитатьЦелое16(24, ПорядокБайтов.LittleEndian);
			Исключение
				ВызватьИсключение НСтр("ru = 'Ошибка при получении значений из структуры заголовка файла:'")
					+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		
			Если МетодСжатия = 0 Тогда
				ЕстьСжатие = Ложь;
			ИначеЕсли МетодСжатия = 8 Тогда
				ЕстьСжатие = Истина;
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверное значение: %1 для метода сжатия.'"), Строка(МетодСжатия));
			КонецЕсли;
		
			Если ДлинаИмениФайла < 1 Тогда
				ВызватьИсключение НСтр("ru = 'Нулевая длина имени файла недопустима.'");
			КонецЕсли;
		
			БуферИмени = ПрочитатьБуферИзПотока(Поток, ДлинаИмениФайла);
			
			Если ДлинаДополнительныхДанных > 0 Тогда
				БуферДополнительныхДанных = ПрочитатьБуферИзПотока(Поток, ДлинаДополнительныхДанных);
			Иначе
				БуферДополнительныхДанных = Неопределено;
			КонецЕсли;
			
			ЗаписатьБуферВПоток(ПотокРезультата, БуферЗаголовка);
			ЗаписатьБуферВПоток(ПотокРезультата, БуферИмени);
			
			Если БуферДополнительныхДанных <> Неопределено Тогда
				ЗаписатьБуферВПоток(ПотокРезультата, БуферДополнительныхДанных);
			КонецЕсли;
		
			Если ЕстьСжатие Тогда
				РазмерДанныхФайла = СжатыйРазмер;
			Иначе
				РазмерДанныхФайла = НесжатыйРазмер;
			КонецЕсли;
			
			Если РазмерДанныхФайла > 0 Тогда
				ПрямоеКопированиеВПоток(Поток, ПотокРезультата, РазмерДанныхФайла);
			КонецЕсли;
			
			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("Offset", ПозицияНачалаБлока);
			ДанныеФайла.Вставить("Compress", ЕстьСжатие);
			ДанныеФайла.Вставить("MinVer", МинимальнаяВерсия);
			ДанныеФайла.Вставить("Flags", РегистрФлагов);
			ДанныеФайла.Вставить("Date", ДатаМодификацииФайла);
			ДанныеФайла.Вставить("Time", ВремяМодификацииФайла);
			ДанныеФайла.Вставить("CRC32", КонтрольнаяСумма);
			ДанныеФайла.Вставить("Name", БуферИмени);
			ДанныеФайла.Вставить("Extra", БуферДополнительныхДанных);
			
			МассивФайлов.Добавить(ДанныеФайла);
			
			ПозицияНачалаБлока = Поток.ТекущаяПозиция();
			
			ТекущаяСигнатура = ПрочитатьНатуральноеЧислоИзПотока(Поток, 4);
			ЗаписатьНатуральноеЧислоВПоток(ПотокРезультата, ТекущаяСигнатура, 4);
			
			Если ТекущаяСигнатура = 67324752 Тогда
				Продолжить;
			ИначеЕсли ТекущаяСигнатура = 33639248 Тогда
				Прервать;
			Иначе
				ВызватьИсключение НСтр("ru = 'Неизвестная структура по сигнатуре:'") + Строка(ТекущаяСигнатура);
			КонецЕсли;
		КонецЦикла;
		
		НомерФайла = 0;
		МассивПроверки = Новый Массив;
		НачалоКаталога = ПозицияНачалаБлока;
		
		Пока Истина Цикл
			// (1) Версия для создания: 2 байта
			// (2) Минимальная версия: 2 байта
			// (3) Регистр флагов: 2 байта
			// (4) Метод сжатия: 2 байта
			// (5) Время модификации файла: 2 байта
			// (6) Дата модификации файла: 2 байта
			// (7) Контрольная сумма: 4 байта
			// (8) Сжатый размер: 4 байта
			// (9) Несжатый размер: 4 байта
			// (10) Длина имени файла: 2 байта
			// (11) Длина дополнительных данных: 2 байта
			// (12) Длина комментария: 2 байта
			// (13) Номер диска: 2 байта
			// (14) Внутренние атрибуты файла: 2 байта
			// (15) Внешние атрибуты файла: 4 байта
			// (16) Смещение до начала записи файла: 4 байта
			
			БуферЗаголовка = ПрочитатьБуферИзПотока(Поток, 42);
			
			Попытка
				// (1) Версия для создания: 2 байта
				ВерсияСозданияФайла = БуферЗаголовка.ПрочитатьЦелое16(0, ПорядокБайтов.LittleEndian);
				// (2) Минимальная версия: 2 байта
				МинимальнаяВерсия = БуферЗаголовка.ПрочитатьЦелое16(2, ПорядокБайтов.LittleEndian);
				// (3) Регистр флагов: 2 байта
				РегистрФлагов = БуферЗаголовка.ПрочитатьЦелое16(4, ПорядокБайтов.LittleEndian);
				// (4) Метод сжатия: 2 байта
				МетодСжатия = БуферЗаголовка.ПрочитатьЦелое16(6, ПорядокБайтов.LittleEndian);
				// (5) Время модификации файла: 2 байта
				ВремяМодификацииФайла = БуферЗаголовка.ПрочитатьЦелое16(8, ПорядокБайтов.LittleEndian);
				// (6) Дата модификации файла: 2 байта
				ДатаМодификацииФайла = БуферЗаголовка.ПрочитатьЦелое16(10, ПорядокБайтов.LittleEndian);
				// (7) Контрольная сумма: 4 байта
				КонтрольнаяСумма = БуферЗаголовка.ПрочитатьЦелое32(12, ПорядокБайтов.LittleEndian);
				// (8) Сжатый размер: 4 байта
				СжатыйРазмер = БуферЗаголовка.ПрочитатьЦелое32(16, ПорядокБайтов.LittleEndian);
				// (9) Несжатый размер: 4 байта
				НесжатыйРазмер = БуферЗаголовка.ПрочитатьЦелое32(20, ПорядокБайтов.LittleEndian);
				// (10) Длина имени файла: 2 байта
				ДлинаИмениФайла = БуферЗаголовка.ПрочитатьЦелое16(24, ПорядокБайтов.LittleEndian);
				// (11) Длина дополнительных данных: 2 байта
				ДлинаДополнительныхДанных = БуферЗаголовка.ПрочитатьЦелое16(26, ПорядокБайтов.LittleEndian);
				// (12) Длина комментария: 2 байта
				ДлинаКомментария = БуферЗаголовка.ПрочитатьЦелое16(28, ПорядокБайтов.LittleEndian);
				// (13) Номер диска: 2 байта
				НомерДиска = БуферЗаголовка.ПрочитатьЦелое16(30, ПорядокБайтов.LittleEndian);
				// (14) Внутренние атрибуты файла: 2 байта
				ВнутренниеАтрибуты = БуферЗаголовка.ПрочитатьЦелое16(32, ПорядокБайтов.LittleEndian);
				// (15) Внешние атрибуты файла: 4 байта
				ВнешниеАтрибуты = БуферЗаголовка.ПрочитатьЦелое32(34, ПорядокБайтов.LittleEndian);
				// (16) Смещение до начала записи файла: 4 байта
				СмещениеДоНачала = БуферЗаголовка.ПрочитатьЦелое32(38, ПорядокБайтов.LittleEndian);
			Исключение
				ВызватьИсключение НСтр("ru = 'Ошибка при чтении полей структуры каталога для файла:'")
					+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			
			Если МетодСжатия = 0 Тогда
				ЕстьСжатие = Ложь;
			ИначеЕсли МетодСжатия = 8 Тогда
				ЕстьСжатие = Истина;
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверное значение: %1 для метода сжатия в каталоге файла.'"),
					Строка(МетодСжатия));
			КонецЕсли;
			
			Если ДлинаИмениФайла < 1 Тогда
				ВызватьИсключение НСтр("ru = 'Указана нулевая длина имени файла.'");
			КонецЕсли;
			
			БуферИмени = ПрочитатьБуферИзПотока(Поток, ДлинаИмениФайла);
			
			Если ДлинаДополнительныхДанных > 0 Тогда
				БуферДополнительныхДанных = ПрочитатьБуферИзПотока(Поток, ДлинаДополнительныхДанных);
			Иначе
				БуферДополнительныхДанных = Неопределено;
			КонецЕсли;
			
			Если ДлинаКомментария > 0 Тогда
				БуферКомментария = ПрочитатьБуферИзПотока(Поток, ДлинаКомментария);
			Иначе
				БуферКомментария = Неопределено;
			КонецЕсли;
			
			Если МассивФайлов.Количество() <= НомерФайла Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Обнаружено файлов: %1, но найдена запись каталога файла: %2.'"),
					Строка(МассивФайлов.Количество()), Строка(НомерФайла));
			КонецЕсли;
			
			ДанныеФайла = МассивФайлов[НомерФайла];
			НомерФайла = НомерФайла + 1;
			
			ДанныеФайла.Вставить("Ver", ВерсияСозданияФайла);
			ДанныеФайла.Вставить("Comment", БуферКомментария);
			ДанныеФайла.Вставить("IntAttr", ВнутренниеАтрибуты);
			ДанныеФайла.Вставить("ExtAttr", ВнешниеАтрибуты);
			
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Offset", СмещениеДоНачала, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "MinVer", МинимальнаяВерсия, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Compress", ЕстьСжатие, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Flags", РегистрФлагов, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Date", ДатаМодификацииФайла, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Time", ВремяМодификацииФайла, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "CRC32", КонтрольнаяСумма, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Name", БуферИмени, МассивПроверки);
			ПроверитьПолеСтруктурыАрхива(ДанныеФайла, "Extra", БуферДополнительныхДанных, МассивПроверки);
			
			Если МассивПроверки.Количество() > 0 Тогда
				ВызватьИсключение НСтр("ru = 'Ошибка при сравнении записи файла и записи каталога файла:'")
					+ Символы.ПС + СтрСоединить(МассивПроверки, Символы.ПС);
			КонецЕсли;
			
			// (14) Внутренние атрибуты файла: 2 байта
			БуферЗаголовка.ЗаписатьЦелое16(32, ЗначениеВнутреннихАтрибутов, ПорядокБайтов.LittleEndian);
			// (15) Внешние атрибуты файла: 4 байта
			БуферЗаголовка.ЗаписатьЦелое32(34, ЗначениеВнешнихАтрибутов, ПорядокБайтов.LittleEndian);
			
			ЗаписатьБуферВПоток(ПотокРезультата, БуферЗаголовка);
			ЗаписатьБуферВПоток(ПотокРезультата, БуферИмени);
			
			Если БуферДополнительныхДанных <> Неопределено Тогда
				ЗаписатьБуферВПоток(ПотокРезультата, БуферДополнительныхДанных);
			КонецЕсли;
			
			Если БуферКомментария <> Неопределено Тогда
				ЗаписатьБуферВПоток(ПотокРезультата, БуферКомментария);
			КонецЕсли;
			
			ПозицияНачалаБлока = Поток.ТекущаяПозиция();
			
			ТекущаяСигнатура = ПрочитатьНатуральноеЧислоИзПотока(Поток, 4);
			ЗаписатьНатуральноеЧислоВПоток(ПотокРезультата, ТекущаяСигнатура, 4);
			
			Если ТекущаяСигнатура = 33639248 Тогда
				Продолжить;
			ИначеЕсли ТекущаяСигнатура = 101010256 Тогда
				Прервать;
			Иначе
				ВызватьИсключение НСтр("ru = 'Неизвестная структура по сигнатуре:'") + Строка(ТекущаяСигнатура);
			КонецЕсли;
		КонецЦикла;
		
		// Номер диска: 2 байта
		// Номер диска начала директории: 2 байта
		// Количество записей текущего диска: 2 байта
		// Всего записей: 2 байта
		// Размер директории: 4 байта
		// Смещение директории: 4 байта
		// Длина комментария: 2 байта
		
		БуферЗаголовка = ПрочитатьБуферИзПотока(Поток, 18);
		
		Попытка
			// Номер диска: 2 байта
			НомерДиска = БуферЗаголовка.ПрочитатьЦелое16(0, ПорядокБайтов.LittleEndian);
			// Номер диска начала директории: 2 байта
			НомерДискаНачала = БуферЗаголовка.ПрочитатьЦелое16(2, ПорядокБайтов.LittleEndian);
			// Количество записей текущего диска: 2 байта
			КоличествоЗаписейТекущегоДиска = БуферЗаголовка.ПрочитатьЦелое16(4, ПорядокБайтов.LittleEndian);
			// Всего записей: 2 байта
			КоличествоЗаписей = БуферЗаголовка.ПрочитатьЦелое16(6, ПорядокБайтов.LittleEndian);
			// Размер директории: 4 байта
			ОбщийРазмерДиректории = БуферЗаголовка.ПрочитатьЦелое32(8, ПорядокБайтов.LittleEndian);
			// Смещение директории: 4 байта
			СмещениеДиректории = БуферЗаголовка.ПрочитатьЦелое32(12, ПорядокБайтов.LittleEndian);
			// Длина комментария: 2 байта
			ДлинаКомментария = БуферЗаголовка.ПрочитатьЦелое16(16, ПорядокБайтов.LittleEndian);
		Исключение
			ВызватьИсключение НСтр("ru = 'Ошибка при чтении полей из буфера окончания:'")
				+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если ДлинаКомментария > 0 Тогда
			БуферКомментария = ПрочитатьБуферИзПотока(Поток, ДлинаКомментария);
		Иначе
			БуферКомментария = Неопределено;
		КонецЕсли;
		
		ЗаписатьБуферВПоток(ПотокРезультата, БуферЗаголовка);
		
		Если БуферКомментария <> Неопределено Тогда
			ЗаписатьБуферВПоток(ПотокРезультата, БуферКомментария);
		КонецЕсли;
		
		Если СмещениеДиректории <> НачалоКаталога Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Указанное начало каталога: %1 отличается от обнаруженного: %2.'"),
				Строка(СмещениеДиректории), Строка(НачалоКаталога));
		КонецЕсли;
		
		Если ПозицияНачалаБлока - НачалоКаталога <> ОбщийРазмерДиректории Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Рассчитанный общий размер каталога: %1 отличается от указанного: %2.'"),
				Строка(ПозицияНачалаБлока - НачалоКаталога), Строка(ОбщийРазмерДиректории));
		КонецЕсли;
		
		Если Поток.Размер() <> Поток.ТекущаяПозиция() Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'После окончания чтения данных позиция: %1 отличается от размера: %2.'"),
				Строка(Поток.ТекущаяПозиция()), Строка(Поток.Размер()));
		КонецЕсли;
		
		Если КоличествоЗаписей <> НомерФайла Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Указанное количество записей: %1 отличается от найденного: %2.'"),
				Строка(КоличествоЗаписей), Строка(НомерФайла));
		КонецЕсли;
		
		Если НомерФайла <> МассивФайлов.Количество() Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Количество записей каталога: %1 отличается от количества файлов: %2.'"),
				 Строка(НомерФайла), Строка(МассивФайлов.Количество()));
		КонецЕсли;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Поток.Закрыть();
		ПотокРезультата.Закрыть();
		
		Возврат ТекстОшибки;
	КонецПопытки;
	
	Поток.Закрыть();
	
	НовыеДанные = ПотокРезультата.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат НовыеДанные;
КонецФункции

// Выполняет чтение натурального числа из потока (предполагается, что младший байт читается первым).
// 
// Параметры:
//  Поток - Поток,ПотокВПамяти,ФайловыйПоток - поток, из которого выполняется чтение.
//  КоличествоБайт - Число - количество байт в числе, которое будет прочитано.
// 
// Возвращаемое значение:
//  - Число - результат чтение.
// 
// Исключение:
//  В случае ошибки вызывается исключение.
Функция ПрочитатьНатуральноеЧислоИзПотока(Поток, Знач КоличествоБайт)
	
	ПроверитьПотокЧтения(Поток);
	ПроверитьЦелоеЧисло(КоличествоБайт, 1, Неопределено);
	
	Буфер = Новый БуферДвоичныхДанных(КоличествоБайт, ПорядокБайтов.LittleEndian);
	
	РазмерПотока = Поток.Размер();
	ТекущаяПозиция = Поток.ТекущаяПозиция();
	
	Если ТекущаяПозиция + КоличествоБайт > РазмерПотока Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'С позиции: %1 потока размером: %2 нельзя прочитать натуральное число длиной: %3'"),
			Строка(ТекущаяПозиция), Строка(РазмерПотока), Строка(КоличествоБайт));
	КонецЕсли;
	
	ПрочитаноБайт = Поток.Прочитать(Буфер, 0, КоличествоБайт);
	
	Если ПрочитаноБайт <> КоличествоБайт Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'С позиции: %1 потока размером: %2 было прочитано: %3 байт числа длиной: %4'"),
			Строка(ТекущаяПозиция), Строка(РазмерПотока), Строка(ПрочитаноБайт), Строка(КоличествоБайт));
	КонецЕсли;
	
	ПрочитанноеЧисло = 0;
	
	Пока КоличествоБайт > 0 Цикл
		КоличествоБайт = КоличествоБайт - 1;
		ПрочитанноеЧисло = (ПрочитанноеЧисло * 256) + Буфер[КоличествоБайт];
	КонецЦикла;
	
	Возврат ПрочитанноеЧисло;
КонецФункции

// Выполняет чтение буфера из потока (буфер создается перед чтением).
// 
// Параметры:
//  Поток - Поток - Поток, из которого будет прочитан буфер.
//  РазмерБуфера - Число - Количество байт в читаемом буфере.
// 
// Возвращаемое значение:
// - БуферДвоичныхДанных - прочитанный из потока буфер.
// 
// Исключение:
//  В случае ошибки вызывается исключение.
Функция ПрочитатьБуферИзПотока(Поток, РазмерБуфера)
	
	ПроверитьПотокЧтения(Поток);
	ПроверитьЦелоеЧисло(РазмерБуфера, 1, Неопределено);
	
	РазмерПотока = Поток.Размер();
	Позиция = Поток.ТекущаяПозиция();
	
	Если Позиция + РазмерБуфера > РазмерПотока Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'В потоке размером: %1 с позиции: %2 невозможно прочитать буфет размером: %3'"),
			Строка(РазмерПотока), Строка(Позиция), Строка(РазмерБуфера));
	КонецЕсли;
	
	Буфер = Новый БуферДвоичныхДанных(РазмерБуфера, ПорядокБайтов.LittleEndian);
	ПрочитаноБайт = Поток.Прочитать(Буфер, 0, РазмерБуфера);
	
	Если ПрочитаноБайт <> РазмерБуфера Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'При чтении буфера размером: %1 с позиции: %2 прочитали только: %3'"),
			Строка(РазмерБуфера), Строка(Позиция), Строка(ПрочитаноБайт));
	КонецЕсли;
	
	Возврат Буфер;
	
КонецФункции

// Выполняет запись натурального числа в поток.
// 
// Параметры:
//  Поток - Поток - поток, в который выполняется запись.
//  ЗначениеДляЗаписи - Число - записываемое в поток значение.
//  КоличествоБайт - Число - количество байт в записываемом числе.
// 
// Исключение:
//  В случае ошибки вызывается исключение.
Процедура ЗаписатьНатуральноеЧислоВПоток(Поток, ЗначениеДляЗаписи, КоличествоБайт)
	
	ПроверитьПотокЗаписи(Поток);
	ПроверитьЦелоеЧисло(ЗначениеДляЗаписи, 0, Неопределено);
	ПроверитьЦелоеЧисло(КоличествоБайт, 1, Неопределено);
	
	Буфер = Новый БуферДвоичныхДанных(КоличествоБайт, ПорядокБайтов.LittleEndian);
	ТекущееЗначение = ЗначениеДляЗаписи;
	
	Для ИндексБайта = 0 По КоличествоБайт - 1 Цикл
		Байт = ТекущееЗначение % 256;
		ТекущееЗначение = (ТекущееЗначение - Байт) / 256;
		Буфер[ИндексБайта] = Байт;
	КонецЦикла;
	
	Если ТекущееЗначение > 0 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Значение: %1 нельзя записать байтами в количестве: %2'"),
			Строка(ЗначениеДляЗаписи), Строка(КоличествоБайт));
	КонецЕсли;
	
	Поток.Записать(Буфер, 0, КоличествоБайт);
	
КонецПроцедуры

// Выполняет запись буфера двоичных данных в поток.
// 
// Параметры:
//  Поток - Поток - поток, в который производится запись.
//  Буфер - БуферДвоичныхДанных - буфер, который записывается в поток.
// 
// Исключение:
//  В случае ошибки вызывается исключение.
Процедура ЗаписатьБуферВПоток(Поток, Буфер)
	
	ПроверитьПотокЗаписи(Поток);
	
	Если ТипЗнч(Буфер) <> Тип("БуферДвоичныхДанных") Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для записываемого в поток буфера двоичных данных.'"),
			Строка(ТипЗнч(Буфер)));
	КонецЕсли;
	
	Поток.Записать(Буфер, 0, Буфер.Размер);
	
КонецПроцедуры

// Выполняет прямое копирование потока чтения в поток записи.
// 
// Параметры:
//  ПотокЧтения - Поток - поток, из которого выполняется чтение.
//  ПотокЗаписи - Поток - поток, в который выполняется запись.
//  КоличествоБайт - Число - количество копируемых байт.
// 
// Исключение:
//  В случае ошибки вызывается исключение.
Процедура ПрямоеКопированиеВПоток(ПотокЧтения, ПотокЗаписи, КоличествоБайт)
	
	ПроверитьПотокЧтения(ПотокЧтения);
	ПроверитьПотокЗаписи(ПотокЗаписи);
	ПроверитьЦелоеЧисло(КоличествоБайт, 0, Неопределено);
	
	Если КоличествоБайт > 0 Тогда
		ПотокЧтения.КопироватьВ(ПотокЗаписи, КоличествоБайт);
	КонецЕсли;
	
КонецПроцедуры

Функция СкопироватьВНовыйПоток(Поток, КоличествоБайт)
	
	Если ТипЗнч(Поток) <> Тип("Поток") Тогда
		Возврат "Неверный тип значения:" + Строка(ТипЗнч(Поток)) + " для потока, из части которого читается поток в памяти.";
	КонецЕсли;
	
	Если ТипЗнч(КоличествоБайт) <> Тип("Число") Тогда
		Возврат "Неверный тип значения:" + Строка(ТипЗнч(КоличествоБайт)) + " для количества читаемых из потока байт.";
	ИначеЕсли Цел(КоличествоБайт) <> КоличествоБайт Тогда
		Возврат "Количество читаемых байт указано дробным числом:" + XMLСтрока(КоличествоБайт);
	ИначеЕсли КоличествоБайт <= 0 Тогда
		Возврат "Указано нереальное количество читаемых байт:" + Строка(КоличествоБайт);
	КонецЕсли;
	
	РазмерПотока = Поток.Размер();
	ТекущаяПозиция = Поток.ТекущаяПозиция();
	
	Если ТекущаяПозиция + КоличествоБайт > РазмерПотока Тогда
		Возврат "С позиции:" + Строка(ТекущаяПозиция) + " потока размером:" + Строка(РазмерПотока) + " невозможно прочитать байт:" + Строка(КоличествоБайт);
	КонецЕсли;
	
	ПотокРезультат = Новый ПотокВПамяти(КоличествоБайт);
	ПрочитаноБайт = Поток.КопироватьВ(ПотокРезультат, КоличествоБайт);
	
	Если ПрочитаноБайт <> КоличествоБайт Тогда
		Возврат "С позиции:" + Строка(ТекущаяПозиция) + " потока размером:" + Строка(РазмерПотока) + " прочитано байт:" + Строка(ПрочитаноБайт) + " вместо:" + Строка(КоличествоБайт);
	КонецЕсли;
	
	Возврат ПотокРезультат;
	
КонецФункции

// Раскодировать deflate поток.
// Пока не реализовано, возвращает тот же поток.
// 
// Параметры:
//  СжатыйПоток - ПотокВПамяти - Сжатый поток в памяти
// 
// Возвращаемое значение:
//  ПотокВПамяти - Раскодированный deflate поток
//
Функция РаскодироватьDeflateПоток(СжатыйПоток)
	
	Возврат СжатыйПоток;
	
КонецФункции

// Проверяет, что переданный поток является потоком и готов для чтения.
// 
// Параметры:
//  ПроверяемоеЗначение - Произвольный - проверяемое значение.
// 
// Исключение:
//  В случае неправильного значения вызывается исключение.
Процедура ПроверитьПотокЧтения(ПроверяемоеЗначение)
	
	ТипЗначения = ТипЗнч(ПроверяемоеЗначение);
	
	Если ТипЗначения = Тип("Поток")
		ИЛИ ТипЗначения = Тип("ПотокВПамяти")
		ИЛИ ТипЗначения = Тип("ФайловыйПоток") Тогда
		Если НЕ ПроверяемоеЗначение.ДоступноЧтение Тогда
			ВызватьИсключение НСтр("ru = 'Из переданного потока чтение невозможно.'");
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для читаемого потока.'"), Строка(ТипЗначения));
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, что переданное значение является потоком, доступным для записи.
// 
// Параметры:
//  ПроверяемоеЗначение - Произвольный - проверяемое значение.
// 
// Исключение:
//  В случае неправильного значения вызывается исключение.
Процедура ПроверитьПотокЗаписи(ПроверяемоеЗначение)
	
	ТипЗначения = ТипЗнч(ПроверяемоеЗначение);
	
	Если ТипЗначения = Тип("Поток")
		ИЛИ ТипЗначения = Тип("ПотокВПамяти")
		ИЛИ ТипЗначения = Тип("ФайловыйПоток") Тогда
		Если НЕ ПроверяемоеЗначение.ДоступнаЗапись Тогда
			ВызватьИсключение НСтр("ru = 'В переданный поток запись недоступна.'");
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для потока, в который ведется запись.'"),
			Строка(ТипЗначения));
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку значения на то, что оно является натуральным числом в указанном диапазоне.
// 
// Параметры:
//  ПроверяемоеЗначение - Произвольный - проверяемое значение.
//  МинимальноеЗначение - Произвольный
//  МаксимальноеЗначение - Произвольный
// 
// Исключение:
//  В случае неправильного значения вызывается исключение.
Процедура ПроверитьЦелоеЧисло(ПроверяемоеЗначение, МинимальноеЗначение = Неопределено, МаксимальноеЗначение = Неопределено)
	
	Если ТипЗнч(ПроверяемоеЗначение) <> Тип("Число") Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для натурального числа.'"),
			Строка(ТипЗнч(ПроверяемоеЗначение)));
	КонецЕсли;
	
	Если Цел(ПроверяемоеЗначение) <> ПроверяемоеЗначение Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Вместо натурального числа передано вещественное: %1'"),
			XMLСтрока(ПроверяемоеЗначение));
	КонецЕсли;
	
	Если МинимальноеЗначение <> Неопределено Тогда
		Если ТипЗнч(МинимальноеЗначение) <> Тип("Число") Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для минимального значения числа.'"),
				Строка(ТипЗнч(МинимальноеЗначение)));
		КонецЕсли;
		
		Если ПроверяемоеЗначение < МинимальноеЗначение Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Проверяемое число: %1 меньше минимального значения: %2'"),
				Строка(ПроверяемоеЗначение), Строка(МинимальноеЗначение));
		КонецЕсли;
	КонецЕсли;
	
	Если МаксимальноеЗначение <> Неопределено Тогда
		Если ТипЗнч(МаксимальноеЗначение) <> Тип("Число") Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для максимального значения числа.'"),
				Строка(ТипЗнч(МаксимальноеЗначение)));
		КонецЕсли;
		
		Если ПроверяемоеЗначение > МаксимальноеЗначение Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Проверяемое число: %1 больше максимального значения: %2'"),
				Строка(ПроверяемоеЗначение), Строка(МаксимальноеЗначение));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку поля в структуре на равенство значению.
// 
// Параметры:
//  Структура - Структура - содержащая проверяемое поле структура.
//  ИмяПоля - Строка - имя поля в структуре, значение которого мы проверяем.
//  ЗначениеПоля - Произвольный - значение, с которым сравнивается значение поля структуры.
//  МассивПроверки - Массив из Строка- массив для записи различий при сравнении.
// 
// Исключение:
//  В случае ошибки в значениях полей вызывается исключение.
Процедура ПроверитьПолеСтруктурыАрхива(Структура, ИмяПоля, ЗначениеПоля, МассивПроверки)
	
	Если ТипЗнч(МассивПроверки) <> Тип("Массив") Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для массива записи результатов проверки.'"),
			Строка(ТипЗнч(МассивПроверки)));
	КонецЕсли;
	
	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для проверяемой структуры.'"),
			Строка(ТипЗнч(Структура))));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ИмяПоля) <> Тип("Строка") Тогда
		МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'Неверный тип значения: %1 для имени проверяемого поля.'"),
			Строка(ТипЗнч(ИмяПоля))));
		Возврат;
	КонецЕсли;
	
	РеальноеЗначение = Неопределено;
	
	Попытка
		Если НЕ Структура.Свойство(ИмяПоля, РеальноеЗначение) Тогда
			МассивПроверки.Добавить(НСтр("ru = 'В структуре нет поля:'") + ИмяПоля);
			Возврат;
		КонецЕсли;
	Исключение
		МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'Ошибка при получении значения поля: %1 из структуры:'"), ИмяПоля)
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ТипЗначения = ТипЗнч(РеальноеЗначение);
	
	Если ТипЗнч(ЗначениеПоля) <> ТипЗначения Тогда
		МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'В структуре поле: %1 имеет тип: %2 отличный от: %3'"),
			ИмяПоля, Строка(ТипЗначения), Строка(ТипЗнч(ЗначениеПоля))));
		Возврат;
	КонецЕсли;
	
	Если ТипЗначения = Тип("БуферДвоичныхДанных") Тогда
		РазмерБуфера = РеальноеЗначение.Размер;
		
		Если ЗначениеПоля.Размер <> РазмерБуфера Тогда
			МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'В структуре поле: %1 содержит буфер двоичных данных размером: %2 отличный от: %3'"),
				ИмяПоля, Строка(РазмерБуфера), Строка(ЗначениеПоля.Размер)));
			Возврат;
		КонецЕсли;
		
		Для Позиция = 0 По РазмерБуфера - 1 Цикл
			Если РеальноеЗначение[Позиция] <> ЗначениеПоля[Позиция] Тогда
				МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'Байт: %1 поля: %2 в позиции: %3 отличается от: %4'"),
					Строка(РеальноеЗначение[Позиция]), ИмяПоля, Строка(Позиция), Строка(ЗначениеПоля[Позиция])));
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли РеальноеЗначение <> ЗначениеПоля Тогда
		МассивПроверки.Добавить(СтрШаблон(НСтр("ru = 'В структуре поле: %1 имеет значение: %2 отличное от: %3'"),
			ИмяПоля, Строка(РеальноеЗначение), Строка(ЗначениеПоля)));
	КонецЕсли;
КонецПроцедуры

// Преобразует ОбъектXDTO в двоичные данные в формате XML.
//
// Параметры:
//  ОбъектXDTO - ЗначениеXDTO, ОбъектXDTO, Неопределено - Записываемое значение.
//  УказаниеТипа - Булево - вариант назначения типа элемента данных XDTO, если истина, то явное.
//  ТипКодировки - Строка - файл будет записан в соответствующей кодировке.
//  ЛокальноеИмя - Строка - локальное имя записываемого элемента данных.
// Возвращаемое значение:
// 	ДвоичныеДанные
Функция XDTOВДвоичныеДанные(ОбъектXDTO, УказаниеТипа = Истина, ТипКодировки = "windows-1251", ЛокальноеИмя = "") Экспорт
	
	Поток = Новый ПотокВПамяти();
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьПоток(Поток, ТипКодировки);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	НазначениеТипа = ?(УказаниеТипа, НазначениеТипаXML.Явное, НазначениеТипаXML.Неявное);
	Если ПустаяСтрока(ЛокальноеИмя) Тогда
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO,,,, НазначениеТипа);
	Иначе
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ЛокальноеИмя,,, НазначениеТипа);
	КонецЕсли;
	ЗаписьXML.Закрыть();
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции


// Событие возникает при записи машиночитаемых доверенностей и добавляет/обновляет запись в журнале МЧД.
// См. ПодпискаНаСобытие.ЗаписатьМашиночитаемуюДоверенностьВЖурнал
// 
// Параметры:
//  Источник - ОпределяемыйТип.ИсточникЗаписиЖурналаМЧД
//  Отказ - Булево
Процедура ОбработчикСобытияЗаписатьМашиночитаемуюДоверенностьВЖурнал(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьМашиночитаемуюДоверенностьВЖурнал(Источник, Отказ);
КонецПроцедуры

Функция ПолучитьМЧДПоНомеру(НомерДоверенности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЧД003.Ссылка
		|ИЗ
		|	Справочник.МЧД003 КАК МЧД003
		|ГДЕ
		|	МЧД003.НомерДоверенности = &НомерДоверенности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиКонтрагентов КАК МашиночитаемыеДоверенностиКонтрагентов
		|ГДЕ
		|	МашиночитаемыеДоверенностиКонтрагентов.НомерДоверенности = &НомерДоверенности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
		|ГДЕ
		|	МашиночитаемыеДоверенностиОрганизаций.НомерДоверенности = &НомерДоверенности";
	
	Запрос.УстановитьПараметр("НомерДоверенности", НомерДоверенности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоLinuxСервер() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	КонецФункции
	
Функция СформироватьСтрокуДляПоискаВЗапросе(Знач СтрокаПоиска) Экспорт
	
	Результат = СтрокаПоиска;
	Результат = СтрЗаменить(Результат, "~", "~~");
	Результат = СтрЗаменить(Результат, "%", "~%");
	Результат = СтрЗаменить(Результат, "_", "~_");
	Результат = СтрЗаменить(Результат, "[", "~[");
	Результат = СтрЗаменить(Результат, "]", "~]");
	Результат = СтрЗаменить(Результат, "^", "~^");	
	Возврат Результат;
	
КонецФункции

Функция ВидСертификатаПоДаннымСвойствСубъектаИИздателя(СвойстваСубъектаСертификата, СвойстваИздателяСертификата) 

	ВидыСертификатов = МашиночитаемыеДоверенностиКлиентСервер.ВидыСертификатовЭлектроннойПодписи();
	
	Если ЭтоВидСертификатаДолжностногоЛицаГосОрганаУЦ(СвойстваСубъектаСертификата, СвойстваИздателяСертификата) Тогда
		Возврат ВидыСертификатов.СертификатДолжностногоЛицаГосОрганаУЦ;
	ИначеЕсли ЭтоВидСертификатаЮридическогоЛица(СвойстваСубъектаСертификата, СвойстваИздателяСертификата) Тогда
		Возврат ВидыСертификатов.СертификатЮЛ;
	ИначеЕсли ЭтоВидСертификатаИндивидуальногоПредпринимателя(СвойстваСубъектаСертификата) Тогда
		Возврат ВидыСертификатов.СертификатИП;
	Иначе
		Возврат ВидыСертификатов.СертификатФЛ;
	КонецЕсли;

КонецФункции

// Проверяет, является ли сертификат сертификатом должностного лица гос. органа, являющегося удостоверяющим центром.
// 
// Параметры:
//  Сертификат - СертификатКриптографии
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоСертификатДолжностногоЛицаГосОрганаУЦ(Сертификат) Экспорт
	
	Если Сертификат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваСубъектаСертификата = СвойстваСубъектаСертификата(Сертификат);
	СвойстваИздателяСертификата = СвойстваИздателяСертификата(Сертификат);
	
	Возврат ЭтоВидСертификатаДолжностногоЛицаГосОрганаУЦ(СвойстваСубъектаСертификата, СвойстваИздателяСертификата);
	
КонецФункции

// Возвращает признак является ли субъект сертификата физическим лицом.
// 
// Параметры:
//  СвойстваСубъекта - См. СвойстваСубъектаСертификата
//  СвойстваИздателя - См. СвойстваИздателяСертификата
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоВидСертификатаФизическогоЛица(СвойстваСубъекта, СвойстваИздателя) Экспорт
	
	Если ЭтоВидСертификатаДолжностногоЛицаГосОрганаУЦ(СвойстваСубъекта, СвойстваИздателя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДлинаИННФизическогоЛица = 12;
	
	Возврат СтрДлина(СвойстваСубъекта.ИНН) = ДлинаИННФизическогоЛица И СвойстваСубъекта.ОГРНИП = Неопределено;
	
КонецФункции

// Проверяет, является ли сертификат сертификатом должностного лица гос. органа, являющегося удостоверяющим центром.
// 
// Параметры:
//  СвойстваСубъектаСертификата - См. СвойстваСубъектаСертификата
//  СвойстваИздателяСертификата - См. СвойстваИздателяСертификата
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоВидСертификатаДолжностногоЛицаГосОрганаУЦ(СвойстваСубъектаСертификата, СвойстваИздателяСертификата) Экспорт
	
	ИздательГосОрганУЦ = 
		ЭтоИННГосОрганаЯвляющегосяУдостоверяющимЦентром(СвойстваИздателяСертификата.ИНН);
	
	ОрганизацияВСубъектеЗаполнена = ЗначениеЗаполнено(СвойстваСубъектаСертификата.Организация);
	
	Возврат ИздательГосОрганУЦ И ОрганизацияВСубъектеЗаполнена;
	
КонецФункции 


// Проверяет, является ли сертификат сертификатом юридического лица 
// (сотрудника организации, руководителя организации по уставу).
// 
// Параметры:
//  СвойстваСубъектаСертификата - См. СвойстваСубъектаСертификата
//  СвойстваИздателяСертификата - См. СвойстваИздателяСертификата
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоВидСертификатаЮридическогоЛица(СвойстваСубъектаСертификата, СвойстваИздателяСертификата)

	Если ЭтоВидСертификатаДолжностногоЛицаГосОрганаУЦ(СвойстваСубъектаСертификата, СвойстваИздателяСертификата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(СвойстваСубъектаСертификата.ИННЮЛ)
		Или ЗначениеЗаполнено(СвойстваСубъектаСертификата.Организация);

КонецФункции

// Проверяет, является ли сертификат сертификатом индивидуального предпринимателя.
// 
// Параметры:
//  СвойстваСубъектаСертификата - См. СвойстваСубъектаСертификата
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоВидСертификатаИндивидуальногоПредпринимателя(СвойстваСубъектаСертификата)
	
	Возврат ЗначениеЗаполнено(СвойстваСубъектаСертификата.ОГРНИП);

КонецФункции

// Преобразует исходную строку в число без вызова исключений.
//
// Параметры:
//   Значение - Строка - строка, которую необходимо привести к числу.
//                       Например, "10", "+10", "010", вернет 10;
//                                 "(10)", "-10",вернет -10;
//                                 "10,2", "10.2",вернет 10.2;
//                                 "000", " ", "",вернет 0;
//                                 "10текст", вернет Неопределено.
//
// Возвращаемое значение:
//   Число, Неопределено - полученное число, либо Неопределено, если строка не является числом.
//
Функция СтрокаВЧисло(Знач Значение) Экспорт
	
	Значение  = СтрЗаменить(Значение, " ", "");
	Если СтрНачинаетсяС(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	
КонецФункции

// Преобразует исходную строку в дату. 
// Если дату не удалось распознать, то возвращается пустая дата (01.01.01 00:00:00).
//
// Параметры:
//  Значение - Строка - строка, которую необходимо привести к дате.
//                      Формат даты должен быть в виде "ДД.ММ.ГГГГ" или "ДД/ММ/ГГ" или "ДД-ММ-ГГ ЧЧ:ММ:CC",
//                      Например, "23.02.1980" или "23/02/80 09:15:45".
//  ЧастьДаты - ЧастиДаты - определяет допустимые части даты. По умолчанию, ЧастиДаты.Дата.
// 
// Возвращаемое значение:
//  Дата
//
Функция СтрокаВДату(Знач Значение, ЧастьДаты = Неопределено)
	
	НаборЦифр = "1234567890";
	
	Если ТипЗнч(ЧастьДаты) <> Тип("ЧастиДаты") Тогда
		ЧастьДаты = ЧастиДаты.Дата;
	КонецЕсли;
	
	ПараметрыДаты = Новый КвалификаторыДаты(ЧастьДаты);
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата",,, ПараметрыДаты);
	
	Значение = ВРег(СтрСоединить(СтрРазделить(СокрЛП(Значение), Символы.НПП + Символы.ПС + Символы.Таб), " "));
	Результат = ОписаниеТипаДата.ПривестиЗначение(Значение);
	
	Для НомерМесяца = 1 По 12 Цикл
		Значение = СтрЗаменить(Значение, ВРег(Формат(Дата(1, НомерМесяца, 2), "ДФ=ММММ")), Формат(НомерМесяца, "ЧЦ=2; ЧВН="));
		Значение = СтрЗаменить(Значение, ВРег(Формат(Дата(1, НомерМесяца, 2), "ДФ=MMM")), Формат(НомерМесяца, "ЧЦ=2; ЧВН="));
	КонецЦикла;
	
	МассивНеЦифр = СтрРазделить(Значение, НаборЦифр);
	Если МассивНеЦифр.Количество() < 2 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПозицияПервойЦифры = СтрДлина(МассивНеЦифр[0]);
	ПозицияПоследнейЦифры = СтрДлина(Значение) - СтрДлина(МассивНеЦифр[МассивНеЦифр.ВГраница()]);
	Значение = Сред(Значение, ПозицияПервойЦифры, ПозицияПоследнейЦифры - ПозицияПервойЦифры);
	Если ПустаяСтрока(Значение) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначениеМассивом = СтрРазделить(Значение, " ");
	Элемент = ЗначениеМассивом[ЗначениеМассивом.ВГраница()];
	Если ЗначениеМассивом.Количество() > 1 Тогда
		Если СтрДлина(Элемент) = 2 Или СтрДлина(Элемент) = 4 Тогда
			
			ЭтоТолькоЦифры = СтрРазделить(Элемент, НаборЦифр, Ложь).Количество() = 0;
			Если ЭтоТолькоЦифры Тогда
				ЗначениеДата = Значение;
				ЗначениеВремя = "";
			Иначе
				ЗначениеВремя = Элемент;
				ЗначениеМассивом.Удалить(ЗначениеМассивом.ВГраница());
				ЗначениеДата = СтрСоединить(ЗначениеМассивом, " ");
			КонецЕсли;
		Иначе
			
			ЗначениеВремя = Элемент;
			ЗначениеМассивом.Удалить(ЗначениеМассивом.ВГраница());
			ЗначениеДата = СтрСоединить(ЗначениеМассивом, " ");
		КонецЕсли;
	Иначе
		
		ЭтоТолькоЦифры = СтрРазделить(Элемент, НаборЦифр, Ложь).Количество() = 0;
		Если ЭтоТолькоЦифры Тогда
			
			Результат = ОписаниеТипаДата.ПривестиЗначение(Элемент);
			Если Не ЗначениеЗаполнено(Результат) Тогда
				
				Если СтрДлина(Элемент) = 6 Тогда
				
					ПеревернутаяДата  = Сред(Элемент, 5) + Сред(Элемент, 3, 2) + Лев(Элемент, 2);
					Год = СтрокаВЧисло(Лев(ПеревернутаяДата, 2));
					Если Год <> Неопределено Тогда
						ПеревернутаяДата = ?(Год > 29, "19", "20") + ПеревернутаяДата;
						Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
					КонецЕсли;
					
				ИначеЕсли СтрДлина(Элемент) > 7 Тогда
					
					ПеревернутаяДата  = Сред(Элемент, 5) + Сред(Элемент, 3, 2) + Лев(Элемент, 2);
					Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Результат;
			
		ИначеЕсли СтрНайти(Элемент, ":") > 0 Тогда
			
			ЗначениеДата = "";
			ЗначениеВремя = Элемент;
		Иначе
			ЗначениеДата = Элемент;
			ЗначениеВремя = "";
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	Если ЗначениеЗаполнено(ЗначениеДата) И ЧастьДаты <> ЧастиДаты.Время Тогда
		
		НаборРазделителей = СтрСоединить(СтрРазделить(ЗначениеДата, НаборЦифр, Ложь), "");
		ЗначениеДатаМассивом = СтрРазделить(ЗначениеДата, НаборРазделителей, Ложь);
		
		ЭтоТолькоЦифры = СтрРазделить(ЗначениеДата, НаборЦифр, Ложь).Количество() = 0;
		Если НЕ ЭтоТолькоЦифры Тогда
			
			Год   = 1;
			Месяц = 1;
			День  = 1;
			
			Если СтрДлина(ЗначениеДатаМассивом[0]) = 4 Тогда
				Год = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[0]);
				ГодВНачале = Истина;
			Иначе
				День = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[0]);
				ГодВНачале = Ложь;
			КонецЕсли;
			
			Если ЗначениеДатаМассивом.Количество() = 2 Тогда
				Месяц = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[1]);
			ИначеЕсли ЗначениеДатаМассивом.Количество() > 2 Тогда
				Месяц = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[1]);
				Если ГодВНачале Тогда
					День = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[2]);
				Иначе
					Год = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[2]);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрДлина(Год) < 3 Тогда
				ГодЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Год);
				Год = ?(ГодЧислом < 30, 2000, 1900) + ГодЧислом;
			Иначе
				Год = ОписаниеТипаЧисло.ПривестиЗначение(Год);
			КонецЕсли;
			
			ЗначениеДата = Формат(Год, "ЧЦ=4; ЧН=0001; ЧВН=; ЧГ=0")
				+ Формат(Месяц, "ЧЦ=2; ЧН=01; ЧВН=; ЧГ=0")
				+ Формат(День, "ЧЦ=2; ЧН=01; ЧВН=; ЧГ=0");
		Иначе
			
			Если СтрДлина(ЗначениеДата) = 6 Тогда
				
				Год = Прав(ЗначениеДата, 2);
				ГодЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Год);
				ЗначениеДата = ?(ГодЧислом < 30, 2000, 1900) + Год + Сред(ЗначениеДата, 3, 2) + Лев(ЗначениеДата, 2) ;
				
			ИначеЕсли СтрДлина(ЗначениеДата) = 8 Тогда
				
				Результат = ОписаниеТипаДата.ПривестиЗначение(ЗначениеДата);
				
				Если Не ЗначениеЗаполнено(Результат) Тогда
					ПеревернутаяДата  = Сред(ЗначениеДата, 5) + Сред(ЗначениеДата, 3, 2) + Лев(ЗначениеДата, 2);
					Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
					Если ЗначениеЗаполнено(Результат) Тогда
						ЗначениеДата = ПеревернутаяДата;
					КонецЕсли;
				КонецЕсли;
			
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ЗначениеДата = "00010101";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеВремя) И ЧастьДаты <> ЧастиДаты.Дата Тогда
		
		ЭтоТолькоЦифры = СтрРазделить(ЗначениеВремя, НаборЦифр, Ложь).Количество() = 0;
		Если НЕ ЭтоТолькоЦифры Тогда
			
			НаборРазделителей = СтрСоединить(СтрРазделить(ЗначениеВремя, НаборЦифр, Ложь), "");
			ЗначениеВремяМассивом = СтрРазделить(ЗначениеВремя, НаборРазделителей, Ложь);
			
			Час     = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[0]);
			Минута  = 0;
			Секунда = 0;
			
			Если ЗначениеВремяМассивом.Количество() = 2 Тогда
				Минута = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[1]);
			ИначеЕсли ЗначениеВремяМассивом.Количество() > 2 Тогда
				Минута = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[1]);
				Секунда = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[2]);
			КонецЕсли;
			
			ШаблонФормата = "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0";
			ЗначениеВремя = Формат(Час, ШаблонФормата)
				+ Формат(Минута, ШаблонФормата)
				+ Формат(Секунда, ШаблонФормата);
				
		КонецЕсли;
		
	Иначе
		ЗначениеВремя = "000000";
	КонецЕсли;
	
	Результат = ОписаниеТипаДата.ПривестиЗначение(ЗначениеДата + ЗначениеВремя);
	
	Возврат Результат;
	
КонецФункции

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив - коллекция уникальных элементов.
//
Функция СвернутьМассив(Массив) Экспорт
    Результат = Новый Массив;
    ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Массив, Истина);
    Возврат Результат;
КонецФункции