
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст        - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоКорректировка - Булево - исходящий признак соответствия документа типу «Корректировка приобретения».
Процедура ЭтоДокументКорректировкаПриобретения(Контекст, ЭтоКорректировка) Экспорт
	
КонецПроцедуры

// Определяет соответствие вида корректировки хозяйственной операции "Корректировка по согласовнию",
// результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - ДокументСсылка - Контекст для определения типа документа.
//  ЭтоКорректировкаПоСогласованиюСторон - Булево - исходящий признак соответствия вида хозяйственной операции значению "Корректировка по согласованию сторон".
Процедура ЭтоКорректировкаПриобретенияПоСогласованию(Контекст, ЭтоКорректировкаПоСогласованиюСторон) Экспорт
	
КонецПроцедуры

// Заполняет таблицу товаров, принятых без расхождений, при загрузке данных формы результатов сверки по кодам маркировки.
// Товары, принятые без расхождений, определяются как товары документа основания, данных по которым нет в массиве номенклатуры,
// полученном по ЭДО (из акта или корректировочного документа), соотвествующие отбору по видам продукции.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка - документ основание, с которым производится сверка кодов из входящего электронного документа.
//  НоменклатураПоДаннымЭДО - Массив - массив из ОпределяемыйТип.Номенклатура, полученный из входящего электронного документа.
//  ВидыМаркируемойПродукции - Массив, ПеречислениеСсылка.ВидыПродукцииИС - виды маркируемой продукции документа основания, которую необходимо получить.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//  * Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура.
//
Функция ПриОпеределенииТаблицыПродукцииПринятойБезРасхождений(ДокументОснование, НоменклатураПоДаннымЭДО, ВидыМаркируемойПродукции) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура", ОпределяемыеТипы().Номенклатура.Тип);
	Возврат Результат;
	
КонецФункции

// Реализовать заполнение в переданной таблице данные из документа по значениям штрихкодов в разрезе продукции.
// Используется для получения данных по документу, содержащему расхождения кодов маркировки (акты о расхождениях).
// 
// Параметры:
// ДокументСсылка - ДокументСсылка - ссылка на документ.
// ТаблицаТоваровЗначенийШтрихкодов - См. СверкаКодовМаркировкиИСМП.ИнициализироватьТаблицуТоваровЗначенийШтрихкодов.
//
Процедура ПриЗаполненииЗначенияШтрихкодовПродукцииПоДокументу(ДокументСсылка, ТаблицаТоваровЗначенийШтрихкодов) Экспорт
		
КонецПроцедуры

#Область ПараметрыИнтеграцииФормыПроверкиИПодбора

// Заполняет специфику интеграции формы сверки кодов маркировки в конкретную форму.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для которой настраиваются параметры интеграции.
//  ПараметрыИнтеграции - (См. СверкаКодовМаркировкиИСМП.ПараметрыИнтеграцииФормыСверкиКодовМаркировки).
//
Процедура ПриОпределенииПараметровИнтеграцииФормыСверкиПоКодамМаркировки(Форма, ПараметрыИнтеграции) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Переопределение параметров интеграции команды открытия формы результатов сверки кодов маркировки в документе Корректировка Приобретения
// (расположения форматированной строки перехода к результатам сверки, если полученный корректировочный документ
// отличается от отправленного акта о расхождениях).
//
// Параметры:
//   Форма            - ФормаКлиентскогоПриложения - прикладная форма для встраивания форматированной строки
//   ПараметрыНадписи - Структура        - (см. СобытияФормИСМП.ПараметрыИнтеграцииГиперссылкиИСМП)
//
Процедура ПриОпределенииПараметровИнтеграцииГиперссылкиСостояниеОбменаИСМП(Форма, ПараметрыНадписи) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Получает виды маркируемой продукции по товарам, содержащимся в документе.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, виды маркируемой продукции которого необходимо получить.
//
// Возвращаемое значение:
//  Массив - Массив видов продукции.
Функция ПриОпределенииВидовПродукцииДокумента(Знач ДокументСсылка) Экспорт
	
	Возврат Новый Массив;
	
КонецФункции

// Заполняет переданную таблицу товарами переданного документа с указанием вида продукции.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, виды маркируемой продукции которого необходимо получить.
//  ТаблицаМаркируемойПродукции - ТаблицаЗначений - См. СверкаКодовМаркировкиИСМП.НоваяТаблицаМаркируемойПродукции
Процедура ПриОпределенииМаркируемойПродукцииДокумента(Знач ДокументСсылка, ТаблицаМаркируемойПродукции) Экспорт
	
КонецПроцедуры

// Предназначена для реализации функциональности проверки, обработаны или нет расхождения по кодам маркировки в документе пользователем.
// Возвращает истина, если требуется обработка (в табличной части расхождений вариант действий не заполнен (реквизит табличной части "Признан")).
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ объект, в котором необходимо проверить обработку пользователем варинатов действий по расхождениям.
//  ПараметрыИнтеграции - Структура - (см. СобытияФормИСМП.ПараметрыИнтеграцииГиперссылкиИСМП)
//  
// Возвращаемое значение:
//  Булево - Истина, если колонка "Признан" в табличной части расхождений не заполнена.
//
Функция ПриОпределенииНеобходимостиОбработкиКодовМаркировкиВДокументе(ДокументОбъект, ПараметрыИнтеграции) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Предназначена для реализации функциональности по отражению результатов сверки кодов маркировки в документе, из которого была вызвана соответствующая форма.
// Вызывается при сохранении действий пользователя при анализе расхождений отправленного УПД и ТОРГ-2 в документе акт о расхождениях.
// 
// Параметры:
//  ПараметрыОкончанияСверки - (См. СверкаКодовМаркировкиИСМП.ЗафиксироватьРезультатСверки).
Процедура ОтразитьРезультатыСверкиВДокументе(ПараметрыОкончанияСверки) Экспорт
	
КонецПроцедуры

// Предназначена для реализации заполнения данных колонки по расхождениям кодов маркировки в переданной коллекции.
//
// Параметры:
//  Товары - ДанныеФормыКоллекция, ТаблицаЗначений - Таблица, в которой необходимо заполнить реквизиты. Обязательные колонки:
//    * Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика номенклатуры
//    * ИмяКолонкиЗаполнения - ФорматированнаяСтрока - колонка для заполнения данных о расхождениях. Имя определяется в 3м параметре процедуры.
//  ДанныеПоРасхождениям - ДанныеФормыКоллекция, ТаблицаЗначений - Таблица, содержащая данные по расхождениям.
//    * Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура.
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика номенклатуры.
//    * ТипРасхождения - ОпределяемыйТип.ТипРасхожденияИСМП - тип расхождения кодов маркировки.
//    * Количество - Число - количество единиц.
//    * Признан - ОпределяемыйТип.ВариантДействийПоРасхождениямКодовМаркировкиИСМП - Обязательная колонка, если 4й параметр Истина. Вариант действия для строки расхождения.
//  ИмяКолонкиЗаполнения - Строка - Имя колонки для заполнения данных о расхождениях.
//  ДоступноСогласованиеРасхождений  -Булево - Истина, если заполняются данные в документе, загруженном по  данным ЭДО ТОРГ-2.
// 
Процедура ЗаполнитьКолонкуРасхожденияПоКодамМаркировки(Товары, ДанныеПоРасхождениям,
													   ИмяКолонкиЗаполнения, ДоступноСогласованиеРасхождений) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииДокументОснованиеСверкиКодов(ДокументСсылка, ДокументОснование) Экспорт
КонецПроцедуры

Процедура ПриОпределенииТекстаНадписиПоляРасхожденияПоРезультатамСверкиКодовМаркировкиИСМП(Ссылка, ТекстНадписи) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецОбласти
