/////////////////////////////////////////////////////////////////////////////////////
//
// Модуль создан при заливке библиотеки ГосИС
//
/////////////////////////////////////////////////////////////////////////////////////

Функция УдалитьЛидирующиеНулиИзНомераОбъекта(Номер) Экспорт

	// удаление ведущих нулей
	Пока Лев(Номер, 1)="0" Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;
	Возврат Номер;
	
КонецФункции

Функция НомерНаПечать(Номер, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт
	
	Возврат УдалитьЛидирующиеНулиИзНомераОбъекта(Номер);
	
КонецФункции
