#Область СлужебныйПрограммныйИнтерфейс

#Область ПодборПоОКПД2

Процедура ОткрытьФормуПодбораОКПД2(Форма, ТекущиеДанные, Владелец, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = ИнтеграцияЗЕРНОКлиент.ИнициализироватьПараметрыОткрытияФормыПодбора();
	
	ПараметрыФормы.ТекущаяСтрока = ТекущиеДанные.ОКПД2;
	ПараметрыФормы.РежимВыбора   = Истина;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ВидПродукции") Тогда
		ПараметрыФормы.ВидПродукции = Форма.Объект.ВидПродукции;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидПродукцииИС") Тогда
		ПараметрыФормы.ВозвращатьСсылкуНаЭлементКлассификатора = Истина;
		ПараметрыФормы.ВидПродукции = Форма.ВидПродукцииИС;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДополнительныеПараметры);
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.КлассификаторНСИЗЕРНО.Форма.ФормаСпискаОКПД2",
		ПараметрыФормы,
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуПодбораТНВЭД(Форма, ТекущиеДанные, Владелец, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = ИнтеграцияЗЕРНОКлиент.ИнициализироватьПараметрыОткрытияФормыПодбора();
	
	ПараметрыФормы.ТекущаяСтрока = ТекущиеДанные.КодТНВЭД;
	ПараметрыФормы.РежимВыбора   = Истина;
	ПараметрыФормы.ОКПД2         = ТекущиеДанные.ОКПД2;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ВидПродукции") Тогда
		ПараметрыФормы.ВидПродукции = Форма.Объект.ВидПродукции;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидПродукцииИС") Тогда
		ПараметрыФормы.ВозвращатьСсылкуНаЭлементКлассификатора = Истина;
		ПараметрыФормы.ВидПродукции = Форма.ВидПродукцииИС;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДополнительныеПараметры);
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.ВидыСельскохозяйственныхКультурЗЕРНО.Форма.ФормаПодбораТНВЭД",
		ПараметрыФормы,
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
