#Область СлужебныйПрограммныйИнтерфейс

#Область СерииНоменклатуры

// Добавляет зависящие от владельца формы проверки и подбора значения в параметры указания серий номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма с товарами, для которой необходимо определить параметры указания серий.
//  ПараметрыУказанияСерий - Структура - дополняемые параметры указания серий.
Процедура ДополнитьПараметрыУказанияСерий(Форма, ПараметрыУказанияСерий) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Формирует структуру, массив которых в дальнейшем будет передан в процедуру генерации серий.
//
// Параметры:
//  * ДанныеДляГенерацииСерии - Структура - Описание:
//  ** Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура, для которой будет генерироваться серия.
//  ** Серия        - ОпределяемыйТип.СерияНоменклатуры - В данное значение будет записана сгенерированная серия.
//  ** ЕстьОшибка   - Булево - Будет установлено в Истина, если по каким то причинам серия сгенерирована не будет.
//  ** ТекстОшибки  - Строка - причина, по которой серия не генерировалась.
//  ** МРЦ          - Число - только для табачной продукции, максимальная розничная цена.
//  * ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции, для которой получается структура данных
Процедура ПолучитьДанныеДляГенерацииСерии(ДанныеДляГенерацииСерии, ВидМаркируемойПродукции) Экспорт
	
	
	Возврат;

КонецПроцедуры

#КонецОбласти

#Область ОткрытиеФормыПроверкиИПодбора

// Заполняет специфичные параметры открытия форм проверки и подбора маркируемой продукции в зависимости от точки вызова
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма из которой происходит открытие формы проверки и подбора
//  Параметры - (См. ПроверкаИПодборПродукцииИСМПКлиент.ПараметрыОткрытияФормыПроверкиИПодбора)
//
Процедура ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, Параметры) Экспорт

	//Обычные формы
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"Ссылка") Тогда 
		Если ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")Тогда 
			Параметры.ИмяРеквизитаФормыОбъект = "ЭтотОбъект";
			Параметры.ИмяРеквизитаДокументОснование = "";
			Параметры.ИмяРеквизитаСклад = "СкладОрдер";
			Параметры.ПроверкаЭлектронногоДокумента = ЭлектронноеВзаимодействиеИСМП.ДокументСвязанСЭлектронным(Форма.ЭтотОбъект.Ссылка);
			Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыПроверкиПодбораИСМП", Форма);
			Параметры.ИмяРеквизитаКонтрагент = "Контрагент";
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации")Тогда 
			Параметры.ИмяРеквизитаФормыОбъект = "ЭтотОбъект";
			Параметры.ИмяРеквизитаДокументОснование = "";
			Параметры.ПроверкаЭлектронногоДокумента = ЭлектронноеВзаимодействиеИСМП.ДокументСвязанСЭлектронным(Форма.ЭтотОбъект.Ссылка);
			Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыПроверкиПодбораИСМП", Форма);
			Параметры.ИмяРеквизитаКонтрагент = "Контрагент";
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")Тогда 
			Параметры.ИмяРеквизитаФормыОбъект = "ЭтотОбъект";
			Параметры.ИмяРеквизитаДокументОснование = "";
			Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыПроверкиПодбораИСМП", Форма);
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")Тогда 
			Параметры.ИмяРеквизитаФормыОбъект = "ЭтотОбъект";
			Параметры.ИмяРеквизитаДокументОснование = "";
			Параметры.ИмяРеквизитаСклад = "СкладОрдер";
			Параметры.ПроверкаЭлектронногоДокумента = ЭлектронноеВзаимодействиеИСМП.ДокументСвязанСЭлектронным(Форма.ЭтотОбъект.Ссылка);
			Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыПроверкиПодбораИСМП", Форма);
			Параметры.ИмяРеквизитаКонтрагент = "Контрагент";
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")Тогда 
			Параметры.ИмяРеквизитаФормыОбъект = "ЭтотОбъект";
			Параметры.ИмяРеквизитаДокументОснование = "";
			Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыПроверкиПодбораИСМП", Форма);
		ИначеЕсли ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ЧекККМ")Тогда 
			Параметры.ИмяРеквизитаФормыОбъект = "";
			Параметры.ИмяРеквизитаДокументОснование = "";
			Параметры.ПроверятьМодифицированность = Ложь;
			Параметры.АдресПроверяемыхДанных = ПроверкаИПодборПродукцииИСМПУТ.АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(
				ШтрихкодированиеИСКлиент.ПараметрыСканирования(Форма,, Параметры.ВидМаркируемойПродукции),
				Форма.ДокументОбъект,
				Форма.УникальныйИдентификатор,
				Параметры.ВидМаркируемойПродукции);
			ПараметрыЗакрытия = Новый Структура("ВидПродукции", Параметры.ВидМаркируемойПродукции);
			Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыПроверкиПодбораИСМП", Форма, ПараметрыЗакрытия);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Выполняет специфичные действия после закрытия форм проверки и подбора маркируемой продукции в зависимости от точки вызова
//
// Параметры:
//  РезультатЗакрытия - Произвольный - результат закрытия формы проверки и подбора
//  ДополнительныеПараметры - Структура с реквизитом Форма (управляемая форма из которой происходил вызов)
//
Процедура ПриЗакрытииФормыПроверкиИПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ДополнительныеПараметры.Форма.Прочитать();
	
КонецПроцедуры

// Выполняет специфичные действия перед открытием форм проверки и подбора маркируемой продукции в зависимости от точки вызова
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения       - форма из которой происходит открытие формы проверки и подбора
//  ПараметрыОткрытияФормыПроверки - Структура - параметры открытия формы проверки и подбора для формы-источника
//  ПараметрыФормыПроверки         - Структура - подготовленные параметры открытия формы проверки и подбора
//  Отказ                          - Булево    - отказ от открытия формы
//
Процедура ПередОткрытиемФормыПроверкиПодбора(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормыПроверки, Отказ) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"Ссылка") Тогда 
		Если ТипЗнч(Форма.Ссылка) = Тип("ДокументСсылка.ЧекККМ")Тогда 
			ПараметрыФормыПроверки.Вставить("ПроверяемыйДокумент", Документы.ЧекККМ.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОткрытиеФормПрикладныхОбъектов

Процедура ОткрытьФормуАктаОРасхождениях(ДокументСсылка, ВладелецФормы) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура ПриОпределенииВариантовЗаполненияКодовМаркировки(Форма, ВариантыЗаполнения) Экспорт
КонецПроцедуры

Процедура ПриОбработкеВариантаЗаполненияКодовМаркировки(Форма, ВариантЗаполнения) Экспорт
КонецПроцедуры
