
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	Возврат "";
КонецФункции
// ОбновлениеИнформационнойБазы

Функция ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Номенклатура.АлкогольнаяПродукция
	|");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(МассивСсылок) Экспорт
	
	Для Каждого ЭлНтМассиваСсылок Из МассивСсылок Цикл
		
		ДокументОбъект = ЭлНтМассиваСсылок.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект.ЕстьАлкогольнаяПродукция = Истина; 
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПрослеживаемыйТовар

//Формирует текст запроса для определения прослеживаемого товара в документе
//
// Параметры:
// ДокументОснование - ДокументСсылка - Документ поступления товаров и услуг
// ДополнительныйРеквизит - Булево - Дополнительный реквизит. не используется в этом модуле
//
// Возвращаемые параметры:
// Строка - Текст сформированного запроса
//

Функция ТекстЗапросаПрослеживаемыеТовары(НомераТаблиц, ПараметрыПроведения, Реквизиты) Экспорт
	
	Если Не Реквизиты.ЕстьТовары
		ИЛИ Не Реквизиты.ВедетсяУчетПрослеживаемыхТоваров Тогда
		ПараметрыПроведения.Вставить("ВТ_ПрослеживаемостьПредварительная", Неопределено);
		ПараметрыПроведения.Вставить("ВТ_Прослеживаемость",                Неопределено);
		ПараметрыПроведения.Вставить("ВТ_СуммыБезНДСПредварительная",      Неопределено);
		ПараметрыПроведения.Вставить("ВТ_СуммыБезНДС",                     Неопределено);
		ПараметрыПроведения.Вставить("ПрослеживаемыеОперации",             Неопределено);
		ПараметрыПроведения.Вставить("ПрослеживаемыеТовары",               Неопределено);
		ПараметрыПроведения.Вставить("РНПТ",                               Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_ПрослеживаемостьПредварительная", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_Прослеживаемость",                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_СуммыБезНДСПредварительная",      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_СуммыБезНДС",                     НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрослеживаемыеОперации",             НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрослеживаемыеТовары",               НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РНПТ",                               НомераТаблиц.Количество());
	
	// Шаблон запроса для сбора временной таблицы ВТ_ПрослеживаемостьПредварительная
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	0 КАК Количество,
	|	НЕОПРЕДЕЛЕНО КАК СтранаПроисхождения,
	|	НЕОПРЕДЕЛЕНО КАК РНПТ,
	|	0 КАК КоличествоПрослеживаемости,
	|	НЕОПРЕДЕЛЕНО КАК ОтражениеВОтчетности,
	|	НЕОПРЕДЕЛЕНО КАК КодОперации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОперации,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК ПериодОперации,
	|	НЕОПРЕДЕЛЕНО КАК НомерДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ТипДокументаВПрослеживаемости,
	|	НЕОПРЕДЕЛЕНО КАК Комитент,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК ЭтоЗакупкаДляКомитента,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	0 КАК СуммаБезНДС
	|ПОМЕСТИТЬ ВТ_ПрослеживаемостьПредварительная";

	Если Реквизиты.ЕстьТовары Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугСведенияПрослеживаемости.Количество, ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
		|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ КАК РНПТ,
		|	ПоступлениеТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
		|	ВЫБОР
		|		КОГДА &ПрослеживаемыеОперацииОтображаютсяВДекларацииНДС
		|			ТОГДА
		|					ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.КнигаПокупок)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ЕстьНДС
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.ЖурналСФ)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.ОтчетОбОперациях)
		|			КОНЕЦ
		|	КОНЕЦ КАК ОтражениеВОтчетности,
		|	ВЫБОР
		|		КОГДА &ПрослеживаемыеОперацииОтображаютсяВДекларацииНДС
		|				ИЛИ &ЕстьНДС
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.Приобретение)
		|	КОНЕЦ КАК КодОперации,
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументОперации,
		|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
		|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслугТовары.Ссылка.Дата, КВАРТАЛ) КАК ПериодОперации,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Ссылка.Номер, """") КАК НомерДокумента,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокумента,
		|	ВЫБОР
		|		КОГДА НЕ &ПрослеживаемыеОперацииОтображаютсяВДекларацииНДС
		|			ТОГДА ВЫБОР
		|					КОГДА ПоступлениеТоваровУслугТовары.Ссылка.ЭтоУниверсальныйДокумент
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ТипыДокументов.УПД)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТипыДокументов.Накладная)
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ТипДокументаВПрослеживаемости,
		|	ВЫБОР
		|		КОГДА &ЭтоКомиссия
		|			ТОГДА ПоступлениеТоваровУслугТовары.Ссылка.Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Комитент,
		|	ВЫБОР
		|		КОГДА &ЭтоКомиссия
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗапасовПрослеживаемыхТоваров.ТоварыОтКомитентаНаРеализацию)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидЗапасов,
		|	ЛОЖЬ КАК ЭтоЗакупкаДляКомитента,
		|	ПоступлениеТоваровУслугТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Сумма КАК СуммаБезНДС
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СведенияПрослеживаемости КАК ПоступлениеТоваровУслугСведенияПрослеживаемости
		|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка
		|			И ПоступлениеТоваровУслугТовары.ИдентификаторСтроки = ПоступлениеТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.ПрослеживаемыйТовар
		|	И ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ВТ_ПрослеживаемостьПредварительная.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ПрослеживаемостьПредварительная.Количество) КАК Количество,
	|	ВТ_ПрослеживаемостьПредварительная.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТ_ПрослеживаемостьПредварительная.РНПТ КАК РНПТ,
	|	СУММА(ВТ_ПрослеживаемостьПредварительная.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	ВТ_ПрослеживаемостьПредварительная.ОтражениеВОтчетности КАК ОтражениеВОтчетности,
	|	ВТ_ПрослеживаемостьПредварительная.КодОперации КАК КодОперации,
	|	ВТ_ПрослеживаемостьПредварительная.ДокументОперации КАК ДокументОперации,
	|	ВТ_ПрослеживаемостьПредварительная.Контрагент КАК Контрагент,
	|	ВТ_ПрослеживаемостьПредварительная.ПериодОперации КАК ПериодОперации,
	|	ВТ_ПрослеживаемостьПредварительная.НомерДокумента КАК НомерДокумента,
	|	ВТ_ПрослеживаемостьПредварительная.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_ПрослеживаемостьПредварительная.ТипДокументаВПрослеживаемости КАК ТипДокументаВПрослеживаемости,
	|	ВТ_ПрослеживаемостьПредварительная.Комитент КАК Комитент,
	|	ВТ_ПрослеживаемостьПредварительная.ВидЗапасов КАК ВидЗапасов,
	|	ВТ_ПрослеживаемостьПредварительная.ЭтоЗакупкаДляКомитента КАК ЭтоЗакупкаДляКомитента,
	|	ВТ_ПрослеживаемостьПредварительная.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(ВТ_ПрослеживаемостьПредварительная.СуммаБезНДС) КАК СуммаБезНДС
	|ПОМЕСТИТЬ ВТ_Прослеживаемость
	|ИЗ
	|	ВТ_ПрослеживаемостьПредварительная КАК ВТ_ПрослеживаемостьПредварительная
	|ГДЕ
	|	ВТ_ПрослеживаемостьПредварительная.Номенклатура <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПрослеживаемостьПредварительная.ДокументОперации,
	|	ВТ_ПрослеживаемостьПредварительная.КодОперации,
	|	ВТ_ПрослеживаемостьПредварительная.ТипДокументаВПрослеживаемости,
	|	ВТ_ПрослеживаемостьПредварительная.РНПТ,
	|	ВТ_ПрослеживаемостьПредварительная.СтранаПроисхождения,
	|	ВТ_ПрослеживаемостьПредварительная.Номенклатура,
	|	ВТ_ПрослеживаемостьПредварительная.НомерДокумента,
	|	ВТ_ПрослеживаемостьПредварительная.ДатаДокумента,
	|	ВТ_ПрослеживаемостьПредварительная.ОтражениеВОтчетности,
	|	ВТ_ПрослеживаемостьПредварительная.ПериодОперации,
	|	ВТ_ПрослеживаемостьПредварительная.Контрагент,
	|	ВТ_ПрослеживаемостьПредварительная.Комитент,
	|	ВТ_ПрослеживаемостьПредварительная.ВидЗапасов,
	|	ВТ_ПрослеживаемостьПредварительная.ЭтоЗакупкаДляКомитента,
	|	ВТ_ПрослеживаемостьПредварительная.ИдентификаторСтроки";
	
	// Шаблон запроса для сбора временной таблицы ВТ_СуммыБезНДСПредварительная.
	// Суммы без НДС необходимы для отчета об операциях и для регистрации 
	// прослеживаемого товара к получению РНПТ при импорте из ЕАЭС.
	ТекстЗапроса = ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	Неопределено КАК Номенклатура,
	|	0 КАК СуммаБезНДС,
	|	Неопределено КАК ЭтоЗакупкаДляКомитента,
	|	"""" КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_СуммыБезНДСПредварительная";
	
	Если Реквизиты.ЕстьТовары Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
		|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
		|	КОНЕЦ КАК СуммаБезНДС,
		|	ЛОЖЬ КАК ЭтоЗакупкаДляКомитента,
		|	ПоступлениеТоваровУслугТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугТовары.ПрослеживаемыйТовар";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ВТ_СуммыБезНДСПредварительная.Номенклатура КАК Номенклатура,
	|	ВТ_СуммыБезНДСПредварительная.СуммаБезНДС КАК СуммаБезНДС,
	|	ВТ_СуммыБезНДСПредварительная.ЭтоЗакупкаДляКомитента КАК ЭтоЗакупкаДляКомитента,
	|	ВТ_СуммыБезНДСПредварительная.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_СуммыБезНДС
	|ИЗ
	|	ВТ_СуммыБезНДСПредварительная КАК ВТ_СуммыБезНДСПредварительная
	|ГДЕ
	|	ВТ_СуммыБезНДСПредварительная.Номенклатура <> НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Прослеживаемость.Номенклатура КАК Номенклатура,
	|	ВТ_Прослеживаемость.Количество КАК Количество,
	|	ВТ_Прослеживаемость.РНПТ КАК РНПТ,
	|	ВТ_Прослеживаемость.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ВТ_Прослеживаемость.ОтражениеВОтчетности КАК ОтражениеВОтчетности,
	|	ВТ_Прослеживаемость.КодОперации КАК КодОперации,
	|	ВТ_Прослеживаемость.ДокументОперации КАК ДокументОперации,
	|	ВТ_Прослеживаемость.Контрагент КАК Контрагент,
	|	ВТ_Прослеживаемость.ПериодОперации КАК ПериодОперации,
	|	ВТ_Прослеживаемость.НомерДокумента КАК НомерДокумента,
	|	ВТ_Прослеживаемость.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_Прослеживаемость.ТипДокументаВПрослеживаемости КАК ТипДокументаВПрослеживаемости,
	|	ЕСТЬNULL(ВТ_СуммыБезНДС.СуммаБезНДС, 0) КАК СуммаБезНДС,
	|	ВТ_Прослеживаемость.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_Прослеживаемость КАК ВТ_Прослеживаемость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыБезНДС КАК ВТ_СуммыБезНДС
	|		ПО ВТ_Прослеживаемость.ИдентификаторСтроки = ВТ_СуммыБезНДС.ИдентификаторСтроки
	|			И ВТ_Прослеживаемость.ЭтоЗакупкаДляКомитента = ВТ_СуммыБезНДС.ЭтоЗакупкаДляКомитента
	|ГДЕ
	|	ВТ_Прослеживаемость.РНПТ <> НЕОПРЕДЕЛЕНО
	|	И НЕ &ЭтоИмпорт
	|	И НЕ &ЭтоКомиссия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Прослеживаемость.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_Прослеживаемость.Количество) КАК Количество,
	|	ВТ_Прослеживаемость.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТ_Прослеживаемость.Комитент КАК Комитент,
	|	ВТ_Прослеживаемость.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	СУММА(ВТ_Прослеживаемость.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|	ВТ_Прослеживаемость.РНПТ КАК РНПТ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ОснованиеДляВозврата
	|ИЗ
	|	ВТ_Прослеживаемость КАК ВТ_Прослеживаемость
	|ГДЕ
	|	ВТ_Прослеживаемость.РНПТ <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Прослеживаемость.Номенклатура,
	|	ВТ_Прослеживаемость.СтранаПроисхождения,
	|	ВТ_Прослеживаемость.Комитент,
	|	ВТ_Прослеживаемость.ВидЗапасов,
	|	ВТ_Прослеживаемость.РНПТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Прослеживаемость.РНПТ КАК РНПТ
	|ИЗ
	|	ВТ_Прослеживаемость КАК ВТ_Прослеживаемость
	|ГДЕ
	|	ВТ_Прослеживаемость.РНПТ <> НЕОПРЕДЕЛЕНО";
	
	Возврат ТекстЗапроса;
	
КонецФункции


//Формирует текст запроса для определения прослеживаемого товара в документе
//
// Параметры:
// ДокументОснование - ДокументСсылка - Документ поступления товаров и услуг
// ДополнительныйРеквизит - Булево - Дополнительный реквизит. не используется в этом модуле
//
// Возвращаемые параметры:
// Строка - Текст сформированного запроса
//
Функция ТекстЗапросаТаблицаПрослеживаемыхТоваровПоОснованию() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслуг.СуммаВключаетНДС
	|				ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК ПериодСобытия,
	|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
	|	СУММА(ВЫБОР
	|			КОГДА НоменклатураСправочник.КодТНВЭД.ЕдиницаИзмерения.Код = ""796""
	|				ТОГДА ПоступлениеТоваровУслугТовары.Количество
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Количество * НоменклатураСправочник.КоэффициентПрослеживаемыхТоваров
	|		КОНЕЦ) КАК КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = НоменклатураСправочник.Ссылка

	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Основание
	|	И ПоступлениеТоваровУслугТовары.ПрослеживаемыйТовар
	|	И ПоступлениеТоваровУслуг.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслуг.Организация,
	|	ПоступлениеТоваровУслуг.Дата,
	|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСправочник.КодТНВЭД КАК ТНВЭД,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Сумма КАК Сумма,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацииПрослеживаемыхТоваров.ВвозТоваровИзЕАЭС) КАК ВидОперации,
	|	ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
	|	ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаТоваров.ЕдиницаИзмерения,
	|	ТаблицаТоваров.КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ВТ_ТоварыПоОснованию
	|ИЗ
	|	ВТ_ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ТаблицаТоваров.Номенклатура = НоменклатураСправочник.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТоваров.Количество КАК Количество,
	|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
	|	ВТ_ТаблицаТоваров.Организация КАК Организация,
	|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
	|	ЛОЖЬ КАК РанееРегистрировалсяВПрослеживаемости,
	|	0 КАК КоличествоУчет,
	|	ВТ_ТаблицаТоваров.ТНВЭД КАК ТНВЭД,
	|	ВТ_ТаблицаТоваров.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТ_ТаблицаТоваров.ЕдиницаИзмерения,
	|	ВТ_ТаблицаТоваров.КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваровРазмеченный
	|ИЗ
	|	ВТ_ТоварыПоОснованию КАК ВТ_ТаблицаТоваров";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

