#Область ПрограмныйИнтерфейс

#Область СерииНоменклатуры

// Добавляет специфичные параметры указания серий для товаров, указанных в форме.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма с товарами, для которой необходимо определить параметры указания серий.
//	ПараметрыУказанияСерий - Структура - дополняемые параметры указания серий.
//
Процедура ДополнитьПараметрыУказанияСерий(Форма, ПараметрыУказанияСерий) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСПрикладнымиДокументами

Процедура ВыбратьВидПродукцииИПроверить(Форма) Экспорт
	
	ДополнительныеПараметры = Новый Структура("Форма", Форма);
	
	ИспользуемыеВидыПродукции = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	
	Если ИспользуемыеВидыПродукции.Количество() > 1 Тогда
		Действие = Новый ОписаниеОповещения("ОткрытьФормуПроверкиПослеВыбораВидаПродукции", ПроверкаИПодборПродукцииИСУТКлиент, ДополнительныеПараметры);
		ОткрытьФорму("ОбщаяФорма.ВыборВидаПродукцииИСУТ",,Форма,,,,Действие,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ИспользуемыеВидыПродукции.Количество() = 1 Тогда 
		ПроверкаИПодборПродукцииИСМПКлиент.ОткрытьФормуПроверкиИПодбора(ДополнительныеПараметры.Форма, ИспользуемыеВидыПродукции[0], Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуПроверкиПослеВыбораВидаПродукции(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено
		Или Результат = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПустаяСсылка")
		Или Результат = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная") Тогда 
		Возврат;
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИСМПКлиент.ОткрытьФормуПроверкиИПодбора(ДополнительныеПараметры.Форма, Результат, Неопределено);
	
КонецПроцедуры

#КонецОбласти

