#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обработчик обновления БЭД 1.1.9.1
// Заполняет дату окончания действия сертификата
//
Процедура ЗаполнитьСрокДействия() Экспорт
	
	Сертификаты = Справочники.СертификатыЭЦП.Выбрать();
	
	Пока Сертификаты.Следующий() Цикл
		
		Попытка
			Сертификат = Сертификаты.ПолучитьОбъект();
			ДанныеСертификата = Сертификат.ФайлСертификата.Получить();
			Если ТипЗнч(ДанныеСертификата) = Тип("ДвоичныеДанные") Тогда
				СертификатКриптографии = Новый СертификатКриптографии(ДанныеСертификата);
				Сертификат.ДатаОкончания = СертификатКриптографии.ДатаОкончания;
				Сертификат.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.1.23.1
// Заполняет дату окончания действия сертификата
//
Процедура ПеренестиОграниченияПоПользователюВСписок() Экспорт
	
	Отбор = Новый Структура("ОграничитьДоступКСертификату", Истина);
	
	Сертификаты = Справочники.СертификатыЭЦП.Выбрать(,, Отбор);
	
	Пока Сертификаты.Следующий() Цикл
		
		Если Сертификаты.СписокПользователей.Количество() = 0 Тогда
			Попытка
				СертификатОбъект = Сертификаты.ПолучитьОбъект();
				НоваяСтрока = СертификатОбъект.СписокПользователей.Добавить();
				НоваяСтрока.Пользователь = СертификатОбъект.УдалитьПользователь;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СертификатОбъект);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#КонецЕсли