#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьКлассификатор(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриПолученииОтветаНаВопросОЗагрузкеКлассификатораФНС_МЧД002",
		ЭтаФорма);
	ЗаголовокВопроса = НСтр("ru = 'Обновление классификатора'");
	ТекстВопроса = НСтр("ru = 'Обновить классификатор полномочий ФНС (МЧД 002) сейчас?'");
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки[0].Значение, ЗаголовокВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриПолученииОтветаНаВопросОЗагрузкеКлассификатораФНС_МЧД002(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКлассификаторНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКлассификаторНаСервере()
	
	ПараметрыОперации = МашиночитаемыеДоверенности.ЗаполнитьПараметрыСинхронизацииКлассификатораПолномочийФНС_МЧД002();
	
	МашиночитаемыеДоверенности.СинхронизироватьКлассификаторПолномочийФНС_МЧД002(ПараметрыОперации);
		
КонецПроцедуры

#КонецОбласти
