///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей"
// ОбщийМодуль.ИнтернетПоддержкаПользователейВызовСервера.
//
// Серверные процедуры и функции Интернет-поддержки пользователей:
//  - определение доступности подключения;
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура записывает из двоичных данных файл обработки в константу.
//
// Параметры:
//	ДвоичныеДанныеОбработки - ДвоичныеДанные - двоичные данные обработки.
//
Процедура ЗаписатьФайлОбработкиВКонстанту(ДвоичныеДанныеОбработки) Экспорт
	
	Если ДвоичныеДанныеОбработки <> Неопределено Тогда 
		Константы.ФайлОбработкиИнтернетПоддержкиПользователей.Установить(Новый ХранилищеЗначения(ДвоичныеДанныеОбработки));
	КонецЕсли;	
	
КонецПроцедуры	

// Функция определеяет версию обработки механизма интернет-поддержки пользователей.
//
// Возвращаемое значение - Неопределено или Строка - версия обработки.
//
Функция ПолучитьВерсиюОбработки() Экспорт
	
	ФайлОбработки = Константы.ФайлОбработкиИнтернетПоддержкиПользователей.Получить().Получить();
	Если ФайлОбработки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Попытка
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
		ФайлОбработки.Записать(ИмяВременногоФайла);
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВременногоФайла);
		Версия = ВнешняяОбработка.ВерсияМеханизмаИнтернетПоддержкиПользователей();
		Возврат Версия;
	Исключение
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с настройками пользователей

// Устанавливает настройку "ПовторитьПопыткуПодключенияПриСтартеПрограммы", которая не позволяет "стучаться" механизму 
// до появления связи.
//
// Параметры:
//	УстанавливатьНастройку - Булево - установить или сбросить "ПовторитьПопыткуПодключенияПриСтартеПрограммы".
//
Процедура УстановитьНастройкуПовторитьПопыткуПодключенияПриСтартеПрограммы(УстанавливатьНастройку) Экспорт 
	
	ХранилищеОбщихНастроек.Сохранить("ИнтернетПоддержкаПользователей", "ПовторитьПопыткуПодключенияПриСтартеПрограммы", УстанавливатьНастройку);
	
КонецПроцедуры	

// Возвращает настройку "ПовторитьПопыткуПодключенияПриСтартеПрограммы".
//
// Возвращаемое значение - Неопределено или Булево - напоминать об отсутствии связи.
//
Функция ПолучитьНастройкуПовторитьПопыткуПодключенияПриСтартеПрограммы() Экспорт
	
	ПовторитьПопыткуПодключенияПриСтартеПрограммы = ХранилищеОбщихНастроек.Загрузить("ИнтернетПоддержкаПользователей", "ПовторитьПопыткуПодключенияПриСтартеПрограммы");
	
	Возврат ?(ПовторитьПопыткуПодключенияПриСтартеПрограммы = Неопределено, Истина, ПовторитьПопыткуПодключенияПриСтартеПрограммы);
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура получает, если есть логин и пароль из инетрнет-поддрежки пользователей.
//
// Параметры:
//	Логин - Строка - логин.
//	Пароль - Строка - пароль.
//
Процедура ЗагрузкаЛогинаИПароляИзПараметровИнтернетПоддержкиПользователей(Логин = "", Пароль = "") Экспорт
	
	Фильтр = Новый Структура("Имя", "login");
	Выборка = РегистрыСведений.ПараметрыИнтернетПоддержкиПользователей.Выбрать(Фильтр);
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.БизнесПроцесс) Тогда 
			Логин = Выборка.Значение;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Фильтр = Новый Структура("Имя", "password");
	Выборка = РегистрыСведений.ПараметрыИнтернетПоддержкиПользователей.Выбрать(Фильтр);
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.БизнесПроцесс) Тогда 
			Пароль = Выборка.Значение;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

// Процедура записывает в журнал регистрации код ошибки.
//
// Параметры:
//	КодОшибки - Строка - код ошибки.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(Ошибка) Экспорт
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрацииИнтернетПоддержкаПользователейОшибка(),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		Ошибка);
	
КонецПроцедуры

// Возвращает код основного языка конфигурации. Используется для записи событий
// в журнал регистрации. Для определения кода основного языка используется
// процедура
// ИнтернетПоддержкаПользователейСерверПереопределяемый.ПриОпределенииКодаОсновногоЯзыкаКонфигурации()
// Если переопределяемой процедурой возвращен некорректный код языка, тогда в
// качестве кода принимается значение Метаданные.ОсновнойЯзык.КодЯзыка.
//
// Возвращаемое значение:
//	Строка - код основного языка конфигурации.
//
Функция КодОсновногоЯзыкаКонфигурации()
	
	КодЯзыка = Неопределено;
	ИнтернетПоддержкаПользователейСерверПереопределяемый.ПриОпределенииКодаОсновногоЯзыкаКонфигурации(КодЯзыка);
	
	Если ТипЗнч(КодЯзыка) <> Тип("Строка") Тогда
		КодЯзыка = Метаданные.ОсновнойЯзык.КодЯзыка;
	КонецЕсли;
	
	Возврат КодЯзыка;
	
КонецФункции

// Возвращается имя события журнала регистрации для записи ошибок
// интернет-поддержки пользователей.
//
// Возвращаемое значение:
//	Строка - имя события ошибки интернет-поддержки.
//
Функция СобытиеЖурналаРегистрацииИнтернетПоддержкаПользователейОшибка()
	
	Возврат НСтр("ru = 'Интернет-поддержка пользователей.Ошибка'", КодОсновногоЯзыкаКонфигурации());
	
КонецФункции

// Возвращает запускать или нет механизм или нет.
// 
// Возвращаемое значение - Булево - Истина, если запускать, Ложь - иначе.
//
Функция ЗапускатьМеханизмПриСтарте() Экспорт
	
	ПовторитьПопыткуПодключенияПриСтартеПрограммы	= ХранилищеОбщихНастроек.Загрузить("ИнтернетПоддержкаПользователей", "ПовторитьПопыткуПодключенияПриСтартеПрограммы");
	ПовторитьПопыткуПодключенияПриСтартеПрограммы	= ?(ПовторитьПопыткуПодключенияПриСтартеПрограммы = Неопределено, Истина, ПовторитьПопыткуПодключенияПриСтартеПрограммы);
	ВсегдаПоказыватьПриСтартеПрограммы				= ХранилищеОбщихНастроек.Загрузить("ИнтернетПоддержкаПользователей", "ВсегдаПоказыватьПриСтартеПрограммы");
	ВсегдаПоказыватьПриСтартеПрограммы				= ?(ВсегдаПоказыватьПриСтартеПрограммы= Неопределено, Истина, ВсегдаПоказыватьПриСтартеПрограммы);
	
	Возврат ПовторитьПопыткуПодключенияПриСтартеПрограммы и ВсегдаПоказыватьПриСтартеПрограммы;
	
КонецФункции

// Процедура сохранения стартовых параметров в регистре сведений
// при запуске механизма
//
// Параметры
// СтруктураСтартовыхПараметров - структура Ключ - имя параметра
//                                значение - значение параметра во временном хранилище
// ОбластьВидимости - область видимости параметра
Процедура СохранитьСтартовыеПараметры(СтруктураСтартовыхПараметров, ОбластьВидимости) Экспорт
	
	Для каждого ЭлементСтруктуры Из СтруктураСтартовыхПараметров Цикл
	
		Запись = РегистрыСведений.ПараметрыИнтернетПоддержкиПользователей.СоздатьМенеджерЗаписи();
		Запись.Имя              = ЭлементСтруктуры.Ключ;
		Запись.Значение         = ЗначениеВСтрокуВнутр(ПолучитьИзВременногоХранилища(ЭлементСтруктуры.Значение));
		Запись.Пользователь     = "00000000-0000-0000-0000-000000000000";
		Запись.ОбластьВидимости = ОбластьВидимости;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение: Булево: Истина - платформа поддерживает таймауты сети,
//	Ложь - в противном случае
//
Функция ИспользоватьТаймаутыПриПодключении(Таймаут = Неопределено) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПриложения = СистемнаяИнформация.ВерсияПриложения;
	
	КоличествоСимволов = СтрДлина(ВерсияПриложения);
	ВерсияСтрокой       = "";
	Подверсия           = "";
	КоличествоПодверсий = 0;
	Для Итератор = 1 По КоличествоСимволов Цикл
		ТекущийСимвол = Сред(ВерсияПриложения, Итератор, 1);
		Если ТекущийСимвол <> "." Тогда
			Подверсия = Подверсия + ТекущийСимвол;
		Иначе
			ВерсияСтрокой = ВерсияСтрокой + Прав("0000" + Подверсия, 4);
			Подверсия     = "";
			КоличествоПодверсий = КоличествоПодверсий + 1;
			Если КоличествоПодверсий > 2 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат = (ВерсияСтрокой > "000800020016");
	
	Если Результат Тогда
		УстановитьПривилегированныйРежим(Истина);
		Таймаут = Константы.ТаймаутПодключенияКСервисуИнтернетПоддержки.Получить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
#Область ПрочиеСлужебныеПроцедурыИФункции

// См. ИнтернетПоддержкаПользователей.СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта.
//
Функция СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(Знач URLСтраницыСайта) Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(URLСтраницыСайта);	// ***
	
КонецФункции

#КонецОбласти

#КонецОбласти
