////////////////////////////////////////////////////////////////////////////////
// ЭлектронныеДокументы: механизм обмена электронными документами.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выводит сообщение о наличии новыйх электронный документов
// в сервисе 1с ЭДО.
Процедура ОповеститьОНовыхЭД() Экспорт
	
	ЕстьНовыеСобытия = ЭлектронныеДокументыСлужебныйВызовСервера.ЕстьСобытияЭДО();
	
	Если ЕстьНовыеСобытия Тогда
		
		ЭлектронныеДокументыКлиент.ОповеститьОНовыхДокументахЭДО();
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОповеститьОНовыхЭД", 3600, Истина);
	
КонецПроцедуры
