
// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ

// Обработчик обновления
//
// Устанавливает новый код вида операции для сводных счетов-фактур по комиссии
Процедура УстановитьКодВидаОперацииСводныйКомиссионный() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК Ссылка,
	|	""27"" КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.КодВидаОперации = ""27""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодУстановлен
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	(СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|			ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный))
	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураПолученный.СводныйКомиссионный = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка,
	|	""28"",
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.КодВидаОперации = ""28""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураПолученный.СводныйКомиссионный = ИСТИНА
	|ИТОГИ
	|	СУММА(КодУстановлен)
	|ПО
	|	ОБЩИЕ";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтоги.Следующий()
		И ВыборкаИтоги.КодУстановлен = 0 Тогда
		ВыборкаДокументы = ВыборкаИтоги.Выбрать();
		Пока ВыборкаДокументы.Следующий() Цикл
			СчетФактураДокумент = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
			СчетФактураДокумент.КодВидаОПерации = ВыборкаДокументы.КодВидаОперации;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетФактураДокумент);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

// Обработчик обновления. Заполняет новый реквизит "КодВидаОперацииНаУменьшение" 
// для корректировочных счетов-фактур дата которых больше или равна 1 января 2015 года
Процедура УстановитьКодВидаОперацииНаУменьшение() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|	И СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|	И СчетФактураПолученный.Дата >= ДАТАВРЕМЯ(2015, 1, 1)
	|	И СчетФактураПолученный.КодВидаОперацииНаУменьшение = """"";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбрабатываемыйСчетФактура = Выборка.Ссылка;
			СчетФактураДокумент = ОбрабатываемыйСчетФактура.ПолучитьОбъект();
			
			СчетФактураДокумент.КодВидаОперацииНаУменьшение = "18";
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетФактураДокумент);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры


Функция ТекстЗапросаПрослеживаемость(НомераТаблиц, ПараметрыПроведения, Реквизиты) Экспорт
	
	Если Реквизиты.СуммаНДСДокумента <> 0 
		ИЛИ Не Реквизиты.ВедетсяУчетПрослеживаемыхТоваров Тогда
		ПараметрыПроведения.Вставить("ВТ_ОперацииСПрослеживаемымиТоварами", Неопределено);
		ПараметрыПроведения.Вставить("СторноПрослеживаемыеОперации",      Неопределено);
		ПараметрыПроведения.Вставить("ПрослеживаемыеОперации",            Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_ОперацииСПрослеживаемымиТоварами", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СторноПрослеживаемыеОперации",      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрослеживаемыеОперации",            НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Период КАК Период,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Регистратор КАК Регистратор,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.НомерСтроки КАК НомерСтроки,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Активность КАК Активность,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Организация КАК Организация,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.ОтражениеВОтчетности КАК ОтражениеВОтчетности,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.ПериодОперации КАК ПериодОперации,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.РНПТ КАК РНПТ,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.ДокументОперации КАК ДокументОперации,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Контрагент КАК Контрагент,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.Количество КАК Количество,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.СуммаБезНДС КАК СуммаБезНДС,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.ТипДокументаВПрослеживаемости КАК ТипДокументаВПрослеживаемости,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.НомерДокумента КАК НомерДокумента,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.ДатаДокумента КАК ДатаДокумента,
	|	ОперацииСПрослеживаемымиТоварамиСрезПоследних.КодОперации КАК КодОперации
	|ПОМЕСТИТЬ ВТ_ОперацииСПрослеживаемымиТоварами
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСПрослеживаемымиТоварами.СрезПоследних(
	|				&ДатаОтраженияВПрослеживаемости,
	|				Организация = &Организация
	|					И ОтражениеВОтчетности = ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.ОтчетОбОперациях)
	|					И Регистратор <> &Ссылка) КАК ОперацииСПрослеживаемымиТоварамиСрезПоследних
	|		ПО СчетФактураПолученныйДокументыОснования.ДокументОснование = ОперацииСПрослеживаемымиТоварамиСрезПоследних.Регистратор
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка = &Ссылка
	|	И (&ПлательщикНДС
	|			ИЛИ ОперацииСПрослеживаемымиТоварамиСрезПоследних.КодОперации = ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПриобретениеТовараДляКомитента))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Организация КАК Организация,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.ОтражениеВОтчетности КАК ОтражениеВОтчетности,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.ПериодОперации КАК ПериодОперации,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.РНПТ КАК РНПТ,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.ДокументОперации КАК ДокументОперации,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Контрагент КАК Контрагент,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Номенклатура КАК Номенклатура,
	|	0 КАК Количество,
	|	0 КАК КоличествоПрослеживаемости,
	|	0 КАК СуммаБезНДС,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.ТипДокументаВПрослеживаемости КАК ТипДокументаВПрослеживаемости,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.НомерДокумента КАК НомерДокумента,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.КодОперации КАК КодОперации
	|ИЗ
	|	ВТ_ОперацииСПрослеживаемымиТоварами КАК ВТ_ОперацииСПрослеживаемымиТоварами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТ_ОперацииСПрослеживаемымиТоварами.КодОперации = ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПриобретениеТовараДляКомитента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.ЖурналСФ)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.КнигаПокупок)
	|	КОНЕЦ КАК ОтражениеВОтчетности,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.ПериодОперации КАК ПериодОперации,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.РНПТ КАК РНПТ,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Регистратор КАК ДокументОперации,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Контрагент КАК Контрагент,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Номенклатура КАК Номенклатура,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.Количество КАК Количество,
	|	ВТ_ОперацииСПрослеживаемымиТоварами.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	НЕОПРЕДЕЛЕНО КАК СуммаБезНДС,
	|	НЕОПРЕДЕЛЕНО КАК ТипДокументаВПрослеживаемости,
	|	НЕОПРЕДЕЛЕНО КАК НомерДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК КодОперации
	|ИЗ
	|	ВТ_ОперацииСПрослеживаемымиТоварами КАК ВТ_ОперацииСПрослеживаемымиТоварами";
	
	Возврат ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
	
КонецФункции


