&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначениеКопирования.Пустая() = Ложь 
		И Параметры.ЗначениеКопирования.ЭтоВходящий = Истина Тогда
        Отказ = Истина; 
        СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ФормаБезОбработки") Тогда
				
		ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтаФорма, Отказ, СтандартнаяОбработка);

		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбменСГИСЭПД.ЗаполнитьТаблицуВерсийТитулов(Объект.Ссылка, Объект.Организация, ВерсииТитулов);
			ОбменСГИСЭПД.ЗаполнитьТаблицуЗначенийРеквизитов(Объект.Ссылка, Объект.Организация, СтруктураРеквизитов);
		Иначе
			ОбменСГИСЭПД.ЗаполнитьТаблицуЗначенийРеквизитовПоПараметрамФормы(Параметры, СтруктураРеквизитов);	
		КонецЕсли;

		ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЛ(ЭтаФорма);
		
		ЦветВыделенияУчастника = ЦветаСтиля.ЦветВыделенияУчастникаЭПД;
		ОрганизацияОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Организации"));
		КонтрагентОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Контрагенты"));
		Если Объект.ЭтоВходящий = Ложь Тогда	
			Элементы.СсылкаТитулОформлениеОформитель.ОграничениеТипа = ОрганизацияОписаниеТипов;
			Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеОформитель) = Ложь Тогда
				Элементы.СсылкаТитулОформлениеОформитель.ОграничениеТипа = ОрганизацияОписаниеТипов;	
				Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеОформитель) = Ложь Тогда
					Объект.СсылкаТитулОформлениеОформитель = ОбменСГИСЭПД.ОрганизацияПоУмолчанию();
					ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элементы.СсылкаТитулОформлениеОформитель, ЭтаФорма);
				КонецЕсли;
			КонецЕсли;					
			
			Элементы.СсылкаТитулОформлениеМедорганизация.ОграничениеТипа = КонтрагентОписаниеТипов;
			Элементы.СсылкаТитулОформлениеТехконтроль.ОграничениеТипа = КонтрагентОписаниеТипов;
			Элементы.СсылкаТитулОформлениеПоказанияОдометра.ОграничениеТипа = КонтрагентОписаниеТипов;
					
			МассивЭлементов = Новый Массив;
			МассивЭлементов.Добавить(Элементы.СсылкаТитулОформлениеОформитель);
			ОбменСГИСЭПДКлиентСервер.ПоказатьОшибкиПоКонтрагентам(ЭтаФорма, МассивЭлементов);
			
			Элементы.ГруппаРеквизитаТитулОформлениеНомерПутевогоЛиста.Видимость = Ложь;
			Элементы.ЗаголовокНомер.Заголовок = "Номер";
			
			Элементы.ГруппаРеквизитаСсылкаТитулОформлениеОформитель.ЦветФона = ЦветВыделенияУчастника;
		Иначе
			Элементы.ГруппаРеквизитаНомер.Видимость = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеМедорганизация)
		И Объект.СсылкаТитулОформлениеМедорганизация <> Объект.СсылкаТитулОформлениеОформитель Тогда
			ВариантМедосмотр = 1;
			ВариантМедработник = 1;
			ВариантМедработникПосле = 1;
			Элементы.ВариантМедработник.Доступность = Ложь;
			Элементы.ВариантМедработникПосле.Доступность = Ложь;			
			Если Объект.Организация = Объект.СсылкаТитулОформлениеМедорганизация Тогда
				Элементы.ВариантМедосмотр.Видимость = Ложь;
				Элементы.ГруппаРеквизитаВариантМедосмотр.ЦветФона = ЦветВыделенияУчастника;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеТехконтроль)
		И Объект.СсылкаТитулОформлениеТехконтроль <> Объект.СсылкаТитулОформлениеОформитель Тогда
			ВариантТехконтроль = 1;	
			Если Объект.Организация = Объект.СсылкаТитулОформлениеТехконтроль Тогда
				Элементы.ВариантТехконтроль.Видимость = Ложь;
				Элементы.ГруппаРеквизитаВариантТехконтроль.ЦветФона = ЦветВыделенияУчастника;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеПоказанияОдометра)
		И Объект.СсылкаТитулОформлениеПоказанияОдометра <> Объект.СсылкаТитулОформлениеОформитель Тогда
			ВариантПоказанияОдометра = 1;	
			Если Объект.Организация = Объект.СсылкаТитулОформлениеПоказанияОдометра Тогда
				Элементы.ВариантПоказанияОдометра.Видимость = Ложь;
				Элементы.ГруппаРеквизитаВариантПоказанияОдометра.ЦветФона = ЦветВыделенияУчастника;
			КонецЕсли;	
		КонецЕсли;
		
		Если Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1 Тогда
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулОформлениеТранспортноеСредство) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулОформлениеТранспортноеСредство.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;		
		ИначеЕсли Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2 Тогда
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулМедосмотрШтатныйМедработник) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулМедосмотрШтатныйМедработник.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулМедосмотрСтороннийМедработник) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулМедосмотрСтороннийМедработник.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулМедосмотрВодитель) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулМедосмотрВодитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
		ИначеЕсли Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3 Тогда
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулВыпускТранспортноеСредство) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулВыпускТранспортноеСредство.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТС) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТС.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
		ИначеЕсли Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул4 Тогда
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанных) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанных.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
		ИначеЕсли Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул5 Тогда
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанных) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанных.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
		ИначеЕсли Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6 Тогда
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ХранимыеДанныеТитулМедосмотрПослеВодитель) = Ложь Тогда
				Элементы.ХранимыеДанныеТитулМедосмотрПослеВодитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ХранимыеДанныеЭПД");
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
		
		УстановитьТекущийШагПомощника();
		
		ЗаполнитьПредставленияАдресов();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторОтправителя()

	Результат = Неопределено;
	
	ТипОрганизация = ОбменСГИСЭПДВызовСервера.ПолучитьТипОрганизация();
	Если ТипЗнч(Объект.СсылкаТитулОформлениеМедорганизация) = ТипОрганизация Тогда
		Результат = Объект.ИдентификаторМедорганизации;
	ИначеЕсли ТипЗнч(Объект.СсылкаТитулОформлениеТехконтроль) = ТипОрганизация Тогда
		Результат = Объект.ИдентификаторТехконтроль;
	ИначеЕсли ТипЗнч(Объект.СсылкаТитулОформлениеПоказанияОдометра) = ТипОрганизация Тогда
		Результат = Объект.ИдентификаторПоказанияОдометра;
	Иначе
		Результат = Объект.ИдентификаторОформителя;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НеТребуетсяИдентификацияФайла") = Ложь Тогда
		ЗаполнитьУчастников();
		ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		ЗаполнитьИдентификациюФайлаОбмена(ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя());	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ТекущийТитул) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	
	Если ИнформацияПоПрефиксамТитула.ВПрограмме = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерВерсии = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
		ИнформацияПоПрефиксамТитула.ВПрограмме + "НомерВерсии", 0);
	
	Если ПараметрыЗаписи.Свойство("НеДобавлятьВерсию") = Ложь Тогда
		// Запишем версию при необходимости
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НомерВерсии", НомерВерсии);
		
		ИдентификаторФайлаВерсии = Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторФайла"];
		
		ДатаВерсии = Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ДатаФормированияФайла"]
						+ 60 * 60 * Час(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]) 
						+ 60 * Минута(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]) 
						+ Секунда(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]);
		
		ЭтоНоваяВерсия = Истина;
		Для Каждого СтрокаВерсии Из ВерсииТитулов Цикл
			Если СтрокаВерсии.Титул = ТекущийОбъект.ТекущийТитул 
			И СтрокаВерсии.НомерВерсии = НомерВерсии Тогда
				СтрокаВерсии.ИдентификаторФайла = ИдентификаторФайлаВерсии;	
				ЭтоНоваяВерсия = Ложь;
			КонецЕсли;	
		КонецЦикла;
	
		Если ЭтоНоваяВерсия = Истина Тогда
			НовСтрокаВерсии = ВерсииТитулов.Добавить();
			НовСтрокаВерсии.ДатаВерсии = ДатаВерсии;
			Если НовСтрокаВерсии.ДатаВерсии = Дата(1,1,1) Тогда
				НовСтрокаВерсии.ДатаВерсии = ТекущаяДатаСеанса();
			КонецЕсли;
			НовСтрокаВерсии.ИдентификаторФайла = ИдентификаторФайлаВерсии;
			НовСтрокаВерсии.НомерВерсии = НомерВерсии;
			НовСтрокаВерсии.Титул = ТекущийОбъект.ТекущийТитул;		
		КонецЕсли;
			
		ВерсияТитула = Новый Структура;
		ВерсияТитула.Вставить("НомерВерсии", НомерВерсии);
		ВерсияТитула.Вставить("ИдентификаторФайла", ИдентификаторФайлаВерсии);
		ВерсияТитула.Вставить("Титул", ТекущийОбъект.ТекущийТитул);
		ВерсияТитула.Вставить("ДатаВерсии", ДатаВерсии);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ВерсияТитула", ВерсияТитула);
	КонецЕсли;
	
	МассивВерсийТитула = Неопределено;
	СтруктураРеквизитов.Свойство(ИнформацияПоПрефиксамТитула.ВПрограмме, МассивВерсийТитула);
	Если МассивВерсийТитула <> Неопределено Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СтруктураРеквизитов", МассивВерсийТитула[Мин(НомерВерсии, МассивВерсийТитула.ВГраница())]);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ДокументыЭПД", Объект.Ссылка);
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЭлектронныйДокумент(Команда)
	
	ОбменСГИСЭПДКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусаОшибкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОписаниеОшибки" Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ОткрытьОписаниеОшибки(Объект.Ссылка, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ТекущиеДелаПоЭДО" Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияАдресов(Знач Титул = Неопределено)
	
	Если Титул = Неопределено Тогда
		ПрефиксТитула = ОбменСГИСЭПДКлиентСервер.ПолучитьПрефиксТитулаПоСтраницеОсновнойФормы(Элементы.Страницы.ТекущаяСтраница.Имя, 
			ОбменСГИСЭПДКлиентСервер.ТипДокументаПутевойЛист());	
		Титул = ОбменСГИСЭПДКлиентСервер.ТитулПоПрефиксу("Документ.ЭлектронныйПутевойЛист", ПрефиксТитула);
	КонецЕсли;
	
	Если Титул = Неопределено Или Титул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1 Тогда
		ОбменСГИСЭПДКлиентСервер.ЗаполнитьПредставлениеАдреса("ПредставлениеТитулОформлениеАдресМестаОтправления", ЭтаФорма);
	КонецЕсли;
	
	Если Объект.ТекущийТитул = Перечисления.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1 Тогда
		ОбменСГИСЭПДКлиентСервер.ЗаполнениеСпискаСохраненныхАдресов(ЭтаФорма, 
						Объект.СсылкаТитулОформлениеОформитель,
						Элементы.ПредставлениеТитулОформлениеАдресМестаОтправления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДО(Команда)
	
	ЭтаФорма.Доступность = Ложь;
		
	Если ИзмененСоставУчастников = Истина
		Или ЗначениеЗаполнено(Объект.ИдентификаторОформителя) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторМедорганизации) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторТехконтроль) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторПоказанияОдометра) = Ложь
		Тогда
		ЗаполнитьУчастников(Истина);
	Иначе
		ОтправитьЧерезЭДОПослеЗаписи();
  	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьУчастников();
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ЗаполнитьИдентификациюФайлаОбмена(ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя());
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяОшибка(Команда)
	
	ОбменСГИСЭПДКлиент.НавигацияПоОшибкамЗаполнения(ЭтаФорма, 
													ОшибкиЗаполнения, 
													Элементы.ОшибкиЗаполнения.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяОшибка(Команда)
	
	ОбменСГИСЭПДКлиент.НавигацияПоОшибкамЗаполнения(ЭтаФорма, 
													ОшибкиЗаполнения, 
													Элементы.ОшибкиЗаполнения.ТекущаяСтрока,
													Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЗаполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ОшибкиЗаполнения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЭтаФорма.ПереходыПоОшибкам = ТекущиеДанные.Описание.Переходы;
	ОбменСГИСЭПДКлиент.ПоказатьОшибкуЗаполнения(ЭтаФорма, ТекущиеДанные, ИдентификаторОтправителя());

КонецПроцедуры

&НаКлиенте
Процедура НадписьОшибкиЗакрытьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗакрытьОшибки" Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.ГруппаОшибки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула(ТитулЗаполнения = Неопределено)
	
	Если ТитулЗаполнения = Неопределено Тогда
		ТитулЗаполнения = Объект.ТекущийТитул;
	КонецЕсли;
	
	КонтейнерОтображаемойВерсии = Неопределено;
	
	Если (ЗначениеЗаполнено(Объект.Ссылка) = Ложь 
		Или ТитулЗаполнения = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1")) Тогда
				
		Если ЗначениеЗаполнено(Объект.ВидДокумента) = Ложь Тогда
			Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыЭД.ЭПЛ");
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеДатаПутевогоЛиста", 
			ТекущаяДатаСеанса(), 
			Ложь, КонтейнерОтображаемойВерсии);
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеПризнакНачалаРейса", 
			"1", 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеОбязательностьМедОсмотраПосле", 
			"2", 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеСведенияОВидеПеревозки", 
			"СН", 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеОформительСтатус", 
			"1", 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеПризнакФормированияПутевогоЛистаНаОдинДень", 
			"1", 
			Ложь, КонтейнерОтображаемойВерсии);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И ТитулЗаполнения = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2") Тогда
			
		Отправки = ОбменСГИСЭПДВызовСервера.ПолучитьТитулыПоДокументу(Объект.Ссылка);
		Медосмотры = Отправки.Получить(ТитулЗаполнения);
		КоличествоМедосмотров = 0;
		КоличествоНезавершенных = 0;
		Если Медосмотры <> Неопределено Тогда
			Для Каждого СтруктураМедосмотр Из Медосмотры Цикл
				Если СтруктураМедосмотр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭД.ПереданОператору") Тогда
					КоличествоМедосмотров = КоличествоМедосмотров + 1;	
				ИначеЕсли СтруктураМедосмотр.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭД.Получен") Тогда
					КоличествоНезавершенных = КоличествоНезавершенных + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Отбор = Новый Структура("Титул", ТитулЗаполнения);
		СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
		
		ТекущееЗначениеВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулМедосмотр");
		
		// Если есть незавершенные переключимся на версию, следующую за крайней отправленной
		Если КоличествоНезавершенных > 0 Тогда
			НовоеТекущееЗначениеВерсии = КоличествоМедосмотров;
			
			ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулМедосмотр", 
														НовоеТекущееЗначениеВерсии - ТекущееЗначениеВерсии);	
		Иначе
			КоличествоВодителей = ОбменСГИСЭПДКлиентСервер.ПолучитьКоличествоСтрокТаблицыИзСтруктурыФормы(ЭтаФорма, "ТитулОформлениеВодители");
			// Версий меньше, чем количество водителей - добавим
			Если КоличествоВодителей > СтрокиВерсий.Количество() Тогда
				НовоеТекущееЗначениеВерсии = КоличествоМедосмотров;
				
				Если НовоеТекущееЗначениеВерсии > СтрокиВерсий.Количество() - 1 Тогда
					СтрокаНовойВерсии = ВерсииТитулов.Добавить();
					СтрокаНовойВерсии.Титул = ТитулЗаполнения;
					СтрокаНовойВерсии.НомерВерсии = НовоеТекущееЗначениеВерсии;
				КонецЕсли;	
				ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулМедосмотр", 
															НовоеТекущееЗначениеВерсии - ТекущееЗначениеВерсии);
				ТекущееЗначениеВерсии = НовоеТекущееЗначениеВерсии;
			КонецЕсли;
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулМедосмотрНомерВерсии", 
			ТекущееЗначениеВерсии, 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулМедосмотрДатаИВремяПроведения", 
			ТекущаяДатаСеанса(), 
			Ложь, КонтейнерОтображаемойВерсии);
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулМедосмотрОтметкаОРезультатеПроведения", 
			"Прошел предсменный медицинский осмотр, к исполнению трудовых обязанностей допущен", 
			Ложь, КонтейнерОтображаемойВерсии);
		
		Водитель = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
									"ТитулОформлениеВодители__" + Строка(ТекущееЗначениеВерсии + 1) + "__ХранимыеДанныеВодитель");
		
		Если ТипЗнч(Водитель) = Тип("Строка") Тогда
			Элементы.ХранимыеДанныеТитулМедосмотрВодитель.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ХранимыеДанныеТитулМедосмотрВодитель", 
			Водитель, 
			Ложь, КонтейнерОтображаемойВерсии);
		
		ОбменСГИСЭПДКлиентСервер.СкопироватьРеквизитыВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеВодители__" + Строка(ТекущееЗначениеВерсии + 1) + "__", 
			"ТитулМедосмотрВодитель");
			
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И ТитулЗаполнения = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3") Тогда
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыпускДатаИВремяПредрейсовогоКонтроля", 
			ТекущаяДатаСеанса(), 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыпускДатаИВремяВыпускаНаЛинию", 
			ТекущаяДатаСеанса(), 
			Ложь, КонтейнерОтображаемойВерсии);
			
		Транспорт = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
																"ХранимыеДанныеТитулОформлениеТранспортноеСредство");
		
		Если ТипЗнч(Транспорт) = Тип("Строка") Тогда
			Элементы.ХранимыеДанныеТитулВыпускТранспортноеСредство.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ХранимыеДанныеТитулВыпускТранспортноеСредство", 
			Транспорт, 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.СкопироватьРеквизитыВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеТранспортноеСредство", 
			"ТитулВыпускТранспортноеСредство");
			
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И ТитулЗаполнения = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул4") Тогда
				
		ПризнакНачалаРейса = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
																				"ТитулОформлениеПризнакНачалаРейса");
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыездПризнакНачалаРейса", 
			ПризнакНачалаРейса, 
			Ложь, КонтейнерОтображаемойВерсии);
			
		Если ТитулВыездПризнакНачалаРейса = "1" Тогда
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
				"ТитулВыездДатаИВремяВыезда", 
				ТекущаяДатаСеанса(), 
				Ложь, КонтейнерОтображаемойВерсии);
		ИначеЕсли ТитулВыездПризнакНачалаРейса = "2" Тогда
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
				"ТитулВыездДатаИВремяПриема", 
				ТекущаяДатаСеанса(), 
				Ложь, КонтейнерОтображаемойВерсии);	
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, "ТитулВыездПризнакНачалаРейса");
			
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И ТитулЗаполнения = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул5") Тогда
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулЗаездПризнакОкончанияРейса", 
			"1", 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ПризнакНачалаРейса = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
			"ТитулЗаездПризнакОкончанияРейса",,
			КонтейнерОтображаемойВерсии);
			
		Если ПризнакНачалаРейса = "1" Тогда
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
				"ТитулЗаездДатаИВремяЗаезда", 
				ТекущаяДатаСеанса(), 
				Ложь, КонтейнерОтображаемойВерсии);
		ИначеЕсли ПризнакНачалаРейса = "2" Тогда
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
				"ТитулЗаездДатаИВремяСдачи", 
				ТекущаяДатаСеанса(), 
				Ложь, КонтейнерОтображаемойВерсии);	
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, "ТитулЗаездПризнакОкончанияРейса");
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка)
		И ТитулЗаполнения = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6") Тогда
			
		Отправки = ОбменСГИСЭПДВызовСервера.ПолучитьТитулыПоДокументу(Объект.Ссылка);
		Медосмотры = Отправки.Получить(ТитулЗаполнения);
		КоличествоМедосмотров = 0;
		КоличествоНезавершенных = 0;
		Если Медосмотры <> Неопределено Тогда
			Для Каждого СтруктураМедосмотр Из Медосмотры Цикл
				Если СтруктураМедосмотр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭД.ПереданОператору") Тогда
					КоличествоМедосмотров = КоличествоМедосмотров + 1;	
				ИначеЕсли СтруктураМедосмотр.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭД.Получен") Тогда
					КоличествоНезавершенных = КоличествоНезавершенных + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Отбор = Новый Структура("Титул", ТитулЗаполнения);
		СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
		
		ТекущееЗначениеВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулМедосмотрПосле");
		
		// Если есть незавершенные переключимся на версию, следующую за крайней отправленной
		Если КоличествоНезавершенных > 0 Тогда
			НовоеТекущееЗначениеВерсии = КоличествоМедосмотров;
			
			ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулМедосмотрПосле", 
														НовоеТекущееЗначениеВерсии - ТекущееЗначениеВерсии);	
		Иначе
			КоличествоВодителей = ОбменСГИСЭПДКлиентСервер.ПолучитьКоличествоСтрокТаблицыИзСтруктурыФормы(ЭтаФорма, "ТитулОформлениеВодители");
			// Версий меньше, чем количество водителей - добавим
			Если КоличествоВодителей > СтрокиВерсий.Количество() Тогда
				НовоеТекущееЗначениеВерсии = КоличествоМедосмотров;
				
				Если НовоеТекущееЗначениеВерсии > СтрокиВерсий.Количество() - 1 Тогда
					СтрокаНовойВерсии = ВерсииТитулов.Добавить();
					СтрокаНовойВерсии.Титул = ТитулЗаполнения;
					СтрокаНовойВерсии.НомерВерсии = НовоеТекущееЗначениеВерсии;
				КонецЕсли;	
				ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулМедосмотрПосле", 
															НовоеТекущееЗначениеВерсии - ТекущееЗначениеВерсии);
				ТекущееЗначениеВерсии = НовоеТекущееЗначениеВерсии;
			КонецЕсли;
		КонецЕсли;
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
				"ТитулМедосмотрПослеНомерВерсии", 
				ТекущееЗначениеВерсии, 
				Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
				"ТитулМедосмотрПослеДатаИВремяПроведения", 
				ТекущаяДатаСеанса(), 
				Ложь, КонтейнерОтображаемойВерсии);	
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулМедосмотрПослеОтметкаОРезультатеПроведения", 
			"Прошел послерейсовый медицинский осмотр", 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ТекущееЗначениеВерсии = Неопределено;
		ОтображаемыеВерсииТитулов.Свойство("ТитулМедосмотрПосле", ТекущееЗначениеВерсии);
		
		Водитель = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
									"ТитулОформлениеВодители__" + Строка(ТекущееЗначениеВерсии + 1) + "__ХранимыеДанныеВодитель");
		
		Если ТипЗнч(Водитель) = Тип("Строка") Тогда
			Элементы.ХранимыеДанныеТитулМедосмотрПослеВодитель.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		КонецЕсли;

		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ХранимыеДанныеТитулМедосмотрПослеВодитель", 
			Водитель, 
			Ложь, КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.СкопироватьРеквизитыВСтруктуреФормы(ЭтаФорма, 
			"ТитулОформлениеВодители__" + Строка(ТекущееЗначениеВерсии + 1) + "__", 
			"ТитулМедосмотрПослеВодитель");		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастников(ЭтоНастройкаПередОтправкой = Ложь)
	
	МассивНастроек = Новый Массив;
	
	ТипОрганизация = ОбменСГИСЭПДВызовСервера.ПолучитьТипОрганизация();
	Если Объект.ЭтоВходящий = Ложь Тогда
		КлючНастроекОтправкиМед = ОбменСГИСЭПДКлиентСервер.НовыйКлючНастроекОтправки();
		КлючНастроекОтправкиМед.ВидДокумента = Объект.ВидДокумента;
		КлючНастроекОтправкиМед.Отправитель = Объект.СсылкаТитулОформлениеОформитель;
		Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеМедорганизация) Тогда
			КлючНастроекОтправкиМед.Получатель = Объект.СсылкаТитулОформлениеМедорганизация; 	
		Иначе
			КлючНастроекОтправкиМед.Получатель = Объект.СсылкаТитулОформлениеОформитель;
		КонецЕсли;
		МассивНастроек.Добавить(КлючНастроекОтправкиМед);
		
		Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеТехконтроль) Тогда
			КлючНастроекОтправкиТК = ОбменСГИСЭПДКлиентСервер.НовыйКлючНастроекОтправки();
			КлючНастроекОтправкиТК.ВидДокумента = Объект.ВидДокумента;
			КлючНастроекОтправкиТК.Отправитель = Объект.СсылкаТитулОформлениеОформитель;
			КлючНастроекОтправкиТК.Получатель = Объект.СсылкаТитулОформлениеТехконтроль;
			МассивНастроек.Добавить(КлючНастроекОтправкиТК);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеПоказанияОдометра) Тогда
			КлючНастроекОтправкиОД = ОбменСГИСЭПДКлиентСервер.НовыйКлючНастроекОтправки();
			КлючНастроекОтправкиОД.ВидДокумента = Объект.ВидДокумента;
			КлючНастроекОтправкиОД.Отправитель = Объект.СсылкаТитулОформлениеОформитель;
			КлючНастроекОтправкиОД.Получатель = Объект.СсылкаТитулОформлениеПоказанияОдометра;
			МассивНастроек.Добавить(КлючНастроекОтправкиОД);
		КонецЕсли;
	КонецЕсли;
	
	//ПараметрыНастройкиОбменаСКонтрагентом = НастройкиЭДОКлиент.НовыеПараметрыНастройкиОбменаСКонтрагентом();
	//ПараметрыНастройкиОбменаСКонтрагентом.НастройкаОдногоДокумента = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивНастроек", МассивНастроек);
	ДополнительныеПараметры.Вставить("ИндексНастройки", 1);
	//ДополнительныеПараметры.Вставить("ПараметрыНастройкиОбменаСКонтрагентом", ПараметрыНастройкиОбменаСКонтрагентом);
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", Новый Структура);
	ДополнительныеПараметры.Вставить("ИдентификаторОтправителя", ИдентификаторОтправителя());
	ДополнительныеПараметры.Вставить("ЭтоНастройкаПередОтправкой", ЭтоНастройкаПередОтправкой);
	
	ОповещениеОкончаниеНастройки = Новый ОписаниеОповещения("ЗаполнитьУчастников_ПослеНастроек", ЭтаФорма, ДополнительныеПараметры);
	Если МассивНастроек.Количество() > 0 Тогда
		НастройкиОтправки = ОбменСГИСЭПДВызовСервера.НастройкиОтправки(МассивНастроек[0]);
		
		Если НастройкиОтправки = Неопределено Тогда	
			//НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(МассивНастроек[0], ОповещениеОкончаниеНастройки, ПараметрыНастройкиОбменаСКонтрагентом);  
			ЭлектронныеДокументыКлиент.ОбработкаНавигационнойСсылкиВФормеОбъектаИБ(Объект.Ссылка);
		Иначе
			ВыполнитьОбработкуОповещения(ОповещениеОкончаниеНастройки, НастройкиОтправки); 
		КонецЕсли;
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОкончаниеНастройки, НастройкиОтправки); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастников_ПослеНастроек(Настройка, ДополнительныеПараметры) Экспорт
	
	МассивНастроек = Неопределено;
	ДополнительныеПараметры.Свойство("МассивНастроек", МассивНастроек);
	ЕстьНастройки = МассивНастроек <> Неопределено И МассивНастроек.Количество() > 0;
	
	Если ЕстьНастройки = Истина Тогда
		Если Настройка = Неопределено Тогда
			Доступность = Истина;
			Возврат;
		КонецЕсли;
		
		Если Настройка.Отправитель = Объект.СсылкаТитулОформлениеОформитель Тогда
			Объект.ИдентификаторОформителя = Настройка.ИдентификаторОтправителя;
		КонецЕсли;
		
		Если Настройка.Отправитель = Объект.СсылкаТитулОформлениеМедорганизация Тогда
			Объект.ИдентификаторМедорганизации = Настройка.ИдентификаторОтправителя;
		КонецЕсли;
		
		Если Настройка.Отправитель = Объект.СсылкаТитулОформлениеТехконтроль Тогда
			Объект.ИдентификаторТехконтроль = Настройка.ИдентификаторОтправителя;
		КонецЕсли;
		
		Если Настройка.Отправитель = Объект.СсылкаТитулОформлениеПоказанияОдометра Тогда
			Объект.ИдентификаторПоказанияОдометра = Настройка.ИдентификаторОтправителя;
		КонецЕсли;
	
	
		Если Настройка.Получатель = Объект.СсылкаТитулОформлениеОформитель Тогда
			Объект.ИдентификаторОформителя = Настройка.ИдентификаторПолучателя;
		КонецЕсли;
		
		Если Настройка.Получатель = Объект.СсылкаТитулОформлениеМедорганизация Тогда
			Объект.ИдентификаторМедорганизации = Настройка.ИдентификаторПолучателя;
		КонецЕсли;
		
		Если Настройка.Получатель = Объект.СсылкаТитулОформлениеТехконтроль Тогда
			Объект.ИдентификаторТехконтроль = Настройка.ИдентификаторПолучателя;
		КонецЕсли;
		
		Если Настройка.Получатель = Объект.СсылкаТитулОформлениеПоказанияОдометра Тогда
			Объект.ИдентификаторПоказанияОдометра = Настройка.ИдентификаторПолучателя;
		КонецЕсли;
		
		ЭтоНастройкаПередОтправкой = Неопределено;
		ДополнительныеПараметры.Свойство("ЭтоНастройкаПередОтправкой", ЭтоНастройкаПередОтправкой);
		ИндексНастройки = 0;
		
		Если ДополнительныеПараметры <> Неопределено 
		И МассивНастроек <> Неопределено
		И ДополнительныеПараметры.Свойство("ИндексНастройки", ИндексНастройки) = Истина
		И МассивНастроек.ВГраница() >= ИндексНастройки Тогда
			ДополнительныеПараметрыСледующий = Новый Структура;
			Для Каждого КиЗ Из ДополнительныеПараметры Цикл
				ДополнительныеПараметрыСледующий.Вставить(КиЗ.Ключ, КиЗ.Значение);	
			КонецЦикла;
			ДополнительныеПараметрыСледующий.Вставить("ИндексНастройки", ИндексНастройки + 1);
			ОповещениеОкончаниеНастройки = Новый ОписаниеОповещения("ЗаполнитьУчастников_ПослеНастроек", ЭтаФорма, ДополнительныеПараметрыСледующий);
			
			НастройкиОтправкиСледующий = ОбменСГИСЭПДВызовСервера.НастройкиОтправки(МассивНастроек[ИндексНастройки]);	
			Если НастройкиОтправкиСледующий = Неопределено Тогда		
				//НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(МассивНастроек[ИндексНастройки], 
				//													ОповещениеОкончаниеНастройки, 
				//													ДополнительныеПараметры.ПараметрыНастройкиОбменаСКонтрагентом);
				ЭлектронныеДокументыКлиент.ОбработкаНавигационнойСсылкиВФормеОбъектаИБ(Объект.Ссылка);
			Иначе
				ВыполнитьОбработкуОповещения(ОповещениеОкончаниеНастройки, НастройкиОтправкиСледующий);	
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеМедорганизация) = Ложь Тогда
		Объект.ИдентификаторМедорганизации = Объект.ИдентификаторОформителя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеТехконтроль) = Ложь Тогда
		Объект.ИдентификаторТехконтроль = Объект.ИдентификаторОформителя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулОформлениеПоказанияОдометра) = Ложь Тогда
		Объект.ИдентификаторПоказанияОдометра = Объект.ИдентификаторОформителя;
	КонецЕсли;
																		
	ИзмененСоставУчастников = Ложь;
	
	Если ЭтоНастройкаПередОтправкой = Истина
		И ЗначениеЗаполнено(Объект.ИдентификаторОформителя)
		И ЗначениеЗаполнено(Объект.ИдентификаторМедорганизации)
		И ЗначениеЗаполнено(Объект.ИдентификаторТехконтроль)
		И ЗначениеЗаполнено(Объект.ИдентификаторПоказанияОдометра) Тогда
			ОтправитьЧерезЭДОПослеЗаписи();
	Иначе
		ЭтаФорма.Доступность = Истина;
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяФайла(Шаблон, ИдОформителя, ИдМедорганизации, ИдТехконтроль, ИдОдометр, НаличиеДругихПолучателей = Ложь)
	
	#Если Сервер Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	#Иначе
		ТекущаяДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли
	
	Результат = Шаблон;
	Результат = СтрЗаменить(Результат, "ИдОФ", ИдОформителя);
	Результат = СтрЗаменить(Результат, "ИдМО", ИдМедорганизации);
	Результат = СтрЗаменить(Результат, "ИдТК", ИдТехконтроль);
	Результат = СтрЗаменить(Результат, "ИдОД", ИдОдометр);
	Результат = СтрЗаменить(Результат, "GGGGMMDD", Формат(ТекущаяДатаСеанса, "ДФ=ггггММдд"));
	Результат = СтрЗаменить(Результат, "ГУИДФайла", Строка(Новый УникальныйИдентификатор()));
	Результат = СтрЗаменить(Результат, "НалДр", ?(НаличиеДругихПолучателей = Истина, "1", "0"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция УстановитьНомерДокумента()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	
	Возврат ДокументОбъект.Номер;
	
КонецФункции

&НаСервере
Функция ПолучитьПодписьТитулаBase64(ТипЭлементаРегламента) 
	
	ПодписьBase64 = "";
	
	СообщениеТитула = ОбменСГИСЭПД.ПолучитьСообщениеТитула(Объект.Ссылка, ТипЭлементаРегламента);
	
	Если ЗначениеЗаполнено(СообщениеТитула) Тогда
		УстановленныеПодписи = ОбменСГИСЭПД.УстановленныеПодписи(СообщениеТитула);
		Для Каждого ОписаниеПодписи Из УстановленныеПодписи Цикл
			ПодписьBase64 = Base64Строка(ОписаниеПодписи.Подпись);
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПодписьBase64;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИдентификациюФайлаОбмена(ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя, Переформировать = Ложь, ОбработкаЗавершения = Неопределено)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИнформацияПоПрефиксамТитула", ИнформацияПоПрефиксамТитула);
	ДополнительныеПараметры.Вставить("ИдентификаторОтправителя", ИдентификаторОтправителя);
	ДополнительныеПараметры.Вставить("Переформировать", Переформировать);
	ДополнительныеПараметры.Вставить("ОбработкаЗавершения", ОбработкаЗавершения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьИдентификациюФайлаОбмена_ПослеПолученияУИД", ЭтаФорма, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(Объект.УИДМинтранс) Тогда
		ЗаполнитьИдентификациюФайлаОбмена_ПослеПолученияУИД(Объект.УИДМинтранс, ДополнительныеПараметры);
	Иначе
		Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1") Тогда
			ОбменСГИСЭПДКлиент.ПолучитьУИДМинтранса(ОписаниеОповещения, Объект.ИдентификаторОформителя);
		ИначеЕсли Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2") Тогда
			ОбменСГИСЭПДКлиент.ПолучитьУИДМинтранса(ОписаниеОповещения, Объект.ИдентификаторМедорганизации, Истина, Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификациюФайлаОбмена_ПослеПолученияУИД(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Объект.УИДМинтранс) = Ложь Тогда
		Объект.УИДМинтранс = Результат;
	КонецЕсли;
	
	ИнформацияПоПрефиксамТитула = ДополнительныеПараметры.ИнформацияПоПрефиксамТитула;
	ИдентификаторОтправителя = ДополнительныеПараметры.ИдентификаторОтправителя;
	Переформировать = ДополнительныеПараметры.Переформировать;
	
	ТребуетсяЗаполнить = Переформировать = Истина
			Или ОбменСГИСЭПДКлиент.ТребуетсяИдентификацияФайлаТитула(Объект.Ссылка, Объект.ТекущийТитул, ВерсииТитулов);
	
	Если ТребуетсяЗаполнить = Истина Тогда
		КонтейнерОтображаемойВерсии = Неопределено;
		ПрефиксПодписанта = "";
		
		Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1") Тогда
			КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтаФорма, "ТитулОформление");
			
			Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
				Объект.Номер = УстановитьНомерДокумента();
			КонецЕсли;
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				"ТитулОформлениеДатаПутевогоЛиста",
				Объект.Дата, Ложь,
				КонтейнерОтображаемойВерсии);	
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				"ТитулОформлениеНомерПутевогоЛиста",
				Объект.Номер, Ложь,
				КонтейнерОтображаемойВерсии);	
			
		ИначеЕсли Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2") Тогда
			КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтаФорма, "ТитулМедосмотр");
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулМедосмотрФайлОформлениеИдентификаторФайла",
					Объект.ТитулОформлениеИдентификаторФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулМедосмотрФайлОформлениеДатаФормированияФайла", 
					Объект.ТитулОформлениеДатаФормированияФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулМедосмотрФайлОформлениеВремяФормированияФайла", 
					Объект.ТитулОформлениеВремяФормированияФайла, , КонтейнерОтображаемойВерсии);
	
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				"ТитулМедосмотрФайлОформлениеЭлектроннаяПодпись",
				ПолучитьПодписьТитулаBase64(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1")), ,
				КонтейнерОтображаемойВерсии);
				
			Если ВариантМедработник = 1 Тогда
				ПрефиксПодписанта = "ТитулМедосмотрСтороннийМедработник";
			Иначе
				ПрефиксПодписанта = "ТитулМедосмотрШтатныйМедработник";
			КонецЕсли;
				
		ИначеЕсли Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3") Тогда
			КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтаФорма, "ТитулВыпуск");
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулВыпускФайлОформлениеИдентификаторФайла",
					Объект.ТитулОформлениеИдентификаторФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулВыпускФайлОформлениеДатаФормированияФайла", 
					Объект.ТитулОформлениеДатаФормированияФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулВыпускФайлОформлениеВремяФормированияФайла", 
					Объект.ТитулОформлениеВремяФормированияФайла, , КонтейнерОтображаемойВерсии);
	
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				"ТитулВыпускФайлОформлениеЭлектроннаяПодпись",
				ПолучитьПодписьТитулаBase64(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1")), ,
				КонтейнерОтображаемойВерсии);
				
			ПрефиксПодписанта = "ТитулВыпускОтветственныйЗаСостояниеТС";
				
		ИначеЕсли Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул4") Тогда
			КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтаФорма, "ТитулВыезд");
			
			Если ТитулВыездПризнакНачалаРейса = "1" Тогда
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
					ЭтаФорма, "ТитулВыездФайлВыпускИдентификаторФайла",
						Объект.ТитулВыпускИдентификаторФайла, , КонтейнерОтображаемойВерсии);
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
					ЭтаФорма, "ТитулВыездФайлВыпускДатаФормированияФайла", 
						Объект.ТитулВыпускДатаФормированияФайла, , КонтейнерОтображаемойВерсии);
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
					ЭтаФорма, "ТитулВыездФайлВыпускВремяФормированияФайла", 
						Объект.ТитулВыпускВремяФормированияФайла, , КонтейнерОтображаемойВерсии);	
						
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
					"ТитулВыездФайлВыпускЭлектроннаяПодпись",
					ПолучитьПодписьТитулаBase64(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3")), ,
					КонтейнерОтображаемойВерсии);
			Иначе
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
					ЭтаФорма, "ТитулВыездФайлОформлениеИдентификаторФайла",
						Объект.ТитулОформлениеИдентификаторФайла, , КонтейнерОтображаемойВерсии);
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
					ЭтаФорма, "ТитулВыездФайлОформлениеДатаФормированияФайла", 
						Объект.ТитулОформлениеДатаФормированияФайла, , КонтейнерОтображаемойВерсии);
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
					ЭтаФорма, "ТитулВыездФайлОформлениеВремяФормированияФайла", 
						Объект.ТитулОформлениеВремяФормированияФайла, , КонтейнерОтображаемойВерсии);
						
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
					"ТитулВыездФайлОформлениеЭлектроннаяПодпись",
					ПолучитьПодписьТитулаBase64(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1")), ,
					КонтейнерОтображаемойВерсии);
			КонецЕсли;
			
			ПрефиксПодписанта = "ТитулВыездУполномоченныйНаПроставлениеДанных";
				
		ИначеЕсли Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул5") Тогда
			КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтаФорма, "ТитулЗаезд");
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулЗаездФайлВыездИдентификаторФайла",
					Объект.ТитулВыездИдентификаторФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулЗаездФайлВыездДатаФормированияФайла", 
					Объект.ТитулВыездДатаФормированияФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулЗаездФайлВыездВремяФормированияФайла", 
					Объект.ТитулВыездВремяФормированияФайла, , КонтейнерОтображаемойВерсии);
	
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				"ТитулЗаездФайлВыездЭлектроннаяПодпись",
				ПолучитьПодписьТитулаBase64(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул4")), ,
				КонтейнерОтображаемойВерсии);
				
			ПрефиксПодписанта = "ТитулЗаездУполномоченныйНаПроставлениеДанных";
				
		ИначеЕсли Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6") Тогда
			КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтаФорма, "ТитулМедосмотрПосле");
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулМедосмотрПослеФайлЗаездИдентификаторФайла",
					Объект.ТитулЗаездИдентификаторФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулМедосмотрПослеФайлЗаездДатаФормированияФайла", 
					Объект.ТитулЗаездДатаФормированияФайла, , КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, "ТитулМедосмотрПослеФайлЗаездВремяФормированияФайла", 
					Объект.ТитулЗаездВремяФормированияФайла, , КонтейнерОтображаемойВерсии);
	
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				"ТитулМедосмотрПослеФайлЗаездЭлектроннаяПодпись",
				ПолучитьПодписьТитулаBase64(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул5")), ,
				КонтейнерОтображаемойВерсии);
				
			Если ВариантМедработникПосле = 1 Тогда
				ПрефиксПодписанта = "ТитулМедосмотрПослеСтороннийМедработник";
			Иначе
				ПрефиксПодписанта = "ТитулМедосмотрПослеШтатныйМедработник";
			КонецЕсли;
			
		КонецЕсли;
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, ИнформацияПоПрефиксамТитула.ПолеУИД, Объект.УИДМинтранс, , КонтейнерОтображаемойВерсии);
	
		ИтераторЦикла = 1;
		ИныеПолучатели = Новый Массив;
		КлючОткуда = ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторыИныхПолучателейФайла__" + ИтераторЦикла + "__" + "ИдентификаторИногоПолучателя";
		ЗначениеОткуда = Неопределено;
		СтруктураВерсииТитула = КонтейнерОтображаемойВерсии.СтруктураРеквизитовЗаполнение[КонтейнерОтображаемойВерсии.ПрефиксТитула][КонтейнерОтображаемойВерсии.НомерВерсии];
		Пока СтруктураВерсииТитула.Свойство(КлючОткуда, ЗначениеОткуда) Цикл
			ИныеПолучатели.Добавить(ЗначениеОткуда);	
			ИтераторЦикла = ИтераторЦикла + 1;
			КлючОткуда = ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторыИныхПолучателейФайла__" + ИтераторЦикла + "__" + "ИдентификаторИногоПолучателя";
		КонецЦикла;
		НаличиеИныхПолучателей = ИныеПолучатели.Количество() > 0;
		Объект.ИныеПолучателиСтрока = СтрСоединить(ИныеПолучатели, ",");
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
				ЭтаФорма, ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторФайла", ПолучитьИмяФайла(ИнформацияПоПрефиксамТитула.ШаблонИмениФайла, 
																			Объект.ИдентификаторОформителя,
																			Объект.ИдентификаторМедорганизации,
																			Объект.ИдентификаторТехконтроль,
																			Объект.ИдентификаторПоказанияОдометра,
																			НаличиеИныхПолучателей), , КонтейнерОтображаемойВерсии);
																			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ВерсияПрограммы",
			ОбменСГИСЭПДКлиентСервер.ВерсияПрограммы(), ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ВерсияФормата",
			ОбменСГИСЭПДКлиентСервер.ВерсияФормата(), ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "КодДокументаПоКНД",
			ИнформацияПоПрефиксамТитула.КНД, ,
			КонтейнерОтображаемойВерсии);
		
		ДатаИВремяФормирования = ОбщегоНазначенияКлиент.ДатаСеанса();
		ДатаФормирования = НачалоДня(ДатаИВремяФормирования);
		ВремяФормирования = Дата('00010101') + (ДатаИВремяФормирования - ДатаФормирования); 
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ДатаФормированияФайла",
			ДатаФормирования, ,	
			КонтейнерОтображаемойВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла",
			ВремяФормирования, ,	
			КонтейнерОтображаемойВерсии);
		
		ОтборПодписанта = ПолучитьОтборПодписанта(ЭтаФорма, ПрефиксПодписанта);
		ДанныеСертификатаУчетнойЗаписиЭДО = ОбменСГИСЭПДКлиентСервер.ДанныеСертификатаУчетнойЗаписиЭДО(ИдентификаторОтправителя, ОтборПодписанта);
		
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантТипПодписи",
			"1", ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантСпособПодтвержденияПолномочий",
			"1", ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантФамилия",
			ДанныеСертификатаУчетнойЗаписиЭДО.Фамилия, ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантИмя",
			ДанныеСертификатаУчетнойЗаписиЭДО.Имя, ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантОтчество",
			ДанныеСертификатаУчетнойЗаписиЭДО.Отчество, ,
			КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантДолжность",
			ДанныеСертификатаУчетнойЗаписиЭДО.Должность, ,
			КонтейнерОтображаемойВерсии);
			
		Если ЗначениеЗаполнено(ДанныеСертификатаУчетнойЗаписиЭДО.НомерДоверенности) Тогда
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантДоверенностьЭлектронная__1__Номер",
				ДанныеСертификатаУчетнойЗаписиЭДО.НомерДоверенности, ,
				КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантДоверенностьЭлектронная__1__Дата",
				ДанныеСертификатаУчетнойЗаписиЭДО.ДатаДоверенности, ,
				КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантДоверенностьЭлектронная__1__НомерВнутр",
				ДанныеСертификатаУчетнойЗаписиЭДО.ПорядковыйНомерДоверенности, ,
				КонтейнерОтображаемойВерсии);	
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантДоверенностьЭлектронная__1__ИнформационнаяСистема",
				ДанныеСертификатаУчетнойЗаписиЭДО.СведенияОбИнформационнойСистеме, ,
				КонтейнерОтображаемойВерсии);
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма,
				ИнформацияПоПрефиксамТитула.ВПрограмме + "ПодписантСпособПодтвержденияПолномочий",
				"2", ,
				КонтейнерОтображаемойВерсии);
		КонецЕсли;
	КонецЕсли;
	
	// Проверим заполнение
	Если ОбменСГИСЭПДКлиент.ЗаполнитьТаблицуОшибокЭПД(ЭтаФорма, ОшибкиЗаполнения, Истина) = Истина Тогда	
		Элементы.ГруппаОшибки.Видимость = Истина;
		Элементы.НадписьОшибки.Заголовок = "Ошибки заполнения (" + Строка(ОшибкиЗаполнения.Количество()) + ")";
		Если ТребуетсяЗаполнить = Истина Тогда
			ОчиститьИдФайлТекущегоТитула();
		КонецЕсли;
	Иначе
		Элементы.НадписьОшибки.Заголовок = "Ошибки заполнения";
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОбработкаЗавершения") 
		И ДополнительныеПараметры.ОбработкаЗавершения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаЗавершения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьТитул(Команда)
	
	ВводимИсправление = Истина;

	ТитулСтрока = ОбменСГИСЭПДКлиентСервер.ПолучитьПрефиксТитулаПоСтраницеОсновнойФормы(Элементы.Страницы.ТекущаяСтраница.Имя, "ЭлектронныйПутевойЛист");	
	Объект.ТекущийТитул = ОбменСГИСЭПДКлиентСервер.ТитулПоПрефиксу("Документ.ЭлектронныйПутевойЛист", ТитулСтрока);
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	
	ИдентификаторФайлаТитула = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
			ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторФайла");
	
	Если ЗначениеЗаполнено(ИдентификаторФайлаТитула) Тогда
		НомерПредыдущейВерсии = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтаФорма, 
				ИнформацияПоПрефиксамТитула.ВПрограмме + "НомерВерсии", 0);
				
		СтрокаНовойВерсии = ВерсииТитулов.Добавить();
		СтрокаНовойВерсии.Титул = Объект.ТекущийТитул;
		СтрокаНовойВерсии.НомерВерсии = НомерПредыдущейВерсии + 1;
		
		// Увеличим номер версии
		НовыйНомерВерсии = НомерПредыдущейВерсии + 1;
		ТекущееЗначениеВерсии = Неопределено;
		ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, ТитулСтрока, НовыйНомерВерсии - ТекущееЗначениеВерсии);
			
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			ИнформацияПоПрефиксамТитула.ВПрограмме + "НомерВерсии", НовыйНомерВерсии);
			
		УстановитьТекущийШагПомощника();
		
		ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
		
		Элементы.Страницы.ТекущаяСтраница.ТолькоПросмотр = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДОПослеЗаписи(Повторно = Ложь)
		
	ДанныеСостоянияЭДО = ОбменСГИСЭПДВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.Ссылка);
	
	ЭтоИсправление = Ложь;
	Если ДанныеСостоянияЭДО.ПредставлениеСостояния = "Требуется уточнение"
		Или ДанныеСостоянияЭДО.ПредставлениеСостояния = "Требуется повторная отправка" Тогда
		ЭтоИсправление = Истина;
		Повторно = Истина;	
	КонецЕсли;
	
	Если ВводимИсправление = Истина Тогда
		Повторно = Истина;
	КонецЕсли;
	
	ДоступенВнеОчередиТитул3 = ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) 
							И Объект.ТитулОформлениеПризнакНачалаРейса = "1"
							И Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2");
							
	Если ДоступенВнеОчередиТитул3 И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТитулВыпуск Тогда
		Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3");	
	КонецЕсли;
	
	ТребуетсяПовторноМедосмотр = Ложь;
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2")
		Или Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6") Тогда
		ЗавершенныеОтправки = ОбменСГИСЭПДВызовСервера.ПолучитьТитулыПоДокументу(Объект.Ссылка, Истина);
		ЗавершенныеМедосмотры = ЗавершенныеОтправки.Получить(Объект.ТекущийТитул);
		КоличествоМедосмотров = 0;
		Если ЗавершенныеМедосмотры <> Неопределено Тогда
			Для Каждого СтруктураМедосмотр Из ЗавершенныеМедосмотры Цикл
				Если СтруктураМедосмотр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭД.ПереданОператору") Тогда
					КоличествоМедосмотров = КоличествоМедосмотров + 1;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		КоличествоВодителей = ОбменСГИСЭПДКлиентСервер.ПолучитьКоличествоСтрокТаблицыИзСтруктурыФормы(ЭтаФорма, "ТитулОформлениеВодители");
		Если КоличествоМедосмотров > 0 И КоличествоВодителей > КоличествоМедосмотров Тогда
			ТребуетсяПовторноМедосмотр = Истина;
		КонецЕсли; 
	КонецЕсли;

	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеСостоянияЭДО", ДанныеСостоянияЭДО);
	ДополнительныеПараметры.Вставить("ЭтоИсправление", ЭтоИсправление);
	ДополнительныеПараметры.Вставить("Повторно", Повторно);
	ДополнительныеПараметры.Вставить("ТребуетсяПовторноМедосмотр", ТребуетсяПовторноМедосмотр);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЧерезЭДОПослеЗаписи_Завершение", ЭтаФорма, ДополнительныеПараметры);
	
	ЗаполнитьИдентификациюФайлаОбмена(ИнформацияПоПрефиксамТитула, 
		ИдентификаторОтправителя(), 
		Повторно Или ТребуетсяПовторноМедосмотр,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДОПослеЗаписи_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеСостоянияЭДО = ДополнительныеПараметры.ДанныеСостоянияЭДО;
	Повторно = ДополнительныеПараметры.Повторно;
	ТребуетсяПовторноМедосмотр = ДополнительныеПараметры.ТребуетсяПовторноМедосмотр;
	ЭтоИсправление = ДополнительныеПараметры.ЭтоИсправление;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
	Записать(ПараметрыЗаписи);
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		ЭтаФорма.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	Если ОшибкиЗаполнения.Количество() > 0 Тогда	
		Элементы.ГруппаОшибки.Видимость = Истина;
		Элементы.НадписьОшибки.Заголовок = "Ошибки заполнения (" + Строка(ОшибкиЗаполнения.Количество()) + ")";
		Доступность = Истина;
		ПоказатьПредупреждение(, НСтр("ru='Документ не отправлен, обнаружены ошибки заполнения. Исправьте ошибки и повторите попытку'"));
		Возврат;
	Иначе
		Элементы.НадписьОшибки.Заголовок = "Ошибки заполнения";
	КонецЕсли;
	
	НаборДействий = "";		
	
	Если Повторно = Истина Или ТребуетсяПовторноМедосмотр = Истина
		Или ДанныеСостоянияЭДО.ПредставлениеСостояния = "Требуется повторная отправка" 
		Или ЗначениеЗаполнено(ОбменСГИСЭПДКлиентСервер.ПолучитьСообщениеТитула(Объект.Ссылка, Объект.ТекущийТитул)) = Ложь Тогда
			Если Объект.ЭтоВходящий = Ложь И ДанныеСостоянияЭДО.СуществуетАктуальныйДокумент = Ложь Тогда
				ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий, "Сформировать");
			Иначе
				ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
					"Утвердить"); // СформироватьОтвет
			КонецЕсли;	   
			
			ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
				"Подписать");
			ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
				"ПодготовитьКОтправке");  
	Иначе		
		Если ДанныеСостоянияЭДО.ПредставлениеСостояния <> "Требуется подготовка к отправке" 
			И ДанныеСостоянияЭДО.ПредставлениеСостояния <> "Требуется отправка" Тогда
				ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий, 
					"Подписать");
		КонецЕсли;
		
		Если ДанныеСостоянияЭДО.ПредставлениеСостояния <> "Требуется отправка" Тогда
			ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
				"ПодготовитьКОтправке");
		КонецЕсли;		
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
		"Отправить");
	
	ДополнительныеПараметрыУспешногоЗавершения = Новый Структура;
	ДополнительныеПараметрыУспешногоЗавершения.Вставить("НаборДействий", НаборДействий);
	ДополнительныеПараметрыУспешногоЗавершения.Вставить("ЭтоИсправление", ЭтоИсправление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭтоИсправление", ЭтоИсправление);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтаФорма, 
									ДополнительныеПараметрыУспешногоЗавершения, 
									"ПослеВыполненияДействийПоЭДО_ОбработкаОшибки", ЭтаФорма));

	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтаФорма, ДополнительныеПараметры);
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(Объект.Ссылка);
	НужноОбновитьСостояниеЭД = Ложь;
	ЭлектронныеДокументыСлужебныйКлиент.ОбработатьЭД(Ссылки, НаборДействий);
	
	ВыполнитьОбработкуОповещения(Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУОУ(Команда)
	
	Текст = "";
	Если ВвестиСтроку(Текст, "Текст запроса уточнения (отклонения)", , Истина) Тогда
		ОтправитьУОУ_ПослеВводаТекстаУточнения(Текст);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУОУ_ПослеВводаТекстаУточнения(Текст) Экспорт
	
	Если ЗначениеЗаполнено(Текст) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_ОткМ");	

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
	Записать(ПараметрыЗаписи);
	
	НаборДействий = "";
	
	ДействиеОтклонить = "Отклонить";
	
	ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий, ДействиеОтклонить);
	ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
					"Подписать");
	ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
					"ПодготовитьКОтправке");
	ОбменСГИСЭПДКлиентСервер.ДобавитьДействие(НаборДействий,
					"Отправить");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭтоИсправление", Ложь);
	ДополнительныеПараметры.Вставить("ОповещениеУспешногоЗавершения",
		Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО_ОбработкаОшибки", ЭтаФорма));

	Оповещение = Новый ОписаниеОповещения("ПослеВыполненияДействийПоЭДО", ЭтаФорма, ДополнительныеПараметры);  
	
	СообщениеЭД = ОбменСГИСЭПДВызовСервера.ПолучитьСообщениеТитула(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1"));

	МассивЭД = Новый Массив;
	МассивЭД.Добавить(СообщениеЭД);  
		
	НужноОбновитьСостояниеЭД = Ложь; 
	Результат = ЭлектронныеДокументыКлиентСервер.СформироватьПодписатьИОтправитьСлужебныеЭД(
					МассивЭД, 
					ПредопределенноеЗначение("Перечисление.ВидыЭД.УведомлениеОбУточнении"),
					Текст);
	
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Доступность = Истина;
	Если НужноОбновитьСостояниеЭД = Истина Тогда
		Если ДополнительныеПараметры.ЭтоИсправление Тогда
			ОбменСГИСЭПДВызовСервера.ОтметитьИсправлениеДокумента(Объект.Ссылка);	
		КонецЕсли;
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		Записать(ПараметрыЗаписи);
		
		ОтображаемыеВерсииТитулов = Неопределено;
		
		ТекстОповещения = НСтр("ru = 'Титул """ + Объект.ТекущийТитул + """ отправлен'");		
		ЗаголовокОповещения = НСтр("ru = 'Электронные документы'");	
		ДействиеПриНажатии = Неопределено;
		КартинкаОповещения = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО;
		
		ПодключитьОбработчикОжидания("ОбновлениеДоступностиЭлементов", 2, Истина);
		
		#Если Не МобильноеПриложениеКлиент Тогда
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, ДействиеПриНажатии, ТекстОповещения, КартинкаОповещения);
		#КонецЕсли
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО_ОбработкаОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ОчиститьИдФайлТекущегоТитула(Истина);
	
	ПодключитьОбработчикОжидания("ОбновлениеДоступностиЭлементов", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДоступностиЭлементов()
	
	ВводимМедосмотрПосле = Ложь;
	
	ПредыдущийТекущийТитул = Объект.ТекущийТитул;
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЛ(ЭтаФорма);
	
	ЭтаФорма.Доступность = Истина;
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) Тогда
		ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
		УстановитьТекущийШагПомощника(Объект.ТекущийТитул);	
	Иначе
		УстановитьТекущийШагПомощника(ПредыдущийТекущийТитул);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИдФайлТекущегоТитула(Записать = Ложь)
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	
	ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(
		ЭтаФорма, 
		ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторФайла", 
		Неопределено);
	
	Если Записать = Истина Тогда
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхНаФорме(ИмяЭлемента)
		
	СтруктураРеквизитовФормы = Новый Структура(ЭтаФорма.ОписаниеРеквизитовФормы.ПараметрыФормы);
	СтруктураРеквизитовОбъекта = Новый Структура(ЭтаФорма.ОписаниеРеквизитовФормы.РеквизитыОбъекта);
	
	Если СтруктураРеквизитовФормы.Свойство(ИмяЭлемента) Тогда
		ЗначениеРеквизита = ЭтаФорма[ИмяЭлемента];
	ИначеЕсли СтруктураРеквизитовОбъекта.Свойство(ИмяЭлемента) Тогда
		ЗначениеРеквизита = Объект[ИмяЭлемента];
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, ИмяЭлемента, ЗначениеРеквизита);
	
	Если ИзмененСоставУчастников = Истина Тогда
		ЗаполнитьУчастников();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТитулОформлениеАдресаПунктовПогрузкиИВыгрузки(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулОформлениеГрузоотправители(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулОформлениеВодители(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДобавлениеПоляВвода(Команда)
	
	ИмяТаблицыИПоля = СтрЗаменить(Команда.Имя, "ДобавлениеПоляВвода", "");
	МассивЧастей = ОбменСГИСЭПДКлиентСервер.РазделитьСтрокуСоСложнымРазделителем(ИмяТаблицыИПоля, "__");
	
	ДобавлениеПоляВводаСервер(МассивЧастей[0], МассивЧастей[1]);
	
КонецПроцедуры

&НаСервере
Процедура ДобавлениеПоляВводаСервер(ИмяТаблицы, ИмяПоля)
	
	ОбменСГИСЭПД.СоздатьЭлементыВводаЗначенийСписка(ЭтаФорма, ИмяТаблицы, ИмяПоля, Истина);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПолеЗначенияСпискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	МассивЧастей = ОбменСГИСЭПДКлиентСервер.РазделитьСтрокуСоСложнымРазделителем(Элемент.Имя, "__");	
	УстановитьФорматированноеЗначениеПоляВвода(МассивЧастей[0], МассивЧастей[1], Число(МассивЧастей[2]), Текст);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматированноеЗначениеПоляВвода(ИмяТаблицы, ИмяПоля, НомерСтроки, Текст)
	
	ТекущиеДанные = ЭтаФорма[ИмяТаблицы][НомерСтроки];	 
	ОбменСГИСЭПД.УстановитьФорматированноеЗначениеПоляВвода(ЭтаФорма, ТекущиеДанные, ИмяПоля, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТитулОформлениеАдресМестаОтправленияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
	//	МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	//	МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	//КонецЕсли;
	
	ОбменСГИСЭПДКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТитулОформлениеАдресМестаОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВводАдреса(Элемент.Имя, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТитулОформлениеАдресМестаОтправленияОбработкаВыбора(Элемент, Результат, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыАдреса(ЭтаФорма, Результат, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулОформлениеОформительПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ИдентификаторОформителя) Тогда
		ИзмененСоставУчастников = Истина;
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулОформлениеМедорганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторМедорганизации) Тогда
		ИзмененСоставУчастников = Истина;
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулОформлениеТехконтрольПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторТехконтроль) Тогда
		ИзмененСоставУчастников = Истина;
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулОформлениеПоказанияОдометраПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПоказанияОдометра) Тогда
		ИзмененСоставУчастников = Истина;
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ХранимыеДанныеТитулОформлениеТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулОформлениеТранспортноеСредствоОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулОформлениеТранспортноеСредство) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулОформлениеТранспортноеСредствоПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулОформлениеТранспортноеСредство;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулОформлениеТранспортноеСредствоАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрШтатныйМедработникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрШтатныйМедработникОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулМедосмотрШтатныйМедработник) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрШтатныйМедработникПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулМедосмотрШтатныйМедработник;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОтборПодписанта(Форма, ПрефиксПодписанта)
	
	ОтборПодписанта = Новый Структура;
	
	Если ЗначениеЗаполнено(ПрефиксПодписанта) Тогда
		КонтейнерОтображаемойВерсии = Неопределено;
		
		ОтборПодписанта.Вставить("Фамилия", ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(Форма, 
			ПрефиксПодписанта + "Фамилия", , КонтейнерОтображаемойВерсии));
		ОтборПодписанта.Вставить("Имя", ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(Форма, 
			ПрефиксПодписанта + "Имя", , КонтейнерОтображаемойВерсии));
		ОтборПодписанта.Вставить("Отчество", ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(Форма, 
			ПрефиксПодписанта + "Отчество", , КонтейнерОтображаемойВерсии));
	КонецЕсли;
	
	Возврат ОтборПодписанта;
	
КонецФункции

&НаСервере
Процедура ПроверитьНаличиеЭЦППоФИО(ПрефиксРеквизитов, ЭлементРодитель, ИдентификаторОтправителя)
	
	ОтборПодписанта = ПолучитьОтборПодписанта(ЭтаФорма, ПрефиксРеквизитов);
	
	ДанныеСертификатаУчетнойЗаписиЭДО = ОбменСГИСЭПДКлиентСервер.ДанныеСертификатаУчетнойЗаписиЭДО(
												ИдентификаторОтправителя, 
												ОтборПодписанта);
	
	ИмяЭлементаОшибки = ПрефиксРеквизитов + "_НадписьОтсутствиеЭЦП";
	НадписьОшибка = Элементы.Найти(ИмяЭлементаОшибки);
	Если ДанныеСертификатаУчетнойЗаписиЭДО.СоответствуетОтбору = Ложь Тогда
		Если НадписьОшибка = Неопределено Тогда
			НадписьОшибка = Элементы.Добавить(ИмяЭлементаОшибки, Тип("ДекорацияФормы"), Элементы.Найти(ЭлементРодитель));
			НадписьОшибка.Вид = ВидДекорацииФормы.Надпись;
			НадписьОшибка.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			НадписьОшибка.Ширина = 50;
			МассивСтроки = Новый Массив;
			МассивСтроки.Добавить(НСтр("ru='Нет сертификата ЭЦП с такими ФИО. 
										|Нужно выбрать другое лицо или добавить сертификат в '"));
			МассивИдентификаторов = Новый Массив;
			МассивИдентификаторов.Добавить(ИдентификаторОтправителя);	            
			СоответствиеПрофилейИД = ОбменСГИСЭПДВызовСервера.СоответствиеПрофилейИД(МассивИдентификаторов);
			ПрофильЭДО = СоответствиеПрофилейИД.Получить(ИдентификаторОтправителя);	
			Если ПрофильЭДО <> Неопределено Тогда
				МассивСтроки.Добавить(" ");
				СсылкаНаЗапись = ПолучитьНавигационнуюСсылку(ПрофильЭДО);
				МассивСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='учетной записи ЭДО'"), , , , СсылкаНаЗапись));
			КонецЕсли;
			ЗаголовокГиперссылки = Новый ФорматированнаяСтрока(МассивСтроки);
			НадписьОшибка.Заголовок = ЗаголовокГиперссылки;
		КонецЕсли;
		НадписьОшибка.Видимость = Истина;
	ИначеЕсли НадписьОшибка <> Неопределено Тогда
		НадписьОшибка.Видимость = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрШтатныйМедработникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрСтороннийМедработникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрСтороннийМедработникОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулМедосмотрСтороннийМедработник) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрСтороннийМедработникПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулМедосмотрСтороннийМедработник;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрСтороннийМедработникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрВодительОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулМедосмотрВодитель) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрВодительПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулМедосмотрВодитель;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрВодительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТСОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТС) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТСПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТС;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускТранспортноеСредствоОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулВыпускТранспортноеСредство) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускТранспортноеСредствоПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулВыпускТранспортноеСредство;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыпускТранспортноеСредствоАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОповещениеОЗавершенииВводаДанных(ИмяЭлемента, ЭтоХранимыеДанные = Истина)
	
	ГруппаДанных = СтрЗаменить(ИмяЭлемента, "ХранимыеДанные", "");
	
	Контекст = Новый Структура;
	Контекст.Вставить("ГруппаДанных", ГруппаДанных);
	ЭлементРодитель = Элементы.Найти("ГруппаРеквизита" + ?(ЭтоХранимыеДанные = Истина, "ХранимыеДанные", "") + ГруппаДанных);
	Контекст.Вставить("ЭлементРодитель", ЭлементРодитель.Имя);
	
	Возврат Новый ОписаниеОповещения("ВывестиФормуВводаДанных_Завершение", ЭтаФорма, Контекст);
	
КонецФункции

&НаКлиенте
Процедура ВывестиФормуВводаДанных_Завершение(Результат, Контекст) Экспорт
	
	ПроверитьНаличиеЭЦППоФИО(Контекст.ГруппаДанных, Контекст.ЭлементРодитель, ИдентификаторОтправителя());
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанныхОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанных) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанныхПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанных;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанныхАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанныхОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанных) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанныхПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанных;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанныхАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработникОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработникПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , , , ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработникОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработникПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ВходящийКонтекст.Вставить("ОповещениеОЗавершении", ПолучитьОповещениеОЗавершенииВводаДанных(Элемент.Имя));
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеВодительОткрытие(Элемент, СтандартнаяОбработка)

	Если ТипЗнч(ХранимыеДанныеТитулМедосмотрПослеВодитель) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеВодительПриИзменении(Элемент)
	
	ЗначениеРеквизита = ХранимыеДанныеТитулМедосмотрПослеВодитель;
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", ГруппаДанных);
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, ГруппаДанных);
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, ГруппаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулМедосмотрПослеВодительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(Объект, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры


#Область Навигация

&НаКлиенте
Процедура Шаг1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг1", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

&НаКлиенте
Процедура Шаг2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг2", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

&НаКлиенте
Процедура Шаг3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг3", НавигационнаяСсылкаФорматированнойСтроки);
	
	// Если перед Т2 можем сформировать Т3 тогда нужно заполнить его значениями по-умолчанию
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2")
		И Объект.ТитулОформлениеПризнакНачалаРейса = "1"
		И ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) Тогда
		ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула(ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Шаг4ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг4", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

&НаКлиенте
Процедура Шаг5ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг5", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

&НаКлиенте
Процедура Шаг6ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг6", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры

#КонецОбласти


#Область НавигацияПоСтраницам

&НаКлиентеНаСервереБезКонтекста
Процедура ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, ТитулСтрока, Инкремент)
	
	Если Инкремент = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображаемыеВерсииТитулов = Неопределено Тогда
		ОтображаемыеВерсииТитулов = Новый Структура;
	Иначе
		ТекущееЗначениеВерсии = Неопределено;
		ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
		Если ТекущееЗначениеВерсии <> Неопределено Тогда
			ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, ТекущееЗначениеВерсии + Инкремент);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницы(ОтображаемаяСтраница)
	
	ОтображаемаяСтраницаЦелевая = ПодменитьСтраницуДляТестированияФормы(ОтображаемаяСтраница);

	// Чтобы не отрастали лишние скролл-бары по высоте из-за разного числа элементов
	// на разных страницах, оставляем видимость только у одной - отображаемой страницы.
	
	Для каждого СтраницаЭПЛ Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		СтраницаЭПЛ.Видимость = (СтраницаЭПЛ = ОтображаемаяСтраницаЦелевая);
	КонецЦикла;

	Элементы.Страницы.ТекущаяСтраница  = ОтображаемаяСтраницаЦелевая;
	
	ОбменСГИСЭПД.ПодготовитьФормуДляОтметкиОбязательныхПолей(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПодменитьСтраницуДляТестированияФормы(ОтображаемаяСтраница)
	
	Возврат ОтображаемаяСтраница;
	
КонецФункции

&НаСервере
Процедура УстановитьТекущийШагПомощника(ПредыдущийТекущийТитул = Неопределено)
	
	ТитулСтраницы = ?(ЗначениеЗаполнено(Объект.ТекущийТитул), Объект.ТекущийТитул, ПредыдущийТекущийТитул);
	
	НачатьСПервойСтраницы = ТолькоПросмотр ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка);

	Если НачатьСПервойСтраницы Тогда		
		УстановитьВидимостьСтраницыНачало("Шаг1");		
	Иначе		
		Если ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2") Тогда			
			УстановитьВидимостьСтраницыТитулМедосмотр("Шаг2"); 			
		ИначеЕсли ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3") Тогда
			НомерШага = ?(Объект.РольУчастника = 4, 2, 3);
			УстановитьВидимостьСтраницыТитулВыпуск("Шаг" + Строка(НомерШага));	
		ИначеЕсли ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул4") Тогда	
			НомерШага = 4;
			Если Объект.ТитулОформлениеПризнакНачалаРейса = "2"
				Или (ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) = Ложь
				     И ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) = Ложь) Тогда  
				НомерШага = НомерШага - 1;
			КонецЕсли;
			УстановитьВидимостьСтраницыТитулВыезд("Шаг" + Строка(НомерШага));
		ИначеЕсли ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул5") Тогда	
			НомерШага = 5;
			Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) = Ложь
				И ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) = Ложь Тогда
				НомерШага = НомерШага - 1;
			КонецЕсли;		
			Если Объект.ТитулОформлениеПризнакНачалаРейса = "2"
				Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) = Ложь Тогда  
				НомерШага = НомерШага - 1;
			КонецЕсли;
			УстановитьВидимостьСтраницыТитулЗаезд("Шаг" + Строка(НомерШага));
		ИначеЕсли ТитулСтраницы = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6") Тогда
			НомерШага = 6;
			Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) = Ложь
				И ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) = Ложь Тогда
				НомерШага = НомерШага - 1;
			КонецЕсли;		
			Если Объект.ТитулОформлениеПризнакНачалаРейса = "2"
				Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) = Ложь Тогда  
				НомерШага = НомерШага - 1;
			КонецЕсли;		
			УстановитьВидимостьСтраницыТитулМедосмотрПосле("Шаг" + Строка(НомерШага));
		Иначе			
			УстановитьВидимостьСтраницыНачало("Шаг1");			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущийШагПомощника()
	
	Если ТолькоПросмотр ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыНачало(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулОформление);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыТитулМедосмотр(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулМедосмотр);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыТитулВыпуск(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулВыпуск);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();
	

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыТитулВыезд(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулВыезд);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыТитулЗаезд(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулЗаезд);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыТитулМедосмотрПосле(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулМедосмотрПосле);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры




&НаСервере
Функция ИмяПомощника()

	Возврат "ЭлектронныйПутевойЛист";

КонецФункции


&НаСервере
Функция НавигацияПомощника()

	СтруктураНавигации = Новый Структура;
	
	НомерШага = 1;
	СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(НомерШага), СтруктураШагаНачало(НомерШага));
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1)
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 2)
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) Тогда
			НомерШага = НомерШага + 1;
			СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(НомерШага), СтруктураШагаМедосмотр(НомерШага));
	КонецЕсли;
	Если Объект.ТитулОформлениеПризнакНачалаРейса = "1"
		И (ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1)
			Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4)) Тогда
		НомерШага = НомерШага + 1;
		СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(НомерШага), СтруктураШагаВыпуск(НомерШага));
	КонецЕсли;
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1)
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) Тогда
			НомерШага = НомерШага + 1;
			СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(НомерШага), СтруктураШагаВыезд(НомерШага));
	КонецЕсли;
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1)
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8)
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 2) Тогда
			НомерШага = НомерШага + 1;
			СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(НомерШага), СтруктураШагаЗаезд(НомерШага));
	КонецЕсли;
	Если (Объект.ТитулОформлениеОбязательностьМедОсмотраПосле = "1" 
			Или ВводимМедосмотрПосле = Истина
			Или ЗначениеЗаполнено(Объект.ТитулМедосмотрПослеИдентификаторФайла))
		И (ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1)
			Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 2)) Тогда
		НомерШага = НомерШага + 1;
		СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(НомерШага), СтруктураШагаМедосмотрПосле(НомерШага));	
	КонецЕсли;

	Для Каждого КиЗ Из СтруктураНавигации Цикл
		ШагВыполнен = Ложь;
		Для Каждого СтрВерсия Из ВерсииТитулов Цикл
			Если СтрВерсия.Титул = КиЗ.Значение.ТипЭлементаРегламента И СтрВерсия.ИдентификаторФайла <> "" Тогда
				ШагВыполнен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		КиЗ.Значение.Выполнен = ШагВыполнен; 	
		КиЗ.Значение.Доступен = КиЗ.Значение.Доступен Или КиЗ.Значение.Выполнен;
	КонецЦикла;
	
	Возврат СтруктураНавигации;
	
КонецФункции

&НаСервере
Функция СтруктураШагаНачало(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул1");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Оформление'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулОформление";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулОформлениеИдентификаторФайла); 
	СтруктураШага.Доступен = Истина;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулОформление");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция СтруктураШагаМедосмотр(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Медосмотр'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулМедосмотр";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулМедосмотрИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулМедосмотр");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция СтруктураШагаВыпуск(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул3");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	ДоступенВнеОчередиТитул3 = ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) 
							И Объект.ТитулОформлениеПризнакНачалаРейса = "1"
							И Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул2");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Контроль транспорта'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулВыпуск";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулВыпускИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул Или ДоступенВнеОчередиТитул3;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулВыпуск");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция СтруктураШагаВыезд(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул4");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Показания (выезд)'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулВыезд";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулВыездИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулВыезд");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция СтруктураШагаЗаезд(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул5");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Показания (заезд)'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулЗаезд";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулЗаездИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулЗаезд");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция СтруктураШагаМедосмотрПосле(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Медосмотр
											|(после рейса)'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулМедосмотрПосле";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулМедосмотрПослеИдентификаторФайла);
	СтруктураШага.Доступен = СтруктураШага.Выполнен Или Объект.ТекущийТитул = Титул;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулМедосмотрПосле");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция ОтображаемаяВерсияТитула(СтрокиВерсий, ТитулСтрока)
	
	Если ОтображаемыеВерсииТитулов = Неопределено Тогда
		ОтображаемыеВерсииТитулов = Новый Структура;
		КоличествоВерсий = Макс(СтрокиВерсий.Количество() - 1, 0);
		ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, КоличествоВерсий);
		Возврат КоличествоВерсий;
	КонецЕсли;
	
	ТекущееЗначениеВерсии = Неопределено;
	ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
	
	Если ТекущееЗначениеВерсии = Неопределено Тогда
		КоличествоВерсий = Макс(СтрокиВерсий.Количество() - 1, 0);
		ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, КоличествоВерсий);
		Возврат КоличествоВерсий;
	Иначе
		Возврат ТекущееЗначениеВерсии;		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыОтображаемойВерсии(ВыбранныйТитулСтрока, ОтмечатьТекущий)
	
	ВыбранныйТитул = ОбменСГИСЭПДКлиентСервер.ТитулПоПрефиксу("Документ.ЭлектронныйПутевойЛист", ВыбранныйТитулСтрока); 
	
	Если ЗначениеЗаполнено(ВыбранныйТитул) Тогда
		Отбор = Новый Структура("Титул", ВыбранныйТитул);
		СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
		СтрокиВерсий.Сортировать("НомерВерсии");	
		НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, ВыбранныйТитулСтрока);
		
		РеквизитыТекущейВерсииТитула = ОбменСГИСЭПД.ПолучитьВерсиюТитулаДокумента(СтруктураРеквизитов, ВыбранныйТитул, НомерВерсии);
		ОбменСГИСЭПД.ЗаполнитьРеквизитыПоВерсии(ЭтаФорма, ВыбранныйТитул, НомерВерсии, РеквизитыТекущейВерсииТитула);
		ЗаполнитьПредставленияАдресов(ВыбранныйТитул);
		Если ОтмечатьТекущий = Истина Тогда
			СтруктураСТекущимиДанными = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
			СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтаФорма);
			СтруктураСДаннымиФормыДляОформленияКнопок = ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтаФорма);
			
			Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДанными,
				Неопределено,
				Неопределено,
				СтруктураДанныхОбъекта,
				СтруктураСДаннымиФормыДляОформленияКнопок);
				
			Если Результат.Успешно Тогда
				ЭтаФорма.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
				МассивОформления = Результат.МассивОформления;
				ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтаФорма, СтруктураСТекущимиДанными, МассивОформления);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РазместитьНавигацию(ВыбранныйТитулСтрока)

	НавигацияПараметрФормы = ВыбранныйТитулСтрока;
	
	ЗаполнитьРеквизитыОтображаемойВерсии(ВыбранныйТитулСтрока, Истина);

	СтруктураНавигацииПомощника = НавигацияПомощника();
	НавигацияПомощниковСВозвратомЭПД.РазместитьНавигацию(ЭтаФорма, СтруктураНавигацииПомощника, Параметры);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеШага(ИмяШага, НавигационнаяСсылка)
	
	ИнкрементВерсии = 0;
	Если НавигационнаяСсылка = "Влево" Тогда
		ИнкрементВерсии = -1;
	ИначеЕсли НавигационнаяСсылка = "Вправо" Тогда
		ИнкрементВерсии = 1;
	КонецЕсли;
	
	НомерШагаТ2 = Неопределено;
	Если Объект.РольУчастника <> 4 Тогда
		НомерШагаТ2 = "Шаг2";
	КонецЕсли;
	
	НомерШагаТ3 = Неопределено;
	Если Объект.ТитулОформлениеПризнакНачалаРейса <> "2" Тогда
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) Тогда
			НомерШагаТ3 = "Шаг3";
		ИначеЕсли ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) Тогда
			Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 2) Тогда
				НомерШагаТ3 = "Шаг3";	
			Иначе
				НомерШагаТ3 = "Шаг2";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НомерШагаТ4 = Неопределено;
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) Тогда
		НомерШагаТ4 = ?(Объект.ТитулОформлениеПризнакНачалаРейса <> "2", "Шаг4", "Шаг3");
	ИначеЕсли ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) Тогда
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4)
			И Объект.ТитулОформлениеПризнакНачалаРейса <> "2" Тогда	
			НомерШагаТ4 = "Шаг4";
		Иначе
			НомерШагаТ4 = "Шаг3";
		КонецЕсли;
	КонецЕсли;
	
	НомерШагаТ5 = Неопределено;
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) Тогда
		НомерШагаТ5 = ?(Объект.ТитулОформлениеПризнакНачалаРейса <> "2", "Шаг5", "Шаг4");
	ИначеЕсли ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 2)
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) Тогда
		СдвигШагаВперед = 0;
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4)
			И Объект.ТитулОформлениеПризнакНачалаРейса <> "2" Тогда
			СдвигШагаВперед = СдвигШагаВперед + 1;
		КонецЕсли;
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) Тогда
			СдвигШагаВперед = СдвигШагаВперед + 1;	
		КонецЕсли;
		НомерШагаТ5 = "Шаг" + Строка(3 + СдвигШагаВперед);
	КонецЕсли;
	
	НомерШагаТ6 = Неопределено;
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) Тогда
		НомерШагаТ6 = ?(Объект.ТитулОформлениеПризнакНачалаРейса <> "2", "Шаг6", "Шаг5");
	ИначеЕсли ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 2) Тогда
		СдвигШагаВперед = 0;
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4)
			И Объект.ТитулОформлениеПризнакНачалаРейса <> "2" Тогда
			СдвигШагаВперед = СдвигШагаВперед + 1;
		КонецЕсли;
		Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) Тогда
			СдвигШагаВперед = СдвигШагаВперед + 1;	
		КонецЕсли;
		НомерШагаТ6 = "Шаг" + Строка(4 + СдвигШагаВперед);
	КонецЕсли;
	
	
	Если ИмяШага = "Шаг1" Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулОформление", ИнкрементВерсии);
		УстановитьВидимостьСтраницыНачало(ИмяШага);
	ИначеЕсли ИмяШага = НомерШагаТ2 Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулМедосмотр", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулМедосмотр(ИмяШага);
	ИначеЕсли ИмяШага = НомерШагаТ3 Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулВыпуск", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулВыпуск(ИмяШага);
	ИначеЕсли ИмяШага = НомерШагаТ4 Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулВыезд", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулВыезд(ИмяШага);
	ИначеЕсли ИмяШага = НомерШагаТ5 Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулЗаезд", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулЗаезд(ИмяШага);
	ИначеЕсли ИмяШага = НомерШагаТ6 Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула(ОтображаемыеВерсииТитулов, "ТитулМедосмотрПосле", ИнкрементВерсии);
		УстановитьВидимостьСтраницыТитулМедосмотрПосле(ИмяШага);
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтаФорма.НачальноеОформлениеВыполнено Тогда
		ЭтаФорма.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтаФорма.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтаФорма.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтаФорма.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
	СтруктураДанныхОбъекта = Неопределено;
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтаФорма);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтаФорма.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтаФорма,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтаФорма, СтруктураСТекущимиДанными);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		НужноОбновитьСостояниеЭД = Истина;
	ИначеЕсли ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") И Источник <> Неопределено Тогда
		Если Источник = Объект.СсылкаТитулОформлениеОформитель Тогда
			СсылкаТитулОформлениеОформительПриИзменении(Элементы.СсылкаТитулОформлениеОформитель);
		ИначеЕсли Источник = ХранимыеДанныеТитулОформлениеТранспортноеСредство Тогда
			ХранимыеДанныеТитулОформлениеТранспортноеСредствоПриИзменении(Элементы.ХранимыеДанныеТитулОформлениеТранспортноеСредство);
		ИначеЕсли Источник = ХранимыеДанныеТитулМедосмотрВодитель Тогда
			ХранимыеДанныеТитулМедосмотрВодительПриИзменении(Элементы.ХранимыеДанныеТитулМедосмотрВодитель);
		ИначеЕсли Источник = ХранимыеДанныеТитулМедосмотрШтатныйМедработник Тогда
			ХранимыеДанныеТитулМедосмотрШтатныйМедработникПриИзменении(Элементы.ХранимыеДанныеТитулМедосмотрШтатныйМедработник);
		ИначеЕсли Источник = ХранимыеДанныеТитулМедосмотрСтороннийМедработник Тогда
			ХранимыеДанныеТитулМедосмотрСтороннийМедработникПриИзменении(Элементы.ХранимыеДанныеТитулМедосмотрСтороннийМедработник);
		ИначеЕсли Источник = ХранимыеДанныеТитулВыпускТранспортноеСредство Тогда
			ХранимыеДанныеТитулВыпускТранспортноеСредствоПриИзменении(Элементы.ХранимыеДанныеТитулВыпускТранспортноеСредство);
		ИначеЕсли Источник = ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТС Тогда
			ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТСПриИзменении(Элементы.ХранимыеДанныеТитулВыпускОтветственныйЗаСостояниеТС);
		ИначеЕсли Источник = ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанных Тогда
			ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанныхПриИзменении(Элементы.ХранимыеДанныеТитулВыездУполномоченныйНаПроставлениеДанных);
		ИначеЕсли Источник = ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанных Тогда
			ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанныхПриИзменении(Элементы.ХранимыеДанныеТитулЗаездУполномоченныйНаПроставлениеДанных);
		ИначеЕсли Источник = ХранимыеДанныеТитулМедосмотрПослеВодитель Тогда
			ХранимыеДанныеТитулМедосмотрПослеВодительПриИзменении(Элементы.ХранимыеДанныеТитулМедосмотрПослеВодитель);
		ИначеЕсли Источник = ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник Тогда
			ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработникПриИзменении(Элементы.ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник);
		ИначеЕсли Источник = ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник Тогда
			ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработникПриИзменении(Элементы.ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ТитулОформлениеДатаПутевогоЛистаПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеПризнакНачалаРейсаПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
	УстановитьТекущийШагПомощника();
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеОбязательностьМедОсмотраПослеПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	УстановитьТекущийШагПомощника();
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеСведенияОВидеПеревозкиПриИзменении(Элемент)
	
	Если ТитулОформлениеСведенияОВидеПеревозки <> "КП" Тогда
		ТитулОформлениеВидКоммерческойПеревозки = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулОформлениеВидКоммерческойПеревозки");
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеВидКоммерческойПеревозкиПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	Если ТитулОформлениеВидКоммерческойПеревозки <> "ПГ" Тогда
		НужноОбновитьНавигацию = Объект.ТитулОформлениеОбязательностьМедОсмотраПосле <> "1";
		Объект.ТитулОформлениеОбязательностьМедОсмотраПосле = "1";
		ПриИзмененииДанныхНаФорме("ТитулОформлениеОбязательностьМедОсмотраПосле");
		Если НужноОбновитьНавигацию Тогда
			УстановитьТекущийШагПомощника();
		КонецЕсли;
	КонецЕсли;
	Элементы.ТитулОформлениеОбязательностьМедОсмотраПосле.Доступность = ТитулОформлениеВидКоммерческойПеревозки = "ПГ";
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеВидСообщенияПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеОформительСтатусПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеПризнакФормированияПутевогоЛистаНаОдинДеньПриИзменении(Элемент)
	
	Если ТитулОформлениеПризнакФормированияПутевогоЛистаНаОдинДень = "1" Тогда
		ТитулОформлениеДатаНачалаСрокаИспользованияПутевогоЛиста = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулОформлениеДатаНачалаСрокаИспользованияПутевогоЛиста");
		ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста");
	ИначеЕсли ТитулОформлениеПризнакФормированияПутевогоЛистаНаОдинДень = "2" Тогда
		ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован");
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользованПриИзменении(Элемент)
	
	Если ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ТитулОформлениеДатаВТечениеКоторойПутевойЛистМожетБытьИспользован = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
		ПоказатьПредупреждение(, НСтр("ru='Дата действия путевого листа не может быть меньше текущей даты'"));
		Возврат;
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеДатаНачалаСрокаИспользованияПутевогоЛистаПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛистаПриИзменении(Элемент)
	
	Если ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
		ТитулОформлениеДатаОкончанияСрокаИспользованияПутевогоЛиста = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
		ПоказатьПредупреждение(, НСтр("ru='Дата действия путевого листа не может быть меньше текущей даты'"));
		Возврат;
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулМедосмотрВидМедосмотраПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулМедосмотрВариантМедработникПриИзменении(Элемент)
	
	Если ВариантМедработник = 0 Тогда
		ХранимыеДанныеТитулМедосмотрСтороннийМедработник = Неопределено;
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, "ТитулМедосмотрСтороннийМедработник");	
	Иначе
		ХранимыеДанныеТитулМедосмотрШтатныйМедработник = Неопределено;
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, "ТитулМедосмотрШтатныйМедработник");	
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыпускРезультатПроведенияПредсменногоКонтроляПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыпускДатаИВремяПредрейсовогоКонтроляПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыпускДатаИВремяВыпускаНаЛиниюПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыездПризнакНачалаРейсаПриИзменении(Элемент)
	
	КонтейнерОтображаемойВерсии = Неопределено;
	Если ТитулВыездПризнакНачалаРейса = "1" Тогда
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыездДатаИВремяПриема", 
			,, КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыездДатаИВремяВыезда", 
			ОбщегоНазначенияКлиент.ДатаСеанса(), 
			Ложь, КонтейнерОтображаемойВерсии);
	ИначеЕсли ТитулВыездПризнакНачалаРейса = "2" Тогда
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыездДатаИВремяВыезда", 
			,, КонтейнерОтображаемойВерсии);
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
			"ТитулВыездДатаИВремяПриема", 
			ОбщегоНазначенияКлиент.ДатаСеанса(), 
			Ложь, КонтейнерОтображаемойВерсии);
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыездДатаИВремяВыездаПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыездПоказанияОдометраПриВыездеПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыездДатаИВремяПриемаПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулВыездПоказанияОдометраПриПриемеПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаездПризнакОкончанияРейсаПриИзменении(Элемент)
	
	Если Объект.ТитулЗаездПризнакОкончанияРейса = "1" Тогда
		ТитулЗаездДатаИВремяСдачи = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулЗаездДатаИВремяСдачи");
		ТитулЗаездПоказанияОдометраПриСдаче = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулЗаездПоказанияОдометраПриСдаче");
		ТитулЗаездДатаИВремяЗаезда = ОбщегоНазначенияКлиент.ДатаСеанса();
		ПриИзмененииДанныхНаФорме("ТитулЗаездДатаИВремяЗаезда");
	ИначеЕсли Объект.ТитулЗаездПризнакОкончанияРейса = "2" Тогда
		ТитулЗаездДатаИВремяЗаезда = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулЗаездДатаИВремяЗаезда");
		ТитулЗаездПоказанияОдометраПриЗаезде = Неопределено;
		ПриИзмененииДанныхНаФорме("ТитулЗаездПоказанияОдометраПриЗаезде");
		ТитулЗаездДатаИВремяСдачи = ОбщегоНазначенияКлиент.ДатаСеанса();
		ПриИзмененииДанныхНаФорме("ТитулЗаездДатаИВремяСдачи");
	КонецЕсли;
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаездДатаИВремяЗаездаПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаездПоказанияОдометраПриЗаездеПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаездДатаИВремяСдачиПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулЗаездПоказанияОдометраПриСдачеПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулМедосмотрВариантМедработникПослеПриИзменении(Элемент)
	
	Если ВариантМедработникПосле = 0 Тогда
		ХранимыеДанныеТитулМедосмотрПослеСтороннийМедработник = Неопределено;
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, "ТитулМедосмотрПослеСтороннийМедработник");	
	Иначе
		ХранимыеДанныеТитулМедосмотрПослеШтатныйМедработник = Неопределено;
		ОбменСГИСЭПДКлиентСервер.УдалитьРеквизитыПоГруппеДанных(ЭтаФорма, "ТитулМедосмотрПослеШтатныйМедработник");	
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулМедосмотрПослеВидМедосмотраПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулМедосмотрДатаИВремяПроведенияПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулМедосмотрПослеДатаИВремяПроведенияПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
КонецПроцедуры



&НаКлиенте
Процедура ВариантМедосмотрПриИзменении(Элемент)
	
	Объект.ИдентификаторМедорганизации = Неопределено;
	Если ВариантМедосмотр = 0 Тогда
		Объект.СсылкаТитулОформлениеМедорганизация = Неопределено;
		ПриИзмененииДанныхНаФорме("СсылкаТитулОформлениеМедорганизация");
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ВариантТехконтрольПриИзменении(Элемент)
	
	Объект.ИдентификаторТехконтроль = Неопределено;
	Если ВариантТехконтроль = 0 Тогда
		Объект.СсылкаТитулОформлениеТехконтроль = Неопределено;
		ПриИзмененииДанныхНаФорме("СсылкаТитулОформлениеТехконтроль");
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПоказанияОдометраПриИзменении(Элемент)
	
	Объект.ИдентификаторПоказанияОдометра = Неопределено;
	Если ВариантПоказанияОдометра = 0 Тогда
		Объект.СсылкаТитулОформлениеПоказанияОдометра = Неопределено;
		ПриИзмененииДанныхНаФорме("СсылкаТитулОформлениеПоказанияОдометра");
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры



&НаКлиенте
Процедура ТитулОформлениеПредыдущийПутевойЛистПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СсылкаПредыдущийПутевойЛист)
		И Объект.СсылкаПредыдущийПутевойЛист = Объект.Ссылка Тогда
		Объект.СсылкаПредыдущийПутевойЛист = Неопределено;
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
													"ТитулОформлениеУИДМинтрансПредыдущегоЭПЛ");
		ПоказатьПредупреждение(, НСтр("ru='Предыдущий путевой лист не может совпадать с текущим'"));
		Возврат;	
	КонецЕсли;
	
	ПриИзмененииПредыдущегоПутевогоЛиста();

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПредыдущегоПутевогоЛиста()
	
	РеквизитыПЛ = ОбменСГИСЭПДВызовСервера.ЗначенияРеквизитовОбъекта(Объект.СсылкаПредыдущийПутевойЛист, "УИДМинтранс, ТитулЗаездПризнакОкончанияРейса");
	
	Если РеквизитыПЛ.ТитулЗаездПризнакОкончанияРейса <> "2" Тогда
		Объект.СсылкаПредыдущийПутевойЛист = Неопределено;
		ПоказатьПредупреждение(, НСтр("ru='В предыдущем путевом листе должен быть признак ""Сдача транспортного средства"" в титуле Т5 ""Заезд""'"));
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыПЛ.УИДМинтранс) Тогда
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
													"ТитулОформлениеУИДМинтрансПредыдущегоЭПЛ", РеквизитыПЛ.УИДМинтранс);	
	Иначе
		Объект.СсылкаПредыдущийПутевойЛист = Неопределено;
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтаФорма, 
													"ТитулОформлениеУИДМинтрансПредыдущегоЭПЛ");
		ПоказатьПредупреждение(, НСтр("ru='Выбранный путевой лист не зарегистрирован в ГИС ЭПД, выберите другой'"));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулОформлениеПредыдущийПутевойЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("ТитулЗаездПризнакОкончанияРейса", "2");
	ПараметрыФормы.Вставить("Отбор", Отбор); 

	СсылкаТитулОформлениеПредыдущийПутевойЛист_Выбор = Новый ОписаниеОповещения("СсылкаТитулОформлениеПредыдущийПутевойЛист_Выбор", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЭлектронныйПутевойЛист.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , 
		СсылкаТитулОформлениеПредыдущийПутевойЛист_Выбор);
		
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулОформлениеПредыдущийПутевойЛист_Выбор(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.СсылкаПредыдущийПутевойЛист = Результат;
		ПриИзмененииПредыдущегоПутевогоЛиста();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьQR(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТитулВыездИдентификаторФайла) = Ложь Тогда
		ПоказатьПредупреждение(, НСтр("ru='Для формирования QR-кода требуется оформить титул внесения показаний одометра при выезде.'"));
	Иначе
		Отправитель = Объект.ИдентификаторОформителя;
		ПараметрыФормы = Новый Структура;	
		ПараметрыФормы.Вставить("УИДМинтранс", Объект.УИДМинтранс);
		ПараметрыФормы.Вставить("Отправитель", Отправитель);
		ПараметрыФормы.Вставить("НомерДокумента", Объект.ТитулОформлениеНомерПутевогоЛиста);
		ПараметрыФормы.Вставить("ДатаДокумента", Объект.ТитулОформлениеДатаПутевогоЛиста); 
		ПараметрыФормы.Вставить("ТипДокумента", ПредопределенноеЗначение("Перечисление.ВидыЭД.ЭПЛ"));
		
		МассивВодителей = ОбменСГИСЭПДКлиентСервер.МассивЗначенийПоСтрокамТаблицыИзСтруктурыФормы(ЭтаФорма, 
							"ТитулОформлениеВодители", "ХранимыеДанныеВодитель");
							
		ПараметрыФормы.Вставить("Получатели", ОбменСГИСЭПДВызовСервера.ПолучитьПочтуВодителей(МассивВодителей));
		
		ОткрытьФорму("ОбщаяФорма.ОтправкаQR", 
						ПараметрыФормы, 
						ЭтаФорма, 
						УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьМедосмотрПосле(Команда)
	
	ВводимМедосмотрПосле = Истина;
	
	Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ЭПЛ_Титул6");
	
	НомерШага = 6;
	Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 1) = Ложь
		И ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 8) = Ложь Тогда
		НомерШага = НомерШага - 1;
	КонецЕсли;		
	Если Объект.ТитулОформлениеПризнакНачалаРейса = "2"
		Или ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(Объект.РольУчастника, 4) = Ложь Тогда  
		НомерШага = НомерШага - 1;
	КонецЕсли;		
	УстановитьВидимостьСтраницыТитулМедосмотрПосле("Шаг" + Строка(НомерШага));
	
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЛ(ЭтаФорма);
	ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВводаДопТитула(Команда)
	
	Объект.ТекущийТитул = Неопределено;
	ВводимМедосмотрПосле = Ложь;
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭПЛ(ЭтаФорма);
	УстановитьТекущийШагПомощника();
	
КонецПроцедуры
