
/////////////////////////////////////////////////////
//
// Определяемые типы
//
/////////////////////////////////////////////////////

Функция ОпределяемыеТипыУПП() Экспорт

	Типы = Новый Структура;
	Типы.Вставить("gln",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(13)
)));
	Типы.Вставить("gtin",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(14)
)));
	Типы.Вставить("rfidepc",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(30)
)));
	Типы.Вставить("rfidtid",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(24)
)));
	Типы.Вставить("артикул",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(50)
)));
	Типы.Вставить("денежнаясуммагосиснеотрицательная",Новый Структура("Тип", Новый ОписаниеТипов("
		|Число
		|"
		,Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Неотрицательный)
)));
	Типы.Вставить("документыегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТТНВходящаяЕГАИС
		|,ДокументСсылка.ЧекЕГАИСВозврат
		|,ДокументСсылка.ЧекЕГАИС
		|,ДокументСсылка.ТТНИсходящаяЕГАИС
		|,ДокументСсылка.АктПостановкиНаБалансЕГАИС
		|,ДокументСсылка.АктСписанияЕГАИС
		|,ДокументСсылка.ЗапросАкцизныхМарокЕГАИС
		|,ДокументСсылка.ОстаткиЕГАИС
		|,ДокументСсылка.ОтчетЕГАИС
		|,ДокументСсылка.ЧекККМ
		|,ДокументСсылка.ПередачаВРегистр2ЕГАИС
		|,ДокументСсылка.ВозвратИзРегистра2ЕГАИС
		|,ДокументСсылка.УведомлениеОПланируемомИмпортеЕГАИС
		|,ДокументСсылка.ОтчетОПроизводствеЕГАИС
		|,ДокументСсылка.ОтчетОбИмпортеЕГАИС
		|"
)));
	Типы.Вставить("документыегаисподдерживающиестатусыоформления",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТТНВходящаяЕГАИС
		|,ДокументСсылка.ЧекЕГАИСВозврат
		|,ДокументСсылка.ЧекЕГАИС
		|,ДокументСсылка.ТТНИсходящаяЕГАИС
		|,ДокументСсылка.АктПостановкиНаБалансЕГАИС
		|,ДокументСсылка.АктСписанияЕГАИС
		|,ДокументСсылка.ПередачаВРегистр2ЕГАИС
		|,ДокументСсылка.ВозвратИзРегистра2ЕГАИС
		|,ДокументСсылка.ОтчетОПроизводствеЕГАИС
		|,ДокументСсылка.ОтчетОбИмпортеЕГАИС
		|,ДокументСсылка.УведомлениеОПланируемомИмпортеЕГАИС
		|"
)));
	Типы.Вставить("документыегаисподдерживающиестатусыоформленияобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ТТНВходящаяЕГАИС
		|,ДокументОбъект.ЧекЕГАИСВозврат
		|,ДокументОбъект.ЧекЕГАИС
		|,ДокументОбъект.ТТНИсходящаяЕГАИС
		|,ДокументОбъект.АктПостановкиНаБалансЕГАИС
		|,ДокументОбъект.АктСписанияЕГАИС
		|,ДокументОбъект.ПередачаВРегистр2ЕГАИС
		|,ДокументОбъект.ВозвратИзРегистра2ЕГАИС
		|,ДокументОбъект.УведомлениеОПланируемомИмпортеЕГАИС
		|,ДокументОбъект.ОтчетОПроизводствеЕГАИС
		|,ДокументОбъект.ОтчетОбИмпортеЕГАИС
		|"
)));
	Типы.Вставить("документыисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.МаркировкаТоваровИСМП
		|,ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|,ДокументСсылка.ВыводИзОборотаИСМП
		|,ДокументСсылка.СписаниеКодовМаркировкиИСМП
		|,ДокументСсылка.ПеремаркировкаТоваровИСМП
		|,ДокументСсылка.ОтгрузкаТоваровИСМП
		|,ДокументСсылка.ВозвратВОборотИСМП
		|,ДокументСсылка.ПриемкаТоваровИСМП
		|,ДокументСсылка.УточнениеСведенийОКодахМаркировкиИСМП
		|,ДокументСсылка.ПодключениеКегаКОборудованиюРозливаИСМП
		|,ДокументСсылка.ОтчетИСМП
		|"
)));
	Типы.Вставить("документыисмпподдерживающиестатусыоформления",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.МаркировкаТоваровИСМП
		|,ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|,ДокументСсылка.ВыводИзОборотаИСМП
		|,ДокументСсылка.ПеремаркировкаТоваровИСМП
		|,ДокументСсылка.ОтгрузкаТоваровИСМП
		|,ДокументСсылка.ПриемкаТоваровИСМП
		|"
)));
	Типы.Вставить("документыисмпподдерживающиестатусыоформленияобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.МаркировкаТоваровИСМП
		|,ДокументОбъект.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|,ДокументОбъект.ВыводИзОборотаИСМП
		|,ДокументОбъект.ПеремаркировкаТоваровИСМП
		|,ДокументОбъект.ОтгрузкаТоваровИСМП
		|,ДокументОбъект.ПриемкаТоваровИСМП
		|"
)));
	Типы.Вставить("единицаизмерения",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.ЕдиницыИзмерения
		|"
)));
	Типы.Вставить("кодакцизноймарки",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(150)
)));
	Типы.Вставить("количествоегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|Число
		|"
		,Новый КвалификаторыЧисла(18,4)
)));
	Типы.Вставить("количествоегаиснеотрицательное",Новый Структура("Тип", Новый ОписаниеТипов("
		|Число
		|"
		,Новый КвалификаторыЧисла(18,4,ДопустимыйЗнак.Неотрицательный)
)));
	Типы.Вставить("контрагентгосис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Контрагенты
		|"
)));
	Типы.Вставить("номенклатура",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Номенклатура
		|"
)));
	Типы.Вставить("источникописанияноменклатурыис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Номенклатура
		|"
)));
	Типы.Вставить("организация",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Организации
		|"
)));
	Типы.Вставить("организацияконтрагентгосис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Организации
		|,СправочникСсылка.Контрагенты
		|"
)));
	Типы.Вставить("основаниеактапостановкинабалансегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТТНВходящаяЕГАИС
		|,ДокументСсылка.ОприходованиеТоваров
		|"
)));
	Типы.Вставить("основаниеактапостановкинабалансегаисобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ТТНВходящаяЕГАИС
		|,ДокументОбъект.ОприходованиеТоваров
		|,ДокументОбъект.АктПостановкиНаБалансЕГАИС
		|"
)));
	Типы.Вставить("основаниеактасписанияегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.СписаниеТоваров
		|,ДокументСсылка.ОтчетОРозничныхПродажах
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниеактасписанияегаисобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ТребованиеНакладная
		|,ДокументОбъект.ОтчетОРозничныхПродажах
		|,ДокументОбъект.СписаниеТоваров
		|,ДокументОбъект.АктСписанияЕГАИС
		|,ДокументОбъект.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниевозвратаизрегистра2егаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТТНИсходящаяЕГАИС
		|"
)));
	Типы.Вставить("основаниевозвратвоборотисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(10)
)));
	Типы.Вставить("основаниевыводаизоборотаисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ЧекККМ
		|,ДокументСсылка.ОтчетОРозничныхПродажах
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.СписаниеТоваров
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниеОтгрузкаТоваровисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|"
)));
	Типы.Вставить("основаниезаказнаэмиссиюкодовмаркировкиисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ЗаказПоставщику
		|,ДокументСсылка.ПеремаркировкаТоваровИСМП
		|,ДокументСсылка.МаркировкаТоваровИСМП
		|"
)));
	Типы.Вставить("основаниезапросаакцизныхмарокегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(10)
)));
	Типы.Вставить("основаниемаркировкатоваровисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.КомплектацияНоменклатуры
		|,ДокументСсылка.ПоступлениеТоваровУслуг
		|,ДокументСсылка.ОприходованиеТоваров
		|,ДокументСсылка.ИнвентаризацияТоваровНаСкладе
		|"
)));
	Типы.Вставить("основаниепередачиврегистр2егаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТТНВходящаяЕГАИС
		|"
)));
	Типы.Вставить("основаниеперемаркировкитоваровисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ВозвратТоваровОтПокупателя
		|"
)));
	Типы.Вставить("основаниесписаниекодовмаркировкиисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(1)
)));
	Типы.Вставить("основаниестатусыоформлениядокументовегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.ТТНВходящаяЕГАИС
		|,ДокументСсылка.ВозвратТоваровОтПокупателя
		|,ДокументСсылка.ПоступлениеТоваровУслуг
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.ТТНИсходящаяЕГАИС
		|,ДокументСсылка.СписаниеТоваров
		|,ДокументСсылка.ПеремещениеТоваров
		|,ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ОтчетОРозничныхПродажах
		|,ДокументСсылка.ОприходованиеТоваров
		|,ДокументСсылка.ЗаказПоставщику
		|,ДокументСсылка.УведомлениеОПланируемомИмпортеЕГАИС
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниестатусыоформлениядокументовегаисобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|Документобъект.ТребованиеНакладная
		|,Документобъект.ТТНВходящаяЕГАИС
		|,Документобъект.ВозвратТоваровОтПокупателя
		|,Документобъект.ПоступлениеТоваровУслуг
		|,Документобъект.ВозвратТоваровПоставщику
		|,Документобъект.ТТНИсходящаяЕГАИС
		|,Документобъект.СписаниеТоваров
		|,Документобъект.ПеремещениеТоваров
		|,Документобъект.РеализацияТоваровУслуг
		|,Документобъект.ОтчетОРозничныхПродажах
		|,Документобъект.ОприходованиеТоваров
		|,Документобъект.ЗаказПоставщику
		|,Документобъект.УведомлениеОПланируемомИмпортеЕГАИС
		|,Документобъект.КомплектацияНоменклатуры
		|,Документобъект.ЧекЕГАИСВозврат
		|,Документобъект.ЧекЕГАИС
		|,Документобъект.ВозвратИзРегистра2ЕГАИС
		|,Документобъект.АктСписанияЕГАИС
		|,Документобъект.ПередачаВРегистр2ЕГАИС
		|,Документобъект.АктПостановкиНаБалансЕГАИС
		|,Документобъект.ОтчетОПроизводствеЕГАИС
		|,Документобъект.ОтчетОбИмпортеЕГАИС
		|"
)));
	Типы.Вставить("основаниеприемкатоваровисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ПоступлениеТоваровУслуг, 
		|ДокументСсылка.ВозвратТоваровОтПокупателя
		|"
)));

	Типы.Вставить("ДокументПродажиИСМП",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.РеализацияТоваровУслуг, 
		|ДокументСсылка.ЧекККМ
		|"
)));

	Типы.Вставить("основаниестатусыоформлениядокументовисмп",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ЗаказПоставщику
		|,ДокументСсылка.ПоступлениеТоваровУслуг
		|,ДокументСсылка.ОприходованиеТоваров
		|,ДокументСсылка.КомплектацияНоменклатуры
		|,ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ЧекККМ
		|,ДокументСсылка.ОтчетОРозничныхПродажах
		|,ДокументСсылка.ВозвратТоваровОтПокупателя
		|,ДокументСсылка.ПеремаркировкаТоваровИСМП
		|,ДокументСсылка.МаркировкаТоваровИСМП
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.СписаниеТоваров
		|,ДокументСсылка.ИнвентаризацияТоваровНаСкладе
		|"
)));
	Типы.Вставить("основаниестатусыоформлениядокументовисмпобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ЗаказПоставщику
		|,ДокументОбъект.ПоступлениеТоваровУслуг
		|,ДокументОбъект.ОприходованиеТоваров
		|,ДокументОбъект.КомплектацияНоменклатуры
		|,ДокументОбъект.РеализацияТоваровУслуг
		|,ДокументОбъект.ОтчетОРозничныхПродажах
		|,ДокументОбъект.ЧекККМ
		|,ДокументОбъект.ВозвратТоваровОтПокупателя
		|,ДокументОбъект.ПеремаркировкаТоваровИСМП
		|,ДокументОбъект.МаркировкаТоваровИСМП
		|,ДокументОбъект.ВозвратТоваровПоставщику
		|,ДокументОбъект.ТребованиеНакладная
		|,ДокументОбъект.СписаниеТоваров
		|,ДокументОбъект.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|,ДокументОбъект.ВыводИзОборотаИСМП
		|,ДокументОбъект.ОтгрузкаТоваровИСМП
		|,ДокументОбъект.ИнвентаризацияТоваровНаСкладе
		|,ДокументОбъект.ПриемкаТоваровИСМП
		|"
)));
	Типы.Вставить("основаниеттнвходящаяегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ПоступлениеТоваровУслуг
		|,ДокументСсылка.ПеремещениеТоваров
		|"
)));
	Типы.Вставить("основаниеттнвходящаяегаисобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ТТНВходящаяЕГАИС
		|,ДокументОбъект.ПеремещениеТоваров
		|,ДокументОбъект.ПоступлениеТоваровУслуг
		|"
)));
	Типы.Вставить("основаниеттнисходящаяегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.ПеремещениеТоваров
		|,ДокументСсылка.РеализацияТоваровУслуг
		|"
)));
	Типы.Вставить("основаниеттнисходящаяегаисобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ВозвратТоваровПоставщику
		|,ДокументОбъект.ТТНИсходящаяЕГАИС
		|,ДокументОбъект.ПеремещениеТоваров
		|,ДокументОбъект.РеализацияТоваровУслуг
		|"
)));
	Типы.Вставить("основаниечекаегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниечекаегаисвозврат",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ВозвратТоваровОтПокупателя
		|"
)));
	Типы.Вставить("основаниечекаегаисвозвратобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ЧекЕГАИСВозврат
		|,ДокументОбъект.ВозвратТоваровОтПокупателя
		|"
)));
	Типы.Вставить("основаниечекаегаисобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ТребованиеНакладная
		|,ДокументОбъект.ЧекЕГАИС
		|,ДокументОбъект.РеализацияТоваровУслуг
		|,ДокументОбъект.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("пользователиис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Пользователи
		|"
)));
	Типы.Вставить("пользователь",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Пользователи
		|"
)));
	Типы.Вставить("производственныйобъектис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Подразделения
		|"
)));
	Типы.Вставить("рабочиеместаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.РабочиеМеста
		|"
)));
	Типы.Вставить("серияноменклатуры",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.СерииНоменклатуры
		|"
)));
	Типы.Вставить("склад",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Склады
		|"
)));
	Типы.Вставить("ставкандс",Новый Структура("Тип", Новый ОписаниеТипов("
		|ПеречислениеСсылка.СтавкиНДС
		|"
)));
	Типы.Вставить("строкаегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(50)
)));
	Типы.Вставить("типноменклатуры",Новый Структура("Тип", Новый ОписаниеТипов("
		|ПеречислениеСсылка.ТипыНоменклатуры
		|"
)));
	Типы.Вставить("торговыйобъектегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Склады
		|"
)));
	Типы.Вставить("удалениеприсоединенныхфайловобъектегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ЧекЕГАИСВозврат
		|,ДокументОбъект.ТТНВходящаяЕГАИС
		|,ДокументОбъект.ЧекККМ
		|,ДокументОбъект.ОстаткиЕГАИС
		|,ДокументОбъект.ЧекЕГАИС
		|,ДокументОбъект.ВозвратИзРегистра2ЕГАИС
		|,ДокументОбъект.ТТНИсходящаяЕГАИС
		|,ДокументОбъект.АктСписанияЕГАИС
		|,ДокументОбъект.ПередачаВРегистр2ЕГАИС
		|,ДокументОбъект.ОтчетЕГАИС
		|,ДокументОбъект.АктПостановкиНаБалансЕГАИС
		|,ДокументОбъект.ЗапросАкцизныхМарокЕГАИС
		|"
)));
	Типы.Вставить("уникальныйидентификаторис",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(36)
)));
	Типы.Вставить("упаковка",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.ЕдиницыИзмерения
		|"
)));
	Типы.Вставить("характеристиканоменклатуры",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.ХарактеристикиНоменклатуры
		|"
)));
	Типы.Вставить("шаблонэтикеткиис",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(10)
)));
	Типы.Вставить("ИдентификаторПроисхожденияВЕТИС",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(10)
)));
	Типы.Вставить("СборкаРазборкаЧастичноеВыбытиеИСМП",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.КомплектацияНоменклатуры
		|"
)));

	Типы.Вставить("ОснованиеУточненияСведенийОКодахМаркировкиИСМП",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.МаркировкаТоваровИСМП
		|"
)));

	Типы.Вставить("владелецприсоединенныхфайловзерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ЗапросОстатковПартийЗЕРНО
		|,ДокументСсылка.ОформлениеСДИЗЗЕРНО
		|,ДокументСсылка.ПогашениеСДИЗЗЕРНО
		|,ДокументСсылка.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументСсылка.СписаниеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийИзДругихПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийПриПроизводствеЗЕРНО
		|,СправочникСсылка.Организации
		|"
)));
	Типы.Вставить("документызерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ЗапросОстатковПартийЗЕРНО
		|,ДокументСсылка.ОформлениеСДИЗЗЕРНО
		|,ДокументСсылка.ПогашениеСДИЗЗЕРНО
		|,ДокументСсылка.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументСсылка.СписаниеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийИзДругихПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийПриПроизводствеЗЕРНО
		|"
)));
	Типы.Вставить("документызерноподдерживающиестатусыоформления",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ОформлениеСДИЗЗЕРНО
		|,ДокументСсылка.ПогашениеСДИЗЗЕРНО
		|,ДокументСсылка.ФормированиеПартийПриПроизводствеЗЕРНО
		|,ДокументСсылка.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументСсылка.СписаниеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийПриПроизводствеЗЕРНО
		|"
)));
	Типы.Вставить("документызерноподдерживающиестатусыоформленияобъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ОформлениеСДИЗЗЕРНО
		|,ДокументОбъект.ПогашениеСДИЗЗЕРНО
		|,ДокументОбъект.ФормированиеПартийПриПроизводствеЗЕРНО
		|,ДокументОбъект.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументОбъект.СписаниеПартийЗЕРНО
		|,ДокументОбъект.ФормированиеПартийЗЕРНО
		|,ДокументОбъект.ФормированиеПартийПриПроизводствеЗЕРНО
		|"
)));
	Типы.Вставить("значениепотребительскогосвойствазерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|,Число
		|,Булево"
)));
	Типы.Вставить("объектысинхронизациизерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.РеестрМестФормированияПартийЗЕРНО
		|,СправочникСсылка.РеестрПартийЗЕРНО
		|,СправочникСсылка.РезультатыИсследованийЗЕРНО
		|,СправочникСсылка.СДИЗЗЕРНО
		|,ДокументСсылка.ОформлениеСДИЗЗЕРНО
		|,ДокументСсылка.ПогашениеСДИЗЗЕРНО
		|,ДокументСсылка.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументСсылка.СписаниеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийЗЕРНО
		|,ДокументСсылка.ФормированиеПартийИзДругихПартийЗЕРНО
		|,СправочникСсылка.КлассификаторНСИЗЕРНО
		|,ДокументСсылка.ЗапросОстатковПартийЗЕРНО
		|,ПеречислениеСсылка.ВидыКлассификаторовЗЕРНО
		|,ДокументСсылка.ФормированиеПартийПриПроизводствеЗЕРНО
		|,СправочникСсылка.Организации
		|,СправочникСсылка.КлючиРеквизитовОрганизацийЗЕРНО
		|,СправочникСсылка.РеестрЭлеваторовЗЕРНО
		|"
)));
	Типы.Вставить("окпд2ис",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка"
		,,Новый КвалификаторыСтроки(10)
)));
	Типы.Вставить("основаниевнесениесведенийособранномурожаезерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
)));
	Типы.Вставить("основаниезапросостатковпартийзерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(1)
)));
	Типы.Вставить("основаниеоформлениесдиззерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ФормированиеПартийЗЕРНО
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.ПеремещениеТоваров
		|"
)));
	Типы.Вставить("основаниепогашениесдиззерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ПоступлениеТоваровУслуг
		|,ДокументСсылка.ВозвратТоваровОтПокупателя
		|,ДокументСсылка.ПеремещениеТоваров
		|"
)));
	Типы.Вставить("основаниесписаниепартийзерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.СписаниеТоваров
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниестатусыоформлениядокументовзерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ПоступлениеТоваровУслуг
		|,СправочникСсылка.СДИЗЗЕРНО
		|,СправочникСсылка.РезультатыИсследованийЗЕРНО
		|,ДокументСсылка.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументСсылка.ОприходованиеТоваров
		|,ДокументСсылка.СписаниеТоваров
		|,ДокументСсылка.ФормированиеПартийЗЕРНО
		|,ДокументСсылка.ТребованиеНакладная
		|,ДокументСсылка.ВозвратТоваровПоставщику
		|,ДокументСсылка.ЗаказПоставщику
		|,ДокументСсылка.РеализацияТоваровУслуг
		|,ДокументСсылка.ВозвратТоваровОтПокупателя
		|,ДокументСсылка.ПеремещениеТоваров
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниестатусыоформлениядокументовзернообъект",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументОбъект.ПоступлениеТоваровУслуг
		|,ДокументОбъект.СписаниеТоваров
		|,ДокументОбъект.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,СправочникОбъект.СДИЗЗЕРНО
		|,ДокументОбъект.ПогашениеСДИЗЗЕРНО
		|,ДокументОбъект.ОформлениеСДИЗЗЕРНО
		|,ДокументОбъект.СписаниеПартийЗЕРНО
		|,ДокументОбъект.ФормированиеПартийЗЕРНО
		|,ДокументОбъект.ФормированиеПартийПриПроизводствеЗЕРНО
		|,СправочникОбъект.РезультатыИсследованийЗЕРНО
		|,ДокументОбъект.ОприходованиеТоваров
		|,ДокументОбъект.ТребованиеНакладная
		|,ДокументОбъект.ВозвратТоваровПоставщику
		|,ДокументОбъект.ЗаказПоставщику
		|,ДокументОбъект.РеализацияТоваровУслуг
		|,ДокументОбъект.ВозвратТоваровОтПокупателя
		|,ДокументОбъект.ПеремещениеТоваров
		|,ДокументОбъект.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("основаниеформированиепартиизерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.РезультатыИсследованийЗЕРНО
		|,ДокументСсылка.ВнесениеСведенийОСобранномУрожаеЗЕРНО
		|,ДокументСсылка.ОприходованиеТоваров
		|,ДокументСсылка.ЗаказПоставщику
		|"
)));
	Типы.Вставить("основаниеформированиепартиииздругихпартийзерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(10)
)));
	Типы.Вставить("основаниеформированиепартииприпроизводствезерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("пунктназначениязерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Организации
		|,СправочникСсылка.Склады
		|,СправочникСсылка.Контрагенты
		|,СправочникСсылка.РеестрЭлеваторовЗЕРНО
		|"
)));
	Типы.Вставить("складконтрагентзерно",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Склады
		|,СправочникСсылка.Контрагенты
		|"
)));
	Типы.Вставить("основаниеуведомлениеопланируемомимпортеегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ЗаказПоставщику
		|"
)));
	Типы.Вставить("основаниеотчетопроизводствеегаис",Новый Структура("Тип", Новый ОписаниеТипов("
		|ДокументСсылка.ОприходованиеТоваров
		|,ДокументСсылка.КомплектацияНоменклатуры
		|"
)));
	Типы.Вставить("подразделение",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.Подразделения
		|"
)));

	Типы.Вставить("ДоговорКонтрагентаИС",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.ДоговорыКонтрагентов
		|"
)));

	Типы.Вставить("ЗемельныйУчастокИС",Новый Структура("Тип", Новый ОписаниеТипов("
		|СправочникСсылка.ЗемельныеУчасткиИС
		|"
)));
	Типы.Вставить("ОснованиеОтчетИСМП",Новый Структура("Тип", Новый ОписаниеТипов("
		|Строка
		|"
		,
		,Новый КвалификаторыСтроки(10)
)));
	Возврат Новый ФиксированнаяСтруктура(Типы);
	
КонецФункции

