
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает объект обработчика драйвера по его наименованию.
// 
// Параметры:
// 	ОбработчикДрайвера
// 	ЗагружаемыйДрайвер
// 	ТипОборудованияИмя
// Возвращаемое значение:
// 	
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт
	
	Возврат МенеджерОборудованияКлиентПереопределяемый.ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя);
	   
КонецФункции

// Функция возвращает список подключенного в справочнике ПО
//
// Параметры:
// 	ТипыПО - Неопределено - Описание.
// 	Идентификатор - Неопределено - Описание.
// 	РабочееМесто - Неопределено - Описание.
// Возвращаемое значение:
// Массив из Структура - содержит:
// *Наименование - Строка - .
// 
Функция ОборудованиеПоПараметрам(ТипыПО = Неопределено, Идентификатор = Неопределено, 
	РабочееМесто = Неопределено, ТолькоАвтоматическаяФискализация = Ложь) Экспорт

	Возврат МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипыПО, Идентификатор, РабочееМесто, ТолькоАвтоматическаяФискализация);

КонецФункции

// Возвращает структуру параметров конкретного экземпляра устройства.
// При первом обращении получает из БД сохраненные ранее параметры.
Функция ПолучитьПараметрыУстройства(Идентификатор) Экспорт

	Возврат МенеджерОборудованияВызовСервера.ПолучитьПараметрыУстройства(Идентификатор);

КонецФункции

// Функция возвращает структуру с данными устройства
// (со значениями реквизитов элемента справочника).
// 
// Параметры:
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - .
// Возвращаемое значение:
// 	Структура - Описание:
// *ОбработчикДрайвераИмя - Строка - имя драйвера.
// *ОбработчикДрайвера - Строка - обработчик драйвера. 
// *ИмяКомпьютера - Строка - наименование компьютера. 
// *РабочееМесто - СправочникСсылка.РабочиеМеста - рабочее место.
// *Параметры - Структура - структура с полями:
// **ДатаНачала - Дата - .
// **ДатаОкончания - Дата - .
// **ПериодВыгрузки - Структура - структура с полями:
// ***ДатаНачала - Дата - дата начала загрузки.
// ***ДатаОкончания - Дата - дата окончания загрузки. 
// *ИмяФайлаДрайвера - Строка - имя файла драйвера.
// *ИмяМакетаДрайвера - Строка - имя макета драйвера.
// *ПоставляетсяДистрибутивом - Булево - признак поставки дистрибутивом.
// *ИдентификаторОбъекта - Строка - идентификатор объекта строкой.
// *ВСоставеКонфигурации - Булево - признак поставке в составе конфигурации.
// *ДрайверОборудованияИмя - Строка - драйвер оборудования строкой.
// *ДрайверОборудования - СправочникСсылка.ПодключаемоеОборудование - драйвер оборудования.
// *ТипОборудованияИмя - Строка - тип опоборудования строкой.
// *ТипОборудования - ПеречислениеСсылка.ТипыПодключаемогоОборудования - тип оборудования.
// *Наименование - Строка - наименование оборудования.
// *ИдентификаторУстройства - Строка - идентификатор устройства.
// *Ссылка - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
//
Функция ПолучитьДанныеУстройства(Идентификатор) Экспорт

	Возврат МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);

КонецФункции

// Функция возвращает поддерживает ли фискальное устройство.
//
Функция ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства);
	
КонецФункции

// Функция возвращает для фискального устройства версию ФФД.
//
Функция ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства)
	
КонецФункции

// Возвращает имя компьютера клиента.
// При первом обращении получает имя компьютера из переменной сеанса.
Функция ПолучитьРабочееМестоКлиента() Экспорт

	Возврат МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();

КонецФункции

// Возвращает имя компьютера клиента.
// При первом обращении получает имя компьютера из переменной сеанса.
Функция НайтиРабочиеМестаПоИД(ИдентификаторКлиента) Экспорт

	Возврат МенеджерОборудованияВызовСервера.НайтиРабочиеМестаПоИД(ИдентификаторКлиента);

КонецФункции

// Создает структуру и заполняет параметры работы клиента на сервере
// Стандарт Минимизация количества серверных вызовов и трафика.
//
// Возвращаемое значение:
//   Структура:
//    * ИдентификаторКлиента - Строка - (входящий) идентификатор рабочего места клиента
//    * ИменаМакетовДляПереустановки - Массив из Строка - имена макетов для переустановки внешних компонент
//    * ИдентификаторОбсужденияРаспределеннойФискализации - ИдентификаторОбсужденияСистемыВзаимодействия -
Функция ПараметрыРаботыКлиентаПриЗапуске() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("ИдентификаторКлиентаБПО", Неопределено);
	Параметры.Вставить("ИменаМакетовДляПереустановки", Неопределено);
	Параметры.Вставить("ИдентификаторОбсужденияРаспределеннойФискализации", Неопределено);
	
	Параметры.ИдентификаторКлиентаБПО = МенеджерОборудованияКлиентСервер.ИдентификаторКлиентаДляРабочегоМеста();
	МенеджерОборудованияВызовСервера.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	
	Возврат Параметры;
	
КонецФункции

// Возвращает Истина, если клиентское приложение запущено под управлением ОС Linux.
//
Функция ЭтоLinuxКлиент() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	Возврат ЭтоLinuxКлиент;
	
КонецФункции

// Получает ревизию требований для драйверов подключаемого оборудования.
//
Функция РевизияИнтерфейсаДрайверов() Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.РевизияИнтерфейсаДрайверов();
	
КонецФункции

// Получить код типа расчета денежными средствами.
// 
Функция КодРасчетаДенежнымиСредствами(ТипРасчета) Экспорт
	
	Возврат МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ТипРасчета);
	
КонецФункции

// Возвращает Истина, если "функциональная" подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
//
// У "функциональной" подсистемы снят флажок "Включать в командный интерфейс".
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ПодсистемаСуществует(ПолноеИмяПодсистемы);
	
КонецФункции

// Возвращает Истина если существует подсистема СтандартныеПодсистемы.БазоваяФункциональность
// 
Функция ИспользуетсяБазоваяФункциональность() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность");
	
КонецФункции    

// Возвращает Истина, если используется подсистемы фискальных устройств и эти подсистемы существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
//
// У хотя бы одной "функциональной" подсистемы включен флажок "Включать в командный интерфейс".
//
// Возвращаемое значение:
//  Булево.
//
Функция ИспользуетсяПодсистемыФискальныхУстройств() Экспорт
	
	Возврат МенеджерОборудованияВызовСервера.ИспользуетсяПодсистемыФискальныхУстройств();
	
КонецФункции

// Возвращает словарь реквизитов и возможных вариантов имен параметров производителя драйверов
//
// Возвращаемое значение:
//  Структура - возможные варианты определенных значений параметров оборудования:
//   * LogEnabled - Структура - флаг включен ли лог файл
//   * LogPath  - Структура - путь к лог файлу
//   * PrintDoc - Структура - Печатать документы на кассовой ленте
//   * PrintSlip - Структура - печатать слип чек на эквайринговом терминале
//   * OfdServer - Структура - адрес сервера оператора фискальных данных 
//   * OfdPort - Структура - порт сервера  оператора фискальных данных
Функция СловарьКлючевыхСвойств() Экспорт
	
	СловарьКлючевыхСвойств = Новый Структура();
	
	Словарь = Новый Структура();
	СловарьКлючевыхСвойств.Вставить("LogEnabled", Словарь);
	Словарь.Вставить("DebugLog");
	Словарь.Вставить("LogEnabled");
	Словарь.Вставить("DebugLogEnabled");
	Словарь.Вставить("SaveLog");
	Словарь.Вставить("Debug");
	Словарь.Вставить("DebugLogEnabled");
	Словарь.Вставить("EnableLog");
	Словарь.Вставить("log_use");
	Словарь.Вставить("EventLogging");
	Словарь.Вставить("EnableDebugLog");
	
	Словарь = Новый Структура();
	СловарьКлючевыхСвойств.Вставить("LogPath", Словарь);
	Словарь.Вставить("LogFilePath");
	Словарь.Вставить("LogErrorPath");
	Словарь.Вставить("LogPath");
	Словарь.Вставить("LogFilePath");
	Словарь.Вставить("LogFileName");
	
	Словарь = Новый Структура();
	СловарьКлючевыхСвойств.Вставить("PrintDoc", Словарь);
	Словарь.Вставить("PrintDoc");
	Словарь.Вставить("PrintDocOnReceiptPaper");
	Словарь.Вставить("NoRecPrint", "Инвертировать");
	
	Словарь = Новый Структура();
	СловарьКлючевыхСвойств.Вставить("PrintSlip", Словарь);
	Словарь.Вставить("PrintSlip");
	Словарь.Вставить("PrintSlipOnTerminal");
	Словарь.Вставить("pos_slip");
	Словарь.Вставить("TerminalPrintSlip");
	
	Словарь = Новый Структура();
	СловарьКлючевыхСвойств.Вставить("OfdServer", Словарь);
	Словарь.Вставить("OfdHostPort");
	Словарь.Вставить("OfdServer");
	Словарь.Вставить("DeviceOfdHost");
	Словарь.Вставить("OFDURL");
	Словарь.Вставить("ofdAddress");
	Словарь.Вставить("OFDAddr");
	
	Словарь = Новый Структура();
	СловарьКлючевыхСвойств.Вставить("OfdPort", Словарь);
	Словарь.Вставить("OfdServerPort");
	Словарь.Вставить("DeviceOfdPort");
	Словарь.Вставить("OFDPort");
	Словарь.Вставить("PortFDO");
	
	Возврат СловарьКлючевыхСвойств;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль.
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Попытка
		Модуль = Вычислить(Имя);
	Исключение
		Модуль = Неопределено;
	КонецПопытки;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтрЗаменить(НСтр("ru = 'Общий модуль ""%1"" не найден.'"), "%1", Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Функция возвращает набор пользовательских настроек,
// связанных с механизмом подключаемого оборудования
Функция ПолучитьПользовательскиеНастройкиПодключаемогоОборудования() Экспорт
	
	Возврат МенеджерОборудованияСервер.ПолучитьПользовательскиеНастройкиПодключаемогоОборудования();
	
КонецФункции

#Область ПанельАдминистрирования

// Возвращает описание команды по имени элемента формы.
// 
// Параметры:
//  ИмяКомандыВФорме Имя команды в форме
//  АдресНастроек Адрес настроек
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//   * Вид - Строка
//   * Идентификатор - Строка
//   * Представление - Строка
//   * Подменю - Строка
//   * Важность - Строка
//   * Порядок - Число
//   * Картинка - Картинка
//   * СочетаниеКлавиш - СочетаниеКлавиш
//   * ОтображениеКнопки - Неопределено
//   * ТолькоВоВсехДействиях - Булево
//   * ЗначениеПометки - Строка
//   * ТипПараметра - ОписаниеТипов
//   * ВидимостьВФормах - Строка
//   * Назначение - Строка
//   * ФункциональныеОпции - Строка
//   * УсловияВидимости - Массив
//   * ИзменяетВыбранныеОбъекты - Булево
//   * МножественныйВыбор - Булево, Неопределено
//   * РежимЗаписи - Строка
//   * ТребуетсяРаботаСФайлами - Булево
//   * Менеджер - Строка
//   * Обработчик - Строка
//   * ДополнительныеПараметры - Структура
//   * ИмяФормы - Строка
//   * ПараметрыФормы - Структура, Неопределено
//   * ИмяПараметраФормы - Строка
//   * ПорядокВажности - Число
//   * ИмяВФорме - Строка
//   * ЕстьУсловияВидимости - Булево
//   * КлючПараметровРазмещения - Строка
//
Функция ОписаниеКомандыПанелиАдминистрирования(ИмяКомандыВФорме, АдресНастроек) Экспорт
	Результат =  МенеджерОборудованияВызовСервера.ОписаниеКомандыПанелиАдминистрирования(ИмяКомандыВФорме, АдресНастроек);
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти