
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет, является ли страна мира государством-членом таможенного союза (ЕАЭС)
// Параметры
// СтранаРегистрацииКонтрагента - СправочникСсылка.СтраныМира - страна мира
//
// Возвращаемое значение:
//  Булево - Истина, если переданная страна является государством-членом таможенного союза (ЕАЭС)
//  Для российских контрагентов возвращается Ложь.
Функция ГосударствоЧленТаможенногоСоюза(СтранаРегистрацииКонтрагента) Экспорт

	Если ЗначениеЗаполнено(СтранаРегистрацииКонтрагента)
		И ТипЗнч(СтранаРегистрацииКонтрагента) = Тип("СправочникСсылка.КлассификаторСтранМира")
		И СтранаРегистрацииКонтрагента <> Справочники.КлассификаторСтранМира.Россия Тогда
		
		Возврат УправлениеКонтактнойИнформацией.ЭтоСтранаУчастникЕАЭС(СтранаРегистрацииКонтрагента);
		
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Определяет данные страны по справочнику стран или классификатору ОКСМ.
// Рекомендуется использовать УправлениеКонтактнойИнформацией.ДанныеСтраныМира.
//
// Параметры:
//    КодСтраны    - Строка, Число - код ОКСМ страны. Если не указано, то поиск по коду не производится.
//    Наименование - Строка        - наименование страны. Если не указано, то поиск по наименованию не производится.
//
// Возвращаемое значение:
//    Структура - поля:
//          * Код                - Строка - реквизит найденной страны.
//          * Наименование       - Строка - реквизит найденной страны.
//          * НаименованиеПолное - Строка - реквизит найденной страны.
//          * КодАльфа2          - Строка - реквизит найденной страны.
//          * КодАльфа3          - Строка - реквизит найденной страны.
//          * Ссылка             - СправочникаСсылка.СтраныМира - реквизит найденной страны.
//    Неопределено - страна не найдена.
//
Функция ДанныеСтраныМира(Знач КодСтраны = Неопределено, Знач Наименование = Неопределено) Экспорт
	Возврат УправлениеКонтактнойИнформацией.ДанныеСтраныМира(КодСтраны, Наименование);
КонецФункции

#КонецОбласти

#КонецЕсли
