
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////
// Обработчики обновления

// Обработчик обновления 1.1.25.47.
Процедура ПеренестиИсходящиеЭлектронныеДокументы() Экспорт
	
	Документы.ЭлектронныйДокументВходящий.ПеренестиЭлектронныеДокументы(
		Метаданные.Документы.УдалитьЭлектронныйДокументИсходящий.Имя,
		Метаданные.Документы.ЭлектронныйДокументИсходящий.Имя,
		НСтр("ru = 'Перенос данных исходящих электронных документов'"));
	
КонецПроцедуры

#КонецЕсли