#Область РаботаСБаннерами

// Процедура закрывает баннер на форме.
// Параметры:
//		Форма - ФормаКлиентскогоПриложения - Форма на которой нужно закрыть баннер.
//		Организация - СправочникСсылка.Организации - Организация, по которой ищем баннер.
//
Процедура ЗакрытьБаннер(Форма, Организация) Экспорт
	
	Баннер = Форма.Баннер;
	Форма.Баннер = Неопределено;
	Форма.ЭлементыФормы.ПанельБаннер.Свертка = РежимСверткиЭлементаУправления.Верх;
	Форма.ЭлементыФормы.ПанельБаннер.Видимость = Ложь;
	
	//
	ПерсонализированныеПредложения.СохранитьОбстоятельстваЗакрытияБаннера(Баннер, Организация);
	//
	
КонецПроцедуры

// Процедура отображает баннер на форме.
// Параметры:
//		Форма - Форма - Форма, на которой отображается баннер.
//		АдресРезультата - Строка - Адрес временного хранилища, в которое помещен баннер.
//
Процедура УстановитьБаннерНаФорме(Форма) Экспорт
	
	Элементы = Форма.ЭлементыФормы;
	Баннер = Форма.Баннер;
	
	Если Баннер = Неопределено Тогда
		Элементы.ПанельБаннер.Видимость = Ложь;
		Элементы.ПанельБаннер.Свертка = РежимСверткиЭлементаУправления.Верх;
	Иначе
		Элементы.ПанельБаннер.Видимость = Истина;
		Элементы.ПанельБаннер.Свертка   = РежимСверткиЭлементаУправления.Нет;

		Элементы.ТекстБаннера.Видимость = Истина;
		Элементы.ТекстБаннера.Видимость = Истина;
		Элементы.ТекстБаннера.Заголовок = Форма.Баннер.ТекстБаннера;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ОткрытьФормуРеклама1СЭДО(Форма) Экспорт
	
	ФормаЭДО = ПолучитьФорму("ОбщаяФорма.Реклама1СЭДО", , Форма);
	ФормаЭДО.Баннер = Форма.Баннер;
	ФормаЭДО.ОткрытьМодально();
	
КонецПроцедуры