#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстЗапросаДляФормированияЭлектронногоДокументаДанныеОтправителя() Экспорт
	
	Возврат 
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Номер КАК Номер,
	|	АктСверкиВзаиморасчетов.Дата КАК Дата,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	АктСверкиВзаиморасчетов.ВалютаДокумента КАК ВалютаДокумента,
	|	АктСверкиВзаиморасчетов.ДатаНачала КАК ДатаНачала,
	|	АктСверкиВзаиморасчетов.ДатаОкончания КАК ДатаОкончания,
	|	АктСверкиВзаиморасчетов.ОстатокНаНачало КАК ОстатокНаНачало,
	|	ЕСТЬNULL(Валюты.Код, ""643"") КАК КодВалюты
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО АктСверкиВзаиморасчетов.ВалютаДокумента = Валюты.Ссылка
	|ГДЕ
	|	АктСверкиВзаиморасчетов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет) КАК Дебет,
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит) КАК Кредит
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДоговорКонтрагента КАК Договор,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК ДатаОперации,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет КАК СуммаДебет,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК СуммаКредит,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Номер, """") КАК НомерДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора,
	|	ЕСТЬNULL(АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор.НомерВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
	|	ЕСТЬNULL(АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор.ДатаВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор,
	|	ТИПЗНАЧЕНИЯ(АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор) КАК НаименованиеДокумента
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АктСверкиВзаиморасчетовПоДаннымОрганизации.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ВидДоговора)
	|ПО
	|	Договор";
	
КонецФункции

Функция ТекстЗапросаДляФормированияЭлектронногоДокументаДанныеПолучателя() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.ОстатокНаНачало КАК ОстатокНаНачало,
	|	АктСверкиВзаиморасчетов.Расхождение КАК ЕстьРасхождения,
	|	АктСверкиВзаиморасчетов.СверкаСогласована КАК СверкаСогласована,
	|	АктСверкиВзаиморасчетов.Организация
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|ГДЕ
	|	АктСверкиВзаиморасчетов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет) КАК Дебет,
	|	СУММА(АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит) КАК Кредит
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДоговорКонтрагента КАК Договор,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дата КАК ДатаОперации,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Дебет КАК СуммаДебет,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Кредит КАК СуммаКредит,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Представление КАК Представление,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Номер, """") КАК НомерДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидДоговора, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка)) КАК ВидДоговора,
	|	ЕСТЬNULL(АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор.НомерВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
	|	ЕСТЬNULL(АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор.ДатаВходящегоДокумента, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
	|	ТИПЗНАЧЕНИЯ(АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор) КАК НаименованиеДокумента,
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.ДокументРегистратор
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО АктСверкиВзаиморасчетовПоДаннымОрганизации.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ВидДоговора)
	|ПО
	|	Договор";
	
КонецФункции

Процедура ЗаполнитьАктСверкиПоДаннымИБ(Объект) Экспорт

	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(Объект);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнениеДокументов.ПриИзмененииЗначенияОрганизации(Объект);
	КонецЕсли;
	
	Объект.ЗаполнитьПоДаннымУправленческогоУчета();
		
КонецПроцедуры


Функция СоответствиеНаименованийОпераций()
	
	СоответствиеОпераций = Новый Соответствие;
	
	СоответствиеОпераций.Вставить(НСтр("ru='Реализация'"),                    НСтр("ru='Поступление'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Поступление'"),                   НСтр("ru='Реализация'"));
	
	СоответствиеОпераций.Вставить(НСтр("ru='Продажа'"),                       НСтр("ru='Приход'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Приход'"),                        НСтр("ru='Продажа'"));

	СоответствиеОпераций.Вставить(НСтр("ru='Корректировка реализации'"),      НСтр("ru='Корректировка поступления'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Корректировка поступления'"),     НСтр("ru='Корректировка реализации'"));
	
	СоответствиеОпераций.Вставить(НСтр("ru='Оплата поставщику'"),             НСтр("ru='Оплата от покупателя'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Оплата от покупателя'"),          НСтр("ru='Оплата поставщику'"));
	
	СоответствиеОпераций.Вставить(НСтр("ru='Возврат средств от поставщика'"), НСтр("ru='Возврат средств покупателю'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Возврат средств покупателю'"),    НСтр("ru='Возврат средств от поставщика'"));
	
	СоответствиеОпераций.Вставить(НСтр("ru='Поступление средств прочее'"),    НСтр("ru='Оплата прочая'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Оплата прочая'"),                 НСтр("ru='Поступление средств прочее'"));
	
	СоответствиеОпераций.Вставить(НСтр("ru='Передано'"),                      НСтр("ru='Принято'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Принято'"),                       НСтр("ru='Передано'"));
	
	СоответствиеОпераций.Вставить(НСтр("ru='Сторно: передано'"),              НСтр("ru='Сторно: принято'"));
	СоответствиеОпераций.Вставить(НСтр("ru='Сторно: принято'"),               НСтр("ru='Сторно: передано'"));
	
	Возврат СоответствиеОпераций;
	
КонецФункции

Функция ТаблицаПоДаннымКонтрагентаНаОсновеТаблицыПоДаннымОрганизации(ТаблицаПоДаннымОрганизации) Экспорт
	
	ТаблицаПоДаннымКонтрагента = ТаблицаПоДаннымОрганизации.СкопироватьКолонки();
	СоответствиеНаименованийОпераций = СоответствиеНаименованийОпераций();
	
	Для Каждого СтрокаПоДаннымОрганизации Из ТаблицаПоДаннымОрганизации Цикл
		СтрокаПоДаннымКонтрагента = ТаблицаПоДаннымКонтрагента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоДаннымКонтрагента, СтрокаПоДаннымОрганизации);
		
		СтрокаПоДаннымКонтрагента.Дебет  = СтрокаПоДаннымОрганизации.Кредит;
		СтрокаПоДаннымКонтрагента.Кредит = СтрокаПоДаннымОрганизации.Дебет;
	КонецЦикла;
	
	Возврат ТаблицаПоДаннымКонтрагента;
	
КонецФункции

#КонецОбласти

