&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("ФормаБезОбработки") = Ложь И ЭтаФорма.ЗапретитьИзменение = Ложь Тогда
		Элементы.СсылкаТитулГрузоотправителяВалюта.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Валюты"));
		Элементы.СсылкаВалютаСтоимости.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Валюты"));
		Элементы.СсылкаЗаказчик.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьИмяПрикладногоСправочника("Контрагенты"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулГрузоотправителяГрузыСтоимостьГрузаПриИзменении(Элемент)
	
	ПосчитатьОбщуюСумму();

КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьОбщуюСумму()
	
	ВалютаСтроки = Неопределено;
	СуммаИтого = Неопределено;
	Для Каждого Стр Из ТитулГрузоотправителяГрузы Цикл
		Если СуммаИтого = Неопределено Тогда
			СуммаИтого = Стр.СтоимостьГруза;
			ВалютаСтроки = Стр.СсылкаВалютаСтоимости;
		ИначеЕсли ЗначениеЗаполнено(ВалютаСтроки)
			И ЗначениеЗаполнено(Стр.СсылкаВалютаСтоимости)
			И ВалютаСтроки <> Стр.СсылкаВалютаСтоимости Тогда
			СуммаИтого = Неопределено;
			Прервать;
		Иначе
			СуммаИтого = СуммаИтого + Стр.СтоимостьГруза;	
		КонецЕсли;
	КонецЦикла;
	
	Если СуммаИтого <> Неопределено Тогда
		ТитулГрузоотправителяСтоимостьГруза = СуммаИтого;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	
	ЭтоКонтейнернаяПеревозка = Ложь;
	Для Каждого СтрГруз Из ТитулГрузоотправителяГрузы Цикл
		Если СтрГруз.ОтгрузочноеНаименованиеГруза = "Контейнер" Тогда
			ЭтоКонтейнернаяПеревозка = Истина;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтаФорма);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции




&НаКлиенте
Процедура ТитулГрузоотправителяГрузыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбменСГИСЭПДКлиент.ОчиститьПодчиненныеТаблицы(ЭтаФорма, Элемент.Имя, ТекущиеДанные.ИдентификаторСтроки, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулГрузоотправителяГрузНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулГрузоотправителяГрузПриИзменении(Элемент)
	
	ЗначениеРеквизита = Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные.ХранимыеДанныеГруз;
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ВходящийКонтекст = Новый Структура;
		ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
		ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
		ВходящийКонтекст.Вставить("ГруппаДанных", СтрЗаменить(Элемент.Имя, "ХранимыеДанные", ""));
		ВходящийКонтекст.Вставить("ТекущиеДанные", Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
		ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(ЗначениеРеквизита, ВходящийКонтекст);	
	Иначе
		ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеЭлементовФормы(ЭтаФорма, СтрЗаменить(Элемент.Имя, "ХранимыеДанные", ""));	
	КонецЕсли;
	
	ТекущиеДанныеСтроки = Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные;
	Если ТекущиеДанныеСтроки = Неопределено Тогда
		ИзменитьОформлениеКнопок(Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки",
			"ЗаполнитьТитулГрузоотправителяСведенияОКонтейнерах", Неопределено));
	Иначе
		ИзменитьОформлениеКнопок(Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки",
			"ЗаполнитьТитулГрузоотправителяСведенияОКонтейнерах", ТекущиеДанныеСтроки.ИдентификаторСтроки));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеТитулГрузоотправителяГрузАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ГруппаДанных = СтрЗаменить(Элемент.Имя, "ХранимыеДанные", "");
	ПараметрыПолученияДанных.Отбор = ОбменСГИСЭПДКлиент.ПолучитьОтборХранимыхДанных(ЭтаФорма, ЭтаФорма, ГруппаДанных);
	ПараметрыПолученияДанных.СпособПоискаСтроки = ПредопределенноеЗначение("СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеДанныеГрузОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.ХранимыеДанныеГруз) <> Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулГрузоотправителяПереченьМаркировокГрузаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулГрузоотправителяСведенияОбОпасныхГрузахНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулГрузоотправителяСведенияОКонтейнерахНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Элемент.Имя, Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаВалютаСтоимостиПриИзменении(Элемент)
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма, Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаЗаказчикПриИзменении(Элемент)
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма, Элементы.ТитулГрузоотправителяГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулГрузоотправителяВалютаПриИзменении(Элемент)
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулГрузоотправителяГрузыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ЗаполнитьТитулГрузоотправителяПереченьМаркировокГруза" 
		Или Поле.Имя = "ЗаполнитьТитулГрузоотправителяСведенияОбОпасныхГрузах"
		Или Поле.Имя = "ЗаполнитьТитулГрузоотправителяСведенияОКонтейнерах"
		Или Поле.Имя = "ХранимыеДанныеГруз" Тогда
		ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтаФорма, Поле.Имя, Элемент.ТекущиеДанные, ЭтаФорма.ЗапретитьИзменение = Ложь);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТитулГрузоотправителяГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ОбменСГИСЭПДКлиент.ТаблицаПриНачалеРедактирования(Элемент, ЭтаФорма, НоваяСтрока, Копирование);

	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанные.КодВалютыСтоимости = ТитулГрузоотправителяКодВалюты;
	ТекущиеДанные.НаименованиеВалютыСтоимости = ТитулГрузоотправителяНаименованиеВалюты;
	
	ПосчитатьОбщуюСумму();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	 
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") Тогда
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ХранимыеДанныеЭПД") Тогда
			Для Каждого СтрокаГруз Из ТитулГрузоотправителяГрузы Цикл
				Если Источник = СтрокаГруз.ХранимыеДанныеГруз Тогда
					ВходящийКонтекст = Новый Структура;
					ВходящийКонтекст.Вставить("ЗапретитьИзменение", Ложь);
					ВходящийКонтекст.Вставить("Форма", ЭтаФорма);
					ВходящийКонтекст.Вставить("ГруппаДанных", "Груз");
					ВходящийКонтекст.Вставить("ТекущиеДанные", СтрокаГруз);
					ОбменСГИСЭПДКлиент.ОткрытиеФормыПоГиперссылке_Завершение(Источник, ВходящийКонтекст);	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтаФорма.НачальноеОформлениеВыполнено Тогда
		ЭтаФорма.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтаФорма.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтаФорма.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтаФорма.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
	СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтаФорма);
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтаФорма);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтаФорма.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтаФорма,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтаФорма);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтаФорма, СтруктураСТекущимиДанными);
	
КонецПроцедуры

// КонецОбласти