// Получает данные файла для открытия и читает из общих настроек ПапкаДляСохранитьКак.
//
// Параметры:
//  ФайлИлиВерсияСсылка     - СправочникСсылка.Файлы
//                          - СправочникСсылка.ВерсииФайлов - файл или версия файла.
//  ИдентификаторФормы      - УникальныйИдентификатор - уникальный идентификатор формы.
//  РабочийКаталогВладельца - Строка - рабочий каталог владельца файла.
//
// Возвращаемое значение:
//   Структура - структура с данными файла.
//
Функция ДанныеФайлаДляСохранения(ФайлСсылка, ВерсияСсылка = Неопределено, ИдентификаторФормы = Неопределено,
	РабочийКаталогВладельца = Неопределено) Экспорт

	ДанныеФайла = ДанныеФайлаДляОткрытия(ФайлСсылка, ВерсияСсылка, ИдентификаторФормы, РабочийКаталогВладельца);

	ПапкаДляСохранитьКак = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы",
		"ПапкаДляСохранитьКак");
	ДанныеФайла.Вставить("ПапкаДляСохранитьКак", ПапкаДляСохранитьКак);

	Возврат ДанныеФайла;
КонецФункции

// Возвращает сведения о файле и версии.
// 
// Параметры:
//  ФайлСсылка - СправочникСсылка.Файлы
//  ВерсияСсылка - СправочникСсылка.ВерсииФайлов
//  ИдентификаторФормы - УникальныйИдентификатор
//  РабочийКаталогВладельца - Строка
//  ПредыдущийАдресФайла - Строка
// 
// Возвращаемое значение:
//   см. ДанныеФайла
//
Функция ДанныеФайлаДляОткрытия(ФайлСсылка, ВерсияСсылка, ИдентификаторФормы = Неопределено,
	РабочийКаталогВладельца = Неопределено, ПредыдущийАдресФайла = Неопределено) Экспорт

	ЕстьПраваНаОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФайлСсылка, "Ссылка", Истина);
	Если ЕстьПраваНаОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ПредыдущийАдресФайла <> Неопределено Тогда
		Если Не ПустаяСтрока(ПредыдущийАдресФайла) И ЭтоАдресВременногоХранилища(ПредыдущийАдресФайла) Тогда
			УдалитьИзВременногоХранилища(ПредыдущийАдресФайла);
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВерсияСсылка) И ОбщегоНазначения.ЕстьРеквизитОбъекта("ТекущаяВерсия",
		Метаданные.НайтиПоТипу(ТипЗнч(ФайлСсылка))) Тогда

		ТекущаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФайлСсылка, "ТекущаяВерсия");
		Если ЗначениеЗаполнено(ТекущаяВерсия) Тогда
			ВерсияСсылка = ТекущаяВерсия;
		КонецЕсли;
	КонецЕсли;

	ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыДанныхФайла.ИдентификаторФормы = ИдентификаторФормы;

	ДанныеФайла = ДанныеФайла(ФайлСсылка, ВерсияСсылка, ПараметрыДанныхФайла);
	Если РабочийКаталогВладельца = Неопределено Тогда
		РабочийКаталогВладельца = РабочийКаталогПапки(ДанныеФайла.Владелец);
	КонецЕсли;
	ДанныеФайла.Вставить("РабочийКаталогВладельца", РабочийКаталогВладельца);

	Если ДанныеФайла.РабочийКаталогВладельца <> "" Тогда
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(
			ДанныеФайла.ПолноеНаименованиеВерсии, ДанныеФайла.Расширение);
		ОбщегоНазначения.СократитьИмяФайла(ИмяФайла);
		ПолноеИмяФайлаВРабочемКаталоге = РабочийКаталогВладельца + ИмяФайла;
		ДанныеФайла.Вставить("ПолноеИмяФайлаВРабочемКаталоге", ПолноеИмяФайлаВРабочемКаталоге);
	КонецЕсли;

	СведенияОВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеФайла.Версия,
		"ТипХраненияФайла, Том, ПутьКФайлу");

	Если ДанныеФайла.Версия <> Неопределено И СведенияОВерсии.ТипХраненияФайла
		= Перечисления.ТипыХраненияФайлов.ВТомахНаДиске Тогда

		ДвоичныеДанные = РаботаСФайламиВТомахСлужебный.ДанныеФайла(ДанныеФайла.Версия);
		ДанныеФайла.НавигационнаяСсылкаТекущейВерсии = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);

	КонецЕсли;

	ПредыдущийАдресФайла = ДанныеФайла.НавигационнаяСсылкаТекущейВерсии;
	Возврат ДанныеФайла;

КонецФункции

// Возвращает структуру, содержащую различные сведения о файле и версии.
// 
// Параметры: 
//  ФайлСсылка - см. РаботаСФайлами.ДвоичныеДанныеФайла.ПрисоединенныйФайл.
//  ВерсияСсылка - СправочникСсылка.ВерсииФайлов - версия файла по которой формируются данные, если не указан то по
//                                                 текущей версии или файлу.
//  ПараметрыДанныхФайла - см. РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла.
// 
// Возвращаемое значение:
//  Структура:
//   * Автор - СправочникСсылка.Пользователи
//   * АвторТекущейВерсии - СправочникСсылка.Пользователи
//   * ВРабочемКаталогеНаЧтение - Булево
//   * Версия - СправочникСсылка.ВерсииФайлов
//   * Владелец - ОпределяемыйТип.ВладелецПрисоединенныхФайлов
//   * ДатаЗаема - Дата
//   * ДатаМодификацииУниверсальная - Дата
//   * Зашифрован	- Булево
//   * Кодировка - Строка
//   * КодировкаТекущейВерсии - Строка
//   * НаЧтение - Булево
//   * НавигационнаяСсылка - Строка
//   * НавигационнаяСсылкаТекущейВерсии - Строка
//   * Наименование - Строка
//   * НомерВерсии - Число
//   * ПапкаДляСохранитьКак - Строка
//   * ПодписанЭП - Булево
//   * ПолноеИмяФайлаВРабочемКаталоге - Строка
//   * ПолноеНаименованиеВерсии - Строка
//   * ПометкаУдаления - Булево
//   * РабочийКаталогВладельца - Строка
//   * Размер - Число
//   * Расширение - Строка
//   * Редактирует - СправочникСсылка.Пользователи
//   * Служебный - Булево
//   * Ссылка - ОпределяемыйТип.ПрисоединенныйФайл
//   * СсылкаНаДвоичныеДанныеФайла - Строка
//   * СтатусИзвлеченияТекста - Строка
//   * ТекущаяВерсия - СправочникСсылка.ВерсииФайлов
//   * Том - СправочникСсылка.ТомаХраненияФайлов
//   * ФайлРедактируетТекущийПользователь - Булево
//   * ХранитьВерсии - Булево
//
Функция ДанныеФайла(ФайлСсылка, ВерсияСсылка = Неопределено, ПараметрыДанныхФайла = Неопределено) Экспорт

	Если ПараметрыДанныхФайла = Неопределено Тогда
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	КонецЕсли;

	ИдентификаторФормы = ПараметрыДанныхФайла.ИдентификаторФормы;
	ВызыватьИсключение = ПараметрыДанныхФайла.ВызыватьИсключение;
	ПолучатьСсылкуНаДвоичныеДанные = ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные;

	ЕстьПраваНаОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФайлСсылка, "Ссылка", Истина);

	Если ЕстьПраваНаОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ФайлСсылка);

	ФайлОбъект = ФайлСсылка.ПолучитьОбъект();

	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("Ссылка", ФайлОбъект.Ссылка);
	ДанныеФайла.Вставить("Редактирует", ФайлОбъект.Редактирует);
	ДанныеФайла.Вставить("Владелец", ФайлОбъект.ВладелецФайла);

	МетаданныеОбъектаФайла = Метаданные.НайтиПоТипу(ТипЗнч(ФайлСсылка));

	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ТекущаяВерсия", МетаданныеОбъектаФайла) И ЗначениеЗаполнено(
		ФайлСсылка.ТекущаяВерсия) Тогда
		ТекущаяВерсияФайла = ФайлОбъект.ТекущаяВерсия;
	Иначе
		ТекущаяВерсияФайла = ФайлСсылка;
	КонецЕсли;

	Если ВерсияСсылка <> Неопределено Тогда
		ДанныеФайла.Вставить("Версия", ВерсияСсылка);
	Иначе
		ДанныеФайла.Вставить("Версия", ТекущаяВерсияФайла);
	КонецЕсли;

	ДанныеФайла.Вставить("ТекущаяВерсия", ТекущаяВерсияФайла);
	ДанныеФайла.Вставить("ХранитьВерсии", ФайлОбъект.ХранитьВерсии);
	ДанныеФайла.Вставить("ПометкаУдаления", ФайлОбъект.ПометкаУдаления);
	ДанныеФайла.Вставить("Зашифрован", ФайлОбъект.Зашифрован);
	ДанныеФайла.Вставить("ПодписанЭП", ФайлОбъект.ПодписанЭП);
	ДанныеФайла.Вставить("ДатаЗаема", ФайлОбъект.ДатаЗаема);

	Если ВерсияСсылка = Неопределено Тогда
		Если ПолучатьСсылкуНаДвоичныеДанные Тогда
			СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(РаботаСФайлами.ДвоичныеДанныеФайла(
				ТекущаяВерсияФайла, ВызыватьИсключение), ИдентификаторФормы);
		Иначе
			СсылкаНаДвоичныеДанныеФайла = Неопределено;
		КонецЕсли;
		ДанныеФайла.Вставить("СсылкаНаДвоичныеДанныеФайла", СсылкаНаДвоичныеДанныеФайла);

		ДанныеФайла.Вставить("НавигационнаяСсылка", ПолучитьНавигационнуюСсылку(ФайлСсылка));
		ДанныеФайла.Вставить("АвторТекущейВерсии", ФайлСсылка.Изменил);
		ДанныеФайла.Вставить("Кодировка", Неопределено);
	Иначе
		Если ПолучатьСсылкуНаДвоичныеДанные Тогда
			СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(РаботаСФайлами.ДвоичныеДанныеФайла(
				ВерсияСсылка, ВызыватьИсключение), ИдентификаторФормы);
		Иначе
			СсылкаНаДвоичныеДанныеФайла = Неопределено;
		КонецЕсли;
		ДанныеФайла.Вставить("СсылкаНаДвоичныеДанныеФайла", СсылкаНаДвоичныеДанныеФайла);

		ДанныеФайла.Вставить("НавигационнаяСсылка", ПолучитьНавигационнуюСсылку(ФайлОбъект.Ссылка));
		ДанныеФайла.Вставить("АвторТекущейВерсии", ВерсияСсылка.Автор);
		ДанныеФайла.Вставить("Кодировка", Неопределено);
	КонецЕсли;

	Если ДанныеФайла.Зашифрован Тогда

		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
			МодульЭлектроннаяПодпись = ОбщегоНазначения.ОбщийМодуль("ЭлектроннаяПодпись");
			МассивСертификатовШифрования = МодульЭлектроннаяПодпись.СертификатыШифрования(ДанныеФайла.Ссылка);
		Иначе
			МассивСертификатовШифрования = Неопределено;
		КонецЕсли;

		ДанныеФайла.Вставить("МассивСертификатовШифрования", МассивСертификатовШифрования);

	КонецЕсли;

	ДанныеФайла.Вставить("Служебный", Ложь);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФайлОбъект, "Служебный") Тогда
		ДанныеФайла.Служебный = ФайлОбъект.Служебный;
	КонецЕсли;

	РаботаСФайламиСлужебный.ЗаполнитьДополнительныеДанныеФайла(ДанныеФайла, ФайлОбъект, ВерсияСсылка);
	Возврат ДанныеФайла;

КонецФункции

// Получает синтетический рабочий каталог папки на компьютере (он может прийти от родительской папки).
//
// Параметры:
//  СсылкаПапки  - СправочникСсылка.ПапкиФайлов - владелец файла.
//
// Возвращаемое значение:
//   Строка  - рабочий каталог.
//
Функция РабочийКаталогПапки(СсылкаПапки) Экспорт

	Возврат "";

КонецФункции

Функция ЭтоСправочникФайлы(ВладелецФайлов) Экспорт

	Возврат Ложь;

КонецФункции

