
#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииОбщегоНазначения

#КонецОбласти

#Область МетодыРаботыСРеквизитамиОбъектов

// Проверяет наличие у произвольного объекта реквизита с указанным именем.
//
Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыРаботыСОтчетами

#КонецОбласти

#Область ВспомогательныеПроцедурыРаботыСФормами

#КонецОбласти

#Область ФункцииДляПоддержкиФормированияПечатныхФорм

#КонецОбласти

#Область ВыборПериодаИзСписка

#КонецОбласти

#Область РаботаСДинамическимиСписками

#КонецОбласти

#Область РаботаСЖурналамиДокументов 

#КонецОбласти

#Область ПреобразованиеТиповДанных

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗначенияДоИзменения

#КонецОбласти

#КонецОбласти
