#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Очищает напоминания текущего пользователя.
//
Процедура ОчиститьНапоминанияТекущегоПользователя() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
	Набор.Записать();
	
КонецПроцедуры

// Откладывает напоминания текущего пользователя на указанное время.
//
// Параметры:
//  ВремяВСекундах - Число - количество секунд, насколько от текущего времени отложить напоминания пользователя.
//
Процедура ОтложитьНапоминанияТекущегоПользователя(ВремяВСекундах) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ТекущийПользователь);
	
	Запись = Набор.Добавить();
	Запись.Пользователь    = ТекущийПользователь;
	Запись.СрокНапоминания = ТекущаяУниверсальнаяДата() + ВремяВСекундах;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли