#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Область "Обновление"

Функция ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ЧекККМ КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ЗаписиКОбработке = ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию();
	
	Если ЗаписиКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     					КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       					КАК Дата,
	|	ДанныеДокумента.Организация                                				    КАК Организация,
	|	ДанныеДокумента.Касса									   					КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               				    КАК Устройство,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация) 	    КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        						КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               					КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                            					КАК ФискальнаяОперацияСумма,
	|	ДанныеДокумента.СуммаДокумента                             					КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	0 																			КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0 																			КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 																			КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       КАК Дата,
	|	ДанныеДокумента.Организация                                КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                               КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               КАК Устройство,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация) КАК ТипОперации,
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|	КОНЕЦ КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        						КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               					КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                             					КАК ФискальнаяОперацияСумма,
	|	0 КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	ДанныеДокумента.СуммаДокумента                             					КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0 КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаОтПокупателяПлатежнойКартой КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       КАК Дата,
	|	ДанныеДокумента.Организация                                КАК Организация,
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ) ТОГДА
	|			ДанныеДокумента.ККМ
	|		ИНАЧЕ
	|			ДанныеДокумента.Касса
	|	КОНЕЦ КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               КАК Устройство,
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ВнесениеДенежныхСредств)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация)
	|	КОНЕЦ КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        						КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                             КАК ФискальнаяОперацияСумма,
	|	ДанныеДокумента.СуммаДокумента                             КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	0 КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0 КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       КАК Дата,
	|	ДанныеДокумента.Организация                                КАК Организация,
	|	ДанныеДокумента.КассаККМ                                   КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               КАК Устройство,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация)         КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                             КАК ФискальнаяОперацияСумма,
	|	ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(СУММА(ПлатежныеКарты.Сумма), 0)   КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	ЕСТЬNULL(СУММА(ПлатежныеКарты.Сумма), 0)                   КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0									                       КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ПлатежныеКарты
	|	ПО ПлатежныеКарты.Ссылка = ДанныеДокумента.Ссылка
	|   И (ПлатежныеКарты.ВидОплаты.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта))
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВТДляОбработкиСсылка", ЗаписиКОбработке);
	
	ТаблицыДляЧтения = Новый Массив;
	ТаблицыДляЧтения.Добавить("Документ.ПриходныйКассовыйОрдер");
	ТаблицыДляЧтения.Добавить("Документ.РасходныйКассовыйОрдер");
	ТаблицыДляЧтения.Добавить("Документ.ОплатаОтПокупателяПлатежнойКартой");
	ТаблицыДляЧтения.Добавить("Документ.ЧекККМ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			НаборЗаписей = РегистрыСведений.ЖурналФискальныхОпераций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ИдентификаторЗаписи = Строка(Новый УникальныйИдентификатор());;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Конец области "Обновление"

#КонецЕсли