#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоответствиеПолейДокументовОснований(Форма, СоответствиеПолей) Экспорт
	
	  Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
				
		СоответствиеПолей.Вставить("ЗаказПоставщику", Новый Соответствие);
		СоответствиеПолей["ЗаказПоставщику"].Вставить("Организация", "Организация");
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.МаркировкаТоваровИСМП") Тогда
		
		СоответствиеПолей.Вставить("КомплектацияНоменклатуры", Новый Соответствие);
		СоответствиеПолей["КомплектацияНоменклатуры"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ПоступлениеТоваровУслуг", Новый Соответствие);
		СоответствиеПолей["ПоступлениеТоваровУслуг"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ПрочееОприходованиеТоваров", Новый Соответствие);
		СоответствиеПолей["ПрочееОприходованиеТоваров"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ОприходованиеИзлишковТоваров", Новый Соответствие);
		СоответствиеПолей["ОприходованиеИзлишковТоваров"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ИнвентаризацияТоваровНаСкладе", Новый Соответствие);
		СоответствиеПолей["ИнвентаризацияТоваровНаСкладе"].Вставить("Организация", "Организация");
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ВыводИзОборотаИСМП") Тогда
		
		СоответствиеПолей.Вставить("ЧекККМ", Новый Соответствие);
		СоответствиеПолей["ЧекККМ"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("РеализацияТоваровУслуг", Новый Соответствие);
		СоответствиеПолей["РеализацияТоваровУслуг"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ОтчетОРозничныхПродажах", Новый Соответствие);
		СоответствиеПолей["ОтчетОРозничныхПродажах"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ВозвратТоваровПоставщику", Новый Соответствие);
		СоответствиеПолей["ВозвратТоваровПоставщику"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("СписаниеТоваров", Новый Соответствие);
		СоответствиеПолей["СписаниеТоваров"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("СписаниеМатериаловИзЭксплуатации", Новый Соответствие);
		СоответствиеПолей["СписаниеМатериаловИзЭксплуатации"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("КомплектацияНоменклатуры", Новый Соответствие);
		СоответствиеПолей["КомплектацияНоменклатуры"].Вставить("Организация", "Организация");
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ОтгрузкаТоваровИСМП") Тогда
		
		СоответствиеПолей.Вставить("РеализацияТоваровУслуг", Новый Соответствие);
		СоответствиеПолей["РеализацияТоваровУслуг"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ВозвратТоваровПоставщику", Новый Соответствие);
		СоответствиеПолей["ВозвратТоваровПоставщику"].Вставить("Организация", "Организация");
		
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ПеремаркировкаТоваровИСМП") Тогда
		
		СоответствиеПолей.Вставить("ВозвратТоваровОтПокупателя", Новый Соответствие);
		СоответствиеПолей["ВозвратТоваровОтПокупателя"].Вставить("Организация", "Организация");
		
		СоответствиеПолей.Вставить("ЧекККМ", Новый Соответствие);
		СоответствиеПолей["ЧекККМ"].Вставить("Организация", "Организация");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ПриОпределенииВариантаДействийПоРасхождениямКодовМаркировкиИСМППризнать(ВариантДействия) Экспорт
КонецПроцедуры

Процедура ПриОпределенииВариантаДействийПоРасхождениямКодовМаркировкиИСМПНеПризнать(ВариантДействия) Экспорт
КонецПроцедуры



